Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-contributor.po
Languages: de, id

source: Backporting is defined as the act of reproducing a change from another branch. Unclean/squashed/modified cherry-picks and complete reimplementations are OK.
de: Backporting ist definiert als der Vorgang, eine Änderung von einem anderen Branch zu reproduzieren. Unsaubere/gesquashte/modifizierte Cherry-Picks und vollständige Reimplementierungen sind in Ordnung.
id: Backporting didefinisikan sebagai tindakan mereproduksi perubahan dari branch lain. Unclean/squashed/modified cherry-picks dan implementasi ulang yang lengkap OK.

source: Backporting is often done by using the same code (via cherry picking), but this is not always the case. This method is preferred when the cherry-pick provides a complete solution for the targeted problem.
de: Backporting wird oft mit dem gleichen Code durchgeführt (via Cherry Picking), aber das ist nicht immer der Fall. Diese Methode wird bevorzugt, wenn der Cherry-Pick eine vollständige Lösung für das angestrebte Problem bietet.
id: Backporting sering dilakukan dengan menggunakan kode yang sama (melalui cherry picking), tetapi ini tidak selalu terjadi. Metode ini lebih disukai ketika cherry-pick memberikan solusi lengkap untuk masalah yang ditargetkan.

source: Bash coding conventions are tested using `Bashate`_, with the following convention exceptions:
de: Bash-Kodierungskonventionen werden unter Verwendung von `Bashate`_ mit den folgenden Konvention-Ausnahmen getestet:
id: Konvensi bash coding diuji menggunakan `Bashate`_, dengan pengecualian konvensi berikut:

source: Before creating blueprint/spec an associated 'Wishlist Bug' can be raised on launchpad. This issue will be triaged and a determination will be made on how large the change is and whether or not the change warrants a blueprint/spec. Both features and bug fixes may require the creation of a blueprint/spec. This requirement will be voted on by core reviewers and will be based on the size and impact of the change.
de: Bevor ein Blueprint/Spec erstellt wird, kann ein entsprechender 'Wishlist Bug' auf dem Launchpad ausgelöst werden. Dieses Problem wird geprüft und es wird eine Entscheidung darüber getroffen, wie groß die Änderung ist und ob die Änderung einen Entwurf/eine Spezifikation rechtfertigt. Beide Funktionen und Fehlerbehebungen erfordern möglicherweise die Erstellung eines Blueprints/einer Spezifikation. Über diese Anforderung werden die Kernüberprüfer abstimmen und auf der Größe und den Auswirkungen der Änderung basieren.
id: Sebelum membuat blueprint/spec 'Wishlist Bug' terkait dapat dimunculkan di launchpad. Masalah ini akan ditriasi dan penentuan akan dilakukan pada seberapa besar perubahan itu dan apakah perubahan tersebut menjamin blueprint/spec. Baik fitur dan perbaikan bug mungkin memerlukan pembuatan blueprint/spec. Persyaratan ini akan dipilih oleh pengulas inti dan akan didasarkan pada ukuran dan dampak perubahan.

source: Before jumping ahead and working on code, a series of steps should be taken:
de: Bevor Sie vorwärts springen und an Code arbeiten, sollten Sie eine Reihe von Schritten durchführen:
id: Sebelum melompat dan mengerjakan kode, serangkaian langkah harus diambil:

source: Before submitting code
de: Vor dem Absenden des Codes
id: Sebelum mengirimkan kode

source: Below will cover the more project specific information you need to get started with OpenStack-Ansible.
id: Di bawah ini akan mencakup lebih banyak informasi spesifik proyek yang Anda perlukan untuk memulai dengan OpenStack-Ansible.

source: Branch all the independent repos that aren't part of the release in gerrit. See also the ``projects.yaml`` in the governance repo. Manually branched repos need extra editions, like updating the .gitreview, or the reno index. Please reference previous branch creations by using the appropriate topic in gerrit (e.g.: ``create-stein``). The previous new branch creation may be different as the tooling/process may have evolved, so be aware that the changes needed may need to be adapted.
de: Branchen Sie alle unabhängigen Repos, die nicht zum Release in Gerrit gehören. Siehe auch ``projects.yaml`` im Governance-Repo. Manuell gebranchte Repos benötigen zusätzliche Editionen, wie das Aktualisieren der .gitreview oder des Reno-Index. Bitte referenzieren Sie frühere Branch-Kreationen, indem Sie das entsprechende Topic in gerrit verwenden (z.B .: `` create-stein``). Die vorherige Erstellung eines neuen Branches kann anders sein, da sich der Werkzeug- /Prozess möglicherweise weiterentwickelt hat. Achten Sie also darauf, dass die erforderlichen Änderungen möglicherweise angepasst werden müssen.
id: Branch semua repo independen merupakan bukan bagian dari rilis di gerrit. Lihat juga ``projects.yaml`` dalam repo tata kelola. Repo yang bercabang secara manual membutuhkan edisi tambahan, seperti memperbarui .gitreview, atau indeks reno. Harap referensi kreasi branch sebelumnya dengan menggunakan topik yang sesuai di gerrit (misal :``create-stein``). Pembuatan branch baru sebelumnya mungkin berbeda karena tooling/process mungkin telah berevolusi, jadi waspadalah bahwa perubahan yang diperlukan mungkin perlu disesuaikan.

source: Bug Reporting
de: Fehlerberichterstattung
id: Pelaporan Bug

source: Bug skimming duty
de: Bug-Skimming-Pflicht
id: Tugas membaca sekilas bug

source: Bug skimming duty reduces the amount of work other developers have to spend to do a proper root cause analysis (and later fix) of bug reports. For this, close the obviously invalid bug reports, confirm the obviously valid bug reports, ask questions if things are unclear.
de: Bug Skimming Duty reduziert den Aufwand, den andere Entwickler für die Ursachenanalyse (und spätere Behebung) von Fehlerberichten aufwenden müssen. Schließen Sie dazu die offensichtlich ungültigen Fehlerberichte, bestätigen Sie die offensichtlich gültigen Fehlerberichte, stellen Sie Fragen, wenn die Dinge unklar sind.
id: Tugas membaca sekilas bug mengurangi jumlah pekerjaan yang harus dihabiskan pengembang lain untuk melakukan analisis akar permasalahan (dan kemudian memperbaiki) laporan bug. Untuk ini, tutup laporan bug yang jelas tidak valid, konfirmasikan laporan bug yang jelas valid, ajukan pertanyaan jika ada yang tidak jelas.

source: Bug skimming duty weekly checklist
de: Bug Checking Pflicht wöchentliche Checkliste
id: Daftar periksa tugas skimming bug mingguan

source: Bug triage meeting duties
de: Aufgaben für Fehlersuche-Meetings
id: Tugas rapat triage bug

source: Bugs should be filed on the `OpenStack-Ansible Launchpad project`_.
de: Fehler sollten im `OpenStack-Ansible Launchpad-Projekt`_ abgelegt werden.
id: Bug harus diarsipkan di `OpenStack-Ansible Launchpad project`_.

source: Bump RDO and Ubuntu Cloud Archive repositories if they are ready on time.
id: Repositori Bump RDO dan Ubuntu Cloud Archive jika mereka siap tepat waktu.

source: Bump ``ceph_stable_release`` to latest Ceph LTS release in the integrated OpenStack-Ansible repo, and inside the ``ceph_client`` role defaults.
de: Bump ``ceph_stable_release`` zur neuesten Ceph LTS-Version im integrierten OpenStack-Ansible-Repo, und innerhalb der ``ceph_client``-Rolle standardmäßig.
id: Bump ``ceph_stable_release`` ke rilis Ceph LTS terbaru dalam repo yang dimungkinkan OpenStack-ansible, dan di dalam default peran ``ceph_client``.

source: By proposing a draft spec you can help the OpenStack-Ansible community keep track of what roles or large changes are being developed, and perhaps connect you with others who may be interested and able to help you in the process.
de: Indem Sie einen Entwurf für eine Spezifikation vorschlagen, können Sie der OpenStack-Ansible-Community helfen, den Überblick darüber zu behalten, welche Rollen oder großen Änderungen entwickelt werden. Vielleicht können Sie sich mit anderen Interessenten in Verbindung setzen, die Ihnen dabei helfen können.
id: Dengan mengajukan draf spesifikasi, Anda dapat membantu komunitas OpenStack-Ansible melacak peran atau perubahan besar apa yang sedang dikembangkan, dan mungkin menghubungkan Anda dengan orang lain yang mungkin tertarik dan dapat membantu Anda dalam proses tersebut.

source: Changes in the project over time which may affect an existing deployment.
de: Änderungen im Projekt im Laufe der Zeit, die sich auf eine vorhandene Bereitstellung auswirken können.
id: Perubahan dalam proyek dari waktu ke waktu yang dapat mempengaruhi penyebaran yang ada.

source: Changes to the project should be submitted for review via the Gerrit tool, following the `workflow documented here`_.
de: Änderungen am Projekt sollten über das Gerrit-Tool nach dem zur Überprüfung eingereicht werden. `workflow documented here`_.
id: Perubahan pada proyek harus diserahkan untuk ditinjau melalui alat Gerrit, mengikuti `workflow documented here`_.

source: Check and bump galera versions if required.
de: Überprüfen und erhöhen Sie Galera-Versionen, falls erforderlich.
id: Check and bump versi galera jika diperlukan.

source: Check and bump rabbitmq versions if required.
de: Überprüfen und erhöhen Sie rabbitmq-Versionen, falls erforderlich.
id: Check and bump versi rabbitmq jika diperlukan.

source: Check current pins status
id: Periksa status pin saat ini

source: Check outstanding reviews and move to merge or abandon them if no longer valid.
de: Überprüfen Sie ausstehende Überprüfungen und verschieben Sie sie, um sie zusammenzuführen oder aufzugeben, wenn sie nicht mehr gültig sind.
id: Periksa ulasan luar biasa dan pindahlah untuk menggabungkan atau meninggalkannya jika tidak lagi valid.

source: Code Comments
de: Code Kommentare
id: Komentar Kode

source: Code Merge Responsibilities
de: Code Merge Verantwortlichkeiten
id: Tanggung Jawab Penggabungan Kode

source: Code comments for bash/python scripts should give guidance to the purpose of the code. This is important to provide context for reviewers before the patch has merged, and for later modifications to remind the contributors what the purpose was and why it was done that way.
de: Code-Kommentare für Bash/Python-Skripte sollten Hinweise für den Zweck des Codes geben. Dies ist wichtig, um den Prüfern einen Kontext zu bieten, bevor der Patch zusammengeführt wurde, und um später für spätere Änderungen daran zu erinnern, was der Zweck war und warum es so gemacht wurde.
id: Komentar kode untuk skrip bash/python harus memberikan panduan untuk tujuan kode. Ini penting untuk memberikan konteks bagi pengulas sebelum patch bergabung, dan untuk modifikasi selanjutnya mengingatkan para kontributor apa tujuannya dan mengapa itu dilakukan seperti itu.

source: Code comments for variables should be used to explain the purpose of the variable. This is particularly important for the role defaults file as the file is included verbatim in the role's documentation. Where there is an optional variable, the variable and an explanation of what it is used for should be added to the defaults file.
de: Code-Kommentare für Variablen sollten verwendet werden, um den Zweck der Variablen zu erklären. Dies ist besonders wichtig für die Datei mit den Rollenvorgaben, da die Datei in der Dokumentation der Rolle wortwörtlich eingefügt wird. Wenn eine optionale Variable vorhanden ist, sollte die Variable und eine Erläuterung, wofür sie verwendet wird, zur Standarddatei hinzugefügt werden.
id: Komentar kode untuk variabel harus digunakan untuk menjelaskan tujuan variabel. Ini sangat penting untuk file peran default karena file tersebut dimasukkan kata demi kata dalam dokumentasi peran. Jika ada variabel opsional, variabel dan penjelasan tentang apa yang digunakan untuk itu harus ditambahkan ke file default.

source: Code location
de: Codestandort
id: Lokasi kode

source: Code rules
de: Code Regeln
id: Aturan kode

source: Communication
id: Komunikasi

source: Community communication channels
de: Community-Kommunikationskanäle
id: Saluran komunikasi komunitas

source: Community goal acknowledgement.
de: Community Ziel Bestätigung.
id: Pengakuan tujuan komunitas.

source: Contacting the Core Team
id: Menghubungi Tim Inti (Core Team)

source: Container technology independence
de: Container Technologie Unabhängigkeit
id: Kemandirian teknologi Container

source: Contents:
de: Inhalt:
id: Isi:

source: Contributor Guidelines
de: Richtlinien für Mitwirkende
id: Pedoman Kontributor

source: Copy release notes relevant to the freeze.
id: Salin catatan rilis yang relevan dengan pembekuan.

source: Core Reviewer Expectations
de: Core Reviewer Erwartungen
id: Harapan Peninjau Inti

source: Core Reviewers
de: Core Reviewer
id: Peninjau Inti

source: Create a source repository (e.g. on Github) to start your work on the Role.
de: Erstellen Sie ein Quell-Repository (z. B. auf Github), um mit der Arbeit an der Rolle zu beginnen.
id: Buat repositori sumber (misal di Github) untuk memulai pekerjaan Anda di Role.

source: Curating the gate and triaging failures
de: Kuratieren der Gate- und Triage-Fehler
id: Curating gate dan gagal triaging

source: Definitively *Invalid*. The status *Incomplete* is an open state and means that more information is necessary.
de: Definitiv *Ungültig*. Der Status *Incomplete* ist ein offener Status und bedeutet, dass mehr Informationen benötigt werden.
id: Definitif *Invalid*. Status *Incomplete* adalah keadaan terbuka dan berarti bahwa lebih banyak informasi diperlukan.

source: Deploy the applicable configuration files in the right places.
de: Stellen Sie die entsprechenden Konfigurationsdateien an den richtigen Stellen bereit.
id: Menyebarkan file konfigurasi yang berlaku di tempat yang tepat.

source: Develop task files for each of the install stages in turn, creating any handlers and templates as needed. Ensure that you notify handlers after any task which impacts the way the service would run (such as configuration file modifications). Also take care that file ownership and permissions are appropriate.
de: Entwickeln Sie für jede Installationsphase nacheinander Taskdateien, und erstellen Sie nach Bedarf Handler und Vorlagen. Stellen Sie sicher, dass Sie die Handler nach jeder Aufgabe benachrichtigen, die sich auf die Art und Weise der Ausführung des Dienstes auswirkt (z.B. Änderungen der Konfigurationsdatei). Achten Sie auch darauf, dass der Dateibesitz und die Berechtigungen angemessen sind.
id: Kembangkan file tugas untuk masing-masing tahap instalasi pada gilirannya, buat penangan dan template apa pun sesuai kebutuhan. Pastikan bahwa Anda memberi tahu penangan setelah tugas apa pun yang memengaruhi cara layanan akan dijalankan (seperti modifikasi file konfigurasi). Juga berhati-hatilah bahwa kepemilikan dan izin file sesuai.

source: Developer Documentation
de: Entwicklerdokumentation
id: Dokumentasi Pengembang

source: Development cycle checklist
de: Entwicklungszyklus Checkliste
id: Daftar periksa siklus pengembangan

source: Distribution support
de: Distributionsunterstützung
id: Dukungan distribusi

source: Distributions can be promoted to voting jobs on individual roles once they move to the `Graduation` phase and their stability has been confirmed by the core OpenStack-Ansible developers. Similar to this, voting can also be enabled in the integration repository for all the scenarios or a specific one.
de: Distributionen können zu Voting-Jobs für einzelne Rollen befördert werden, sobald sie in die Phase `Graduation` übergehen, und ihre Stabilität wurde von den OpenStack-Ansible-Entwicklern bestätigt. Ähnlich kann das Voting auch im Integration Repository für alle Szenarien oder für ein bestimmtes Szenario aktiviert werden.
id: Distribusi dapat dipromosikan ke pekerjaan pemungutan suara pada peran individu begitu mereka pindah ke fase `Graduation` dan stabilitasnya telah dikonfirmasi oleh pengembang inti OpenStack-Ansible. Mirip dengan ini, pemungutan suara juga dapat diaktifkan di repositori integrasi untuk semua skenario atau skenario tertentu.

source: Do I have to double-check bug reports which are New and have an assignee?
de: Muss ich Fehlerberichte, die neu sind und einen Beauftragten haben, erneut prüfen?
id: Apakah saya harus memeriksa ulang laporan bug yang New dan memiliki penerima hak?

source: Do I need to prove that a bug report is valid/invalid before I can set it to *Confirmed*/*Invalid* ?
de: Muss ich beweisen, dass ein Fehlerbericht gültig/ungültig ist, bevor ich ihn auf *Confirmed*/*Invalid* setzen kann?
id: Apakah saya perlu membuktikan bahwa laporan bug valid/invalid sebelum saya dapat mengaturnya menjadi *Confirmed*/*Invalid* ?

source: Documentation and Release Note Guidelines
de: Dokumentation und Release Note Richtlinien
id: Pedoman Dokumentasi dan Catatan Rilis

source: Documentation building
de: Dokumentation bauen
id: Dokumentasi dibangun

source: Documentation is a critical part of ensuring that the deployers of OpenStack-Ansible are appropriately informed about:
de: Die Dokumentation ist ein wichtiger Bestandteil, um sicherzustellen, dass die Implementierer von OpenStack-Ansible angemessen über Folgendes informiert sind:
id: Dokumentasi adalah bagian penting untuk memastikan bahwa penyebar OpenStack-Ansible diberi informasi tentang:

source: Documentation is developed in reStructuredText_ (RST) and compiled into HTML using Sphinx.
de: Die Dokumentation wird in reStructuredText_ (RST) erstellt und mit Sphinx in HTML übersetzt.
id: Dokumentasi dikembangkan dalam reStructuredText_ (RST) dan dikompilasi ke dalam HTML menggunakan Sphinx.

source: Documentation locations
de: Dokumentationsstandorte
id: Lokasi dokumentasi

source: Documentation may be built locally by executing:
de: Die Dokumentation kann lokal erstellt werden, indem Folgendes ausgeführt wird:
id: Dokumentasi dapat dibangun secara lokal dengan mengeksekusi:

source: Documentation must be added in the role to describe how to implement the new service in an integrated environement. This content must adhere to the :ref:`documentation`. Until the role has integrated functional testing implemented (see also the Role development maturity paragraph), the documentation must make it clear that the service inclusion in OpenStack-Ansible is experimental and is not fully tested by OpenStack-Ansible in an integrated build. Alternatively, an user story can be created.
de: Die Dokumentation muss in der Rolle hinzugefügt werden, um zu beschreiben, wie der neue Service in einer integrierten Umgebung implementiert wird. Dieser Inhalt muss den folgenden Regeln entsprechen :ref:`documentation`. Bis die Rolle ein integriertes Funktionstest implementiert hat (siehe auch den Paragraphen Rollenentwicklungsreife), muss die Dokumentation klarstellen, dass die Serviceeinbindung in OpenStack-Ansible experimentell ist und nicht vollständig von OpenStack-Ansible in einem integrierten Build getestet wird. Alternativ kann eine User Story erstellt werden.
id: Dokumentasi harus ditambahkan dalam peran untuk menggambarkan bagaimana menerapkan layanan baru di lingkungan yang terintegrasi. Konten ini harus mematuhi :ref:`documentation`. Sampai peran tersebut telah mengimplementasikan pengujian fungsional terintegrasi (lihat juga paragraf kedewasaan pengembangan peran), dokumentasi harus memperjelas bahwa inklusi layanan di OpenStack-Ansible adalah eksperimental dan tidak sepenuhnya diuji oleh OpenStack-Ansible dalam build terintegrasi. Atau, cerita pengguna dapat dibuat.

source: Documentation should be provided with the code directly. See also :ref:`documentation`.
de: Die Dokumentation sollte direkt mit dem Code versehen werden. Siehe auch :ref:`documentation`.
id: Dokumentasi harus diberikan dengan kode secara langsung. Lihat juga :ref:`documentation`.

source: E003: Indent not multiple of 4. We prefer to use multiples of 2 instead.
de: E003: Einrücken nicht Vielfaches von 4. Wir bevorzugen stattdessen Vielfache von 2 zu verwenden.
id: E003: Indent bukan kelipatan 4. Kami lebih suka menggunakan kelipatan 2 sebagai gantinya.

source: E006: Line longer than 79 columns. As many scripts are deployed as templates
de: E006: Zeile länger als 79 Spalten. Viele Skripts werden als Vorlagen bereitgestellt
id: E006: Baris lebih panjang dari 79 kolom. Karena banyak skrip yang digunakan sebagai templat

source: E040: Syntax error determined using `bash -n`. As many scripts are deployed
de: E040: Syntaxfehler mit `bash -n` ermittelt. Wie viele Skripts bereitgestellt werden
id: E040: Kesalahan sintaks ditentukan menggunakan `bash -n`. Karena banyak skrip dikerahkan

source: Each list item must make sense to read without the context of the patch or the repository the patch is being submitted into. The reason for this is that all release notes are consolidated and presented in a long list without reference to the source patch or the context of the repository.
de: Jedes Listenelement muss ohne den Kontext des Patches oder des Repositorys, in das der Patch gesendet wird, gelesen werden. Der Grund dafür ist, dass alle Versionshinweise konsolidiert und in einer langen Liste ohne Verweis auf den Quell-Patch oder den Kontext des Repositorys präsentiert werden.
id: Setiap item daftar harus masuk akal untuk dibaca tanpa konteks tambalan atau repositori patch sedang diajukan. Alasan untuk ini adalah bahwa semua catatan rilis dikonsolidasikan dan disajikan dalam daftar panjang tanpa referensi ke patch sumber atau konteks repositori.

source: Each note should be brief and to the point. Try to avoid multi-paragraph notes. For features the note should typically refer to documentation for more details. For bug fixes the note can refer to a registered bug for more details.
de: Jede Note sollte kurz und bündig sein. Versuchen Sie, Mehrfachabsatznotizen zu vermeiden. Bei Features sollte die Notiz in der Regel für weitere Details auf die Dokumentation verweisen. Für Fehlerbehebungen kann die Notiz für mehr Details auf einen registrierten Fehler verweisen.
id: Setiap note harus singkat dan to the point. Cobalah untuk menghindari note multi-paragraf. Untuk fitur, note biasanya merujuk ke dokumentasi untuk detail lebih lanjut. Untuk perbaikan bug, note dapat merujuk ke bug terdaftar untuk detail lebih lanjut.

source: Each of the role tests is in its tests/ folder.
de: Jeder der Rollentests befindet sich in seinem Test/Ordner.
id: Setiap tes peran ada di dalam tests/ foldernya.

source: Each role is in charge of deploying **exactly one** component of an OpenStack-Ansible deployment.
de: Jede Rolle ist verantwortlich für die Bereitstellung von **genau einer** Komponente einer OpenStack-Ansible-Bereitstellung.
id: Setiap peran bertugas menyebarkan **exactly one** komponen dari penyebaran OpenStack-Ansible.

source: Easy to fix bugs are marked with the tag *low hanging fruit*, and should be the target of first time contributors.
de: Einfach zu behebende Bugs sind mit dem Tag *Low Hanging Fruit* gekennzeichnet und sollten das Ziel von Erstspielern sein.
id: Bug yang mudah diperbaiki ditandai dengan tag *low hanging fruit*, dan harus menjadi target kontributor pertama kali.

source: Ensure that the service starts.
de: Stellen Sie sicher, dass der Dienst gestartet wird.
id: Pastikan layanan mulai.

source: Ensure the role converges:
de: Stellen Sie sicher, dass die Rolle konvergiert:
id: Pastikan peran menyatu (converge):

source: Ensuring the level of testing is adequate and remains relevant as features are added
de: Sicherstellen, dass das Testniveau angemessen ist und relevant bleibt, wenn Features hinzugefügt werden
id: Memastikan tingkat pengujian memadai dan tetap relevan saat fitur ditambahkan

source: Ensuring the role matches OpenStack-Ansible's latest standards. See also our :ref:`code_rules` page.
de: Sicherstellen, dass die Rolle den neuesten Standards von OpenStack-Ansible entspricht. Siehe auch unsere :ref:`code_rules` Seite.
id: Memastikan perannya cocok dengan standar terbaru OpenStack-Ansible. Lihat juga halaman :ref:`code_rules` kami.
