Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: de, id

source: Use the openstack client within the utility container to manage all glance images. `See the openstack client official documentation on managing images <https://docs.openstack.org/image-guide/create-images-manually.html>`_.
de: Verwenden Sie den Openstack-Client im Dienstprogrammcontainer, um alle flüchtigen Abbilder zu verwalten. `Lesen Sie die offizielle Dokumentation des Openstack-Clients zum Verwalten von Abbildern <https://docs.openstack.org/image-guide/create-images-manually.html>`_.
id: Gunakan klien openstack dalam kontainer utilitas untuk mengelola semua glance images. `See the openstack client official documentation on managing images <https://docs.openstack.org/image-guide/create-images-manually.html>`_.

source: Useful network utilities and commands:
de: Nützliche Netzwerkdienstprogramme und Befehle:
id: Utilitas dan perintah jaringan yang berguna:

source: Using a 3 node example, you would be telling nodes 2 and 3 to join the cluster of the first node.
de: Bei Verwendung eines 3-Knoten-Beispiels würden Sie den Knoten 2 und 3 mitteilen, dass sie dem Cluster des ersten Knotens beitreten.
id: Menggunakan contoh 3 node, Anda akan memberitahu node 2 dan 3 untuk bergabung dengan cluster dari node pertama.

source: Using an image, create a new instance via the Dashboard options.
de: Erstellen Sie mithilfe eines Abbildes eine neue Instanz über die Dashboard-Optionen.
id: Menggunakan image, buat instance baru melalui opsi Dasbor.

source: Using tags
de: Verwenden von Tags
id: Menggunakan tag

source: Verify OpenStack-Ansible Cloud
de: Überprüfen Sie die OpenStack-Ansible Cloud
id: Verifikasi OpenStack-Ansible Cloud

source: Verify cluster status
de: Überprüfen Sie den Clusterstatus
id: Verifikasi status kluster

source: Verify the instances are shutdown:
de: Stellen Sie sicher, dass die Instanzen heruntergefahren werden:
id: Pastikan instance dimatikan:

source: Verify the services on the host are reconnected to the environment:
de: Überprüfen Sie, dass die Dienste auf dem Host wieder mit der Umgebung verbunden sind:
id: Verifikasi bahwa layanan di host terhubung kembali ke lingkungan:

source: View the instance console log
de: Zeigen Sie das Protokoll der Instanzkonsole an
id: Lihat log konsol instance

source: Volumes attach to instances, enabling persistent storage. Volume storage provides a source of memory for instances. Administrators can attach volumes to a running instance, or move a volume from one instance to another.
de: Datenträger werden an Instanzen angehängt, wodurch dauerhafter Speicher aktiviert wird. Der Datenträgerspeicher stellt eine Speicherquelle für Instanzen bereit. Administratoren können Datenträger einer laufenden Instanz anhängen oder ein von einer Instanz zu einer anderen verschieben.
id: Volume melampirkan ke instance, memungkinkan penyimpanan persisten. Penyimpanan volume menyediakan sumber memori untuk instance. Administrator dapat melampirkan volume ke instance yang sedang berjalan, atau memindahkan volume dari satu instance ke instance lainnya.

source: Watch out when you restart the node, it will still think it is part of the cluster and will require you to reset the node. After resetting, you should be able to rejoin it to other nodes as needed.
de: Achten Sie darauf, wenn Sie den Knoten neu starten, er wird immer noch denken, dass er Teil des Clusters ist, und Sie müssen den Knoten zurücksetzen. Nach dem Zurücksetzen sollten Sie in der Lage sein, sich bei Bedarf an andere Knoten anzuschließen.
id: Perhatikan ketika Anda me-restart node, itu masih akan berpikir itu adalah bagian dari cluster dan akan meminta Anda untuk mereset node. Setelah mereset, Anda harus dapat bergabung kembali ke node lain sesuai kebutuhan.

source: We can now go ahead with the upgrade of all the OpenStack components.
de: Wir können jetzt weitermachen mit der Aktualisierung aller OpenStack Komponenten.
id: Kita sekarang dapat melanjutkan dengan upgrade semua komponen OpenStack.

source: We can now go ahead with the upgrade of all the infrastructure components. To ensure that rabbitmq and mariadb are upgraded, we pass the appropriate flags.
de: Wir können jetzt weitermachen mit der Aktualisierung aller Infrastrukturkomponenten. Um sicherzustellen, dass rabbitmq und mariadb aktualisiert werden, wir führen die enstprechenden Flags mit aus.
id: Kita sekarang dapat melanjutkan dengan upgrade semua komponen infrastruktur. Untuk memastikan bahwa rabbitmq dan mariadb ditingkatkan (upgraded), kami memberikan flag yang sesuai.

source: What is the destination address of the traffic?
de: Wie lautet die Zieladresse des Datenverkehrs?
id: Apa alamat tujuan lalu lintas?

source: What is the source address of the traffic?
de: Wie lautet die Absenderadresse des Datenverkehrs?
id: Apa alamat sumber lalu lintas?

source: What is the tenant network type?
de: Was ist der Tenant-Netzwerktyp?
id: Apa jenis jaringan penyewa?

source: What type of node am I replacing hardware on?
de: Bei welcher Art von Knoten ersetze ich die Hardware?
id: Apa jenis node yang saya ganti perangkat keras?

source: When a module is being used as an ad-hoc command, there are a few parameters that are not required. For example, for the ``chdir`` command, there is no need to :command:`chdir=/home/user ls` when running Ansible from the CLI:
de: Wenn ein Modul als ad-hoc Kommando verwendet wird, werden ein paar Parameter nicht benötigt. Zum Beispiel, für das ``chdir`` Kommando ist kein :command:`chdir=/home/user ls` notwendig, wenn Ansible von CLI aufgerufen wird:
id: Ketika sebuah modul digunakan sebagai perintah ad-hoc, ada beberapa parameter yang tidak diperlukan. Sebagai contoh, untuk perintah ``chdir``, tidak perlu :command:`chdir=/home/user ls` saat menjalankan Ansible dari CLI:

source: When all but one node fails, the remaining node cannot achieve quorum and stops processing SQL requests. In this situation, failed nodes that recover cannot join the cluster because it no longer exists.
de: Wenn alle Knoten bis auf einen Knoten fehlschlagen, kann der verbleibende Knoten das Quorum nicht erreichen und die Verarbeitung von SQL-Anfragen beendet werden. In diesem Fall können ausgefallene Knoten, die wiederhergestellt werden, dem Cluster nicht beitreten, da er nicht mehr vorhanden ist.
id: Ketika semua kecuali satu node gagal, node yang tersisa tidak dapat mencapai quorum dan berhenti memproses permintaan SQL. Dalam situasi ini, node gagal yang pulih tidak dapat bergabung dengan kluster karena tidak ada lagi.

source: When the entire cluster is brought down, the last node to go down must be the first node to be brought online. If this does not happen, the nodes will wait 30 seconds for the last disc node to come back online, and fail afterwards.
de: Wenn der gesamte Cluster heruntergefahren wird, muss der letzte Knoten, der heruntergefahren werden soll, der erste Knoten sein, der online geschaltet werden soll. Wenn dies nicht geschieht, warten die Knoten 30 Sekunden, bis der letzte Plattenknoten wieder online ist, und scheitern danach.
id: Ketika seluruh klaster diturunkan, node terakhir yang harus turun harus menjadi node pertama yang dibawa online. Jika ini tidak terjadi, node akan menunggu 30 detik untuk node disk terakhir untuk kembali online, dan gagal setelahnya.

source: Which compute node is hosting the VM in question?
de: Welcher Rechenknoten hostet die fragliche VM?
id: Komputasi node mana yang menjadi hosting VM yang dimaksud?

source: Which interface is used for VXLAN overlay?
de: Welche Schnittstelle wird für VXLAN-Overlay verwendet?
id: Antarmuka mana yang digunakan untuk hamparan VXLAN?

source: Which interface is used for provider network traffic?
de: Welche Schnittstelle wird für den Netzwerkverkehr des Providers verwendet?
id: Antarmuka mana yang digunakan untuk lalu lintas jaringan penyedia?

source: Which network node (container) is the router hosted?
de: Welcher Netzwerkknoten (Container) wird vom Router gehostet?
id: Node jaringan (kontainer) manakah yang dihosting oleh router?

source: While three infrastructure hosts are recommended, if further hosts are needed in an environment, it is possible to create additional nodes.
de: Obwohl drei Infrastrukturhosts empfohlen werden, können weitere Knoten erstellt werden, wenn weitere Hosts in einer Umgebung benötigt werden.
id: Sementara tiga host infrastruktur direkomendasikan, jika host lebih lanjut diperlukan dalam suatu lingkungan, adalah mungkin untuk membuat node tambahan.

source: While troubleshooting, if you notice one node is refusing to join the cluster, it is definitely worth checking if the erlang cookie matches the other nodes. When the cookie is misconfigured (for example, not identical), RabbitMQ will log errors such as "Connection attempt from disallowed node" and "Could not auto-cluster". See `clustering <https://www.rabbitmq.com/clustering.html>`_ for more information.
de: Wenn Sie bei der Fehlerbehebung feststellen, dass ein Knoten sich weigert, dem Cluster beizutreten, sollten Sie unbedingt prüfen, ob das Erlang-Cookie mit den anderen Knoten übereinstimmt. Wenn der Cookie falsch konfiguriert ist (zum Beispiel nicht identisch ist), protokolliert RabbitMQ Fehler wie "Verbindungsversuch von nicht zugelassenem Knoten" und "Konnte nicht automatisch clustern". Siehe `Clustering <https://www.rabbitmq.com/clustering.html>`_ für weitere Informationen.
id: Sementara pemecahan masalah, jika Anda melihat satu node menolak untuk bergabung dengan cluster, itu pasti bernilai memeriksa apakah cookie erlang sesuai dengan node lainnya. Ketika cookie salah dikonfigurasi (misalnya, tidak identik), RabbitMQ akan mencatat kesalahan seperti "Connection attempt from disallowed node" dan "Could not auto-cluster". Lihat `clustering <https://www.rabbitmq.com/clustering.html>`_ untuk informasi lebih lanjut.

source: With a web browser, access the Dashboard using the external load balancer IP address. This is defined by the ``external_lb_vip_address`` option in the ``/etc/openstack_deploy/openstack_user_config.yml`` file. The dashboard uses HTTPS on port 443.
de: Mit einem Webbrowser greifen Sie über die externe Load-Balancer-IP-Adresse auf das Dashboard zu. Dies wird durch die ``external_lb_vip_address`` Option in der ``/etc/openstack_deploy/openstack_user_config.yml`` Datei definiert. Das Dashboard verwendet HTTPS an Port 443.
id: Dengan browser web, akses Dasbor menggunakan alamat IP penyeimbang beban eksternal. Ini ditentukan oleh opsi ``external_lb_vip_address`` pada file ``/etc/openstack_deploy/openstack_user_config.yml``. Dasbor menggunakan HTTPS di port 443.

source: With this complete, we can now restart the mariadb containers one at a time, ensuring that each is started, responding, and synchronized with the other nodes in the cluster before moving on to the next steps. This step allows the LXC container configuration that you applied earlier to take effect, ensuring that the containers are restarted in a controlled fashion.
de: Mit diesem Abschluss können wir nun alle mariadb-Container einzeln nacheinander neu starten und sicherstellen, dass jeder Container gestartet wird, antwortet und mit den anderen Knoten im Cluster synchronisiert wird, bevor mit den nächsten Schritten fortgefahren wird. Durch diesen Schritt kann die zuvor angewendete LXC-Containerkonfiguration wirksam werden, um sicherzustellen, dass die Container kontrolliert neu gestartet werden.
id: Dengan lengkap ini, kita sekarang dapat me-restart kontainer mariadb satu per satu, memastikan bahwa masing-masing dimulai, merespons, dan disinkronkan dengan node lain di cluster sebelum melanjutkan ke langkah berikutnya. Langkah ini memungkinkan konfigurasi kontainer LXC yang Anda terapkan sebelumnya berlaku, memastikan bahwa kontainer diaktifkan kembali secara terkendali.

source: Within OpenStack-Ansible, all data and states required for operation of the RabbitMQ cluster is replicated across all nodes including the message queues providing high availability. RabbitMQ nodes address each other using domain names. The hostnames of all cluster members must be resolvable from all cluster nodes, as well as any machines where CLI tools related to RabbitMQ might be used. There are alternatives that may work in more restrictive environments. For more details on that setup, see `Inet Configuration <http://erlang.org/doc/apps/erts/inet_cfg.html>`_.
de: Innerhalb von OpenStack-Ansible werden alle Daten und Zustände, die für den Betrieb des RabbitMQ-Clusters erforderlich sind, über alle Knoten repliziert, einschließlich der Nachrichtenwarteschlangen, die eine hohe Verfügbarkeit bereitstellen. RabbitMQ-Knoten adressieren sich gegenseitig unter Verwendung von Domainnamen. Die Hostnamen aller Clustermitglieder müssen von allen Clusterknoten auflösbar sein, ebenso wie von allen Maschinen, auf denen CLI-Tools für RabbitMQ verwendet werden können. Es gibt Alternativen, die in restriktiveren Umgebungen funktionieren können. Weitere Informationen zu diesem Setup finden Sie unter `Inet-Konfiguration <http://erlang.org/doc/apps/erts/inet_cfg.html>`_.
id: Dalam OpenStack-Ansible, semua data dan status yang diperlukan untuk pengoperasian kluster RabbitMQ direplikasi di semua node termasuk antrian pesan yang menyediakan ketersediaan tinggi. Node RabbitMQ membahas satu sama lain menggunakan nama domain. Nama host dari semua anggota cluster harus dapat dipecahkan dari semua node cluster, serta mesin apa pun yang mana alat CLI yang terkait dengan RabbitMQ dapat digunakan. Ada alternatif yang dapat bekerja di lingkungan yang lebih ketat. Untuk detail lebih lanjut tentang pengaturan itu, lihat `Inet Configuration <http://erlang.org/doc/apps/erts/inet_cfg.html>`_.

source: Yes:
de: Ja:

source: You can also conduct the following activities which may generate logs to help identity problems:
de: Sie können auch die folgenden Aktivitäten ausführen, die Protokolle generieren können, um Identitätsprobleme zu beheben:
id: Anda juga dapat melakukan aktivitas berikut yang dapat menghasilkan log untuk membantu masalah identitas:

source: You can check the status of an OpenStack service by accessing every controller node and running the :command:`service <SERVICE_NAME> status`.
de: Sie können den Status eines OpenStack-Dienstes überprüfen, indem Sie auf jeden Controller-Knoten zugreifen und den Befehl: `service <SERVICE_NAME> status` ausführen.
id: Anda dapat memeriksa status layanan OpenStack dengan mengakses setiap node pengontrol dan menjalankan :command:`service <SERVICE_NAME> status`.

source: You can limit upgrades to specific OpenStack components by running each of the component playbooks against groups.
de: Sie können Upgrades auf bestimmte OpenStack-Komponenten beschränken, indem Sie die einzelnen Komponenten-Playbooks für Gruppen ausführen.
id: Anda dapat membatasi pemutakhiran pada komponen OpenStack tertentu dengan menjalankan masing-masing playbook komponen terhadap grup.

source: You can limit upgrades to specific OpenStack components. See the following section for details.
de: Sie können Upgrades auf bestimmte OpenStack-Komponenten beschränken. Details finden Sie im folgenden Abschnitt.
id: Anda dapat membatasi pemutakhirkan pada komponen OpenStack tertentu. Lihat bagian berikut untuk detailnya.

source: You can only upgrade between sequential releases.
de: Sie können nur zwischen sequenziellen Releases upgraden.
id: Anda hanya dapat memutakhirkan di antara rilis berurutan.

source: You will be asked two questions:
de: Sie werden zwei Fragen gestellt bekommen:
id: Anda akan ditanya dua pertanyaan:

source: You will see ``rabbit1`` and ``rabbit2`` are both running as before.
de: Sie werden sehen, dass ``rabbit1`` und ``rabbit2`` beide laufen wie zuvor.
id: Anda akan melihat ``rabbit1`` dan ``rabbit2`` sama-sama berjalan seperti sebelumnya.

source: `Block Storage (cinder) CLI command cheat sheet <https://docs.openstack.org/python-cinderclient/latest/cli/details.html>`__
de: `Blockspeicher (cinder) CLI Befehl Spickzettel <https://docs.openstack.org/python-cinderclient/latest/cli/details.html>`__

source: `Block Storage (cinder) CLI commands <https://docs.openstack.org/python-cinderclient/latest/user/shell.html>`__
de: `CLI-Befehle zum Blockspeicher (Cinder) <https://docs.openstack.org/python-cinderclient/latest/user/shell.html>`__

source: `Block Storage service <https://docs.openstack.org/ocata/install-guide-rdo/cinder-verify.html>`_
de: `Blockspeicherdienst <https://docs.openstack.org/ocata/install-guide-rdo/cinder-verify.html>`_

source: `Compute (nova) CLI command cheat sheet <https://docs.openstack.org/python-novaclient/latest/cli/nova.html>`__
de: `Compute (Nova) CLI Befehl Spickzettel <https://docs.openstack.org/python-novaclient/latest/cli/nova.html>`__

source: `Compute (nova) CLI commands <https://docs.openstack.org/nova/latest/cli/index.html>`__
de: `Compute (nova) CLI-Befehle <https://docs.openstack.org/nova/latest/cli/index.html>`__

source: `Compute service (nova) <https://docs.openstack.org/ocata/install-guide-ubuntu/nova-verify.html>`_
de: `Compute-Dienst (Nova) <https://docs.openstack.org/ocata/install-guide-ubuntu/nova-verify.html>`_

source: `Haproxy <https://opendev.org/openstack/openstack-ansible/src/commit/6520d0bb2c689ed7caa5df581be6a966133cdce0/inventory/group_vars/haproxy/haproxy.yml>`_ can be configured with OpenStack-Ansible. The automatically generated ``/etc/haproxy/haproxy.cfg`` file have enough information on the ports to open for your environment.
de: `Haproxy <https://opendev.org/openstack/openstack-ansible/src/commit/6520d0bb2c689ed7caa5df581be6a966133cdce0/inventory/group_vars/haproxy/haproxy.yml>`_ kann mit OpenStack-Ansible konfiguriert werden. Die automatisch erzeugte Datei ``/etc/haproxy/haproxy.cfg`` verfügt über genügend Informationen über die Ports, die Sie für Ihre Umgebung öffnen können.
id: `Haproxy <https://opendev.org/openstack/openstack-ansible/src/commit/6520d0bb2c689ed7caa5df581be6a966133cdce0/inventory/group_vars/haproxy/haproxy.yml>`_ dapat dikonfigurasi dengan OpenStack-Ansible. File ``/etc/haproxy/haproxy.cfg`` yang dihasilkan secara otomatis memiliki informasi yang cukup pada port untuk dibuka bagi lingkungan Anda.

source: `Identity service (keystone) <https://ask.openstack.org/en/question/101127/how-to-check-if-keystone-is-running/>`_
de: `Identitätsdienst (Keystone) <https://ask.openstack.org/en/question/101127/how-to-check-if-keystone-is-running/>`_

source: `Image Service (glance) CLI command cheat sheet <https://docs.openstack.org/python-glanceclient/latest/cli/glance.html>`__
de: `Image Service (glance) CLI Befehl Spickzettel <https://docs.openstack.org/python-glanceclient/latest/cli/glance.html>`__

source: `Image Service (glance) CLI commands <https://docs.openstack.org/glance/latest/cli/index.html>`__
de: `Image Service (glance) CLI-Befehle <https://docs.openstack.org/glance/latest/cli/index.html>`__

source: `Image service (glance) <https://docs.openstack.org/ocata/install-guide-ubuntu/glance-verify.html>`_
de: `Abbilddienst (glance) <https://docs.openstack.org/ocata/install-guide-ubuntu/glance-verify.html>`_

source: `Networking (neutron) CLI command cheat sheet <https://docs.openstack.org/python-neutronclient/latest/cli/neutron.html>`__
de: `Netzwerk (Neutron) CLI Befehl Spickzettel <https://docs.openstack.org/python-neutronclient/latest/cli/neutron.html>`__

source: `Networking (neutron) CLI commands <https://docs.openstack.org/neutron/latest/cli/index.html>`__
de: `Netzwerk (Neutron) CLI-Befehle <https://docs.openstack.org/neutron/latest/cli/index.html>`__

source: `Networking service (neutron) <https://docs.openstack.org/ocata/install-guide-ubuntu/neutron-verify.html>`_
de: `Netzwerkdienst (Neutron) <https://docs.openstack.org/ocata/install-guide-ubuntu/neutron-verify.html>`_

source: `Object Storage service (swift) <https://docs.openstack.org/project-install-guide/object-storage/ocata/verify.html>`_
de: `Objektspeicherdienst (swift) <https://docs.openstack.org/project-install-guide/object-storage/ocata/verify.html>`_

source: `OpenStack API Quick Start <https://docs.openstack.org/api-quick-start/index.html>`__
de: `OpenStack API Schnellstart <https://docs.openstack.org/api-quick-start/index.html>`__

source: `OpenStackClient commands <https://docs.openstack.org/python-openstackclient/latest/>`__
de: `OpenStackClient Befehle <https://docs.openstack.org/python-openstackclient/latest/>`__

source: ``CONTAINER_NET`` (LXC container network used Openstack Services)
de: ``CONTAINER_NET`` (LXC-Container-Netzwerk verwendet Openstack Services)
id: ``CONTAINER_NET`` (Jaringan kontainer LXC menggunakan Layanan Openstack)

source: ``HOST_NET`` (Physical Host Management and Access to Internet)
de: ``HOST_NET`` (Physische Host-Verwaltung und Zugang zum Internet)
id: ``HOST_NET`` (Physical Host Management dan Access ke Internet)

source: ``OVERLAY_NET`` (VXLAN overlay network)
de: ``OVERLAY_NET`` (VXLAN-Overlay-Netzwerk)
id: ``OVERLAY_NET`` (jaringan hamparan VXLAN)

source: ``br-mgmt`` should contain veth-pair ends from all containers and a physical interface or tagged-subinterface:
de: `` br-mgmt`` sollte veth-pair Enden von allen Containern und einer physikalischen Schnittstelle oder getagged-subinterface enthalten:
id: ``br-mgmt`` harus berisi veth-pair end dari semua kontainer dan antarmuka fisik atau tagged-subinterface:

source: `eth0` in the container connects to `lxcbr0` on the host
de: `eth0` im Container verbindet sich mit` lxcbr0` auf dem Host
id: `eth0` dalam kontainer terhubung ke` lxcbr0` pada host

source: `eth1` in the container connects to `br-mgmt` on the host
de: `eth1` im Container verbindet sich mit` br-mgmt` auf dem Host
id: `eth1` dalam kontainer terhubung ke `br-mgmt` pada host

source: `python-neutronclient <https://pypi.org/project/python-neutronclient/>`__
de: `Python-Neutronenclient <https://pypi.org/project/python-neutronclient/>`__

source: kvm defaults to ``qemu+tcp://%s/system``
de: kvm verwendet standardmäßig ``qemu+tcp://%s/system``
id: kvm default ke ``qemu+tcp://%s/system``

source: qemu defaults to ``qemu+tcp://%s/system``
de: qemu verwendet standardmäßig `` qemu+tcp://%s/system``
id: qemu default ke ``qemu+tcp://%s/system``

source: xen defaults to ``xenmigr://%s/system``
de: xen verwendet standardmäßig ``xenmigr://%s/system``
id: xen defaults ke ``xenmigr://%s/system``

source: |upgrade_warning| Test this on a development environment first.
de: |upgrade_warning| Testen Sie dies zunächst in einer Entwicklungsumgebung.
id: Uji |upgrade_warning| ini pada lingkungan pengembangan terlebih dahulu.

source: Alternatively you can try using new compute nodes deployment script ``/opt/openstack-ansible/scripts/add-compute.sh``.
id: Atau Anda dapat mencoba menggunakan skrip penyebaran node komputasi baru ``/opt/openstack-ansible/scripts/add-compute.sh``.

source: Are you sure you want to destroy the LXC containers? Are you sure you want to destroy the LXC container data?
id: Anda yakin ingin menghancurkan kontainer LXC? Anda yakin ingin menghancurkan data kontainer LXC?

source: As a hint, you could find the list of all public URI defaults by executing the following:
id: Sebagai petunjuk, Anda dapat menemukan daftar semua default URI publik dengan menjalankan yang berikut:

source: As explained in the previous section, you can find (in each roles documentation) the default variables used for the public interface endpoint ports.
id: Seperti dijelaskan di bagian sebelumnya, Anda dapat menemukan (dalam setiap dokumentasi peran) variabel default yang digunakan untuk port endpoint antarmuka publik.
