Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: de, id

source: Enable the ``cinder-volume`` service:
de: Aktivieren Sie den Dienst ``cinder-volume``:
id: Aktifkan layanan ``cinder-volume``:

source: Enable the ``nova-compute`` service in the environment:
de: Aktivieren Sie den Dienst ``nova-compute`` in der Umgebung:
id: Aktifkan layanan ``nova-compute`` di lingkungan:

source: Enable the previously failed node on the load balancer.
de: Aktivieren Sie den zuvor fehlgeschlagenen Knoten im Lastenausgleich.
id: Aktifkan node yang gagal sebelumnya pada load balancer.

source: Ensure RabbitMQ is not running on the node:
de: Stellen Sie sicher, dass RabbitMQ nicht auf dem Knoten ausgeführt wird:
id: Pastikan RabbitMQ tidak berjalan di node:

source: Ensure that the new instance can respond to a networking connection test through the :command:`ping` command. Log in to your monitoring system, and verify that the monitors return a green signal for the new node.
de: Stellen Sie sicher, dass die neue Instanz auf einen Netzwerkverbindungstest mit dem Befehl :command:`ping` reagieren kann. Melden Sie sich bei Ihrem Überwachungssystem an und vergewissern Sie sich, dass die Monitore ein grünes Signal für den neuen Knoten zurückgeben.
id: Pastikan instance baru dapat menanggapi tes koneksi jaringan melalui perintah :command:`ping`. Masuk ke sistem pemantauan Anda, dan verifikasi bahwa monitor mengembalikan sinyal hijau untuk simpul node.

source: Ensure that your OpenStack-Ansible code is on the latest |current_release_formal_name| tagged release.
de: Stellen Sie sicher, dass sich Ihr OpenStack-Ansible-Code auf latest |current_release_formal_name| befindet markierte Version.
id: Pastikan kode OpenStack-Ansible Anda ada di |current_release_formal_name| terbaru rilis yang ditandai.

source: Ensure that your OpenStack-Ansible code is on the latest |current_release_formal_name| tagged release:
de: Stellen Sie sicher, dass sich Ihr OpenStack-Ansible-Code auf latest |current_release_formal_name| markierte Version befindet:
id: Pastikan kode OpenStack-Ansible Anda ada di |current_release_formal_name| terbaru rilis yang ditandai (tagged):

source: Ensure this step is performed first
de: Stellen Sie sicher, dass dieser Schritt zuerst ausgeführt wird
id: Pastikan langkah ini dilakukan terlebih dahulu

source: Enter the details of the image, including the **Image Location**, which is where the URL location of the image is required.
de: Geben Sie die Details des Abbildes ein, einschließlich **Abbildort**, wo der URL-Ort des Abbildes benötigt wird.
id: Masukkan detail image, termasuk **Image Location**, yang mana lokasi URL image diperlukan.

source: Examplarery live migration on a local storage:
de: Beispielhafte Live Migration auf einem lokalen Speicher:
id: Examplarery live migration pada penyimpanan lokal:

source: Example inventory restore process.
de: Beispiel für die Wiederherstellung eines Inventars
id: Contoh proses pengembalian inventaris.

source: Example of rebooting one container at a time, 60 seconds apart:
de: Beispiel für das Neustarten eines einzelnen Containers im Abstand von 60 Sekunden:
id: Contoh reboot satu kontainer pada satu waktu, 60 detik terpisah:

source: Example of rebooting still accessible containers.
de: Beispiel für das Neustarten von noch zugänglichen Containern.
id: Contoh rebooting kontainer yang masih dapat diakses.

source: Execute ``rabbitmq cluster_status`` to see all 3 nodes:
de: Führen Sie ``rabbitmq cluster_status`` aus, um alle 3 Knoten zu sehen:
id: Jalankan ``rabbitmq cluster_status`` untuk melihat semua 3 node:

source: Execute a minor version upgrade
de: Führen Sie ein Nebenversionsupgrade durch
id: Jalankan pemutakhiran versi kecil

source: Executing the migration
de: Ausführen der Migration
id: Melaksanakan migrasi

source: Export the Neutron network that is about to be removed as single UUID.
de: Exportieren Sie das Neutron-Netzwerk, das als einzelne UUID entfernt werden soll.
id: Ekspor jaringan Neutron yang akan dihapus sebagai UUID tunggal.

source: Fact caching can be disabled by running ``export ANSIBLE_CACHE_PLUGIN=memory``. To set this permanently, set this variable in ``/usr/local/bin/openstack-ansible.rc``. Refer to the Ansible documentation on `fact caching`_ for more details.
de: Das Fact-Caching kann durch Ausführen von ``export ANSIBLE_CACHE_PLUGIN=memory`` deaktiviert werden. Um dies dauerhaft einzustellen, setzen Sie diese Variable in ``/usr/local/bin/openstack-ansible.rc``. Weitere Informationen finden Sie in der Ansible-Dokumentation zum `fact caching`_.
id: Caching fakta dapat dinonaktifkan dengan menjalankan ``export ANSIBLE_CACHE_PLUGIN = memory``. Untuk mengatur ini secara permanen, setel variabel ini di ``/usr/local/bin/openstack-ansible.rc``. Lihat dokumentasi Ansible di `fact caching`_ untuk detail lebih lanjut.

source: Failed ansible playbooks during an upgrade
de: Fehlerhafte Ansible-Playbooks während eines Upgrades
id: Playbook yang gagal mungkin dilakukan selama upgrade

source: Failed security hardening after host kernel upgrade from version 3.13
de: Fehlgeschlagene Sicherheitsverhärtung nach Host-Kernel-Upgrade ab Version 3.13
id: Pengerasan (hardening) keamanan gagal setelah upgrade kernel host dari versi 3.13

source: Field Name
de: Feldname

source: Find the volumes to check the instance has successfully booted and is at the login :
de: Suchen Sie nach den Datenträgern, die überprüft werden sollen, ob die Instanz erfolgreich gestartet wurde und sich bei der Anmeldung befindet:
id: Temukan volume untuk memeriksa instance telah berhasil di-boot dan sedang masuk:

source: Finding ports for your external load balancer
de: Suchen nach Ports für Ihren externen Load Balancer
id: Menemukan port untuk penyeimbang beban (load balancer) eksternal Anda

source: For a Compute host, shut down the instance on the host before it goes down. For a Block Storage (cinder) host using non-redundant storage, shut down any instances with volumes attached that require that mount point. Unmount the drive within your operating system and re-mount the drive once the Block Storage host is back online.
de: Beenden Sie für einen Compute-Host die Instanz auf dem Host, bevor sie heruntergefahren wird. Löschen Sie für einen Blockspeicher (Cinder) -Host, der nicht redundanten Speicher verwendet, alle Instanzen mit angehängten Datenträgern, für die dieser Bereitstellungspunkt erforderlich ist. Hängen Sie das Laufwerk innerhalb Ihres Betriebssystems aus und mounten Sie das Laufwerk erneut, sobald der Blockspeicher-Host wieder online ist.
id: Untuk host Compute, matikan instance pada host sebelum down. Untuk host Block Storage (cinder) yang menggunakan penyimpanan non-redundan, matikan instance dengan volume yang terpasang yang mengharuskan titik pemasangan itu. Lepas drive dalam sistem operasi Anda dan pasang kembali drive setelah host Block Storage kembali online.

source: For an example and more information, see `Verify operation <https://docs.openstack.org/glance/latest/install/verify.html>_`. and `Manage Images <https://docs.openstack.org/glance/latest/admin/manage-images.html>_`
de: Für ein Beispiel und mehr Informationen, schauen Sie `Verify operation <https://docs.openstack.org/glance/latest/install/verify.html>_`. und `Manage Images <https://docs.openstack.org/glance/latest/admin/manage-images.html>_`
id: Untuk contoh dan informasi lebih lanjut, lihat `Verify operation <https://docs.openstack.org/glance/latest/install/verify.html>_`. dan `Manage Images <https://docs.openstack.org/glance/latest/admin/manage-images.html>_`

source: For disaster recovery purposes, it is a good practice to perform regular backups of the database, configuration files, network information, and OpenStack service details in your environment. For an OpenStack cloud deployed using OpenStack-Ansible, back up the ``/etc/openstack_deploy/`` directory.
de: Für die Notfallwiederherstellung empfiehlt es sich, regelmäßige Sicherungen der Datenbank, Konfigurationsdateien, Netzwerkinformationen und OpenStack-Dienstdetails in Ihrer Umgebung durchzuführen. Für eine OpenStack-Cloud, die mit OpenStack-Ansible bereitgestellt wird, sichern Sie das Verzeichnis ``/etc/openstack_deploy/``.
id: Untuk tujuan pemulihan bencana, ini adalah praktik yang baik untuk melakukan pencadangan teratur dari database, file konfigurasi, informasi jaringan, dan rincian layanan OpenStack di lingkungan Anda. Untuk cloud OpenStack yang digunakan menggunakan OpenStack-Ansible, buat cadangan direktori ``/etc/openstack_deploy/``.

source: For example, if you update the networks requiring a change in all nodes with a linux bridge agent, assuming you have infra nodes named **infra01**, **infra02**, and **infra03**, run:
de: Wenn Sie zum Beispiel die Netzwerke aktualisieren, die eine Änderung an allen Knoten mit einem Linux-Bridge-Agenten erfordern, führen Sie Folgendes aus: Wenn Sie Infra-Knoten mit den Namen **infra01**, **infra02** und **infra03** haben, führen Sie Folgendes aus:
id: Misalnya, jika Anda memperbarui jaringan yang membutuhkan perubahan di semua node dengan agen bridge linux, dengan asumsi Anda memiliki infra node bernama **infra01**, **infra02**, dan **infra03**, jalankan:

source: For example, run the **openstack-ansible lxc-containers-create.yml rabbitmq-install.yml** commands from the ``openstack-ansible/playbooks`` repository to complete the scaling process described in the example above:
de: Führen Sie beispielsweise die Befehle **openstack-ansible lxc-containers-create.yml rabbitmq-install.yml** aus dem Repository ``openstack-ansible/playbooks`` aus, um den im obigen Beispiel beschriebenen Skalierungsprozess abzuschließen:
id: Sebagai contoh, jalankan perintah **openstack-ansible lxc-containers-create.yml rabbitmq-install.yml** dari repositori ``openstack-ansible/playbooks`` untuk menyelesaikan proses penskalaan yang dijelaskan pada contoh di atas:

source: For example, the `os_glance documentation <https://docs.openstack.org/openstack-ansible-os_glance/latest/#default-variables>`_ lists the variable ``glance_service_publicuri``. This contains the port used for the reaching the service externally. In this example, it is equal to ``glance_service_port``, whose value is 9292.
de: Zum Beispiel die `os_glance documentation <https://docs.openstack.org/openstack-ansible-os_glance/latest/#default-variables>`_ listet die Variable ``glance_service_publicuri``. Diese beinhaltet den Port zur Erreichung des Dienstes extern. In diesem Beispiel ist es gleich dem ``glance_service_port``, welcher den Wert 9292 hat.
id: Misalnya, `os_glance documentation <https://docs.openstack.org/openstack-ansible-os_glance/latest/#default-variables>`_ mendaftar variabel ``glance_service_publicuri``. Ini berisi port yang digunakan untuk mencapai layanan secara eksternal. Dalam contoh ini, itu sama dengan ``glance_service_port``, yang nilainya 9292.

source: For example, you can update only the Compute hosts by running the following command:
de: Beispielsweise können Sie nur die Compute-Hosts aktualisieren, indem Sie den folgenden Befehl ausführen:
id: Misalnya, Anda hanya dapat memperbarui host Compute dengan menjalankan perintah berikut:

source: For example, you could use the shell module to check the amount of disk space on a set of Compute hosts:
de: Mit dem Shell-Modul können Sie beispielsweise den Speicherplatz auf einer Gruppe von Compute-Hosts prüfen:
id: Misalnya, Anda bisa menggunakan modul shell untuk memeriksa jumlah ruang disk pada satu set host Compute:

source: For in-depth technical information, see the :dev_docs:`OpenStack-Ansible Reference <reference/index.html>`.
de: Ausführliche technische Informationen finden Sie unter :dev_docs:`OpenStack-Ansible Reference <reference/index.html>`.
id: Untuk informasi teknis yang mendalam, lihat :dev_docs:`OpenStack-Ansible Reference <reference/index.html>`.

source: For information on how to contribute, extend or develop OpenStack-Ansible, see the :dev_docs:`Contributors Guide <contributor/index.html>`.
de: Informationen zum Beitragen, Erweitern oder Entwickeln von OpenStack-Ansible finden Sie im :dev_docs:`Contributors Guide <contributor/index.html>`.
id: Untuk informasi tentang cara berkontribusi, memperluas atau mengembangkan OpenStack-Ansible, lihat :dev_docs:`Contributors Guide <contributor/index.html>`.

source: For information on how to deploy your OpenStack-Ansible cloud, refer to the :deploy_guide:`Deployment Guide <index.html>` for step-by-step instructions on how to deploy the OpenStack packages and dependencies on your cloud using OpenStack-Ansible.
de: Informationen zur Bereitstellung Ihrer OpenStack-Ansible-Cloud finden Sie im Implementierungshandbuch :deploy_guide:`Deployment Guide <index.html>` für eine Schritt-für-Schritt-Anleitung zur Bereitstellung der OpenStack-Pakete und Abhängigkeiten in Ihrer Cloud mit OpenStack-Ansible.
id: Untuk informasi tentang cara menggunakan cloud OpenStack-Ansible Anda, lihat :deploy_guide:`Deployment Guide <index.html>` untuk petunjuk langkah demi langkah tentang cara menggunakan paket OpenStack dan dependensi pada cloud Anda menggunakan OpenStack-Ansible .

source: For more generic information on troubleshooting your network, see the `Network Troubleshooting chapter <https://wiki.openstack.org/wiki/OpsGuide/Network_Troubleshooting>`_ in the Operations Guide.
de: Weitere allgemeine Informationen zur Fehlerbehebung in Ihrem Netzwerk finden Sie im Kapitel `Netzwerk-Fehlerbehebung <https://wiki.openstack.org/wiki/OpsGuide/Network_Troubleshooting>`_ im Betriebshandbuch.
id: Untuk informasi lebih umum tentang pemecahan masalah jaringan Anda, lihat `Network Troubleshooting chapter <https://wiki.openstack.org/wiki/OpsGuide/Network_Troubleshooting>`_ dalam Operations Guide.

source: For more in-depth information on Networking, see the `Networking Guide <https://docs.openstack.org/neutron/latest/admin/>`_.
de: Weitere Informationen zum Netzwerk finden Sie im `Netzwerkhandbuch <https://docs.openstack.org/neutron/latest/admin/>`_.
id: Untuk informasi lebih mendalam tentang Networking, lihat `Networking Guide <https://docs.openstack.org/neutron/latest/admin/>`_.

source: For more information about Mnesia, see the `Mnesia overview <http://erlang.org/doc/apps/mnesia/Mnesia_overview.html>`_.
de: Weitere Informationen zu Mnesia finden Sie in der `Übersicht Mnesia <http://erlang.org/doc/apps/mnesia/Mnesia_overview.html>`_.
id: Untuk informasi lebih lanjut tentang Mnesia, lihat `Mnesia overview <http://erlang.org/doc/apps/mnesia/Mnesia_overview.html>`_.

source: For more information about OpenStack client utilities, see these links:
de: Weitere Informationen zu OpenStack-Client-Dienstprogrammen finden Sie unter folgenden Links:
id: Untuk informasi lebih lanjut tentang penggunaan klien OpenStack, lihat tautan ini:

source: For more information about forks, please see the following references:
de: Weitere Informationen zu Forks finden Sie in den folgenden Referenzen:
id: Untuk informasi lebih lanjut tentang fork, silakan lihat referensi berikut:

source: For more information about the major upgrade process, see :ref:`upgrading-by-using-a-script` and :ref:`upgrading-manually`.
de: Weitere Informationen zum Hauptaktualisierungsprozess finden Sie unter :ref:`upgrading-by-using-a-script` und :ref:`upgrading-manually`.
id: Untuk informasi lebih lanjut tentang proses pemutakhiran utama, lihat :ref:`upgrading-by-using-a-script` dan :ref:`upgrading-manually`.

source: For more information about the steps performed by the script, see :ref:`upgrading-manually`.
de: Für mehr Informationen über die Schritte, die das Script ausführt, schauen Sie :ref:`upgrading-manually`.
id: Untuk informasi lebih lanjut tentang langkah-langkah yang dilakukan oleh skrip, lihat :ref:`upgrading-manually`.

source: For more information on attaching Block Storage volumes to instances for persistent storage, see the *Managing volumes for persistent storage* section below.
de: Weitere Informationen zum Anhängen von Blockspeicher-Datenträger an Instanzen für dauerhaftes Speichern finden Sie im Abschnitt *Managing volumes for persistent storage* weiter unten.
id: Untuk informasi lebih lanjut tentang melampirkan volume Block Storage ke instance untuk penyimpanan persisten, lihat bagian *Managing volumes for persistent storage* di bawah ini.

source: For more information, see :deploy_guide:`Configure the deployment <configure.html>` in the OpenStack-Ansible Deployment Guide.
de: Weitere Informationen finden Sie unter :deploy_guide:`Konfigurieren Sie die Bereitstellung <configure.html>` im OpenStack-Ansible-Bereitstellungshandbuch.
id: Untuk informasi lebih lanjut, lihat :deploy_guide:`Configure the deployment <configure.html>` dalam OpenStack-Ansible Deployment Guide.

source: For more information, see `Inventory <https://docs.ansible.com/ansible/intro_inventory.html>`_ and `Patterns <https://docs.ansible.com/ansible/intro_patterns.html>`_.
de: Weitere Informationen finden Sie unter `Inventar <https://docs.ansible.com/ansible/intro_inventory.html>`_ und `Muster <https://docs.ansible.com/ansible/intro_patterns.html>`_.
id: Untuk informasi lebih lanjut, lihat `Inventory <https://docs.ansible.com/ansible/intro_inventory.html>`_ and `Patterns <https://docs.ansible.com/ansible/intro_patterns.html>`_.

source: For more information, see `shell - Execute commands in nodes <https://docs.ansible.com/ansible/shell_module.html>`_.
de: Weitere Informationen finden Sie unter `Shell - Befehle in Knoten ausführen <https://docs.ansible.com/ansible/shell_module.html>`_.
id: Untuk informasi lebih lanjut, lihat `shell - Execute commands in nodes <https://docs.ansible.com/ansible/shell_module.html>`_.

source: For user guides, see the :dev_docs:`User Guide <user/index.html>`.
de: Benutzerhandbücher finden Sie im :dev_docs:`Benutzerhandbuch <user/index.html>`.
id: Untuk panduan pengguna, lihat :dev_docs:`User Guide <user/index.html>`.

source: Forcing regeneration of cached facts
de: Regenerierung von zwischengespeicherten Fakten erzwingen
id: Memaksa regenerasi fakta yang di-cache

source: Galera cluster maintenance
de: Galera-Cluster-Wartung
id: Pemeliharaan klaster Galera

source: Galera cluster recovery
de: Galera-Cluster-Wiederherstellung
id: Pemulihan klaster Galera

source: Generate a list of instance UUIDs hosted on the failed node:
de: Generieren Sie eine Liste der Instanz-UUIDs, die auf dem ausgefallenen Knoten gehostet werden:
id: Buat daftar instance UUID yang dihosting pada node yang gagal:

source: Good!
de: Gut!

source: Good! The instance can ping its intended gateway.
de: Gut! Die Instanz kann ihr beabsichtigtes Gateway anpingen.
id: Baik! Instance dapat melakukan ping ke gateway yang dituju.

source: Good! The instance can ping its intended gateway. The issue may be north of the gateway or related to the provider network.
de: Gut! Die Instanz kann ihr beabsichtigtes Gateway anpingen. Das Problem kann sich nördlich des Gateways oder im Zusammenhang mit dem Provider-Netzwerk befinden.
id: Baik! Instance dapat melakukan ping ke gateway yang dituju. Masalahnya mungkin berada di utara gateway (north of the gateway) atau terkait dengan jaringan penyedia.

source: Good! This suggests that the instance received its IP address and can reach local network resources.
de: Gut! Dies deutet darauf hin, dass die Instanz ihre IP-Adresse erhalten hat und lokale Netzwerkressourcen erreichen kann.
id: Baik! Ini menunjukkan bahwa instance menerima alamat IP-nya dan dapat mencapai sumber daya jaringan lokal.

source: Gracefully shutting down all nodes destroys the cluster. Starting or restarting a cluster from zero nodes requires creating a new cluster on one of the nodes.
de: Wenn Sie alle Knoten ordnungsgemäß herunterfahren, wird der Cluster zerstört. Das Starten oder Neustarten eines Clusters von null Knoten erfordert das Erstellen eines neuen Clusters auf einem der Knoten.
id: Secara halus mematikan semua node akan menghancurkan cluster. Memulai atau memulai kembali kluster dari nol node membutuhkan pembuatan kluster baru di salah satu node.

source: Gracefully shutting down the MariaDB service on all but one node allows the remaining operational node to continue processing SQL requests. When gracefully shutting down multiple nodes, perform the actions sequentially to retain operation.
de: Wenn der MariaDB-Dienst auf allen außer einem Knoten ordnungsgemäß heruntergefahren wird, kann der verbleibende operative Knoten SQL-Anforderungen weiter verarbeiten. Wenn Sie mehrere Knoten ordnungsgemäß herunterfahren, führen Sie die Aktionen nacheinander aus, um den Vorgang beizubehalten.
id: Dengan halus menutup layanan MariaDB di semua kecuali satu node memungkinkan node operasional yang tersisa untuk melanjutkan pemrosesan permintaan SQL. Ketika secara halus mematikan beberapa node, lakukan tindakan secara berurutan untuk mempertahankan operasi.

source: Host Maintenance
de: Host-Wartung
id: Pemeliharaan Host

source: Host capacity management
de: Host-Kapazitätsverwaltung
id: Manajemen kapasitas host

source: However, you may notice some issues with your application as clients may be trying to push messages to the un-responsive node. To remedy this, forget the node from the cluster by executing the following:
de: Möglicherweise stellen Sie jedoch einige Probleme mit Ihrer Anwendung fest, da Clients möglicherweise versuchen, Nachrichten an den nicht reagierenden Knoten zu senden. Um dies zu beheben, vergessen Sie den Knoten aus dem Cluster, indem Sie Folgendes ausführen:
id: Namun, Anda mungkin melihat beberapa masalah dengan aplikasi Anda karena klien mungkin mencoba untuk mendorong pesan ke node yang tidak responsif. Untuk memperbaiki ini, lupakan node dari cluster dengan mengeksekusi yang berikut:

source: IP address should be applied to ``br-mgmt``:
de: IP-Adresse sollte auf ``br-mgmt`` angewendet werden:
id: Alamat IP harus digunakan ke ``br-mgmt``:

source: IP address should be applied to ``br-vxlan``:
de: Die IP-Adresse sollte auf ``br-vxlan`` angewendet werden:
id: Alamat IP harus digunakan ke ``br-vxlan``:

source: IP address should be applied to ``eth1`` inside the LXC container:
de: Die IP-Adresse sollte innerhalb des LXC-Containers auf ``eth1`` angewendet werden:
id: Alamat IP harus digunakan pada ``eth1`` di dalam kontainer LXC:

source: IP addresses should be applied to physical interface, bond interface, tagged sub-interface, or in some cases the bridge interface:
de: IP-Adressen sollten auf die physische Schnittstelle, die Verbindungsschnittstelle, die markierte Unterschnittstelle oder in einigen Fällen auf die Brückenschnittstelle angewendet werden:
id: Alamat IP harus diterapkan pada antarmuka fisik (physical interface), antarmuka ikatan (bond interface), sub-antarmuka yang ditandai (tagged sub-interface), atau dalam beberapa kasus pada antarmuka jembatan (bridge interface):

source: If MariaDB fails to start on any of the failed nodes, run the ``mysqld`` command and perform further analysis on the output. As a last resort, rebuild the container for the node.
de: Wenn MariaDB auf einem der ausgefallenen Knoten nicht gestartet werden kann, führen Sie den Befehl ``mysqld`` aus und führen Sie eine weitere Analyse der Ausgabe durch. Als letzten Ausweg erstellen Sie den Container für den Knoten neu.
id: Jika MariaDB gagal memulai pada salah satu node yang gagal, jalankan perintah ``mysqld`` dan lakukan analisis lebih lanjut pada output. Sebagai usaha terakhir, buat kembali kontainer untuk node.
