Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: de, id

source: However, some of the services within an OpenStack cloud are accessible to all end users, while others are accessible only to administrators or operators on a secured network.
de: Einige der Dienste in einer OpenStack-Cloud sind jedoch für alle Endbenutzer zugänglich, während andere nur für Administratoren oder Betreiber in einem gesicherten Netzwerk zugänglich sind.
id: Namun, beberapa layanan dalam cloud OpenStack dapat diakses oleh semua end user, sementara yang lain hanya dapat diakses oleh administrator atau operator di jaringan yang aman.

source: However, this project solely focuses on the deployment of OpenStack and its requirements.
de: Dieses Projekt konzentriert sich jedoch ausschließlich auf den Einsatz von OpenStack und seinen Anforderungen.
id: Namun, proyek ini hanya berfokus pada penyebaran OpenStack dan persyaratannya.

source: Identity service (keystone):
id: Layanan Identity (keystone):

source: If a tool or object does not require a dedicated container, or if it is impractical to create a new container for a single tool or object, it is installed in the utility container. The utility container is also used when tools cannot be installed directly on a host. The utility container is prepared with the appropriate credentials and clients to administer the OpenStack environment. It is set to automatically use the internal service endpoints.
de: Wenn für ein Werkzeug oder Objekt kein dedizierter Container erforderlich ist oder wenn das Erstellen eines neuen Containers für ein einzelnes Werkzeug oder Objekt nicht praktikabel ist, wird es im Dienstprogrammcontainer installiert. Der Dienstprogrammcontainer wird auch verwendet, wenn Tools nicht direkt auf einem Host installiert werden können. Der Dienstprogrammcontainer wird mit den entsprechenden Anmeldeinformationen und Clients vorbereitet, um die OpenStack-Umgebung zu verwalten. Es ist so eingestellt, dass es automatisch die internen Service-Endpunkte verwendet.
id: Jika suatu alat atau objek tidak memerlukan container khusus, atau jika tidak praktis untuk membuat container baru untuk satu alat atau objek tunggal, itu dipasang di wadah utilitas. Wadah utilitas juga digunakan ketika alat tidak dapat diinstal langsung pada host. Wadah utilitas disiapkan dengan kredensial dan klien yang sesuai untuk mengelola lingkungan OpenStack. Sudah diatur untuk secara otomatis menggunakan endpoint layanan internal.

source: If any groups defined in the ``openstack_user_config.yml`` or ``conf.d`` files are not found in the environment, a warning will be raised.
de: Wenn in den Dateien ``openstack_user_config.yml`` oder ``conf.d`` definierte Gruppen nicht in der Umgebung gefunden werden, wird eine Warnung ausgegeben.
id: Jika ada grup yang didefinisikan dalam file ``openstack_user_config.yml`` atau ``conf.d`` tidak ditemukan di lingkungan, peringatan akan dimunculkan.

source: If there is a requirement to rush a role patch into the next release, then anyone may propose a change to the ``ansible-role-requirements.yml`` file in the ``openstack/openstack-ansible`` repository with the appropriate justification.
de: Wenn es erforderlich ist, einen Rollen-Patch in das nächste Release zu stürzen, kann jeder eine Änderung der ``ansible-role-requirements.yml``-Datei im ``openstack/openstack-ansible``-Repository vorschlagen.
id: Jika ada persyaratan untuk menjalankan patch peran ke rilis berikutnya, maka siapa pun dapat mengusulkan perubahan ke file ``ansible-role-requirement.yml`` dalam repositori ``openstack/openstack-ansible`` dengan dengan justifikasi yang sesuai.

source: If you are deploying a stand-alone Object Storage (swift) environment, you can skip the deployment of RabbitMQ. If you use this configuration, your ``openstack_user_config.yml`` file would look as follows:
de: Wenn Sie eine eigenständige Object Storage-Umgebung (Swift) bereitstellen, können Sie die Bereitstellung von RabbitMQ überspringen. Wenn Sie diese Konfiguration verwenden, sieht Ihre ``openstack_user_config.yml`` Datei wie folgt aus:
id: Jika Anda menggunakan lingkungan Object Storage (swift) yang berdiri sendiri, Anda dapat melewati penerapan RabbitMQ. Jika Anda menggunakan konfigurasi ini, file ``openstack_user_config.yml`` Anda akan terlihat seperti berikut:

source: If you require additional network configuration for your container interfaces (like changing the routes on eth1 for routes on the management network), please adapt your ``openstack_user_config.yml`` file. See :ref:`openstack-user-config-reference` for more details.
de: Wenn Sie eine zusätzliche Netzwerkkonfiguration für Ihre Container-Schnittstellen benötigen (z. B. Ändern der Routen auf eth1 für Routen im Verwaltungsnetzwerk), passen Sie bitte Ihre Datei ``openstack_user_config.yml`` an. Siehe :ref:`openstack-user-config-reference` für weitere Details.
id: Jika Anda memerlukan konfigurasi jaringan tambahan untuk antarmuka kontainer Anda (seperti mengubah rute pada eth1 untuk rute di jaringan manajemen), silakan sesuaikan file ``openstack_user_config.yml`` Anda. Lihat :ref:`openstack-user-config-reference` untuk keterangan lebih lanjut.

source: If you want to change the location of the override folder, you can adapt your openstack-ansible.rc file, or export ``GROUP_VARS_PATH`` and ``HOST_VARS_PATH`` during your shell session.
de: Wenn Sie den Speicherort des Override-Ordners ändern möchten, können Sie Ihre openstack-ansible.rc-Datei anpassen oder `GROUP_VARS_PATH`` und` `HOST_VARS_PATH`` während Ihrer Shell-Sitzung exportieren.
id: Jika Anda ingin mengubah lokasi folder override, Anda dapat mengadaptasi file openstack-ansible.rc Anda, atau mengekspor ``GROUP_VARS_PATH`` dan ``HOST_VARS_PATH`` selama sesi shell Anda.

source: If you want to globally override variable, you can define the variable you want to override in a ``/etc/openstack_deploy/user_*.yml`` file. It will apply on all hosts.
de: Wenn Sie die Variable global überschreiben möchten, können Sie die Variable, die Sie überschreiben möchten, in einer Datei ``/etc/openstack_deploy/user_*.yml`` definieren. Es wird auf alle Hosts angewendet.
id: Jika Anda ingin menimpa variabel secara global, Anda dapat menentukan variabel yang ingin Anda timpa dalam file ``/etc/openstack_deploy/user_*.yml``. Ini akan berlaku pada semua host.

source: If you wish to change the SHA to a specific SHA/tag/branch, or wish to use your own fork of an OpenStack service, please see the section titled :ref:`override_openstack_sources` in the user guide.
de: Wenn Sie den SHA in einen bestimmten SHA/Tag/Zweig ändern möchten oder Ihren eigenen Fork eines OpenStack-Dienstes verwenden möchten, lesen Sie den Abschnitt mit dem Titel :ref:`override_openstack_sources` im Benutzerhandbuch.
id: Jika Anda ingin mengubah SHA ke SHA/tag/branch, tertentu, atau ingin menggunakan garpu sendiri (your own fork) dari layanan OpenStack, silakan lihat bagian berjudul :ref:`override_openstack_sources` dalam buku petunjuk.

source: Image service (glance):
id: Layanan Image (glance):

source: In a typical production environment, physical network interfaces are combined in bonded pairs for better redundancy and throughput. Avoid using two ports on the same multiport network card for the same bonded interface, because a network card failure affects both of the physical network interfaces used by the bond.
id: Dalam lingkungan produksi yang khas, antarmuka jaringan fisik digabungkan dalam pasangan terikat (bonded pair) untuk redundansi dan keluaran (throughput) yang lebih baik. Hindari menggunakan dua port pada kartu jaringan multiport yang sama untuk antarmuka berikat yang sama, karena kegagalan kartu jaringan mempengaruhi kedua antarmuka jaringan fisik yang digunakan oleh ikatan.

source: In addition to this argument, the base environment skeleton is provided in the ``inventory/env.d`` directory of the OpenStack-Ansible codebase.
de: Zusätzlich zu diesem Argument wird das Skelett der Basisumgebung im Verzeichnis ``inventory/env.d`` der OpenStack-Ansible-Codebasis bereitgestellt.
id: Selain argumen ini, kerangka lingkungan dasar disediakan di direktori ``inventory/env.d`` dari basis kode OpenStack-Ansible.

source: In all versions prior to |previous_release_formal_name|, this argument was ``--file``.
de: In allen Versionen vor |previous_release_formal_name| war dieses Argument ``file``.
id: Di semua versi sebelum |previous_release_formal_name|, argumen ini adalah ``--file``.

source: In many environments, the ephemeral disks are stored on the Compute host's local disks, but for production environments we recommend that the Compute hosts be configured to use a shared storage subsystem instead. A shared storage subsystem allows quick, live instance migration between Compute hosts, which is useful when the administrator needs to perform maintenance on the Compute host and wants to evacuate it. Using a shared storage subsystem also allows the recovery of instances when a Compute host goes offline. The administrator is able to evacuate the instance to another Compute host and boot it up again. The following diagram illustrates the interactions between the storage device, the Compute host, the hypervisor, and the instance.
de: In vielen Umgebungen werden die ephemeren Festplatten auf den lokalen Festplatten des Compute-Hosts gespeichert. In Produktionsumgebungen wird jedoch empfohlen, dass die Compute-Hosts so konfiguriert werden, dass sie stattdessen ein gemeinsam genutztes Speichersubsystem verwenden. Ein gemeinsam genutztes Speichersubsystem ermöglicht eine schnelle, dynamische Instanzmigration zwischen Compute-Hosts. Dies ist nützlich, wenn der Administrator Wartungsarbeiten am Compute-Host durchführen und diesen leeren muss. Die Verwendung eines gemeinsam genutzten Speichersubsystems ermöglicht auch die Wiederherstellung von Instanzen, wenn ein Compute-Host offline geht. Der Administrator kann die Instanz auf einen anderen Compute-Host verschieben und erneut starten. Das folgende Diagramm veranschaulicht die Interaktionen zwischen dem Speichergerät, dem Compute-Host, dem Hypervisor und der Instanz.
id: Di banyak lingkungan, disk sementara disimpan pada disk lokal host Compute, tetapi untuk lingkungan produksi kami menganjurkan agar host Compute dikonfigurasikan untuk menggunakan subsistem penyimpanan bersama. Subsistem penyimpanan bersama memungkinkan migrasi instance dan langsung antar host Compute, yang berguna ketika administrator perlu melakukan pemeliharaan pada host Compute dan ingin mengevakuasinya. Menggunakan subsistem penyimpanan bersama juga memungkinkan pemulihan instance saat host Compute menjadi offline. Administrator dapat mengevakuasi instance ke host Compute lain dan mem-boot-nya kembali. Diagram berikut menggambarkan interaksi antara perangkat penyimpanan, host Compute, hypervisor, dan instance.

source: In order to ensure a common understanding of what release versions mean, we use `Semantic Versioning 2.0.0_` for versioning as a basis. The exception to the rule is for milestone releases during a development cycle, where releases are tagged ``<MAJOR>.0.0.0b<MILESTONE>`` where ``<MAJOR>`` is the next major release number, and ``<MILESTONE>`` is the milestone number.
id: Untuk memastikan pemahaman umum tentang apa arti versi rilis, kami menggunakan `Semantic Versioning 2.0.0_` untuk versi sebagai basis. Pengecualian untuk aturan ini adalah untuk rilis tonggak selama siklus pengembangan, di mana rilis diberi tag ``<MAJOR> .0.0.0b <MILESTONE>`` di mana ``<MAJOR>`` adalah nomor rilis utama berikutnya, dan ``<MILESTONE>`` adalah angka tonggak sejarah.

source: In these files, the target hosts are listed under one or more headings, such as ``shared-infra_hosts`` or ``storage_hosts``, which serve as Ansible group mappings. These groups map to the physical hosts.
de: In diesen Dateien werden die Zielhosts unter einer oder mehreren Überschriften aufgelistet, z. B. ``shared-infra_hosts`` oder ``storage_hosts``, die als Ansible-Gruppenzuordnungen dienen. Diese Gruppen werden den physischen Hosts zugeordnet.
id: Dalam file ini, host target terdaftar di bawah satu atau lebih judul, seperti ``shared-infra_hosts`` atau ``storage_hosts``, yang berfungsi sebagai pemetaan grup Ansible. Grup ini memetakan ke host fisik.

source: In this chapter, you can find details about `why` OpenStack-Ansible was architected in this way.
de: In diesem Kapitel finden Sie Details darüber, warum OpenStack-Ansible auf diese Weise entwickelt wurde.
id: Dalam bab ini, Anda dapat menemukan detail tentang `why` OpenStack-Ansible diarsipkan dengan cara ini.

source: In this chapter, you can find the information on how to configure the openstack-ansible dynamic inventory to your needs.
de: In diesem Kapitel finden Sie Informationen dazu, wie Sie das dynamische Openstack-fähige Inventar Ihren Anforderungen entsprechend konfigurieren können.
id: Dalam bab ini, Anda dapat menemukan informasi tentang cara mengonfigurasikan dynamic inventory openstack-ansible untuk kebutuhan Anda.

source: In this example the three hosts are assigned to the `shared-infra_hosts` group, and will deploy containerized workloads using ``lxc`` on **infra1**, ``nspawn`` on **infra2**, and ``lxc`` on **infra3**. Notice **infra3** does not define the ``container_tech`` option because it not required. If this option is undefined the value will automatically be set to ``lxc`` within the generated inventory. The two supported options for the ``container_tech`` configuration variable are ``lxc`` or ``nspawn``.
id: Dalam contoh ini, tiga host ditugaskan ke grup `shared-infra_hosts`, dan akan menggunakan beban kerja containerized menggunakan ``lxc`` pada **infra1**, ``nspawn`` pada **infra2**, and ``lxc`` pada **infra3**. Perhatikan **infra3** tidak mendefinisikan opsi ``container_tech`` karena itu tidak diperlukan. Jika opsi ini tidak ditentukan, nilai akan secara otomatis ditetapkan ke ``lxc`` dalam inventaris yang dihasilkan. Dua opsi yang didukung untuk variabel konfigurasi ``container_tech`` adalah ``lxc`` atau ``nspawn``.

source: In this section, you will find documentation relevant to the inventory for OpenStack-Ansible.
de: In diesem Abschnitt finden Sie eine für das Inventar relevante Dokumentation für OpenStack-Ansible.
id: Di bagian ini, Anda akan menemukan dokumentasi yang relevan dengan inventaris untuk OpenStack-Ansible.

source: In this task the ``test.ini.j2`` file is a template which will be rendered and written to disk at ``/tmp/test.ini``. The **config_overrides** entry is a dictionary (hash) which allows a deployer to set arbitrary data as overrides to be written into the configuration file at run time. The **config_type** entry specifies the type of configuration file the module will be interacting with; available options are "yaml", "json", and "ini".
de: In dieser Aufgabe ist die Datei ``test.ini.j2`` eine Vorlage, die gerendert und auf der Festplatte unter ``/tmp/test.ini`` gespeichert wird. Der Eintrag **config_overrides** ist ein Wörterbuch (Hash), mit dem ein Implementierer beliebige Daten als Überschreibungen festlegen kann, die zur Laufzeit in die Konfigurationsdatei geschrieben werden. Der Eintrag **config_type** gibt den Typ der Konfigurationsdatei an, mit der das Modul interagieren soll. Verfügbare Optionen sind ``yaml``, ``json`` und ``ini``.
id: Dalam tugas ini file ``test.ini.j2`` adalah templat yang akan dirender dan ditulis ke disk di ``/tmp/test.ini``. Entri **config_overrides** adalah kamus (hash) yang memungkinkan penyebar untuk mengatur data sewenang-wenang sebagai penggantian yang akan ditulis ke dalam file konfigurasi pada saat run time. Entri **config_type** menentukan jenis file konfigurasi yang akan berinteraksi dengan modul; opsi yang tersedia adalah "yaml", "json", dan "ini".

source: Including OpenStack-Ansible in your project
de: Einschließlich OpenStack-Ansible in Ihrem Projekt
id: Termasuk OpenStack-Ansible dalam proyek Anda

source: Including OpenStack-Ansible with your Ansible structure
de: Einschließlich OpenStack-Ansible mit Ihrer Ansible-Struktur
id: Termasuk OpenStack-Ansible dengan struktur Ansible Anda

source: Including the openstack-ansible repository within another project can be done in several ways:
id: Termasuk repositori openstack-ansible dalam proyek lain dapat dilakukan dengan beberapa cara:

source: Information on a per-host basis can be obtained with the ``--export/-e`` parameter.
de: Informationen auf einer pro-Host-Basis können mit dem Parameter ``--export/-e`` erhalten werden.
id: Informasi berdasarkan per-host dapat diperoleh dengan parameter ``--export/-e``.

source: Infrastructure services
de: Infrastrukturdienste
id: Layanan infrastruktur

source: Inspecting and manipulating the inventory
de: Inspizieren und Manipulieren des Inventars
id: Memeriksa dan memanipulasi inventory

source: Introduction
de: Einführung
id: Pengantar

source: Inventory conventions
de: Inventarkonventionen
id: Konvensi inventaris

source: Isolation
de: Isolierung
id: Isolasi

source: Least privilege
de: Das geringste Privileg
id: Hak istimewa terkecil (least privilege)

source: Like ``--check``, this flag is not invoked when running from ansible.
de: Wie ``--check`` wird dieses Flag bei der Ausführung von ansible nicht aufgerufen.
id: Seperti ``--check``, flag ini tidak dipanggil saat menjalankan dari ansible.

source: Limiting access to these networks has several benefits:
de: Die Beschränkung des Zugriffs auf diese Netzwerke hat mehrere Vorteile:
id: Membatasi akses ke jaringan ini memiliki beberapa manfaat:

source: Linux bridges
id: Linux bridges (Jembatan Linux)

source: List containers and summary information such as operational state and network configuration:
de: Auflisten von Containern und Übersichtsinformationen wie Betriebsstatus und Netzwerkkonfiguration:
id: Daftar kontainer dan informasi ringkasan seperti keadaan operasional dan konfigurasi jaringan:

source: Load balancer
de: Lastenausgleicher
id: Load balancer (penyeimbang beban)

source: Log aggregation host
id: Host agregasi log

source: Major releases are done every six months according to the `OpenStack release schedule_`. Each major release is consistent with an OpenStack series.
id: Rilis besar dilakukan setiap enam bulan sesuai dengan `OpenStack release schedule_`. Setiap rilis utama konsisten dengan seri OpenStack.

source: Many of the services deployed with OpenStack-Ansible are encrypted by default or offer encryption as an option. The playbooks generate self-signed certificates by default, but deployers have the option to use their existing certificates, keys, and CA certificates.
de: Viele der Dienste, die mit OpenStack-Ansible bereitgestellt werden, sind standardmäßig verschlüsselt oder bieten eine Verschlüsselung als Option an. Die Playbooks generieren standardmäßig selbstsignierte Zertifikate, aber die Implementierer können ihre vorhandenen Zertifikate, Schlüssel und CA-Zertifikate verwenden.
id: Banyak layanan yang disebarkan dengan OpenStack-Ansible dienkripsi secara default atau menawarkan enkripsi sebagai opsi. Playbooks menghasilkan sertifikat yang ditandatangani sendiri secara default, tetapi para penyusun memiliki opsi untuk menggunakan sertifikat, kunci, dan sertifikat CA mereka yang sudah ada.

source: Many operational requirements have been taken into consideration for the design of the OpenStack-Ansible project.
de: Viele operationale Anforderungen wurden bei der Gestaltung des OpenStack-Ansible-Projekts berücksichtigt.
id: Banyak persyaratan operasional telah dipertimbangkan untuk desain proyek OpenStack-Ansible.

source: MariaDB with Galera
de: MariaDB mit Galera
id: MariaDB dengan Galera

source: Minor/patch releases are requested for stable branches on the second and last Friday of every month. The releases are typically completed within a few days of the request.
de: Minor/Patch-Releases werden für stabile Filialen am zweiten und letzten Freitag jedes Monats angefordert. Die Releases werden in der Regel innerhalb weniger Tage nach der Anfrage abgeschlossen.
id: Rilis minor/patch diminta untuk cabang stabil pada hari Jumat kedua dan terakhir setiap bulan. Rilis biasanya selesai dalam beberapa hari setelah permintaan.

source: Modify the ``container_skel`` section of the ``env.d/galera.yml`` file. For example:
de: Ändern Sie den Abschnitt ``container_skel`` der ``env.d/galera.yml``-Datei. Beispielsweise:
id: Ubah bagian ``container_skel`` dari file ``env.d/galera.yml``. Sebagai contoh:

source: Most often, overrides are implemented for the ``<service>.conf`` files (for example, ``nova.conf``). These files use a standard INI file format.
de: In den meisten Fällen sind Überschreibungen für die ``<service>.conf``Dateien implementiert (zum Beispiel ``nova.conf``). Diese Dateien verwenden ein Standard-INI-Dateiformat.
id: Paling sering, override diterapkan untuk file ``<service> .conf`` (misalnya, ``nova.conf``). File ini menggunakan format file INI standar.

source: Namespaces provide logically separate layer 3 environments (similar to routers) within a host. Namespaces use virtual interfaces to connect with other namespaces, including the host namespace. These interfaces, often called ``veth`` pairs, are virtually plugged in between namespaces similar to patch cables connecting physical devices such as switches and routers.
id: Namespace menyediakan lingkungan layer 3 yang secara logis terpisah (mirip dengan router) dalam sebuah host. Namespace menggunakan antarmuka virtual untuk terhubung dengan namespace lain, termasuk host namespace. Antarmuka ini, sering disebut pasangan ``veth``, secara virtual dipasang di antara beberapa namespace yang mirip dengan kabel patch yang menghubungkan perangkat fisik seperti switch dan router.

source: Network diagrams
de: Netzwerkdiagramme
id: Diagram jaringan

source: Networking service (neutron):
id: Layanan Networking (neutron):

source: Neutron traffic
de: Neutron Verkehr
id: Lalu lintas Neutron

source: Never edit or delete the files ``/etc/openstack_deploy/openstack_inventory.json`` or ``/etc/openstack_deploy/openstack_hostnames_ips.yml``. This can lead to file corruptions, and problems with the inventory: hosts and container could disappear and new ones would appear, breaking your existing deployment.
id: Jangan pernah mengedit atau menghapus file ``/etc/openstack_deploy/openstack_inventory.json`` atau ``/etc/openstack_deploy/openstack_hostnames_ips.yml``. Ini dapat menyebabkan file korup, dan masalah dengan inventory: host dan kontainer bisa menghilang dan yang baru akan muncul, merusak deployment Anda yang ada.

source: Not all services are containerized: some don't make sense to run within a container. Logic needs to be applied in regards on how services are containerized. If their requirements can't be met due to system limitations, (kernel, application maturity, etc...), then the service is not set to run within a container.
de: Nicht alle Dienste sind containerisiert: Manche sind nicht sinnvoll, wenn sie innerhalb eines Containers ausgeführt werden. Logik muss in Bezug darauf verwendet werden, wie Dienste containerisiert werden. Wenn ihre Anforderungen aufgrund von Systemeinschränkungen (Kernel, Anwendungsreife usw.) nicht erfüllt werden können, wird der Dienst nicht in einem Container ausgeführt.
id: Tidak semua layanan dalam kontainer: beberapa tidak masuk akal untuk dijalankan dalam sebuah kontainer. Logika perlu diterapkan dalam hal bagaimana layanan di kontainer. Jika persyaratan mereka tidak dapat dipenuhi karena keterbatasan sistem, (kernel, kematangan aplikasi, dll ...), maka layanan tidak diatur untuk berjalan dalam sebuah kontainer.
