Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: de, id

source: This guide describes how to remove a compute node from an OpenStack-Ansible environment completely. Perform these steps with caution, as the compute node will no longer be in service after the steps have been completed. This guide assumes that all data and instances have been properly migrated.
de: In diesem Handbuch wird beschrieben, wie ein Rechenknoten vollständig aus einer OpenStack-Ansible-Umgebung entfernt wird. Führen Sie diese Schritte mit Vorsicht durch, da der Rechenknoten nach Abschluss der Schritte nicht mehr in Betrieb ist. In diesem Handbuch wird davon ausgegangen, dass alle Daten und Instanzen ordnungsgemäß migriert wurden.
id: Panduan ini menjelaskan cara menghapus node komputasi dari lingkungan yang dimungkinkan oleh OpenStack. Lakukan langkah-langkah ini dengan hati-hati, karena node komputasi tidak akan lagi berfungsi setelah langkah-langkah tersebut selesai. Panduan ini mengasumsikan bahwa semua data dan instance telah dimigrasi dengan benar.

source: This guide provides information about operating your OpenStack-Ansible deployment.
de: Dieses Handbuch enthält Informationen zum Betrieb Ihrer OpenStack-Ansible-Bereitstellung.
id: Panduan ini memberikan informasi tentang pengoperasian penyebaran OpenStack-Ansible Anda.

source: This guide provides information about the upgrade process from |previous_release_formal_name| to |current_release_formal_name| for OpenStack-Ansible.
de: Dieses Handbuch enthält Informationen zum Aktualisierungsvorgang von |previous_release_formal_name| zu |current_release_formal_name| für OpenStack-Ansible.
id: Panduan ini memberikan informasi tentang proses pemutakhiran dari |previous_release_formal_name| ke |current_release_formal_name| untuk OpenStack-Ansible.

source: This guide ranges from first operations to verify your deployment, to the major upgrades procedures.
de: Dieses Handbuch reicht von den ersten Vorgängen zur Überprüfung Ihrer Bereitstellung bis hin zu den wichtigsten Upgrades.
id: Panduan ini berkisar dari operasi pertama untuk memverifikasi penerapan Anda, hingga prosedur peningkatan versi utama.

source: This is a draft environment scaling page for the proposed OpenStack-Ansible operations guide.
de: Dies ist eine Entwurfsumgebungsskalierungsseite für den vorgeschlagenen OpenStack-Ansible-Betriebshandbuch.
id: Ini adalah halaman skala lingkungan draf untuk panduan operasi OpenStack-Ansible yang diusulkan.

source: This is a draft monitoring system page for the proposed OpenStack-Ansible operations guide.
de: Dies ist eine Entwurfsüberwachungssystemseite für das vorgeschlagene OpenStack-Ansible-Betriebshandbuch.
id: Ini adalah halaman sistem pemantauan draf untuk panduan operasi OpenStack-Ansible yang diusulkan.

source: This module transfers log files that might not be present, so a missing remote file will not be an error unless ``fail_on_missing`` is set to ``yes``.
de: Dieses Modul überträgt Protokolldateien, die möglicherweise nicht vorhanden sind, so dass eine fehlende Remote-Datei kein Fehler ist, es sei denn, ``fail_on_missing`` ist auf ``yes`` gesetzt.
id: Modul ini mentransfer file log yang mungkin tidak ada, jadi file remote yang hilang tidak akan menjadi kesalahan kecuali kalau ``fail_on_missing`` diatur ke ``yes``.

source: This option assigns security groups to an instance. The default security group activates when no customised group is specified here. Security Groups, similar to a cloud firewall, define which incoming network traffic is forwarded to instances.
de: Diese Option weist Sicherheitsgruppen einer Instanz zu. Die Standardsicherheitsgruppe wird aktiviert, wenn hier keine benutzerdefinierte Gruppe angegeben wird. Sicherheitsgruppen definieren ähnlich wie eine Cloud-Firewall, welcher eingehende Netzwerkverkehr an Instanzen weitergeleitet wird.
id: Opsi ini memberikan grup keamanan ke instance. Grup keamanan default diaktifkan ketika tidak ada grup khusus yang ditentukan di sini. Grup Keamanan, mirip dengan firewall cloud, menentukan lalu lintas jaringan masuk yang diteruskan ke instance.

source: This section describes some of the more common commands to use your OpenStack cloud.
de: In diesem Abschnitt werden einige der gebräuchlicheren Befehle zur Verwendung Ihrer OpenStack-Cloud beschrieben.
id: Bagian ini menjelaskan beberapa perintah yang lebih umum untuk menggunakan cloud OpenStack Anda.

source: This section focuses on troubleshooting general host-to-host communication required for the OpenStack control plane to function properly.
de: In diesem Abschnitt wird die allgemeine Host-zu-Host-Kommunikation behandelt, die für die ordnungsgemäße Funktion der OpenStack-Steuerungsebene erforderlich ist.
id: Bagian ini berfokus pada pemecahan masalah komunikasi host-ke-host umum yang diperlukan agar bidang kontrol (control plane) OpenStack berfungsi dengan baik.

source: This section will focus on troubleshooting general instance (VM) connectivity communication. This does not cover any networking related to instance connectivity. This is assuming a OpenStack-Ansible install using LXC containers, VXLAN overlay and the Linuxbridge ml2 driver.
de: In diesem Abschnitt wird die Fehlerbehebung für die Kommunikation mit der allgemeinen Instanz (VM) -Konnektivität behandelt. Dies gilt nicht für die Vernetzung von Instanzkonnektivität. Dies setzt eine OpenStack-Ansible-Installation unter Verwendung von LXC-Containern, VXLAN-Overlay und dem Linuxbridge ml2-Treiber voraus.
id: Bagian ini akan fokus pada pemecahan masalah komunikasi konektivitas instance umum (VM). Ini tidak mencakup jaringan apa pun yang terkait dengan konektivitas instance. Ini dengan asumsi instalasi OpenStack-Ansible menggunakan kontainer LXC, overlay VXLAN dan driver Linuxbridge ml2.

source: This work around is required for all Libvirt versions prior 1.2.17.
de: Diese Umgehung ist für alle Libvirt-Versionen vor 1.2.17 erforderlich.
id: Pekerjaan ini diperlukan untuk semua versi Libvirt sebelum 1.2.17.

source: To add a network to an instance, click the **+** in the **Networks field**.
de: Um ein Netzwerk zu einer Instanz hinzuzufügen, klicken Sie auf **+** im Feld **Netzwerke**.
id: Untuk menambahkan jaringan ke suatu instance, klik **+** dalam **Networks field**.

source: To add the third RabbitMQ node to the cluster, repeat the above process by stopping the RabbitMQ application on the third node.
de: Um den dritten RabbitMQ-Knoten dem Cluster hinzuzufügen, wiederholen Sie den obigen Vorgang, indem Sie die Anwendung rabbitmq auf dem dritten Knoten stoppen.
id: Untuk menambahkan node RabbitMQ ketiga ke cluster, ulangi proses di atas dengan menghentikan aplikasi RabbitMQ pada node ketiga.

source: To allow live migration of Nova instances, this forced provisioning of the config (CD-ROM) drive needs either be turned off, or the format of the configuration drive needs to be changed to a disk format like vfat, a format which both Linux and Windows instances can access.
de: Um eine Live-Migration von Nova-Instanzen zu ermöglichen, muss diese erzwungene Bereitstellung des CD-ROM-Laufwerks entweder deaktiviert werden oder das Format des Konfigurationslaufwerks muss in ein Datenträgerformat wie vfat geändert werden, ein Format, das sowohl Linux als auch Windows-Instanzen können darauf zugreifen.
id: Untuk memungkinkan migrasi langsung instance Nova, ini memaksa penyediaan drive config (CD-ROM) perlu dimatikan, atau format dari drive konfigurasi perlu diubah ke format disk seperti vfat, format yang baik Linux dan Instance Windows dapat mengakses.

source: To avoid issues and simplify troubleshooting during the upgrade, disable the security hardening role by setting the ``apply_security_hardening`` variable to ``False`` in the :file:`user_variables.yml` file, and backup your openstack-ansible installation.
de: Um Probleme zu vermeiden und die Fehlerbehebung während des Upgrades zu vereinfachen, deaktivieren Sie die Rolle der Sicherheitsverhärtung, indem Sie die Variable ``apply_security_hardening`` auf ``False`` in der Datei :file:`user_variables.yml` setzen und Ihre openstack-ansible-Installation sichern.
id: Untuk menghindari masalah dan menyederhanakan pemecahan masalah selama pemutakhiran, nonaktifkan peran pengerasan keamanan dengan mengatur variabel ``apply_security_hardening`` ke ``False`` dalam file :file: `user_variables.yml`, dan cadangkan instalasi openstack-ansible Anda.

source: To change the format of the configuration drive, to a hard disk style format, use the following configuration inside the same ``/etc/openstack_deploy/user_variables.yml`` file:
de: Um das Format des Konfigurationslaufwerks in ein Festplattenstilformat zu ändern, verwenden Sie die folgende Konfiguration innerhalb der Datei ``/etc/openstack_deploy/user_variables.yml``:
id: Untuk mengubah format drive konfigurasi, ke format gaya hard disk, gunakan konfigurasi berikut di dalam yang sama file ``/etc/openstack_deploy/user_variables.yml`` :

source: To check on the status of your Galera cluster:
de: So überprüfen Sie den Status Ihres Galera-Clusters:
id: Untuk memeriksa status cluster Galera Anda:

source: To check that the instance was created successfully, issue the **openstack server list** command:
de: Um zu überprüfen, ob die Instanz erfolgreich erstellt wurde, geben Sie den Befehl **openstack server list** ein:
id: Untuk memeriksa apakah instance telah berhasil dibuat, berikan perintah **openstack server list**:

source: To clear facts for a single host, find its file within ``/etc/openstack_deploy/ansible_facts/`` and remove it. Each host has a JSON file that is named after its hostname. The facts for that host will be regenerated on the next playbook run.
de: Um die Fakten für einen einzelnen Host zu löschen, suchen Sie seine Datei in ``/etc/openstack_deploy/ansible_facts/`` und entfernen Sie sie. Jeder Host verfügt über eine JSON-Datei, die nach ihrem Hostnamen benannt ist. Die Fakten für diesen Host werden beim nächsten Playbook-Lauf neu generiert.
id: Untuk menghapus fakta dari satu host, temukan file-nya di dalam ``/etc/openstack_deploy/ansible_facts/`` dan hapus. Setiap host memiliki file JSON yang dinamai dengan nama hostnya. Fakta untuk host itu akan dibuat kembali pada menjalankan playbook berikutnya.

source: To create the containers again, execute the following:
de: Um die Container erneut zu erstellen, führen Sie Folgendes aus:
id: Untuk membuat kontainer lagi, jalankan yang berikut:

source: To destroy a container, execute the following:
de: Um einen Container zu zerstören, führen Sie Folgendes aus:
id: Untuk menghancurkan kontainer, jalankan yang berikut:

source: To dump traffic on the ``br-mgmt`` bridge, use ``tcpdump`` to see all communications between the various containers. To narrow the focus, run ``tcpdump`` only on the desired network interface of the containers.
de: Um den Datenverkehr auf der ``br-mgmt``-Bridge zu dumpen, verwenden Sie `` tcpdump``, um die gesamte Kommunikation zwischen den verschiedenen Containern anzuzeigen. Um den Fokus einzugrenzen, führen Sie `` tcpdump`` nur auf der gewünschten Netzwerkschnittstelle der Container aus.
id: Untuk membuang lalu lintas di jembatan ``br-mgmt``, gunakan ``tcpdump`` untuk melihat semua komunikasi antara berbagai kontainer. Untuk mempersempit fokus, jalankan ``tcpdump`` hanya pada antarmuka jaringan kontainer yang diinginkan.

source: To filter the list, the options ``--host`` or ``--status`` can be used:
de: Um die Liste zu filtern, können die Optionen ``--host`` oder ``--status`` verwendet werden:
id: Untuk memfilter daftar, opsi ``--host`` atau ``--status`` dapat digunakan:

source: To form a RabbitMQ Cluster, you start by taking independent RabbitMQ brokers and re-configuring these nodes into a cluster configuration.
de: Um einen RabbitMQ-Cluster zu bilden, beginnen Sie mit unabhängigen RabbitMQ-Brokern und konfigurieren diese Knoten in einer Cluster-Konfiguration neu.
id: Untuk membentuk Cluster RabbitMQ, Anda mulai dengan mengambil broker RabbitMQ independen dan mengkonfigurasi kembali node-node ini ke dalam konfigurasi cluster.

source: To improve performance, particularly in large deployments, you can cache host facts and information.
de: Um die Leistung insbesondere in großen Bereitstellungen zu verbessern, können Sie Host-Fakten und -Informationen zwischenspeichern.
id: Untuk meningkatkan kinerja, khususnya dalam penyebaran besar, Anda dapat menyimpan fakta dan informasi host.

source: To restore the ``/etc/openstack_deploy/`` directory, copy the backup of the directory to your cloud environment.
de: Um das Verzeichnis ``/etc/openstack_deploy/`` wiederherzustellen, kopieren Sie die Sicherung des Verzeichnisses in Ihre Cloud-Umgebung.
id: Untuk mengembalikan direktori ``/etc/openstack_deploy/``, salin cadangan direktori ke lingkungan cloud Anda.

source: To see which hosts a playbook runs against, and to see which tasks are performed, run the following commands (for example):
de: Um zu sehen, auf welchen Hosts ein Playbook ausgeführt wird und um zu sehen, welche Aufgaben ausgeführt werden, führen Sie die folgenden Befehle aus (zum Beispiel):
id: Untuk melihat host mana yang dijalankan oleh playbook, dan untuk melihat tugas mana yang dilakukan, jalankan perintah berikut (misalnya):

source: To see which hosts belong to which groups, use the ``inventory-manage.py`` script to show all groups and their hosts. For example:
de: Um zu sehen, welche Hosts zu welchen Gruppen gehören, verwenden Sie das Skript ``inventory-manage.py``, um alle Gruppen und ihre Hosts anzuzeigen. Beispielsweise:
id: Untuk melihat host mana yang termasuk dalam grup mana, gunakan skrip ``inventory-manage.py`` untuk menampilkan semua grup dan host mereka. Sebagai contoh:

source: To stop and start the cluster, keep in mind the order in which you shut the nodes down. The last node you stop, needs to be the first node you start. This node is the `master`.
de: Beachten Sie die Reihenfolge, in der Sie die Knoten heruntergefahren haben, um den Cluster zu stoppen und zu starten. Der letzte Knoten, den Sie stoppen, muss der erste Knoten sein, den Sie starten. Dieser Knoten ist der `master`.
id: Untuk menghentikan dan memulai cluster, ingatlah urutan urutan Anda mematikan node. Node terakhir yang Anda hentikan, harus menjadi node pertama yang Anda mulai. Node ini adalah `master`.

source: To turn off the forced provisioning of the config drive, add the following override to the ``/etc/openstack_deploy/user_variables.yml`` file:
de: Um die erzwungene Bereitstellung des Konfigurations-Laufwerks zu deaktivieren, fügen Sie der Datei ``/etc/openstack_deploy/user_variables.yml`` folgende Überschreibung hinzu:
id: Untuk mematikan penyediaan paksa dari drive config, tambahkan penggantinya berikut ke file ``/etc/openstack_deploy/user_variables.yml``:

source: To update only a single Compute host, run the following command:
de: Führen Sie den folgenden Befehl aus, um nur einen einzelnen Compute-Host zu aktualisieren:
id: Untuk memperbarui hanya satu host Compute, jalankan perintah berikut:

source: To upgrade from |previous_release_formal_name| to |current_release_formal_name| by using the upgrade script, perform the following steps in the ``openstack-ansible`` directory:
de: So aktualisieren Sie von |previous_release_formal_name| zu |current_release_formal_name|. Führen Sie mit dem Upgrade-Skript die folgenden Schritte im Verzeichnis ``openstack-ansible`` durch:
id: Untuk memutakhirkan dari |previous_release_formal_name| ke |current_release_formal_name| dengan menggunakan skrip pemutakhiran, lakukan langkah-langkah berikut di direktori ``openstack-ansible``:

source: To view the locations of important Rabbit files, see `File Locations <https://www.rabbitmq.com/relocate.html>`_.
de: Um die Positionen wichtiger Rabbit-Dateien anzuzeigen, siehe `Dateispeicherorte <https://www.rabbitmq.com/relocate.html>`_.
id: Untuk melihat lokasi file Rabbit yang penting, lihat `File Locations <https://www.rabbitmq.com/relocate.html>`_.

source: Troubleshooting
de: Fehlerbehebung
id: Penyelesaian masalah

source: Troubleshooting Instance connectivity issues
de: Fehlerbehebung bei Problemen mit der Instanzienkonnektivität
id: Pemecahan kesulitan masalah konektivitas Instance

source: Troubleshooting host-to-host traffic on CONTAINER_NET
de: Fehlerbehebung für Host-zu-Host-Datenverkehr in CONTAINER_NET
id: Memecahkan masalah lalu lintas host-to-host di CONTAINER_NET

source: Troubleshooting host-to-host traffic on HOST_NET
de: Fehlerbehebung für Host-zu-Host-Datenverkehr in HOST_NET
id: Memecahkan masalah lalu lintas host-to-host di HOST_NET

source: Troubleshooting host-to-host traffic on OVERLAY_NET
de: Fehlerbehebung für Host-zu-Host-Datenverkehr auf OVERLAY_NET
id: Memecahkan masalah lalu lintas host-to-host pada OVERLAY_NET

source: Tunneling versus direct transport
de: Tunnelling gegen direkten Transport
id: Tunneling versus transportasi langsung

source: Ubuntu kernel packages newer than version 3.13 contain a change in module naming from ``nf_conntrack`` to ``br_netfilter``. After upgrading the kernel, run the ``openstack-hosts-setup.yml`` playbook against those hosts. For more information, see `OSA bug 157996 <https://bugs.launchpad.net/openstack-ansible/+bug/1579963>`_.
de: Ubuntu-Kernel-Pakete, die neuer als Version 3.13 sind, enthalten eine Änderung in der Modulbenennung von ``nf_conntrack`` nach ``br_netfilter``. Führen Sie nach dem Upgrade des Kernels das Playbook ``openstack-hosts-setup.yml`` für diese Hosts aus. Weitere Informationen finden Sie unter `OSA-Fehler 157996 <https://bugs.launchpad.net/openstack-ansible/+bug/1579963>`_.
id: Paket kernel Ubuntu yang lebih baru dari versi 3.13 berisi perubahan dalam penamaan modul dari ``nf_conntrack`` menjadi ``br_netfilter``. Setelah memutakhirkan kernel, jalankan playbook ``openstack-hosts-setup.yml`` terhadap host tersebut. Untuk informasi lebih lanjut, lihat `OSA bug 157996 <https://bugs.launchpad.net/openstack-ansible/+bug/1579963>`_.

source: Unassign all Neutron floating IPs:
de: Zuweisung aller neutron floating IPs aufheben:
id: Batalkan penetapan semua IP mengambang neutron:

source: Under some circumstances, configuration or temporary issues, one specific or all neutron agents container need to be restarted.
de: Unter bestimmten Umständen, bei der Konfiguration oder bei temporären Problemen, muss ein bestimmter oder alle Neutronenagenten-Container neu gestartet werden.
id: Dalam keadaan tertentu, konfigurasi atau masalah sementara, satu kontainer khusus atau semua kontainer neutron perlu di-restart.

source: Update all OpenStack services:
de: Aktualisieren Sie alle OpenStack-Dienste:
id: Perbarui semua layanan OpenStack:

source: Update all the dependent roles to the latest version:
de: Aktualisieren Sie alle abhängigen Rollen auf die neueste Version:
id: Perbarui semua peran dependen ke versi terbaru:

source: Update the container number listed under the ``affinity`` configuration to the desired number. The above example has ``galera_container`` set at one and ``rabbit_mq_container`` at two, which scales RabbitMQ services, but leaves Galera services fixed.
de: Aktualisieren Sie die Containernummer, die unter der Konfiguration ``affinity`` aufgeführt ist, auf die gewünschte Nummer. Das obige Beispiel hat ``galera_container`` auf eins und ``rabbit_mq_container`` auf zwei gesetzt, was die RabbitMQ-Dienste skaliert, aber die Galera-Dienste nicht verändert.
id: Perbarui nomor kontainer yang tercantum di bawah konfigurasi ``affinity`` ke nomor yang diinginkan. Contoh di atas memiliki ``galera_container`` yang disetel pada satu dan ``rabbit_mq_container`` pada dua, yang mengukur layanan RabbitMQ, tetapi meninggalkan layanan Galera tetap.

source: Update the hosts:
de: Aktualisieren Sie die Hosts:
id: Perbarui host:

source: Update the infrastructure:
de: Aktualisieren Sie die Infrastruktur:
id: Perbarui infrastruktur:

source: Update the inventory to add new hosts. Make sure new rsyslog container names are updated. Send the updated results to ``dev/null``.
de: Aktualisieren Sie das Inventar, um neue Hosts hinzuzufügen. Stellen Sie sicher, dass neue rsyslog-Containernamen aktualisiert werden. Senden Sie die aktualisierten Ergebnisse an ``dev/null``.
id: Perbarui inventaris untuk menambah host baru. Pastikan nama kontainer rsyslog baru diperbarui. Kirim hasil yang diperbarui ke ``dev/null``.

source: Updating the node with the new configuration
de: Aktualisieren des Knotens mit der neuen Konfiguration
id: Memperbarui node dengan konfigurasi baru

source: Upgrade OpenStack
de: Aktualisieren Sie OpenStack
id: Memutakhirkan OpenStack

source: Upgrade hosts
de: Aktualisieren Sie Hosts
id: Upgrade host (tingkatkan host)

source: Upgrade infrastructure
de: Aktualisieren der Infrastruktur
id: Upgrade infrastruktur

source: Upgrade specific components
de: Aktualisieren Sie bestimmte Komponenten
id: Mutakhirkan komponen tertentu

source: Upgrades between minor versions of OpenStack-Ansible require updating the repository clone to the latest minor release tag, updating the ansible roles, and then running playbooks against the target hosts. This section provides instructions for those tasks.
de: Upgrades zwischen kleineren Versionen von OpenStack-Ansible erfordern das Aktualisieren des Repository-Clones auf das neueste Minor-Release-Tag, das Aktualisieren der möglichen Rollen und das anschließende Ausführen von Playbooks für die Zielhosts. Dieser Abschnitt enthält Anweisungen für diese Aufgaben.
id: Pemutakhirkan antara versi minor OpenStack-Ansible perlu update dari klon repositori ke tag rilis minor terbaru, update peran ansible, dan kemudian menjalankan playbooks terhadap host target. Bagian ini memberikan instruksi untuk tugas tersebut.

source: Upgrading by using a script
de: Aktualisierung mit einem Script
id: Memutakhirkan dengan menggunakan skrip

source: Upgrading manually
de: Manuelle Aktualisierung
id: Memutakhirkan secara manual

source: Upload an image to test whether the image is registering and writing to the image store.
de: Laden Sie ein Abbild hoch, um zu testen, ob das Abbild registriert und in den Abbildspeicher geschrieben wird.
id: Unggah image untuk menguji apakah image tersebut terdaftar dan ditulis ke penyimpanan image.

source: Uploading images using the Dashboard will be available to users with administrator privileges. Operators can set user access privileges.
de: Das Hochladen von Abbildern über das Dashboard steht Benutzern mit Administratorrechten zur Verfügung. Bediener können Benutzerzugriffsrechte festlegen.
id: Mengunggah image menggunakan Dasbor akan tersedia untuk pengguna dengan hak istimewa administrator. Operator dapat mengatur hak akses pengguna.

source: Use SSH to connect to the Compute host.
de: Verwenden Sie SSH, um eine Verbindung mit dem Compute-Host herzustellen.
id: Gunakan SSH untuk terhubung ke host Compute.

source: Use the command line clients
de: Verwenden Sie die Befehlszeilenclients
id: Gunakan klien command line

source: Use the following procedure to add a compute host to an operational cluster.
de: Verwenden Sie das folgende Verfahren, um einen Compute-Host einem funktionsfähigen Cluster hinzuzufügen.
id: Gunakan prosedur berikut untuk menambahkan host komputasi ke cluster operasional.
