Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: de, id

source: Note that any services marked with ``is_metal: true`` will run on the allocated physical host and not in a container. For an example of ``is_metal: true`` being used refer to ``inventory/env.d/cinder.yml`` in the ``container_skel`` section.
de: Beachten Sie, dass alle Dienste, die mit ``is_metal: true`` gekennzeichnet sind, auf dem zugewiesenen physischen Host und nicht in einem Container ausgeführt werden. Ein Beispiel für die Verwendung von ``is_metal: true`` ist ``inventory/env.d/cinder.yml`` im Abschnitt ``container_skel``.
id: Perhatikan bahwa layanan apa pun yang ditandai dengan ``is_metal: true`` akan berjalan pada host fisik yang dialokasikan dan tidak dalam sebuah container. Untuk contoh ``is_metal: true`` yang digunakan merujuk ke ``inventory/env.d/cinder.yml`` di bagian ``container_skel``.

source: Nova compute (for direct access to virtualization devices)
de: Nova compute (für den direkten Zugriff auf Virtualisierungsgeräte)
id: Nova compute (untuk akses langsung ke perangkat virtualisasi)

source: OSA frequently does pro-active bugfix backports. In order to reduce the risk of these backports introducing any destabilization, OSA implements a 'soak' period for any patches implemented in the stable branches for roles, but also provides for circumventing this in exceptional circumstances.
id: OSA sering melakukan backports perbaikan bug pro-aktif. Untuk mengurangi risiko backport ini yang menyebabkan destabilisasi, OSA menerapkan periode 'soak' untuk setiap patch yang diterapkan di branch stabil untuk role, tetapi juga menyediakan untuk menghindari hal ini dalam keadaan luar biasa.

source: OSA is able to deploy a multitude of services. Have a look at the role maturity matrix to know the status of the service you want to deploy.
id: OSA mampu menyebarkan banyak layanan. Lihatlah matriks kedewasaan peran untuk mengetahui status layanan yang ingin Anda gunakan.

source: Object Storage service (swift):
id: Layanan Object Storage (swift):

source: Omit a service or component from the deployment
de: Überlassen Sie einen Dienst oder eine Komponente aus der Bereitstellung
id: Hapus layanan atau komponen dari penerapan

source: Once executed, the script will output an ``openstack_inventory.json`` file into the directory specified with the ``--config`` argument. This is used as the source of truth for repeated runs.
de: Nach der Ausführung gibt das Skript eine Datei ``openstack_inventory.json`` in das Verzeichnis aus, das mit dem Argument ``--config`` angegeben wurde. Dies wird als Quelle der Wahrheit für wiederholte Läufe verwendet.
id: Setelah dieksekusi, skrip akan menampilkan file ``openstack_inventory.json`` ke direktori yang ditentukan dengan argumen ``--config``. Ini digunakan sebagai sumber kebenaran untuk berjalan berulang (repeated run).

source: Once the variables are set call the play ``repo-build.yml`` to build all of the wheels within the repository infrastructure. When ready run the target plays to deploy your overridden source code.
de: Sobald die Variablen gesetzt sind, rufen Sie das Playbook ``repo-build.yml`` auf, um alle Wheels innerhalb der Repository-Infrastruktur zu erstellen. Wenn Sie fertig sind, starten Sie das Zielplaybook, um den überschriebenen Quellcode bereitzustellen.
id: Setelah variabel diatur, panggil play ``repo-build.yml`` untuk membangun semua roda (wheel) dalam infrastruktur repositori. Ketika siap menjalankan target play untuk menggunakan (deploy) kode sumber yang diganti.

source: OpenStack clouds provide many services to end users, that enable them to build instances, provision storage, and create networks. Each of these services exposes one or more service ports and API endpoints to the network.
de: OpenStack-Clouds stellen Endbenutzern zahlreiche Dienste zur Verfügung, mit denen sie Instanzen erstellen, Speicher bereitstellen und Netzwerke erstellen können. Jeder dieser Dienste stellt dem Netzwerk einen oder mehrere Service-Ports und API-Endpunkte zur Verfügung.
id: Cloud OpenStack menyediakan banyak layanan kepada end user, yang memungkinkan mereka untuk membuat instance, penyimpanan provisi, dan membuat jaringan. Setiap layanan ini memaparkan satu atau beberapa port layanan dan API endpoint ke jaringan.

source: OpenStack has many configuration options available in ``.conf`` files (in a standard ``INI`` file format), policy files (in a standard ``JSON`` format) and ``YAML`` files, and can therefore use the ``config_template`` module described above.
de: OpenStack hat viele Konfigurationsoptionen in ``conf`` Dateien (in einem Standard ``INI`` Dateiformat), Richtliniendateien (im Standard ``JSON`` Format) und ``YAML`` Dateien, und kann Verwenden Sie daher das oben beschriebene Modul ``config_template``.
id: OpenStack memiliki banyak opsi konfigurasi yang tersedia dalam file ``.conf`` (dalam format file ``INI`` standar), file kebijakan (dalam format ``JSON`` standar) dan file ``YAML``, dan dapat karena itu gunakan modul ``config_template`` yang dijelaskan di atas.

source: OpenStack has multiple storage realms to consider:
de: OpenStack muss mehrere Speicherbereiche berücksichtigen:
id: OpenStack memiliki beberapa ranah penyimpanan (storage realm) untuk dipertimbangkan:

source: OpenStack services
de: OpenStack-Dienste
id: Layanan OpenStack

source: OpenStack services use Memcached for in-memory caching, which accelerates transactions. For example, the OpenStack Identity service (keystone) uses Memcached for caching authentication tokens, which ensures that token validation does not have to complete a disk or database transaction every time the service is asked to validate a token.
id: Layanan OpenStack menggunakan Memcached untuk cache dalam memori, yang mempercepat transaksi. Misalnya, layanan OpenStack Identity (keystone) menggunakan Memcached untuk caching token otentikasi, yang memastikan bahwa validasi token tidak harus menyelesaikan transaksi disk atau transaksi basis data setiap kali layanan diminta untuk memvalidasi token.

source: OpenStack services use RabbitMQ for Advanced Message Queuing Protocol (AMQP). OSA deploys RabbitMQ in a clustered configuration with all queues mirrored between the cluster nodes. Because Telemetry (ceilometer) message queue traffic is quite heavy, for large environments we recommend separating Telemetry notifications into a separate RabbitMQ cluster.
id: Layanan OpenStack menggunakan RabbitMQ untuk Advanced Message Queuing Protocol (AMQP). OSA menyebarkan RabbitMQ dalam konfigurasi berkerumun (clustered) dengan semua antrian dicerminkan antara node cluster. Karena lalu lintas antrian pesan Telemetry (ceilometer) cukup berat, untuk lingkungan yang besar kami sarankan memisahkan notifikasi Telemetry menjadi cluster RabbitMQ yang terpisah.

source: OpenStack-Ansible (OSA) uses the 'cycle-trailing' release model as specified in the OpenStack `release model reference_`.
id: OpenStack-Ansible (OSA) menggunakan model rilis 'cycle-trailing' seperti yang ditentukan dalam OpenStack `release model reference_`.

source: OpenStack-Ansible Manifesto
de: OpenStack-Ansible-Manifest
id: Manifesto OpenStack-Ansible

source: OpenStack-Ansible Reference
de: OpenStack-Ansible-Referenz
id: Referensi OpenStack-Ansible

source: OpenStack-Ansible configures unique username and password combinations for each service that interacts with RabbitMQ and Galera/MariaDB. Each service that connects to RabbitMQ uses a separate virtual host for publishing and consuming messages. The MariaDB users for each service are only granted access only to the databases that they need to query.
de: OpenStack-Ansible konfiguriert eindeutige Benutzernamen- und Kennwortkombinationen für jeden Dienst, der mit RabbitMQ und Galera/MariaDB interagiert. Jeder Dienst, der eine Verbindung zu RabbitMQ herstellt, verwendet einen separaten virtuellen Host zum Veröffentlichen und Verwenden von Nachrichten. Die MariaDB-Benutzer für jeden Dienst erhalten nur Zugriff nur auf die Datenbanken, die sie abfragen müssen.
id: OpenStack-Ansible mengonfigurasi kombinasi nama pengguna dan kata sandi unik untuk setiap layanan yang berinteraksi dengan RabbitMQ dan Galera/MariaDB. Setiap layanan yang terhubung ke RabbitMQ menggunakan host virtual terpisah untuk mempublikasikan dan mengkonsumsi pesan. Pengguna MariaDB untuk setiap layanan hanya diberikan akses hanya ke database yang mereka butuhkan untuk query.

source: OpenStack-Ansible currently uses `AppArmor`_ to provide MAC policies on infrastructure servers and hypervisors. The AppArmor configuration sets the access policies to prevent one container from accessing the data of another container. For virtual machines, ``libvirtd`` uses the `sVirt`_ extensions to ensure that one virtual machine cannot access the data or devices from another virtual machine.
de: OpenStack-Ansible verwendet derzeit `AppArmor`_, um MAC-Richtlinien auf Infrastrukturservern und Hypervisoren bereitzustellen. Die AppArmor-Konfiguration legt die Zugriffsrichtlinien fest, um zu verhindern, dass ein Container auf die Daten eines anderen Containers zugreift. Für virtuelle Maschinen verwendet ``libvirtd`` die Erweiterungen `sVirt`_ , um sicherzustellen, dass eine virtuelle Maschine nicht auf Daten oder Geräte von einer anderen virtuellen Maschine zugreifen kann.
id: OpenStack-Ansible saat ini menggunakan `AppArmor`_ untuk memberikan kebijakan MAC pada server infrastruktur dan hypervisor. Konfigurasi AppArmor menetapkan kebijakan akses untuk mencegah satu container mengakses data container lain. Untuk mesin virtual, ``libvirtd`` menggunakan ekstensi `sVirt`_ untuk memastikan bahwa satu mesin virtual tidak dapat mengakses data atau perangkat dari mesin virtual lain.

source: OpenStack-Ansible deploys HAProxy back ends for each service and restricts access for highly sensitive services by making them available only on the management network. Deployers with external load balancers must ensure that the back ends are configured securely and that firewalls prevent traffic from crossing between networks.
de: OpenStack-Ansible stellt HAProxy-Backends für jeden Dienst bereit und beschränkt den Zugriff für hochsensible Dienste, indem sie nur im Verwaltungsnetzwerk verfügbar gemacht werden. Implementierer mit externen Load Balancern müssen sicherstellen, dass die Backends sicher konfiguriert sind und dass Firewalls den Datenverkehr zwischen den Netzwerken verhindern.
id: OpenStack-Ansible mengerahkan HAProxy back end untuk setiap layanan dan membatasi akses untuk layanan yang sangat sensitif dengan menjadikannya hanya tersedia di jaringan manajemen. Deployer dengan load balancer eksternal harus memastikan bahwa back end dikonfigurasikan dengan aman dan bahwa firewall mencegah lalu lintas yang melintas antar jaringan.

source: OpenStack-Ansible deploys Linux containers (LXC) and uses Linux bridging between the container and the host interfaces to ensure that all traffic from containers flows over multiple host interfaces. This appendix describes how the interfaces are connected and how traffic flows.
id: OpenStack-Ansible menyebarkan Linux container (LXC) dan menggunakan Linux menjembatani antara kontainer dan host interfacet untuk memastikan bahwa semua lalu lintas dari kontainer mengalir melalui beberapa host interface. Lampiran ini menjelaskan bagaimana interface terhubung dan bagaimana arus lalu lintas mengalir.

source: OpenStack-Ansible deploys the Compute service on the physical host rather than in a container. The following diagram shows how to use bridges for network connectivity:
id: OpenStack-Ansible menyebarkan layanan Compute pada host fisik daripada dalam sebuah kontainer. Diagram berikut menunjukkan cara menggunakan jembatan (bridge) untuk konektivitas jaringan:

source: OpenStack-Ansible deploys the following infrastructure components:
de: OpenStack-Ansible implementiert die folgenden Infrastrukturkomponenten:
id: OpenStack-Ansible menyebarkan komponen infrastruktur berikut:

source: OpenStack-Ansible directory checkout
de: OpenStack-Ansible Verzeichnis Checkout
id: Checkout direktori OpenStack-Ansible

source: OpenStack-Ansible enables you to reference any options in the `OpenStack Configuration Reference`_ through the use of a simple set of configuration entries in the ``/etc/openstack_deploy/user_variables.yml``.
de: Mit OpenStack-Ansible können Sie auf alle Optionen in der `OpenStack Configuration Reference`_ verweisen, indem Sie einen einfachen Satz von Konfigurationseinträgen in der Datei ``/etc/openstack_deploy/user_variables.yml`` verwenden.
id: OpenStack-Ansible memungkinkan Anda untuk referensi opsi apa pun di `OpenStack Configuration Reference`_ melalui penggunaan serangkaian entri konfigurasi yang sederhana di ``/etc/openstack_deploy/user_variables.yml``.

source: OpenStack-Ansible has a flexible deployment configuration model that can deploy all services in separate machine containers or on designated hosts without using containers, and all network traffic either on a single network interface or on many network interfaces.
id: OpenStack-Ansible memiliki model konfigurasi penempatan yang fleksibel yang dapat menggunakan semua layanan dalam container mesin yang terpisah atau pada host yang ditunjuk tanpa menggunakan container, dan semua lalu lintas jaringan baik pada antarmuka jaringan tunggal atau pada banyak antarmuka jaringan.

source: OpenStack-Ansible presently supports two different container technologies, LXC and nspawn. These two container technologies can be used separately or together within the same cluster but has a limitation of only one setting per host.
id: OpenStack-Ansible saat ini mendukung dua teknologi container yang berbeda, LXC dan nspawn. Kedua teknologi container ini dapat digunakan secara terpisah atau bersama-sama dalam kelompok yang sama tetapi memiliki batasan hanya satu pengaturan per host.

source: OpenStack-Ansible provides a comprehensive `security hardening role`_ that applies over 200 security configurations as recommended by the `Security Technical Implementation Guide`_ (STIG) provided by the Defense Information Systems Agency (DISA). These security configurations are widely used and are distributed in the public domain by the United States government.
de: OpenStack-Ansible bietet eine umfassende `security hardening role`_, die mehr als 200 Sicherheitskonfigurationen anwendet, wie vom `Security Technical Implementation Guide`_ (STIG) der Defense Information Systems Agency (DISA) empfohlen. Diese Sicherheitskonfigurationen sind weit verbreitet und werden von der Regierung der Vereinigten Staaten öffentlich verbreitet.
id: OpenStack-Ansible menyediakan `security hardening role`_ komprehensif yang menerapkan lebih dari 200 konfigurasi keamanan seperti yang direkomendasikan oleh `Security Technical Implementation Guide`_ (STIG) yang disediakan oleh Badan Defense Information Systems Agency (DISA). Konfigurasi keamanan ini banyak digunakan dan didistribusikan dalam domain publik oleh pemerintah Amerika Serikat.

source: OpenStack-Ansible provides safe defaults for deployers in its group_vars folder. They take care of the wiring between different roles, like for example storing information on how to reach RabbitMQ from nova role.
de: OpenStack-Ansible bietet sichere Standards für Deployer im Ordner group_vars. Sie kümmern sich um die Verkabelung zwischen verschiedenen Rollen, wie zum Beispiel das Speichern von Informationen darüber, wie RabbitMQ von der nova-Rolle erreicht werden kann.
id: OpenStack-Ansible menyediakan default aman untuk penggunaan di folder group_vars. Mereka menjaga kabel antara peran yang berbeda, seperti misalnya menyimpan informasi tentang cara mencapai RabbitMQ dari peran nova.

source: OpenStack-Ansible uses an included script to generate the inventory of hosts and containers within the environment. This script is called by Ansible through its `dynamic inventory functionality <http://docs.ansible.com/ansible/intro_dynamic_inventory.html>`_.
id: OpenStack-Ansible menggunakan skrip yang disertakan untuk menghasilkan inventaris host dan kontainer di dalam lingkungan. Script ini dipanggil oleh Ansible melalui `dynamic inventory functionality <http://docs.ansible.com/ansible/intro_dynamic_inventory.html>`_.

source: OpenStack-Ansible uses bridges to connect physical and logical network interfaces on the host to virtual network interfaces within containers.
id: OpenStack-Ansible menggunakan bridge untuk menghubungkan antarmuka jaringan fisik dan logis pada host ke antarmuka jaringan virtual dalam kontainer.

source: OpenStack-Ansible wrapper
id: Pembungkus OpenStack-Ansible

source: Operations taken by this script only affect the ``/etc/opentstack_deploy/openstack_inventory.json`` file; any new or removed information must be set by running playbooks.
de: Operationen, die von diesem Skript ausgeführt werden, betreffen nur die Datei ``/etc/opentstack_deploy/openstack_inventory.json``; Alle neuen oder entfernten Informationen müssen durch Ausführen von Playbooks festgelegt werden.
id: Operasi yang dilakukan oleh skrip ini hanya mempengaruhi file ``/etc/opentstack_deploy/openstack_inventory.json``; setiap informasi baru atau yang dihapus harus disetel dengan menjalankan playbook.

source: Orchestration service (heat):
id: Layanan Orchestration (heat):

source: Our ``openstack-ansible`` cli is located in ``/usr/bin/openstack-ansible``. It sources an environment variable file located in: ``/usr/bin/openstack-ansible.rc``.
id: Cli ``openstack-ansible`` kami terletak di ``/usr/bin/openstack-ansible``. Ini sumber file variabel lingkungan yang terletak di: ``/usr/bin/openstack-ansible.rc``.

source: Overriding .conf files
de: Überschreiben von .conf-Dateien
id: File Overriding .conf

source: Overriding .json files
de: Überschreiben von JSON-Dateien
id: Mengganti file .json

source: Overriding .yml files
de: Überschreiben von .yml-Dateien
id: Mengganti file .yml

source: Overriding OpenStack configuration defaults
de: Überschreiben der OpenStack-Konfigurationsstandards
id: Mengganti default konfigurasi OpenStack

source: Overriding default configuration
de: Überschreiben der Standardkonfiguration
id: Mengganti konfigurasi default

source: Physical host interfaces
de: Physische Hostschnittstellen
id: Antarmuka host fisik

source: Please confer to the inventory section of this reference.
id: Silakan berunding ke bagian inventaris dari referensi ini.

source: Possible additional overrides can be found in the "Tunable Section" of each role's ``main.yml`` file, such as ``/etc/ansible/roles/role_name/defaults/main.yml``.
de: Mögliche zusätzliche Überschreibungen finden Sie im ``Tunable Section`` der ``main.yml`` Datei jeder Rolle, wie zum Beispiel ``/etc/ansible/roles/role_name/defaults/main.yml``.
id: Kemungkinan override tambahan dapat ditemukan di "Tunable Section" dari setiap file ``main.yml`` peran, seperti ``/etc/ansible/roles/role_name/defaults/main.yml``.

source: Prevents unauthorized network surveillance
de: Verhindert nicht autorisierte Netzwerküberwachung
id: Mencegah pengawasan jaringan yang tidak sah

source: Project scope
de: Projektumfang
id: Ruang lingkup proyek

source: Python wheels for all services that are deployed in the environment
de: Python Wheels für alle Dienste, die in der Umgebung eingesetzt werden
id: Roda Python (python wheel) untuk semua layanan yang digunakan di lingkungan

source: Reduces damage from unknown or unpatched service vulnerabilities
de: Reduziert den Schaden durch unbekannte oder ungepatchte Service-Schwachstellen
id: Mengurangi kerusakan dari kerentanan layanan yang tidak diketahui atau tidak ditambal (unpatched).

source: Reduces the chance of credential theft
de: Reduziert die Wahrscheinlichkeit des Diebstahls von Anmeldeinformationen
id: Mengurangi kesempatan pencurian kredensial

source: Releases
de: Veröffentlichungen
id: Rilis (release)

source: Remove the ``physical_skel`` link between the container group and the host group by deleting the related file located in the ``env.d/`` directory.
de: Entfernen Sie den ``physical_skel``-Link zwischen der Containergruppe und der Hostgruppe, indem Sie die zugehörige Datei im ``env.d/``-Verzeichnis löschen.
id: Hapus tautan ``physical_skel`` antara grup kontainer dan grup host dengan menghapus file terkait yang terletak di direktori ``env.d/`` .

source: Removing a host
de: Einen Host entfernen
id: Menghapus host

source: Repository
id: Repositori

source: Roles within the Openstack-Ansible umbrella are built using Ansible best practices and contain namespaced variables that are *human* understandable. All roles are independant of each other and testable separately.
id: Peran dalam Openstack-Ansible umbrella dibangun menggunakan praktik terbaik Ansible dan berisi variabel dengan nama *human* yang dapat dimengerti. Semua peran independen satu sama lain dan dapat diuji secara terpisah.

source: Run as quickly as possible
de: Lauf so schnell wie möglich
id: Jalankan secepat mungkin

source: Run the following command:
de: Führen Sie den folgenden Befehl aus:
id: Jalankan perintah berikut:

source: Securing network access to OpenStack services
de: Sicherstellen des Netzwerkzugriffs auf OpenStack-Dienste
id: Mengamankan akses jaringan ke layanan OpenStack

source: Security
de: Sicherheit
id: Keamanan

source: Security is one of the top priorities within OpenStack-Ansible (OSA), and many security enhancements for OpenStack clouds are available in deployments by default. This section provides a detailed overview of the most important security enhancements.
de: Sicherheit ist eine der obersten Prioritäten innerhalb von OpenStack-Ansible (OSA). Viele Sicherheitsverbesserungen für OpenStack-Clouds sind in Bereitstellungen standardmäßig verfügbar. Dieser Abschnitt bietet einen detaillierten Überblick über die wichtigsten Sicherheitsverbesserungen.
id: Keamanan adalah salah satu prioritas utama dalam OpenStack-Ansible (OSA), dan banyak peningkatan keamanan untuk awan OpenStack tersedia dalam penyebaran secara default. Bagian ini memberikan tinjauan mendetail tentang peningkatan keamanan yang paling penting.

source: Service architecture
de: Service-Architektur
id: Arsitektur layanan

source: Services running "on metal" (deploying directly on the physical hosts)
id: Layanan berjalan "on metal" (menyebar langsung di host fisik)

source: Services that *all end users* can access
de: Dienste, auf die *alle Endbenutzer* zugreifen können
id: Layanan yang *all end users* dapat mengakses

source: Services that *only administrators or operators* can access
de: Dienste, auf die *nur Administratoren oder Operatoren* zugreifen können
id: Layanan *only administrators or operators* yang dapat mengakses.

source: Setting overrides in configuration files with config_template
de: Überschreibungen in Konfigurationsdateien mit config_template setzen
id: Pengaturan menimpa dalam file konfigurasi dengan config_template

source: Should an ``env.d`` directory be found in the directory specified by ``--config``, its contents will be added to the base environment, overriding any previous contents in the event of conflicts.
de: Sollte ein ``env.d``-Verzeichnis in dem mit ``--config`` angegebenen Verzeichnis gefunden werden, wird dessen Inhalt der Basisumgebung hinzugefügt, wobei im Konfliktfall der vorherige Inhalt überschrieben wird.
id: Jika direktori ``env.d`` ditemukan di direktori yang ditentukan oleh `` --config``, isinya akan ditambahkan ke lingkungan basis, menggantikan semua konten sebelumnya jika terjadi konflik.

source: Show container details including operational state, resource utilization, and ``veth`` pairs:
de: Containerdetails einschließlich Betriebsstatus, Ressourcenauslastung und ``veth`` -Paare anzeigen:
id: Tampilkan detail container termasuk keadaan operasional, pemanfaatan sumber daya, dan pasangan ``veth``:
