Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-user.po
Languages: de, id, ru

source: Before rebooting, in ``/etc/sysconfig/selinux``, make sure that ``SELINUX=enforcing`` is changed to ``SELINUX=disabled``. SELinux enabled is not currently supported in OpenStack-Ansible for CentOS/Rocky/RHEL due to a lack of maintainers for the feature.
ru: Перед перезагрузкой убедитесь, что в ``/etc/sysconfig/selinux`` параметр ``SELINUX=enforcing`` установлен в значение ``SELINUX=disabled``. SELinux на данный момент не поддерживается в OpenStack-Ansible для CentOS/Rocky/RHEL из-за нехватки ресурсов для сопровождения данной возможности.

source: Below you can find an example for defining endpoints for Keystone and Nova:
ru: Ниже вы можете найти пример определения точек доступа для Keystone и Nova:

source: Bootstrap Ansible and the required roles
id: Bootstrap Ansible dan role yang diperlukan
ru: Начальная подготовка Ansible и требуемых ролей

source: Bootstrap the AIO configuration
id: Bootstrap konfigurasi AIO
ru: Начальная подготовка конфигурации AIO

source: Building an AIO
de: Ein AIO bauen
id: Membangun AIO
ru: Установка AIO

source: But this approach is not correct and will result in issues in some clients or use cases, despite the service appearing completely functional. The problem with the approach above is related to how services return the `self` URL when it's asked for. Most services will reply with their current micro-version and URI to this micro-version in reply.
ru: Но этот подход не является правильным и приведет к проблемам в некоторых клиентах или вариантах использования, несмотря на то, что служба выглядит полностью функциональной. Проблема с подходом выше связана с тем, как службы возвращают `self` URL, когда его запрашивают. Большинство служб ответят своей текущей микроверсией и URI этой микроверсии в ответе.

source: But when your setup grows, gnocchi might slow down or block your ceph installation. You might experience slow requests and stuck PGs in your Ceph. As this might have multiple causes, take a look at the presentations linked in the `Performance Tests for Gnocchi`_ section. They also include various parameters which you might tune.
id: Tetapi ketika setup Anda tumbuh, gnocchi mungkin memperlambat atau memblokir instalasi ceph Anda. Anda mungkin mengalami permintaan lambat dan terjebak PG di Ceph Anda. Karena ini mungkin memiliki banyak penyebab, lihat presentasi yang ditautkan di bagian `Performance Tests for Gnocchi`_ . Mereka juga menyertakan berbagai parameter yang mungkin Anda tune.
ru: Но когда ваша установка вырастет, gnocchi может замедлять или блокировать ваш ceph. Вы можете столкнуться с медленными запросами или заблокированными PG в ceph. Так как это может иметь несколько причин, взгляните на прикрепленные презентации в секции `Тесты производительности для Gnocchi`_. Они также содержат различные параметры, которые вы можете захотеть оптимизировать.

source: By default the AIO bootstrap scripts deploy a base set of OpenStack services with sensible defaults for the purpose of a gate check, development or testing system.
id: Secara default skrip bootstrap AIO menggunakan set dasar layanan OpenStack dengan default yang masuk akal untuk tujuan pemeriksaan gerbang (gate check), pengembangan atau sistem pengujian.
ru: По умолчанию скрипты подготовки AIO разворачивают базовый набор сервисов OpenStack с благоразумными настройками по умолчанию для автоматических тестов, разработки или проверки работы систем.

source: By default this header is set to block access to all features apart from the following from the same origin; fullscreen, clipboard read, clipboard write and spatial navigation.
ru: По умолчанию этот заголовок настроен на блокировку доступа ко всем функциям, за исключением следующих из того же источника: полноэкранный режим, чтение буфера обмена, запись буфера обмена и пространственная навигация.

source: By default, OSA enables *only* the Swift API in radosgw.
id: Secara default, OSA mengaktifkan *only* API Swift di radosgw.
ru: По умолчанию, OSA включает *только* Swift API в radosgw.

source: By default, OpenStack-Ansible does not secure connections to the internal VIP. To enable this you must set the following variables in the ``/etc/openstack_deploy/user_variables.yml`` file:
ru: По умолчанию OpenStack-Ansible не защищает соединения с внутренним VIP. Чтобы включить это, необходимо задать следующие переменные в файле ``/etc/openstack_deploy/user_variables.yml``:

source: By default, OpenStack-Ansible uses port-based endpoints. This means, that each service will be served on its own unique port for both public and internal endpoints. For example, Keystone will be added as ``https://domain.com:5000/v3``, Nova as ``https://domain.com:8774/v2.1`` and so on.
ru: По умолчанию OpenStack-Ansible использует точки доступа на основе портов. Это означает, что каждая служба будет обслуживаться на своем собственном уникальном порту как для публичных, так и для внутренних точек доступа. Например, Keystone будет добавлен как ``https://domain.com:5000/v3``, а Nova как ``https://domain.com:8774/v2.1`` и так далее.

source: By default, self-signed certificates will be used to secure traffic but user-provided certificates are also supported.
ru: По умолчанию для защиты трафика будут использоваться самоподписанные сертификаты, но также поддерживаются сертификаты, предоставленные пользователем.

source: By default, the Content Security Policy (CSP) enables a minimum set of resources to allow Horizon to work, which includes access the Nova console. If you require access to other resources these can be set by overriding the ``haproxy_security_headers_csp`` variable in the ``/etc/openstack_deploy/user_variables.yml`` file.
ru: По умолчанию политика безопасности контента (CSP) включает минимальный набор ресурсов, позволяющий Horizon работать, включая доступ к консоли Nova. Если вам требуется доступ к другим ресурсам, их можно задать, переопределив переменную ``haproxy_security_headers_csp`` в файле ``/etc/openstack_deploy/user_variables.yml``.

source: By design, this header is difficult to disable once set. It is recommended that during testing you set a short time of 1 day and after testing increase the time to 1 year.
ru: По замыслу этот заголовок трудно отключить после установки. Рекомендуется во время тестирования установить короткое время в 1 день, а после тестирования увеличить время до 1 года.

source: CPU/motherboard that supports `hardware-assisted virtualization`_
de: CPU / Motherboard, das `Hardware-unterstützte Virtualisierung`_ unterstützt
id: CPU/motherboard yang mendukung `hardware-assisted virtualization`_
ru: Процессор/материнская плата поддерживают `аппаратную виртуализацию`_

source: Ceilometer Changes
id: Perubahan Ceilometer
ru: Изменения Ceilometer

source: Ceilometer needs additional pip packages to talk to Ceph Rados Gateway. To install it, edit the default ceilometer_pip_packages in your user_variables.yml file:
id: Ceilometer membutuhkan paket pip tambahan untuk berbicara dengan Ceph Rados Gateway. Untuk menginstalnya, edit ceilometer_pip_packages default dalam file user_variables.yml Anda:
ru: Для ceilometer требуются дополнительные pip пакеты для взаимодействия с Ceph Rados Gateway. Для их установки отредактируйте ceilometer_pip_packages в файле user_variables.yml:

source: Ceph (preferred)
ru: Ceph (рекомендован)

source: Ceph Changes
ru: Изменения Ceph

source: Ceph as metric storage
id: Ceph sebagai penyimpanan metrik
ru: Ceph, как хранилище метрик

source: Ceph production example
de: Ceph Produktionsbeispiel
id: Contoh produksi Ceph
ru: Пример настройки Ceph в рабочем окружении

source: Certbot certificates
ru: Сертификаты Certbot

source: Certbot defaults to using Let's Encrypt as the Certificate Authority, other Certificate Authorities can be used by setting the ``haproxy_ssl_letsencrypt_certbot_server`` variable in the ``/etc/openstack_deploy/user_variables.yml`` file:
ru: По умолчанию Certbot использует Let's Encrypt в качестве центра сертификации. Другие центры сертификации можно использовать, установив переменную ``haproxy_ssl_letsencrypt_certbot_server`` в файле ``/etc/openstack_deploy/user_variables.yml``:

source: Changes will not apply to any existing running guests on the compute node, so this configuration should be done before launching any instances. For existing deployments it is recommended that you migrate instances off the compute node before enabling.
ru: Изменения не будут применяться к существующим запущенным гостевым ОС на вычислительном узле, поэтому эту настройку следует выполнить до запуска любых инстансов. Для существующих развертываний рекомендуется перенести инстансы с вычислительного узла перед включением.

source: Clone OpenStack-Ansible repository to home user directory. It means, that instead of ``/opt/openstack-ansible`` repository will be in ``~/openstack-ansible``.
ru: Склонируйте репозиторий OpenStack-Ansible в домашний каталог пользователя. Это значит, что вместо ``/opt/openstack-ansible`` репозиторий будет в ``~/openstack-ansible``.

source: Communication between HAProxy and service backends can be encrypted. Currently it is disabled by default. It can be enabled for all services by setting the following variable:
ru: Связь между HAProxy и бекэндами сервисов может быть зашифрована. В настоящее время по умолчанию она отключена. Ее можно включить для всех сервисов, установив следующую переменную:

source: Compute hosts act as OVN gateway hosts
ru: Вычислительные хосты действуют как шлюзы OVN

source: Configuration examples
ru: Примеры конфигурации

source: Configure Nova Scheduler to Check Architecture.
ru: Настройте Nova Scheduler для проверки архитектуры.

source: Configure the ``bootstrap-ansible.sh`` script used to install Ansible and Ansible role dependencies on the deployment host to use a proxy by setting the environment variables ``HTTPS_PROXY`` or ``HTTP_PROXY``.
de: Konfigurieren Sie das Skript `` bootstrap-ansible.sh``, das zum Installieren der Abhängigkeiten von Ansible und Ansible auf dem Implementierungshost verwendet wird, um einen Proxy zu verwenden, indem Sie die Umgebungsvariablen `` HTTPS_PROXY`` oder `` HTTP_PROXY`` festlegen.
id: Konfigurasikan skrip ``bootstrap-ansible.sh`` yang digunakan untuk menginstal dependensi role Ansible dan Ansible pada host deployment untuk menggunakan proxy dengan mengatur variabel lingkungan ``HTTPS_PROXY`` atau ``HTTP_PROXY``.
ru: Скрипт ``bootstrap-ansible.sh``, используемый для установки Ansible и зависимостей Ansible ролей на хосте развертывания, использует настройки прокси, заданные переменными окружения ``HTTPS_PROXY`` или ``HTTP_PROXY``.

source: Configuring HAProxy binding inside containers
ru: Настройка привязки HAProxy внутри контейнеров

source: Configuring domain-based endpoints (recommended)
ru: Настройка точек доступа на основе домена (рекомендуется)

source: Configuring network interfaces
ru: Настройка сетевых интерфейсов

source: Configuring path-based endpoints
ru: Настройка точек доступа на основе пути

source: Considerations when proxying TLS traffic
de: Überlegungen bei der Verwendung von TLS-Verkehr
id: Pertimbangan saat mem-proxy lalu lintas TLS
ru: Важные моменты при проксировании TLS трафика

source: Copy your SSL certificate, key, and CA certificate files to the deployment host.
de: Kopieren Sie Ihre SSL-Zertifikat-, Schlüssel- und CA-Zertifikatdateien auf den Bereitstellungshost.
id: Salin file sertifikat SSL, kunci, dan CA Anda ke host penyebaran.
ru: Скопируйте ваш SSL сертификат, ключ и промежуточные сертификаты на хост развертывания.

source: Create containers for Zookeeper:
id: Buat container untuk Zookeeper:
ru: Создайте контейнеры для Zookeeper:

source: Creating containers
ru: Создание контейнеров

source: Custom Groups
id: Grup Kustom
ru: Пользовательские группы

source: Custom inventory groups can be created to assist in segmenting hosts beyond the built-in groups provided by OpenStack-Ansible.
id: Grup inventaris kustom dapat dibuat untuk membantu mensegmentasi host di luar grup built-in yang disediakan oleh OpenStack-Ansible.
ru: Пользовательские группы в inventory могут быть созданы для помощи в сегментации хостов над встроенными группами, создаваемыми OpenStack-Ansible.

source: Declare Ceph Rados Gateway as object-store in your ceilometer.conf file by adding this to your user_variables.yml file:
id: Deklarasikan Ceph Rados Gateway sebagai object-store di file ceilometer.conf Anda dengan menambahkan ini ke file user_variables.yml Anda:
ru: Объявите Ceph Rados Gateway как объектное хранилище в файле ceilometer.conf, добавив следующее в ваш файл user_variables.yml:

source: Define 6 keepalived instances: 3 for public and 3 for internal VIPs
ru: Определение 6 инстансов keepalived: 3 для публичных и 3 для внутренних VIP-адресов

source: Define Internal API FQDN through /etc/hosts overrides, which are unique per Availability Zone
ru: Определение FQDN внутреннего API с помощью переопределений /etc/hosts, которые являются уникальными для каждой зоны доступности

source: Define ``ansible_remote_tmp: /tmp`` in user_variables.yml
ru: Задайте ``ansible_remote_tmp: /tmp`` в user_variables.yml

source: Define ``ansible_user: <USER>`` in user_variables.yml
ru: Определите ``ansible_user: <USER>`` в user_variables.yml

source: Define the contents of ``security.txt`` in the variable ``haproxy_security_txt_content`` in the ``/etc/openstack_deploy/user_variables.yml`` file:
ru: Определите содержимое ``security.txt`` в переменной ``haproxy_security_txt_content`` в файле ``/etc/openstack_deploy/user_variables.yml``:

source: Define the following environment variable:
ru: Определите следующую переменную окружения:

source: Define the group and its members in a corresponding file in ``/etc/openstack_deploy/conf.d/``. The following is an example of a group named ``custom2_hosts`` defined in ``/etc/openstack_deploy/conf.d/custom2_hosts.yml`` consisting of a single member, ``compute2``:
id: Tentukan grup dan anggotanya dalam file yang sesuai di ``/etc/openstack_deploy/conf.d/``. Berikut ini adalah contoh grup yang bernama ``custom2_hosts`` didefinisikan dalam ``/etc/openstack_deploy/conf.d/custom2_hosts.yml`` terdiri dari satu anggota, ``compute2``:
ru: Определите группу и ее участников в соответствующем файле внутри ``/etc/openstack_deploy/conf.d/``. Следующий пример содержит группу с названием ``custom2_hosts``, определенную в ``/etc/openstack_deploy/conf.d/custom2_hosts.yml`` и содержащую единственного участника - ``compute2``:

source: Define the user that will be used for for connections from the deploy host to the ansible target hosts. In case the user is the same for all hosts in your deployment, you can do it in one of following ways:
ru: Определите пользователя, который будет использоваться для подключений от хоста развертывания к целевым хостам ansible. Если пользователь один и тот же для всех хостов в вашем развертывании, вы можете сделать это одним из следующих способов:

source: Defining container networking
ru: Настройка сети контейнера

source: Defining host networking
ru: Настройка сети хоста

source: Deployed files in ``/etc/openstack_deploy/env.d`` allow the customization of Ansible groups.
ru: Развернутые файлы в ``/etc/openstack_deploy/env.d`` позволяют настраивать группы Ansible.

source: Deployers can configure the script to source Ansible from an alternate Git repository by setting the environment variable ``ANSIBLE_GIT_REPO``. Also, during initial bootstrap you might need to define a custom URL for upper-constraints file that is part of `openstack/requirements` repository, using the TOX_CONSTRAINTS_FILE environment variable.
ru: Операторы могут настроить скрипт на получение Ansible из альтернативного репозитория Git, установив переменную окружения ``ANSIBLE_GIT_REPO``. Кроме того, во время начальной загрузки вам может потребоваться определить пользовательский URL для файла upper-constraints, который является частью репозитория `openstack/requirements`, используя переменную окружения TOX_CONSTRAINTS_FILE.

source: Deployers can configure the script to source Ansible role dependencies from alternate locations by providing a custom role requirements file and specifying the path to that file using the environment variable ``ANSIBLE_ROLE_FILE``.
de: Deployer können das Skript so konfigurieren, dass es Ansible-Rollenabhängigkeiten von alternativen Speicherorten abruft, indem es eine benutzerdefinierte Rollenanforderungsdatei bereitstellt und den Pfad zu dieser Datei mit der Umgebungsvariable ``ANSIBLE_ROLE_FILE`` angibt.
id: Deployer dapat mengonfigurasi skrip ke sumber dependensi role Ansible dari lokasi alternatif dengan memberikan file persyaratan role khusus dan menentukan jalur ke file tersebut menggunakan variabel lingkungan ``ANSIBLE_ROLE_FILE``.
ru: Операторы могут настроить скрипт для получения зависимостей ролей Ansible из альтернативных расположений, предоставив файл требований к пользовательской роли и указав путь к этому файлу с помощью переменной среды ``ANSIBLE_ROLE_FILE``.

source: Deployers do not have to use ``root`` user accounts on deploy or target hosts. This approach works out of the box by leveraging `Ansible privilege escalation`_.
ru: Операторам не нужно использовать учетные записи пользователя ``root`` на хостах развертывания или целевых хостах. Этот подход работает из коробки, используя `Ansible privilege escalation`_.

source: Deploying ceph cluster as part of OpenStack-Ansible is not recommended since ceph-ansible upgrade path is not tested or supported. This option is mainly used for CI and AIO deployments to test and demonstrate a sample integration of the software stack.
ru: Развертывание кластера ceph как части OpenStack-Ansible не рекомендуется, поскольку путь обновления ceph-ansible не тестировался и не поддерживается. Этот вариант в основном используется для развертываний CI и AIO для тестирования и демонстрации примера интеграции программного стека.

source: Deployment configuration
de: Bereitstellungskonfiguration
id: Konfigurasi penempatan (deployment)
ru: Настройка развертывания

source: Deployment host proxy configuration for bootstrapping Ansible
de: Deployment-Host-Proxy-Konfiguration für das Bootstrapping von Ansible
id: Konfigurasi proxy host deployment untuk bootstrapping Ansible
ru: Настройка прокси на хосте развертывания для подготовки Ansible

source: Deployment hosts
ru: Хосты развертывания

source: Deployment of certificates using Let's Encrypt has been validated for OpenStack-Ansible using Ubuntu 22.04 (Jammy Jellyfish). Other distributions should work but are not tested.
ru: Развертывание сертификатов с использованием Let's Encrypt было проверено для OpenStack-Ansible с использованием Ubuntu 22.04 (Jammy Jellyfish). Другие дистрибутивы должны работать, но не тестировались.

source: Deployments consisting entirely of x86_64 or aarch64 nodes do not need any special consideration and will work according to the normal OpenStack-Ansible documentation.
ru: Окружения, которые полностью состоят из x86_64 или aarch64 серверов не нуждаются в дополнительных настройках и будут работать согласно стандартной документации OpenStack-Ansible.

source: Deployments may encounter limited external connectivity for a number of reasons:
de: Für Bereitstellungen kann es aus mehreren Gründen zu eingeschränkter externer Konnektivität kommen:
id: Deployment dapat menemui konektivitas eksternal terbatas karena sejumlah alasan:
ru: Установки могут сталкиваться с ограниченным внешним соединением по ряду причин:

source: Destination hosts
ru: Хосты назначения

source: Differences in network interface names may be the result of a difference in drivers and/or PCI slot locations.
id: Perbedaan nama antarmuka jaringan mungkin merupakan akibat dari perbedaan dalam driver dan/atau lokasi slot PCI.
ru: Различие в именах сетевых интерфейсов может быть результатом в использовании различных драйверов и/или слотов PCI.

source: Disable QEMU Emulation.
ru: Отключите эмуляцию QEMU.

source: Distribution specific packages
de: Verteilungsspezifische Pakete
id: Paket khusus distribusi
ru: Специфичные для дистрибутивов пакеты

source: Domain-based endpoints do separate direct requests to specific services based on FQDNs. Usually for this purpose subdomains are used. For example, Keystone endpoint may look like ``https://identity.domain.com`` while Nova endpoint can be like ``https://compute.domain.com``.
ru: Доменные точки доступа выполняют отдельные прямые запросы к определенным службам на основе полных доменных имен. Обычно для этой цели используются поддомены. Например, точка доступа Keystone может выглядеть как ``https://identity.domain.com``, а конечная точка Nova может выглядеть как ``https://compute.domain.com``.

source: Each host does require the correct network bridges to be implemented. In this example, we leverage the ``systemd_networkd`` role that performs configuration for us during ``openstack_hosts`` execution. It creates all required vlans and bridges. The only pre-requirement is to have a connection to the host via SSH available for Ansible to manage the host.
ru: Для каждого хоста требуется реализация правильных сетевых мостов. В этом примере мы используем роль ``systemd_networkd``, которая выполняет настройку для нас во время выполнения ``openstack_hosts``. Она создает все необходимые vlan и мосты. Единственное предварительное требование — иметь подключение к хосту через SSH, доступное для Ansible для управления хостом.

source: Each host will require the correct network bridges to be implemented. The following is the ``/etc/network/interfaces`` file for ``infra1`` using a single bond.
id: Setiap host akan membutuhkan jembatan jaringan yang benar untuk diimplementasikan. Berikut ini adalah file ``/etc/network/interfaces`` untuk ``infra1`` menggunakan satu ikatan.
ru: На каждом хосте потребуется настроить корректные сетевые мосты. Ниже представлено содержимое файла ``/etc/network/interfaces`` для ``infra1`` с использованием одного агрегированного интерфейса.

source: Each host will require the correct network bridges to be implemented. The following is the ``/etc/network/interfaces`` file for ``infra1`` using multiple bonded interfaces.
id: Setiap host akan membutuhkan jembatan jaringan yang benar untuk diimplementasikan. Berikut ini adalah file ``/etc/network/interfaces`` untuk ``infra1`` menggunakan banyak antarmuka terikat.
ru: На каждом хосте потребуется настроить корректные сетевые мосты. Ниже представлено содержимое файла ``/etc/network/interfaces`` для ``infra1`` с использованием нескольких агрегированных интерфейсов.

source: Each host will require the correct network bridges to be implemented. The following is the ``/etc/network/interfaces`` file for ``infra1``.
de: Für jeden Host müssen die richtigen Netzwerkbrücken implementiert werden. Das Folgende ist die ``/etc/network/interfaces`` Datei für `` infra1``.
id: Setiap host akan membutuhkan jembatan jaringan (network bridge) yang benar untuk diimplementasikan. Berikut ini adalah file ``/etc/network/interfaces`` untuk ``infra1``.
ru: На каждом сервере должны быть настроены корректные сетевые мосты. Ниже мы приводим файл ``/etc/network/interfaces`` для ``infra1``.

source: Eight compute hosts, 2 compute hosts in each Availability Zone. First Availability Zone has two extra compute hosts for pinned CPU aggregate.
ru: Восемь вычислительных хостов, 2 вычислительных хоста в каждой зоне доступности. Первая зона доступности имеет два дополнительных вычислительных хоста для привязки CPU.
