Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-contributor.po
Languages: de, id

source: The OpenStack-Ansible community communicates in the #openstack-ansible IRC channel hosted on freenode. This channel is logged, and its logs are published on http://eavesdrop.openstack.org/irclogs/%23openstack-ansible/.
id: Komunitas OpenStack-Ansible berkomunikasi dalam kanal IRC # openstack-ansible yang dihosting di Freenode. Saluran ini dicatat, dan log-nya diterbitkan di http://eavesdrop.openstack.org/irclogs/%23openstack-ansible/.

source: The OpenStack-Ansible integrated repo also has an extra documentation building process, to build the deployment guide.
de: Das OpenStack-Ansible-integrierte Repository verfügt außerdem über einen zusätzlichen Dokumentationserstellungsprozess, um das Bereitstellungshandbuch zu erstellen.
id: Repo terintegrasi OpenStack-Ansible juga memiliki proses pembangunan dokumentasi tambahan, untuk membangun panduan penyebaran.

source: The OpenStack-Ansible project has different kinds of git repositories, each of them with specific use cases, and different sets of practices.
de: Das OpenStack-Ansible-Projekt verfügt über verschiedene Arten von Git-Repositorys mit jeweils spezifischen Anwendungsfällen und unterschiedlichen Vorgehensweisen.
id: Proyek OpenStack-Ansible memiliki berbagai jenis repositori git, masing-masing dengan kasus penggunaan khusus, dan serangkaian praktik yang berbeda.

source: The OpenStack-Ansible project has recurring tasks that need attention, like releasing, or other code duties. See our page :ref:`Periodic work<periodicwork>`.
de: Das OpenStack-Ansible-Projekt hat wiederkehrende Aufgaben, die Aufmerksamkeit erfordern, wie die Freigabe oder andere Code-Aufgaben. Siehe unsere Seite :ref:`Periodic work <periodicwork>`.
id: Proyek OpenStack-Ansible memiliki tugas berulang yang perlu perhatian, seperti melepaskan, atau tugas kode lainnya. Lihat halaman kami :ref:`Periodic work<periodicwork>`.

source: The `OpenStack-Ansible Core Reviewer Team`_ is responsible for many aspects of the OpenStack-Ansible project. These include, but are not limited to:
de: Das `OpenStack-Ansible Core Reviewer Team`_ ist für viele Aspekte des OpenStack-Ansible-Projekts verantwortlich. Diese umfassen, sind aber nicht beschränkt auf:
id: The `OpenStack-Ansible Core Reviewer Team`_ bertanggung jawab atas banyak aspek dari proyek OpenStack-Ansible. Ini termasuk, tetapi tidak terbatas pada:

source: The ``releasenotes`` build argument only tests committed changes. Ensure your local changes are committed before running the ``releasenotes`` build.
de: Das Build-Argument ``Releasenotes`` testet nur festgeschriebene Änderungen. Stellen Sie sicher, dass Ihre lokalen Änderungen festgeschrieben sind, bevor Sie den ``Releasenotes`` Build ausführen.
id: Argumen build ``releasenotes`` hanya menguji perubahan yang dilakukan. Pastikan perubahan lokal Anda dilakukan sebelum menjalankan build ``releasenotes``.

source: The `defaults/main.yml` file
de: Die Datei `defaults/main.yml`
id: File `defaults/main.yml`

source: The `vars/<platform specific>.yml` file
de: Die `vars/<platform specific> .yml` Datei
id: File `vars/<platform specific> .yml`

source: The `vars/<platform specific>.yml` is the place where distribution specific content will be stored. For example, this file will hold the package names, repositories urls and keys, file paths, service names/init scripts.
de: Die `vars/<platform specific>.yml` ist der Ort, an dem der vertriebsspezifische Inhalt gespeichert wird. Diese Datei enthält beispielsweise die Paketnamen, URLs der Repositorys und Schlüssel, Dateipfade, Dienstnamen/Init-Skripts.
id: `Vars/<platform specific> .yml` adalah tempat penyimpanan konten spesifik distribusi. Sebagai contoh, file ini akan menyimpan nama paket, url dan kunci repositori, path file, nama layanan / skrip init.

source: The `vars/main.yml` file
de: Die `vars/main.yml`-Datei
id: File `vars/main.yml`

source: The `vars/main.yml` is always included. It contains generic variables that aren't meant to be changed by a deployer. This includes for example static information that aren't distribution specific (like aggregation of role internal variables for example).
de: Die `vars/main.yml` ist immer enthalten. Sie enthält generische Variablen, die von einem Deployer nicht geändert werden sollen. Dazu gehören beispielsweise statische Informationen, die nicht verteilungsspezifisch sind (wie zum Beispiel die Aggregation von internen Rollenvariablen).
id: `Vars/main.yml` selalu disertakan. Ini berisi variabel generik yang tidak dimaksudkan untuk diubah oleh sebuah deployer. Ini termasuk misalnya informasi statis yang tidak spesifik distribusi (seperti agregasi variabel peran internal misalnya).

source: The bug triage meeting is probably a good time for people with bug supervisors rights to also prioritize bugs per importance (on top of classifying them on status).
de: Das Bug-Triage-Treffen ist wahrscheinlich eine gute Zeit für Leute mit Bug-Supervisor-Rechten, Bugs auch nach Wichtigkeit zu priorisieren (zusätzlich zur Klassifizierung nach Status).
id: Rapat triage bug mungkin merupakan saat yang tepat bagi orang-orang dengan hak pengawas bug untuk juga memprioritaskan bug per kepentingan (di atas mengklasifikasikan mereka berdasarkan status).

source: The conventions for writing tests are described in the :ref:`tests` page.
de: Die Konventionen für das Schreiben von Tests sind auf der Seite :ref:`tests` beschrieben.
id: Kebiasaan menulis tes dijelaskan di halaman :ref:`tests`

source: The convergence may involve consuming other OpenStack-Ansible roles (For example: **galera_server, galera_client, rabbitmq_server**) in order to ensure that the appropriate infrastructure is in place. Re-using existing roles in OpenStack-Ansible or Ansible Galaxy is strongly encouraged.
de: Die Konvergenz kann den Konsum anderer OpenStack-Ansible-Rollen beinhalten (zum Beispiel: **galera_server, galera_client, rabbitmq_server**), um sicherzustellen, dass die entsprechende Infrastruktur vorhanden ist. Die Wiederverwendung vorhandener Rollen in OpenStack-Ansible oder Ansible Galaxy wird dringend empfohlen.
id: Konvergensi dapat melibatkan penggunaan peran OpenStack-Ansible lainnya (Misalnya: **galera_server, galera_client, rabbitmq_server**) untuk memastikan bahwa infrastruktur yang sesuai sudah ada. Menggunakan kembali peran yang ada di OpenStack-Ansible atau Ansible Galaxy sangat dianjurkan.

source: The dependencies for OpenStack-Ansible are updated through the use of ``osa releases bump_upstream_shas``. This script updates the project's pinned SHAs, located in the `repo_packages folder`, based on their ``_git_track_branch`` value.
id: Dependency untuk OpenStack-Ansible diperbarui melalui penggunaan ``osa releases bump_upstream_shas``. Skrip ini memperbarui SHA yang disematkan (pinned) proyek, yang terletak di `repo_packages folder`, berdasarkan nilai ``_git_track_branch`` mereka.

source: The description clearly states or describes the original problem or root cause of the problem.
de: In der Beschreibung wird das ursprüngliche Problem oder die Ursache des Problems eindeutig angegeben oder beschrieben.
id: Deskripsi dengan jelas menyatakan atau menjelaskan masalah asli atau akar penyebab masalah.

source: The description clearly states the expected outcome of the user action.
de: Die Beschreibung gibt klar das erwartete Ergebnis der Benutzeraktion an.
id: Deskripsi dengan jelas menyatakan hasil yang diharapkan dari tindakan pengguna.

source: The following convention is used:
de: Die folgende Konvention wird verwendet:
id: Konvensi berikut digunakan:

source: The in-depth technical information is located in the :dev_docs:`OpenStack-Ansible Reference <reference/index.html>`.
de: Die ausführliche technische Information befindet sich in der :dev_docs:`OpenStack-Ansible Reference <reference/index.html>`.
id: Informasi teknis mendalam terletak di :dev_docs:`OpenStack-Ansible Reference <reference/index.html>`.

source: The integrated repo functional test is using the ``scripts/gate-check-commit.sh`` script, which receives arguments from the zuul run playbook definition.
de: Der integrierte Repo-Funktionstest verwendet das Skript ``scripts/gate-check-commit.sh``, das Argumente von der zuul run-Playbook-Definition empfängt.
id: Tes fungsional repo terintegrasi menggunakan skrip ``scripts/gate-check-commit.sh``, yang menerima argumen dari definisi playbook zuul run.

source: The integration repository contains at least one job which passes the Temptest testing framework.
de: Das Integrationsrepository enthält mindestens einen Job, der das Temptest-Testframework besteht.
id: Repositori integrasi berisi setidaknya satu pekerjaan yang melewati kerangka pengujian Tempest.

source: The list of supported distributions can be found in the :deploy_guide:`Deployment Guide <deploymenthost.html>`
de: Die Liste der unterstützten Distributionen finden Sie im :deploy_guide:`Deployment Guide <deploymenthost.html>`
id: Daftar distribusi yang didukung dapat ditemukan di Internet :deploy_guide:`Deployment Guide <deploymenthost.html>`

source: The necessary steps for bootstrapping the operating system have to be documented in the :deploy_guide:`Deployment Guide <index.html>`.
de: Die notwendigen Schritte zum Booten des Betriebssystems müssen im :deploy_guide:`Deployment Guide <index.html>` dokumentiert werden.
id: Langkah - langkah yang diperlukan untuk bootstrap sistem operasi harus didokumentasikan dalam :deploy_guide:`Deployment Guide <index.html>`.

source: The next community meeting should discuss about role deprecation, and if no contributor comes forward to fix the role, periodic testing will be turned off, and the role will move to an ``unmaintained`` state.
de: Das nächste Community-Meeting sollte sich mit der Abwertung von Rollen befassen, und wenn kein Contributor die Rolle korrigiert, werden periodische Tests deaktiviert und die Rolle wechselt in den Status ``nicht gewartet``.
id: Pertemuan komunitas berikutnya harus membahas tentang penghentian peran, dan jika tidak ada kontributor yang muncul untuk memperbaiki peran tersebut, pengujian berkala akan dimatikan, dan peran tersebut akan pindah ke keadaan ``unmaintained``.

source: The provided information should be totally self-contained. External access to web services/sites should not be needed.
de: Die bereitgestellten Informationen sollten vollständig eigenständig sein. Externer Zugriff auf Web-Services/Websites sollte nicht benötigt werden.
id: Informasi yang disediakan harus benar-benar lengkap (self-contained). Akses eksternal ke layanan / situs web tidak diperlukan.

source: The role documentation (for example, the `keystone role documentation`_) intends to explain all the options available for the role and how to implement more advanced requirements. To reduce duplication, the role documentation directly includes the role's default variables file which includes the comments explaining the purpose of the variables. The long hand documentation for the roles should focus less on explaining variables and more on explaining how to implement advanced use cases.
de: Die Rollendokumentation (z. B. die `Keystone-Rollendokumentation`_) erläutert alle für die Rolle verfügbaren Optionen und erläutert, wie erweiterte Anforderungen implementiert werden. Um Doppelarbeit zu vermeiden, enthält die Rollendokumentation direkt die Standardvariablendatei der Rolle, die die Kommentare enthält, die den Zweck der Variablen erläutern. Die Volldokumentation für die Rollen sollte sich weniger auf das Erläutern von Variablen als auf die Erläuterung der Implementierung von erweiterten Anwendungsfällen konzentrieren.
id: Dokumentasi peran (misalnya, dokumentasi peran `keystone`_) bermaksud untuk menjelaskan semua opsi yang tersedia untuk peran dan bagaimana menerapkan persyaratan yang lebih maju. Untuk mengurangi duplikasi, dokumentasi peran secara langsung menyertakan file variabel default peran yang mencakup komentar yang menjelaskan tujuan variabel. Dokumentasi lama untuk peran harus kurang fokus pada menjelaskan variabel dan lebih pada menjelaskan bagaimana menerapkan kasus penggunaan lanjutan.

source: The role documentation must include a description of the mandatory infrastructure (For example: a database and a message queue are required), variables (For example: the database name and credentials) and group names (For example: The role expects a group named ``foo_all`` to be present and it expects the host to be a member of it) for the role's execution to succeed.
de: Die Rollendokumentation muss eine Beschreibung der obligatorischen Infrastruktur (z.B. eine Datenbank und eine Nachrichtenwarteschlange), Variablen (z.B. den Datenbanknamen und Anmeldeinformationen) und Gruppennamen (z.B. die Rolle erwartet eine Gruppe mit dem Namen) enthalten ``foo_all`` ist vorhanden und erwartet, dass der Host ein Mitglied davon ist), damit die Ausführung der Rolle erfolgreich ist.
id: Dokumentasi peran harus menyertakan uraian tentang infrastruktur wajib (Sebagai contoh: diperlukan database dan antrian pesan), variabel (Misalnya: nama basis data dan kredensial) dan nama grup (Misalnya: Peran mengharapkan grup bernama ``foo_all`` untuk hadir dan mengharapkan host untuk menjadi anggota itu) agar eksekusi peran berhasil.

source: The role implementation should be done in such a way that it is agnostic with regards to whether it is implemented in a container, or on a physical host. The test infrastructure may make use of containers for the separation of services, but if a role is used by a playbook that targets a host, it must work regardless of whether that host is a container, a virtual server, or a physical server. The use of containers for role tests is not required but it may be useful in order to simulate a multi-node build out as part of the testing infrastructure.
de: Die Rollenimplementierung sollte so durchgeführt werden, dass sie unabhängig davon ist, ob sie in einem Container oder auf einem physischen Host implementiert ist. Die Testinfrastruktur kann Container für die Trennung von Diensten verwenden, aber wenn eine Rolle von einem Playbook verwendet wird, das auf einen Host abzielt, muss es unabhängig davon funktionieren, ob dieser Host ein Container, ein virtueller Server oder ein physischer Server ist. Die Verwendung von Containern für Rollentests ist nicht erforderlich, kann jedoch nützlich sein, um ein Multi-Node-Build als Teil der Testinfrastruktur zu simulieren.
id: Implementasi peran harus dilakukan sedemikian rupa sehingga agnostik sehubungan dengan apakah itu diimplementasikan dalam container, atau pada host fisik. Infrastruktur pengujian dapat menggunakan container untuk pemisahan layanan, tetapi jika peran digunakan oleh buku pedoman yang menargetkan host, ia harus berfungsi terlepas dari apakah host itu adalah container, server virtual, atau server fisik. Penggunaan container untuk uji peran tidak diperlukan tetapi mungkin berguna untuk mensimulasikan multi-node yang dibangun sebagai bagian dari infrastruktur pengujian.

source: The tests in the openstack infrastructure are triggered by jobs defined in each repo ``zuul.d`` folder.
de: Die Tests in der Openstack-Infrastruktur werden durch Jobs ausgelöst, die in jedem Repo ``zuul.d``-Ordner definiert sind.
id: Pengujian dalam infrastruktur openstack dipicu oleh pekerjaan yang ditentukan dalam setiap folder ``zuul.d``.

source: The tests repository is the location for common code used in the integrated repo and role repos tests.
de: Das Test-Repository ist der Speicherort für den gemeinsamen Code, der in den integrierten Repo- und Rollen-Repo-Tests verwendet wird.
id: Repositori tes adalah lokasi untuk kode umum yang digunakan dalam repo terintegrasi dan tes repositori peran.

source: The triaging process is explained here below.
de: Der Triage-Vorgang wird nachfolgend erläutert.
id: Proses triaging dijelaskan di bawah ini.

source: The variables files in a role are split in 3 locations:
de: Die Variablendateien in einer Rolle sind in drei Bereiche unterteilt:
id: File variabel dalam sebuah peran dibagi dalam 3 lokasi:

source: The variables with lower priority should be in the `defaults/main.yml`. This allows their overriding with group variables or host variables. A good example for this are default database connection details, default queues connection details, or debug mode.
de: Die Variablen mit niedrigerer Priorität sollten in `defaults/main.yml` stehen. Dies ermöglicht ihr Überschreiben mit Gruppenvariablen oder Hostvariablen. Ein gutes Beispiel hierfür sind Standard-Datenbankverbindungsdetails, Verbindungsdetails für Standardwarteschlangen oder Debug-Modus.
id: Variabel dengan prioritas lebih rendah harus dalam `defaults/main.yml`. Ini memungkinkan pengesampingannya dengan variabel grup atau variabel host. Contoh yang baik untuk ini adalah detail koneksi database default, detail koneksi antrian default, atau mode debug.

source: There should be no difference between running tests in the openstack infrastructure, versus running locally.
de: Es sollte keinen Unterschied zwischen dem Ausführen von Tests in der Openstack-Infrastruktur und dem lokalen Ausführen geben.
id: Seharusnya tidak ada perbedaan antara menjalankan tes dalam infrastruktur openstack, dibandingkan menjalankan secara lokal.

source: They have made a long-term, recurring time investment to improve the project.
de: Sie haben eine langfristige, wiederkehrende Zeit investiert, um das Projekt zu verbessern.
id: Mereka telah melakukan investasi jangka panjang dan berulang untuk meningkatkan proyek.

source: They share responsibility in the project's success in its `mission`_.
de: Sie teilen die Verantwortung für den Erfolg des Projekts in seiner `mission`_.
id: Mereka berbagi tanggung jawab dalam keberhasilan proyek dalam `mission`_.

source: They spend their time doing what needs to be done to ensure the project's success, not necessarily what is the most interesting or fun.
de: Sie verbringen ihre Zeit mit dem, was getan werden muss, um den Erfolg des Projekts sicherzustellen, nicht unbedingt, was am interessantesten oder amüsant ist.
id: Mereka menghabiskan waktu melakukan apa yang perlu dilakukan untuk memastikan keberhasilan proyek, tidak harus apa yang paling menarik atau menyenangkan.

source: They value a healthy, vibrant, and active developer and user community.
de: Sie schätzen eine gesunde, lebendige und aktive Entwickler- und Benutzergemeinschaft.
id: Mereka menghargai komunitas pengembang dan pengguna yang sehat, bersemangat, dan aktif.

source: This can be done using the ``new-release`` command, and then editing the SHA used for openstack-ansible. See also `new_releases page`_ for an explanation of this command.
id: Ini dapat dilakukan dengan menggunakan perintah ``new-release``, dan kemudian mengedit SHA yang digunakan untuk openstack-ansible. Lihat juga `new_releases page`_ untuk penjelasan tentang perintah ini.

source: This can do multiple things:
id: Ini dapat melakukan banyak hal:

source: This document should help you understand how to contribute to OpenStack-Ansible.
de: Dieses Dokument soll Ihnen helfen zu verstehen, wie Sie zu OpenStack-Ansible beitragen können.
id: Dokumen ini akan membantu Anda memahami bagaimana berkontribusi pada OpenStack-Ansible.

source: This doesn't patch the ``global-requirements-pins``, as this should be a manual operation. See the :ref:`cycle-checklist` to know when to bump the global-requirements-pins.
id: Ini tidak mem-patch ``global-requirements-pins``, karena ini harus operasi manual. Lihat :ref:`cycle-checklist` untuk mengetahui kapan harus menabrak pin persyaratan global.

source: This folder contains at least the following files:
de: Dieser Ordner enthält mindestens die folgenden Dateien:
id: Folder ini mengandung setidaknya file-file berikut:

source: This guide may be built locally by executing:
de: Dieses Handbuch kann lokal erstellt werden, indem Sie Folgendes ausführen:
id: Panduan ini dapat dibuat secara lokal dengan menjalankan:

source: This repository contains all the information concerning large bodies of work done in OpenStack-Ansible, split by cycle.
de: Dieses Repository enthält alle Informationen zu großen Arbeitsbereichen, die in OpenStack-Ansible nach Zyklus aufgeteilt wurden.
id: Repositori ini berisi semua informasi mengenai kumpulan besar pekerjaan yang dilakukan di OpenStack-Ansible, dibagi berdasarkan siklus.

source: This repository is an incubator for new projects, each project solving a particular operational problem. Each project has its own folder in this repository.
de: Dieses Repository ist ein Inkubator für neue Projekte, wobei jedes Projekt ein bestimmtes operatives Problem löst. Jedes Projekt hat einen eigenen Ordner in diesem Repository.
id: Repositori ini adalah inkubator untuk proyek baru, masing-masing proyek menyelesaikan masalah operasional tertentu. Setiap proyek memiliki foldernya sendiri di repositori ini.

source: This tooling can then be called using ``osa releases``. Each subcommand contains help by default.
id: Tooling ini kemudian dapat dipanggil menggunakan ``osa releases``. Setiap subcommand mengandung bantuan secara default.

source: This wishlist bug has been open a year without any activity. I am moving this to "Opinion / Wishlist". This is an easily-obtainable queue of older requests. This bug can be reopened (set back to "New") if someone decides to work on this.
de: Dieser Wunschliste-Bug wurde ein Jahr lang ohne Aktivität geöffnet. Ich ziehe das auf "Opinion/Wishlist". Dies ist eine leicht erhältliche Warteschlange für ältere Anfragen. Dieser Fehler kann wieder geöffnet werden (zurück auf "New"), wenn sich jemand dazu entschließt, daran zu arbeiten.
id: Bug wishlist ini telah dibuka setahun tanpa aktivitas apa pun. Saya memindahkan ini ke "Opini / Wishlist". Ini adalah antrian permintaan lama yang mudah diperoleh. Bug ini dapat dibuka kembali (disetel kembali ke "New") jika seseorang memutuskan untuk mengerjakan ini.

source: To facilitate the development and tests implemented across all OpenStack-Ansible roles, a base set of folders and files need to be implemented. A base set of configuration and test facilitation scripts must include at least the following:
de: Um die Entwicklung und die Tests aller OpenStack-Ansible-Rollen zu erleichtern, muss ein Basissatz von Ordnern und Dateien implementiert werden. Ein Basissatz von Skripts zur Konfiguration und zur Testunterstützung muss mindestens Folgendes enthalten:
id: Untuk memfasilitasi pengembangan dan pengujian yang diterapkan di semua peran OpenStack-Ansible, sekumpulan folder dan file perlu diimplementasikan. Sepasang skrip konfigurasi dan fasilitasi uji dasar harus mencakup setidaknya yang berikut:

source: To help triaging bugs, one person of the bug team can be on "bug skimming duty".
de: Um Bugs zu lösen, kann eine Person des Bug-Teams ``Bug Skimming Duty`` sein.
id: Untuk membantu triaging bug, satu orang dari tim bug dapat aktif "bug skimming duty".

source: To meet these needs developers must submit :ref:`code comments<codecomments>`, documentation (see also the :ref:`documentation locations section<docslocations>`) and :ref:`release notes<reno>` with any code submissions.
de: Um diese Anforderungen zu erfüllen, müssen Entwickler Folgendes einreichen :ref:`code comments<codecomments>`, Dokumentation (siehe auch Abschnitt :ref:`documentation locations section<docslocations>`) und :ref:`release notes<reno>` mit irgendwelchen Code-Einreichungen.
id: Untuk memenuhi kebutuhan ini, pengembang harus menyerahkan :ref:`code comments <codecomments>`, dokumentasi (lihat juga :ref:`documentation locations section<docslocations>`) dan :ref:`release notes <reno>` dengan pengiriman kode apa pun .

source: To run a functional test named "calico", execute:
id: Untuk menjalankan tes fungsional bernama "calico", jalankan:
