Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: de, id

source: Before starting with the upgrade, perform preflight health checks to ensure your environment is stable. If any of those checks fail, ensure that the issue is resolved before continuing.
id: Sebelum memulai dengan upgrade, lakukan pemeriksaan kesehatan preflight untuk memastikan lingkungan Anda stabil. Jika salah satu dari pemeriksaan itu gagal, pastikan bahwa masalah tersebut diselesaikan sebelum melanjutkan.

source: Being familiar with running ad-hoc Ansible commands is helpful when operating your OpenStack-Ansible deployment. For a review, we can look at the structure of the following ansible command:
id: Menjadi terbiasa dengan menjalankan ad-hoc Ansible commands sangat membantu saat mengoperasikan penyebaran OpenStack-Ansible Anda. Untuk ulasan, kita dapat melihat struktur dari perintah berikut yang mungkin:

source: Change to the playbooks directory to simplify the CLI commands from here on in the procedure, given that most playbooks executed are in this directory.
id: Ubah ke direktori playbook untuk menyederhanakan perintah CLI dari sini dalam prosedur, mengingat sebagian besar playbook yang dieksekusi ada di direktori ini.

source: Check ``br-vxlan`` interface on Compute and ``eth10`` inside the Neutron network agent container.
id: Periksa antarmuka ``br-vxlan`` pada Compute dan ``eth10`` di dalam kontainer agen jaringan Neutron.

source: For more information on generic OpenStack firewall configuration, see the `Firewalls and default ports <https://docs.openstack.org/install-guide/firewalls-default-ports.html>`_
id: Untuk informasi lebih lanjut tentang konfigurasi firewall OpenStack generik, lihat `Firewalls and default ports <https://docs.openstack.org/install-guide/firewalls-default-ports.html>`_

source: For upgrades between major versions, the OpenStack-Ansible repository provides playbooks and scripts to upgrade an environment. The ``run-upgrade.sh`` script runs each upgrade playbook in the correct order, or playbooks can be run individually if necessary. Alternatively, a deployer can upgrade manually.
id: Untuk upgrade di antara versi utama, repositori OpenStack-Ansible menyediakan playbooks dan skrip untuk upgrade suatu lingkungan. Skrip `run-upgrade.sh`` menjalankan setiap playbook upgrade dalam urutan yang benar, atau playbook dapat dijalankan secara individual jika perlu. Atau, seorang deployer dapat upgrade secara manual.

source: IP address should be applied to eth10 inside the required LXC containers:
id: Alamat IP harus digunakan pada eth10 di dalam kontainer LXC yang diperlukan:

source: If there have been any OSA variable name changes or environment/inventory changes, there is a playbook to handle those changes to ensure service continuity in the environment when the new playbooks run. The playbook is tagged to ensure that any part of it can be executed on its own or skipped. Please review the contents of the playbook for more information.
id: Jika ada perubahan nama variabel OSA atau perubahan lingkungan/inventaris, ada buku pedoman untuk menangani perubahan itu untuk memastikan kesinambungan layanan di lingkungan saat buku pedoman baru dijalankan. Playbook ini ditandai untuk memastikan bahwa setiap bagian dari itu dapat dieksekusi sendiri atau dilewati. Harap tinjau isi buku pedoman untuk informasi lebih lanjut.

source: If you need to run a particular command against a subset of a group, you could use the limit flag ``-l``. For example, if a ``compute_hosts`` group contained ``compute1``, ``compute2``, ``compute3``, and ``compute4``, and you only needed to execute a command on ``compute1`` and ``compute4`` you could limit the command as follows:
id: Jika Anda perlu menjalankan perintah tertentu terhadap subset grup, Anda bisa menggunakan flag batas `` -l``. Misalnya, jika grup ``compute_hosts`` berisi `` compute1``, `` compute2``, `` compute3``, dan ``compute4``, dan Anda hanya perlu menjalankan perintah pada ``compute1` ` dan ` `compute4`` Anda dapat membatasi perintah sebagai berikut:

source: Implement changes to OSA configuration
id: Terapkan perubahan pada konfigurasi OSA

source: In each of the role's respective documentatione you can find the default variables for the ports used within the scope of the role. Reviewing the documentation allow you to find the variable names if you want to use a different port.
id: Di setiap dokumentasi peran masing-masing, Anda dapat menemukan variabel default untuk port yang digunakan dalam lingkup peran. Meninjau dokumentasi memungkinkan Anda menemukan nama variabel jika Anda ingin menggunakan port yang berbeda.

source: It is possible to do mass pruning of the inventory backup. The following example will prune all but the last 15 inventories from the running archive.
id: Dimungkinkan untuk melakukan pemangkasan massal backup inventaris. Contoh berikut akan memangkas semua kecuali 15 inventaris terakhir dari arsip yang sedang berjalan.

source: Kernel version
id: Versi kernel

source: Modules can be used to control system resources or handle the execution of system commands. For more information about modules, see `Module Index <https://docs.ansible.com/ansible/modules_by_category.html>`_ and `About Modules <https://docs.ansible.com/ansible/modules.html>`_.
id: Modul dapat digunakan untuk mengontrol sumber daya sistem atau menangani eksekusi perintah sistem. Untuk informasi lebih lanjut tentang modul, lihat `Module Index <https://docs.ansible.com/ansible/modules_by_category.html>`_ dan `About Modules <https://docs.ansible.com/ansible/modules.html>`_.

source: Once that is complete, upgrade the final host groups with the flag to prevent container restarts.
id: Setelah selesai, upgrade grup host terakhir dengan flag untuk mencegah restart kontainer.

source: OpenStack-Ansible does not configure firewalls for its infrastructure. It is up to the deployer to define the perimeter and its firewall configuration.
id: OpenStack-Ansible tidak mengkonfigurasi firewall untuk infrastrukturnya. Terserah deployer untuk menentukan perimeter dan konfigurasi firewallnya.

source: Tags are similar to the limit flag for groups, except tags are used to only run specific tasks within a playbook. For more information on tags, see `Tags <http://ansible-docs.readthedocs.io/zh/stable-2.0/rst/playbooks_tags.html>`_ and `Understanding ansible tags <http://www.caphrim.net/ansible/2015/05/24/understanding-ansible-tags.html>`_.
id: Tag mirip dengan flag batas untuk grup, kecuali tag digunakan untuk hanya menjalankan tugas tertentu dalam sebuah playbook. Untuk informasi lebih lanjut tentang tag, lihat `Tags <http://ansible-docs.readthedocs.io/zh/stable-2.0/rst/playbooks_tags.html>`_ dan `Understanding ansible tags <http://www.caphrim.net/ansible/2015/05/24/understanding-ansible-tags.html>`_.

source: The ``container_bridge`` setting defines the physical network bridge used to connect the veth pair from the physical host to the container. Inside the container, the ``container_interface`` setting defines the name at which the physical network will be made available. The ``container_interface`` setting is not required when Neutron agents are deployed on bare metal. Make sure that both settings are uniquely defined across their provider networks and that the network interface is correctly configured inside your operating system. ``group_binds`` define where this network need to attached to, to either containers or physical hosts and is ultimately dependent on the network stack in use. For example, Linuxbridge versus OVS. The configuration ``range`` defines Neutron physical segmentation IDs which are automatically used by end users when creating networks via mainly horizon and the Neutron API. Similar is true for the ``net_name`` configuration which defines the addressable name inside the Neutron configuration. This configuration also need to be unique across other provider networks.
id: Pengaturan ``container_bridge`` menentukan jembatan jaringan (network bridge) fisik yang digunakan untuk menghubungkan pasangan veth dari host fisik ke container. Di dalam container, pengaturan ``container_interface`` menentukan nama di mana jaringan fisik akan tersedia. Pengaturan ``container_interface`` tidak diperlukan saat agen Neutron digunakan pada bare metal. Pastikan kedua pengaturan didefinisikan secara unik di seluruh jaringan penyedia mereka dan antarmuka jaringan dikonfigurasi dengan benar di dalam sistem operasi Anda. ``group_binds`` menentukan ke mana jaringan ini harus dihubungkan (attached), ke container atau host fisik dan pada akhirnya tergantung pada tumpukan jaringan (network stack) yang digunakan. Misalnya, Linuxbridge versus OVS. Konfigurasi ``range`` mendefinisikan ID segmentasi fisik Neutron yang secara otomatis digunakan oleh pengguna akhir (end user) saat membuat jaringan melalui horizon utama dan API Neutron. Mirip dengan true untuk konfigurasi ``net_name`` yang mendefinisikan nama addressable di dalam konfigurasi Neutron. Konfigurasi ini juga harus unik di seluruh jaringan penyedia lainnya.

source: The ``glance-registry`` handles the database operations for managing the storage of the image index and properties. The ``glance-api`` handles the API interactions and image store.
id: ``glance-registry`` menangani operasi basis data untuk mengelola penyimpanan image indeks dan properti. ``glance-api`` menangani interaksi API dan penyimpanan image.

source: The copy module copies a file on a local machine to remote locations. To copy files from remote locations to the local machine you would use the fetch module. If you need variable interpolation in copied files, use the template module. For more information, see `copy - Copies files to remote locations <https://docs.ansible.com/ansible/copy_module.html>`_.
id: Modul salin menyalin file di mesin lokal ke lokasi terpencil. Untuk menyalin file dari lokasi yang jauh ke mesin lokal Anda akan menggunakan modul fetch. Jika Anda membutuhkan interpolasi variabel dalam file yang disalin, gunakan modul template. Untuk informasi lebih lanjut, lihat `copy - Copies files to remote locations <https://docs.ansible.com/ansible/copy_module.html>`_.

source: The fetch module gathers files from remote machines and stores the files locally in a file tree, organized by the hostname from remote machines and stores them locally in a file tree, organized by hostname.
id: Modul fetch mengumpulkan file dari mesin jarak jauh dan menyimpan file secara lokal di file tree, yang diatur oleh nama host dari mesin jarak jauh dan menyimpannya secara lokal di file tree, yang diatur oleh nama host.

source: This command calls on Ansible to run the ``example_group`` using the ``-m`` shell module with the ``-a`` argument which is the hostname command. You can substitute example_group for any groups you may have defined. For example, if you had ``compute_hosts`` in one group and ``infra_hosts`` in another, supply either group name and run the command. You can also use the ``*`` wild card if you only know the first part of the group name, for instance if you know the group name starts with compute you would use ``compute_h*``. The ``-m`` argument is for module.
id: Perintah ini memanggil Ansible untuk menjalankan ``example_group`` menggunakan modul shell `` -m`` dengan argumen `` -a`` yang merupakan perintah nama host. Anda dapat mengganti example_group dengan grup apa pun yang mungkin telah Anda tentukan. Misalnya, jika Anda memiliki `` compute_hosts`` dalam satu grup dan `` infra_hosts`` di yang lain, masukkan salah satu nama grup dan jalankan perintah. Anda juga dapat menggunakan wild card `` * `` jika Anda hanya tahu bagian pertama dari nama grup, misalnya jika Anda tahu nama grup dimulai dengan compute Anda akan menggunakan ``compute_h * ``. Argumen ``-m`` adalah untuk modul.

source: This command is the same setting up hosts on a new installation. The ``galera_all`` and ``rabbitmq_all`` host groups are excluded to prevent reconfiguration and restarting of any of those containers as they need to be updated, but not restarted.
id: Perintah ini sama mengatur host pada instalasi baru. Grup host ``galera_all`` dan ``rabbitmq_all`` dikecualikan untuk mencegah konfigurasi ulang dan memulai kembali container mana pun karena perlu diperbarui, tetapi tidak dimulai kembali.

source: To ensure that there is no currently set ANSIBLE_INVENTORY to override the default inventory location, we unset the environment variable.
id: Untuk memastikan bahwa saat ini tidak ada yang menetapkan ANSIBLE_INVENTORY untuk mengganti lokasi inventaris default, kami membatalkan variabel lingkungan.

source: To prune the inventory archive selectively, first identify the files you wish to remove by listing them out.
id: Untuk memangkas arsip inventaris secara selektif, kenali dulu file yang ingin Anda hapus dengan mencantumkannya.

source: To troubleshoot problems or errors with the Image service, refer to :file:`/var/log/glance-api.log` and :file:`/var/log/glance-registry.log` inside the glance api container.
id: Untuk memecahkan masalah atau kesalahan dengan layanan Image, lihat :file:`/var/log/glance-api.log` dan :file:`/var/log/glance-registry.log` di dalam kontainer glance api.

source: With Ansible, the OpenStack installation process is entirely automated using playbooks written in YAML. After installation, the settings configured by the playbooks can be changed and modified. Services and containers can shift to accommodate certain environment requirements. Scaling services are achieved by adjusting services within containers, or adding new deployment groups. It is also possible to destroy containers, if needed, after changes and modifications are complete.
id: Dengan Ansible, proses instalasi OpenStack sepenuhnya otomatis menggunakan playbooks yang ditulis dalam YAML. Setelah instalasi, pengaturan yang dikonfigurasikan oleh playbook dapat diubah dan dimodifikasi. Layanan dan kontainer dapat bergeser untuk mengakomodasi persyaratan lingkungan tertentu. Layanan penskalaan dicapai dengan menyesuaikan layanan di dalam kontainer, atau menambahkan grup penempatan baru. Dimungkinkan juga untuk menghancurkan kontainer, jika perlu, setelah perubahan dan modifikasi selesai.

source: You can provide this script with extra tasks that will be executed before or right after OSA roles. To do so you should set environment variables ``PRE_OSA_TASKS`` or ``POST_OSA_TASKS`` with plays to run devided with semicolon:
id: Anda dapat memberikan skrip ini tugas tambahan yang akan dieksekusi sebelum atau tepat setelah peran OSA. Untuk melakukannya, Anda harus mengatur variabel lingkungan ``PRE_OSA_TASKS`` atau ``POST_OSA_TASKS`` dengan memainkan untuk menjalankan dibagi dengan titik koma (semicolon):

source: ``br-vxlan`` should contain veth-pair ends from required LXC containers and a physical interface or tagged-subinterface:
id: ``br-vxlan`` harus berisi veth-pair end dari kontainer LXC yang diperlukan dan antarmuka fisik atau tagged-subinterface:
