Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-contributor.po
Languages: de, id

source: "Bug triage is a process where tracker issues are screened and prioritised. Triage should help ensure we appropriately manage all reported issues - bugs as well as improvements and feature requests." (Source: `Moodle bug triage`_)
de: "Bug Triage ist ein Prozess, bei dem Tracker-Probleme überprüft und priorisiert werden. Triage sollte dazu beitragen, dass wir alle gemeldeten Probleme - Bugs sowie Verbesserungen und Feature-Anfragen - angemessen verwalten." (Quelle: `Moodle Bug Triage`_)
id: "Bug triage adalah proses di mana masalah pelacak disaring dan diprioritaskan. Triage harus membantu memastikan kami mengelola dengan tepat semua issues - bug yang dilaporkan serta peningkatan dan permintaan fitur." (Source: `Moodle bug triage`_)

source: A consolidated set of all lint tests may be done locally by executing:
de: Ein konsolidierter Satz aller Linttests kann lokal ausgeführt werden, indem Folgendes ausgeführt wird:
id: Serangkaian semua tes lint dapat dilakukan secara lokal dengan menjalankan:

source: A core reviewer's responsibility doesn't end with merging code.
de: Die Verantwortung eines Core-Reviewers endet nicht mit dem Zusammenführen von Code.
id: Tanggung jawab peninjau inti tidak berakhir dengan menggabungkan kode.

source: A description of how these work can be found in :ref:`inventory-confd` and :ref:`inventory-envd`.
de: Eine Beschreibung dieser Arbeit finden Sie in :ref:`inventory-confd` und :ref:`inventory-envd`.
id: Deskripsi tentang cara kerja ini dapat ditemukan di :ref:`inventory-confd` dan :ref:`inventory-envd`.

source: A feature release note must be added to announce the new service availability and to refer to the role documentation for further details. This content must adhere to the :ref:`documentation`.
de: Eine Feature-Release-Notiz muss hinzugefügt werden, um die neue Serviceverfügbarkeit anzukündigen und für weitere Details auf die Rollendokumentation zu verweisen. Dieser Inhalt muss den folgenden Regeln entsprechen :ref:`documentation`.
id: Catatan rilis fitur harus ditambahkan untuk mengumumkan ketersediaan layanan baru dan untuk merujuk ke dokumentasi peran untuk rincian lebih lanjut. Konten ini harus mematuhi :ref:`documentation`.

source: A member of the OpenStack-Ansible community should monitor the **OpenStack-discuss** `mailing lists`_.
de: Ein Mitglied der OpenStack-Ansible-Community sollte die **OpenStack-discuss** `mailing lists`_ überwachen.
id: Seorang anggota komunitas OpenStack-Ansible harus memantau **OpenStack-discuss** `mailing lists`_.

source: A new project in "openstack-ansible-ops" can be started at any time, with no constraint like writing a specification, or creating a bug.
de: Ein neues Projekt in ``openstack-ansible-ops`` kann jederzeit gestartet werden, ohne Einschränkungen wie das Schreiben einer Spezifikation oder das Erstellen eines Fehlers.
id: Proyek baru dalam "openstack-ansible-ops" dapat dimulai kapan saja, tanpa kendala seperti menulis spesifikasi, atau membuat bug.

source: A role can be ``Incubated`` for maximum 2 cycles.
de: Eine Rolle kann für maximal 2 Zyklen ``Inkubiert`` werden.
id: Peran dapat ``Incubated`` untuk maksimum 2 siklus.

source: A role can be in one of the four maturity levels:
de: Eine Rolle kann in einer der vier Reifegrade sein:
id: Peran dapat berada dalam salah satu dari empat tingkat kematangan:

source: A role can be retired at any time if it is not relevant anymore.
de: Eine Rolle kann jederzeit zurückgezogen werden, wenn sie nicht mehr relevant ist.
id: Suatu peran dapat dihentikan kapan saja jika tidak relevan lagi.

source: A role in ``Complete`` status can be downgraded to ``Unmaintained``. status, according to the maturity downgrade procedure.
de: Eine Rolle im `Complete`` Status kann zu` `Unmaintained`` degradiert werden. Status, gemäß dem Reifegradherabstufungsverfahren.
id: Peran dalam status ``Complete`` dapat diturunkan ke status ``Unmaintained``, sesuai dengan prosedur penurunan versi jatuh tempo.

source: A role may be fully mature, even if it is not integrated in the ``openstack-ansible`` repository. The maturity depends on its testing levels.
de: Eine Rolle kann vollständig ausgereift sein, auch wenn sie nicht in das Repository ``openstack-ansible`` integriert ist. Die Reife hängt von den Teststufen ab.
id: Peran mungkin sepenuhnya matang, bahkan jika itu tidak terintegrasi dalam repositori ``openstack-ansible``. Kematangan tergantung pada tingkat pengujiannya.

source: A tag including the word ``config`` prepares the configuration of the software (adapted to your needs), and all the components necessary to run the service(s) configured in the role. Running a playbook with ``--tags <role>-config`` is only possible if the target already ran the tags ``<role>-install``.
de: Ein Tag mit dem Wort ``config`` bereitet die Konfiguration der Software vor (angepasst an Ihre Bedürfnisse) und alle Komponenten, die notwendig sind, um die in der Rolle konfigurierten Dienste auszuführen. Ein Playbook mit ``-Tags <role> -config`` laufen lassen ist nur möglich, wenn das Ziel bereits die Tags ``<role> -install`` ausgeführt hat.
id: Sebuah tag termasuk kata ``config`` menyiapkan konfigurasi perangkat lunak (disesuaikan dengan kebutuhan Anda), dan semua komponen yang diperlukan untuk menjalankan layanan yang dikonfigurasi dalam peran. Menjalankan buku pedoman dengan ``--tags <role> -config`` hanya dimungkinkan jika target sudah menjalankan tag ``<role> -install``.

source: A tag including the word ``install`` handles software installation tasks. Running a playbook with ``--tags <role>-install`` only deploys the necessary software on the target, and will not configure it to your needs or run any service.
de: Ein Tag, der das Wort ``install`` enthält, behandelt Softwareinstallationsaufgaben. Ein Playbook mit ``-Tags laufen lassen <role>-install`` stellt nur die erforderliche Software auf dem Ziel bereit und konfiguriert es nicht für Ihre Bedürfnisse oder führt keinen Dienst aus.
id: Sebuah tag termasuk kata ``install`` menangani tugas-tugas instalasi perangkat lunak. Menjalankan buku pedoman dengan ``--tags <role> -install`` hanya menyebarkan perangkat lunak yang diperlukan pada target, dan tidak akan mengkonfigurasinya sesuai kebutuhan Anda atau menjalankan layanan apa pun.

source: A tag including the word ``upgrade`` handles all the upgrade tasks.
de: Ein Tag mit dem Wort ``upgrade`` behandelt alle Upgrade-Aufgaben.
id: Tag termasuk kata ``upgrade`` menangani semua tugas pemutakhiran.

source: Actively reviewing patch submissions, considering whether the patch: - is functional - fits the use-cases and vision of the project - is complete in terms of testing, documentation, and release notes - takes into consideration upgrade concerns from previous versions
de: Das aktive Überprüfen von Patch-Übergaben, ob der Patch: - funktional ist - den Anwendungsfällen und der Vision des Projekts entspricht - in Bezug auf Tests, Dokumentation und Versionshinweise vollständig ist - berücksichtigt Upgrade-Probleme von früheren Versionen
id: Secara aktif meninjau pengiriman patch, dengan mempertimbangkan apakah apakah patch: - fungsional - cocok dengan kasus penggunaan dan visi proyek - lengkap dalam hal pengujian, dokumentasi, dan catatan rilis - mempertimbangkan pertimbangan peningkatan masalah dari versi sebelumnya

source: Add a new non-voting job in ``zuul.d/jobs.yaml``, and wire it in the project tests file ``zuul.d/project.yaml``.
de: Fügen Sie einen neuen Job ohne Abstimmungen in ``zuul.d/jobs.yaml`` hinzu und verbinden Sie ihn in der Projekttestdatei `` zuul.d/project.yaml``.
id: Tambahkan pekerjaan non-voting baru di ``zuul.d/jobs.yaml``, dan kirimkan ke file tes proyek ``zuul.d/project.yaml``.

source: Add an extra role test scenario, to ensure your code path is tested and working.
de: Fügen Sie ein zusätzliches Rollen-Testszenario hinzu, um sicherzustellen, dass Ihr Code-Pfad getestet wird und funktioniert.
id: Tambahkan skenario uji peran tambahan, untuk memastikan jalur kode Anda diuji dan berfungsi.

source: Add tests to the role. See also our :ref:`tests` page.
de: Fügen Sie der Rolle Tests hinzu. Siehe auch unsere Seite :ref:`tests`.
id: Tambahkan tes ke peran. Lihat juga halaman kami :ref:`tests`.

source: Adding patch in releases repo
id: Menambahkan patch dalam rilis repo

source: Adding tests to a new role
de: Hinzufügen von Tests zu einer neuen Rolle
id: Menambahkan tes ke peran baru

source: After creating a new stable branch:
id: Setelah membuat branch stabil baru:

source: After milestone 3:
de: Nach Meilenstein 3:
id: Setelah milestone 3:

source: After official project release, before official OpenStack-Ansible release:
id: Setelah rilis proyek resmi, sebelum rilis resmi OpenStack-Ansible:

source: All Core reviewer duties are described on the page :dev_docs:`Core Reviewers <contributor/core-reviewers.html>`.
id: Semua tugas reviewer Core dijelaskan di halaman:dev_docs:`Core Reviewers <contributor/core-reviewers.html>`.

source: All blueprints/specs should be voted on and approved by core reviewers before any associated code will be merged. For more information on blueprints/specs please review the OpenStack documentation regarding `Working on Specifications and Blueprints`_ and our own :ref:`specs`.
de: Alle Blueprints/Spezifikationen sollten abgestimmt und von Core-Reviewern genehmigt werden, bevor der zugehörige Code zusammengeführt wird. Für weitere Informationen zu Blueprints/Spezifikationen lesen Sie bitte die OpenStack-Dokumentation bezüglich `Working on Specifications and Blueprints`_ und unsere eigenen :ref:`specs`.
id: Semua blueprints/specs harus dipilih dan disetujui oleh pengulas inti sebelum kode terkait akan digabungkan. Untuk informasi lebih lanjut tentang blueprints/specs, silakan baca dokumentasi OpenStack mengenai `Working on Specifications and Blueprints`_ dan milik kami sendiri :ref:`specs`.

source: All changes should be clearly listed in the commit message, with an associated bug id/blueprint along with any extra information where applicable.
de: Alle Änderungen sollten in der Commit-Nachricht mit einer zugehörigen Bug-ID/Blueprint zusammen mit zusätzlichen Informationen klar aufgeführt werden, wo zutreffend.
id: Semua perubahan harus secara jelas tercantum dalam pesan komit, dengan id/blueprint bug terkait bersama dengan informasi tambahan apa pun yang berlaku.

source: All code requires to go through our :ref:`reviews`.
de: Der gesamte Code erfordert, dass Sie unsere :ref:`reviews` durchlaufen.
id: Semua kode harus melalui kode kami :ref:`reviews`.

source: All code should match our :ref:`codeguidelines`.
de: Der gesamte Code sollte zu unserem :ref:`codeguidelines` passen.
id: Semua kode harus sesuai dengan kode kami :ref:`codeguidelines`.

source: All common PTL duties are enumerated in the `PTL guide <https://docs.openstack.org/project-team-guide/ptl.html>`_.
id: Semua tugas PTL umum disebutkan dalam `PTL guide <https://docs.openstack.org/project-team-guide/ptl.html>`_.

source: All forms of documentation should comply with the guidelines provided in the `OpenStack Documentation Contributor Guide`_, with particular reference to the following sections:
de: Alle Arten von Dokumentationen sollten den Richtlinien im `OpenStack Documentation Contributor Guide`_ entsprechen, mit besonderem Bezug auf die folgenden Abschnitte:
id: Semua bentuk dokumentasi harus mematuhi pedoman yang disediakan dalam `OpenStack Documentation Contributor Guide`_, dengan referensi khusus ke bagian-bagian berikut:

source: All large feature additions/deletions should be accompanied by a blueprint/spec. e.g. adding additional active agents to neutron, developing a new service role, etc... See also :ref:`specs`.
de: Alle großen Hinzufügungen/Löschungen von Features sollten von einem Blueprint/Spec begleitet werden. z.B. Hinzufügen neuer aktiver Agenten zu Neutron, Entwickeln einer neuen Service-Rolle, etc ... Siehe auch :ref:`specs`.
id: Semua additions/deletions fitur besar harus disertai dengan blueprint/spec. misalnya menambahkan agen aktif tambahan ke neutron, mengembangkan peran layanan baru, dll ... Lihat juga :ref:`specs`.

source: All of our core team is available through IRC and present in #openstack-ansible channel on Freenode. The list of the current members of the OpenStack-Ansible Team might be found on `gerrit`_.
id: Semua tim inti kami tersedia melalui IRC dan hadir di saluran # openstack-ansible di Freenode. Daftar anggota Tim OpenStack-Ansible saat ini dapat ditemukan di `gerrit`_.

source: All of the OpenStack-Ansible roles do not have the same level of maturity and testing.
de: Alle OpenStack-Ansible-Rollen haben nicht den gleichen Reifegrad und Test.
id: Semua peran OpenStack-Ansible tidak memiliki tingkat kematangan dan pengujian yang sama.

source: All our communications should be prefixed with **[openstack-ansible]**.
de: All unseren Mitteilungen sollte das Präfix **[openstack-ansible]** vorangestellt werden.
id: Semua komunikasi kita harus diawali dengan **[openstack-ansible]**.

source: All patch sets should adhere to the :ref:`Ansible Style Guide` listed here as well as adhere to the `Ansible best practices`_ when possible.
de: Alle Patch-Sets sollten sich an den hier aufgelisteten :ref:`Ansible Style Guide` halten und, wenn möglich, den `Ansible best practices`_ folgen.
id: Semua set patch harus mematuhi :ref:`Ansible Style Guide` yang tercantum di sini dan juga mematuhi `Ansible best practices`_ bila memungkinkan.

source: All patches including code, documentation and release notes should be built and tested locally with the appropriate test suite before submitting for review. See :ref:`Development and Testing<devel_and_testing>` for more information.
de: Alle Patches einschließlich Code, Dokumentation und Versionshinweise sollten vor dem Einreichen zur Überprüfung lokal mit der entsprechenden Testsuite erstellt und getestet werden. Siehe :ref:`Development and Testing<devel_and_testing>` für mehr Informationen.
id: Semua patch termasuk kode, dokumentasi, dan catatan rilis harus dibuat dan diuji secara lokal dengan suite pengujian yang sesuai sebelum mengirimkan untuk ditinjau. Lihat :ref:`Development and Testing<devel_and_testing>` untuk informasi lebih lanjut.

source: Also called *integrated repository*
de: Auch als *integriertes Repository*
id: Disebut juga *integrated repository*

source: Also you may find more detailed information about how to work with bugs on the page :dev_docs:`Bug Handling <contributor/bugs.html>`
id: Anda juga dapat menemukan informasi lebih rinci tentang cara bekerja dengan bug di halaman :dev_docs:`Bug Handling <contributor/bugs.html>`

source: Alternatively, you can check the :ref:`aio guide<quickstart-aio>`, or even run the gate wrapper script, named ``scripts/gate-check-commit.sh``, described below.
de: Alternativ können Sie den :ref:`aio guide <quickstart-aio>` lesen, oder führen Sie sogar das Gate-Wrapper-Skript mit dem Namen ``scripts/gate-check-commit.sh``, wie unten beschrieben, aus.
id: Atau, Anda dapat memeriksa :ref:`aio guide <quickstart-aio>`, atau bahkan menjalankan skrip wrapper gate, bernama `skrip/gate-check-commit.sh``, dijelaskan di bawah ini.

source: An ``Incubated`` role that didn't implement functional testing in the six month timeframe will become ``Unmaintained``.
de: Eine ``Incubated`` -Rolle, die im sechsmonatigen Zeitrahmen keinen Funktionstest implementiert hat, wird ``nicht gepflegt``.
id: Peran ``Incubated`` yang tidak menerapkan pengujian fungsional dalam jangka waktu enam bulan akan menjadi ``Unmaintained``.

source: An ``Incubated`` role that passes functional testing will be upgraded to the ``Complete`` status, and cannot return in ``Incubated`` status.
de: Eine Rolle ``Incubated``, die den Funktionstest besteht, wird auf den Status ``Complete`` hochgestuft und kann nicht in den Status ``Incubated`` zurückkehren.
id: Peran ``Incubated`` yang melewati pengujian fungsional akan ditingkatkan ke status ``Complete``, dan tidak dapat kembali dalam status ``Incubated``.

source: Ansible Style Guide
de: Ansible-Stil Anleitung
id: Panduan Style Ansible

source: Ansible is lint tested using `ansible-lint`_.
de: Ansible wird mit `anisible-lint`_ getestet.
id: Ansible lint diuji menggunakan `ansible-lint`_.

source: Ansible playbook syntax is tested using ansible-playbook.
de: Ansible Playbook Syntax wird mit Ansible-Playbook getestet.
id: Sintaks playbook Ansible diuji menggunakan ansible-playbook.

source: Answering questions and participating in mailing list discussions
de: Beantwortung von Fragen und Teilnahme an Mailinglisten-Diskussionen
id: Menjawab pertanyaan dan berpartisipasi dalam diskusi milis

source: Any bug fix should have, in its commit message:
de: Jeder Bugfix sollte in seiner Commit-Nachricht enthalten sein:
id: Perbaikan bug apa pun harus, dalam pesan komitnya:

source: Any new OpenStack services implemented which have `Tempest`_ tests available must be implemented along with suitable functional tests enabled as part of the feature development in order to ensure that any changes to the code base do not break the service functionality.
de: Alle neuen OpenStack-Dienste, die `Tempest`_-Tests enthalten, müssen zusammen mit geeigneten Funktionstests, die im Rahmen der Feature-Entwicklung aktiviert wurden, implementiert werden, um sicherzustellen, dass Änderungen an der Codebasis die Service-Funktionalität nicht beeinträchtigen.
id: Setiap layanan OpenStack baru yang diimplementasikan yang memiliki tes `Tempest`_ tersedia harus diimplementasikan bersama dengan tes fungsional yang sesuai diaktifkan sebagai bagian dari pengembangan fitur untuk memastikan bahwa setiap perubahan pada basis kode tidak merusak fungsi layanan.

source: Any new code will be reviewed before merging into our repositories and requires at least 2 approvals from our Core team.
id: Setiap kode baru akan ditinjau sebelum bergabung ke dalam repositori kami dan memerlukan setidaknya 2 persetujuan dari tim Inti kami.

source: Any new code will be reviewed before merging into our repositories.
de: Jeder neue Code wird vor dem Zusammenführen in unsere Repositories überprüft.
id: Kode baru apa pun akan ditinjau sebelum digabungkan ke dalam repositori kami.

source: Any relevant logs or user configuration are included, either directly or through a pastebin.
de: Alle relevanten Protokolle oder Benutzerkonfigurationen sind enthalten, entweder direkt oder über eine Pastebin.
id: Semua log atau konfigurasi pengguna yang relevan disertakan, baik secara langsung atau melalui pastebin.

source: Any secrets (For example: passwords) should not be provided with default values in the tasks, role vars, or role defaults. The tasks should be implemented in such a way that any secrets required, but not provided, should result in the task execution failure. It is important for a secure-by-default implementation to ensure that an environment is not vulnerable due to the production use of default secrets. Deployers must be forced to properly provide their own secret variable values.
de: Alle geheimen Schlüssel (z.B. Kennwörter) sollten nicht mit Standardwerten in den Aufgaben-, Rollen- oder Rollenstandards versehen werden. Die Aufgaben sollten so implementiert werden, dass alle erforderlichen, jedoch nicht bereitgestellten Geheimnisse dazu führen, dass die Aufgabenausführung fehlschlägt. Es ist wichtig, dass bei einer standardsicheren Implementierung sichergestellt wird, dass eine Umgebung aufgrund der Produktionsverwendung von Standardgeheimnissen nicht anfällig ist. Deployer müssen gezwungen werden, ihre eigenen geheimen Variablenwerte ordnungsgemäß anzugeben.
id: Setiap rahasia (Misalnya: kata sandi) tidak boleh diberikan dengan nilai-nilai standar dalam tugas, peran peran, atau peran standar. Tugas harus diimplementasikan sedemikian rupa sehingga rahasia yang diperlukan, tetapi tidak disediakan, harus mengakibatkan kegagalan pelaksanaan tugas. Penting untuk implementasi yang aman secara default untuk memastikan bahwa lingkungan tidak rentan karena penggunaan produksi dari rahasia default. Pemberi kerja harus dipaksa untuk memberikan nilai variabel rahasia sendiri dengan benar.

source: Any secrets required for the role to work must be noted in the ``etc/openstack_deploy/user_secrets.yml`` file for reuse by other users.
de: Alle für die Funktion erforderlichen Geheimnisse müssen in der Datei ``etc/openstack_deploy/user_secrets.yml`` zur Wiederverwendung durch andere Benutzer vermerkt sein.
id: Setiap rahasia yang diperlukan untuk menjalankan peran harus dicatat dalam file ``etc/openstack_deploy/user_secrets.yml`` untuk digunakan kembali oleh pengguna lain.

source: Any variables needed by other roles to connect to the new role, or by the new role to connect to other roles, should be implemented in ``inventory/group_vars``. The group vars are essentially the glue which playbooks use to ensure that all roles are given the appropriate information. When group vars are implemented it should be a minimum set to achieve the goal of integrating the new role into the integrated build.
de: Alle Variablen, die von anderen Rollen benötigt werden, um sich mit der neuen Rolle zu verbinden, oder von der neuen Rolle, um eine Verbindung zu anderen Rollen herzustellen, sollten in ``inventory/group_vars`` implementiert werden. Die Gruppen-Vars sind im Wesentlichen der Leim, den Playbooks verwenden, um sicherzustellen, dass allen Rollen die entsprechenden Informationen gegeben werden. Wenn Gruppenvars implementiert werden, sollte es ein Mindestsatz sein, um das Ziel der Integration der neuen Rolle in den integrierten Build zu erreichen.
id: Setiap variabel yang dibutuhkan oleh peran lain untuk terhubung ke peran baru, atau oleh peran baru untuk terhubung ke peran lain, harus diimplementasikan dalam ``inventory/group_vars``. Vars grup pada dasarnya adalah perekat yang digunakan buku pedoman untuk memastikan bahwa semua peran diberi informasi yang sesuai. Ketika vars grup diimplementasikan, itu harus menjadi set minimum untuk mencapai tujuan mengintegrasikan peran baru ke dalam bangunan terintegrasi.

source: Are you sure nobody is working on this problem at the moment? Could there be a review pending fixing the same issue?
de: Sind Sie sicher, dass momentan niemand an diesem Problem arbeitet? Könnte es eine Überprüfung bis zum gleichen Problem geben?
id: Apakah Anda yakin tidak ada yang mengerjakan masalah ini saat ini? Mungkinkah ada ulasan yang tertunda memperbaiki masalah yang sama?

source: Assist in bug triage and delivery of bug fixes
de: Unterstützung bei der Fehlersuche und Bereitstellung von Bugfixes
id: Membantu dalam triage bug dan pengiriman perbaikan bug

source: Attend and participate in the weekly IRC meetings
de: An den wöchentlichen IRC-Treffen teilnehmen und daran mitwirken
id: Hadiri dan berpartisipasi dalam pertemuan IRC mingguan

source: Backport reviews should be done with due consideration to the effect of the patch on any existing environment deployed by OpenStack-Ansible. The general `OpenStack Guidelines for stable branches`_ can be used as a reference.
de: Backport-Überprüfungen sollten unter Berücksichtigung der Auswirkungen des Patches auf vorhandene Umgebungen, die von OpenStack-Ansible bereitgestellt werden, durchgeführt werden. Die allgemeinen `OpenStack Guidelines for stable branches`_ können als Referenz verwendet werden.
id: Ulasan Backport harus dilakukan dengan mempertimbangkan efek patch pada lingkungan yang ada yang digunakan oleh OpenStack-Ansible. Umum `OpenStack Guidelines for stable branches`_ dapat digunakan sebagai referensi.
