Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-user.po
Languages: de, id, ru

source: Good example of exceptions which do not support path-based endpoints at the moment are VNC consoles for VMs (to be implemented with `blueprint <https://blueprints.launchpad.net/nova/+spec/novnc-base-url-respect-extra-params>`_), Magnum (`bug report <https://launchpad.net/bugs/2083168>`) and Ceph Rados Gateway.
ru: Хорошим примером исключений, которые в данный момент не поддерживают точки доступа на основе путей, являются консоли VNC для виртуальных машин (будут реализованы с помощью `blueprint <https://blueprints.launchpad.net/nova/+spec/novnc-base-url-respect-extra-params>`_), Magnum (`отчет об ошибке <https://launchpad.net/bugs/2083168>`) и Ceph Rados Gateway.

source: HAProxy and Keepalived in LXC containers
ru: HAProxy и Keepalived внутри LXC контейнеров

source: HAProxy configuration
ru: Конфигурация HAProxy

source: HAProxy example
de: Beispiel für HAProxy
id: Contoh HAProxy
ru: Пример HAProxy

source: HW_ARCH_X86_64 for x86_64 Intel and AMD CPUs HW_ARCH_AARCH64 for aarch64 architecure CPUs
ru: HW_ARCH_X86_64 для процессоров архитектуры x86_64 Intel и AMD, HW_ARCH_AARCH64 для процессоров архитектуры aarch64

source: Here is a basic diagram that attempts to illustrate what the resulting AIO deployment looks like.
de: Hier ist ein grundlegendes Diagramm, das versucht zu veranschaulichen, wie die resultierende AIO-Bereitstellung aussieht.
id: Berikut ini adalah diagram dasar yang mencoba untuk menggambarkan apa yang dihasilkan penyebaran AIO yang dihasilkan.
ru: Ниже представлена базовая диаграмма, которая примерно иллюстрирует, как выглядит установленный AIO.

source: Here is an example test environment for a working OpenStack-Ansible (OSA) deployment with a small number of servers.
de: Hier sehen Sie eine Beispiel-Testumgebung für eine funktionierende OpenStack-Ansible (OSA) -Implementierung mit einer kleinen Anzahl von Servern.
id: Berikut ini adalah contoh lingkungan pengujian untuk penyebaran OpenStack-Ansible (OSA) yang berfungsi dengan sejumlah sedikit server.
ru: Ниже приведен пример тестового окружения для рабочего развертывания OpenStack-Ansible (OSA) с небольшим количеством серверов.

source: High security environments where no external connectivity is permitted
de: Hochsicherheitsumgebungen, in denen keine externe Konnektivität zulässig ist
id: Lingkungan keamanan tinggi di mana tidak ada konektivitas eksternal diizinkan
ru: Высокозащищенные окружения, где внешнее соединение не разрешено

source: Host name
ru: Имя сервера

source: Host network configuration
de: Host-Netzwerkkonfiguration
id: Konfigurasi jaringan host
ru: Настройка сети сервера

source: Hosts in the ``network_hosts`` group will map ``physnet1`` to the ``ens1f0`` interface, while hosts in the ``compute_hosts`` group will map ``physnet1`` to the ``ens2f0`` interface. Additional provider mappings can be established using the same format in a separate definition.
id: Host di grup ``network_hosts`` akan memetakan ``physnet1`` ke antarmuka ``ens1f0``, sementara host di grup ``compute_hosts`` akan memetakan ``physnet1`` ke antarmuka ``ens2f0`` . Pemetaan penyedia tambahan dapat dibuat menggunakan format yang sama dalam definisi yang terpisah.
ru: Хосты в группе ``network_hosts`` соотносят интерфейс ``physnet1`` к ``ens1f0``, в то время как хосты в группе ``compute_hosts`` соотносят интерфейс ``physnet1`` к ``ens2f0``. Дополнительные сопоставления могут быть заданы в том же формате в отдельном параметре.

source: However, there is another important part of the configuration required per service which is not a case for domain-based setup. All services assume that they've been served on root path (i.e. `/`) while in path-based approach we use a unique path for each service.
ru: Однако есть еще одна важная часть конфигурации, требуемая для каждой службы, которая не является случаем для настройки на основе домена. Все службы предполагают, что они обслуживаются по корневому пути (т. е. `/`), тогда как в подходе на основе пути мы используем уникальный путь для каждой службы.

source: IP assignments
de: IP-Zuweisungen
ru: Назначения IP

source: Ideally the ``hw_architecture`` property is set for all uploaded images. It is mandatory to set this property for all architectures that do not match ``image_properties_default_architecture``
ru: В идеале свойство ``hw_architecture`` задается для всех загруженных образов. Это свойство обязательно должно быть установлено для всех архитектур, которые не соответствуют ``image_properties_default_architecture``

source: If no domain will be matched HAProxy will proceed with path-based endpoints.
ru: Если ни один домен не будет совпадать, HAProxy продолжит работу с точками доступа на основе пути.

source: If the AIO was deployed in a cloud VM, you may need to configure security groups or firewall rules to allow access to the HTTP(S) ports. For example, if the AIO was deployed in an OpenStack VM, you can create and apply a suitable security group for interacting with Horizon like so:
ru: Если AIO был развернут в облачной виртуальной машине, вам может потребоваться настроить группы безопасности или правила брандмауэра, чтобы разрешить доступ к портам HTTP(S). Например, если AIO был развернут в виртуальной машине OpenStack, вы можете создать и применить подходящую группу безопасности для взаимодействия с Horizon следующим образом:

source: If the AIO was deployed in a cloud VM, you may need to configure security groups or firewall rules to allow access to the various sevice ports. For example, if the AIO was deployed in an OpenStack VM, you can create and apply a suitable security group for interacting the core services like so:
ru: Если AIO был развернут в облачной виртуальной машине, вам может потребоваться настроить группы безопасности или правила брандмауэра, чтобы разрешить доступ к различным портам служб. Например, если AIO был развернут в виртуальной машине OpenStack, вы можете создать и применить подходящую группу безопасности для взаимодействия основных служб следующим образом:

source: If the full QEMU suite is installed on a compute host, that host will offer to run all architectures supported by the available ``qemu-system-*`` binaries. In this situation images without the ``hw_architecture`` property could be scheduled to a non native architecture host and emulated.
ru: Если полный набор QEMU установлен на вычислительном хосте, этот хост предложит запустить все архитектуры, поддерживаемые доступными бинарными файлами ``qemu-system-*``. В этой ситуации образы без свойства ``hw_architecture`` могут быть распределены на хост неродной архитектуры и эмулированы.

source: If the user differs from host to host, you can leverage group_vars or host_vars. More information on how to use that can be found in the :doc:`overrides guide </reference/configuration/using-overrides>`
ru: Если пользователь отличается от хоста к хосту, вы можете использовать group_vars или host_vars. Более подробную информацию о том, как это использовать, можно найти в :doc:`Руководстве по переопределениям </reference/configuration/using-overrides>`

source: If this fails to get the database cluster back into a running state, then please make use of the `Galera Cluster Recovery </admin/maintenance-tasks.html#galera-cluster-recovery>`_ section in the operations guide.
ru: Если это не поможет вернуть кластер базы данных в рабочее состояние, воспользуйтесь разделом `Galera Cluster Recovery </admin/maintenance-tasks.html#galera-cluster-recovery>`_ в руководстве по эксплуатации.

source: If this is the case you can specify an alternate path which does not have this mount option set:
de: Wenn dies der Fall ist, können Sie einen alternativen Pfad angeben, für den diese Mount-Option nicht festgelegt ist:
id: Jika ini adalah kasus Anda dapat menentukan jalur alternatif yang tidak memiliki opsi mount ini diatur:
ru: В этом случае вы можете указать другой путь, для которого не указан данный флаг монтирования:

source: If you are installing with limited connectivity, or you don't have default route set, you will need to define interface for outgoing connections manually
ru: Если вы производите установку с ограниченным соединение или маршрут по умолчанию отсутствует, вам будет нужно задать интерфейс для исходящих соединений вручную

source: If you are installing with limited connectivity, please review :ref:`Installing with limited connectivity <limited-connectivity>` before proceeding.
ru: Если вы производите установку с ограниченным доступом к сети, пожалуйста посмотрите :ref:`Установка с ограниченным подключением <limited-connectivity>` перед тем, как продолжить.

source: If you are to use uWSGI rewrites like shown above, you will result in response like that:
ru: Если вы используете rewrite uWSGI, как показано выше, вы получите такой ответ:

source: If you have enabled SSL certificate configuration (default), all services will use self-signed certificates. While the host is configured to trust these certificates, this is not the case for other hosts. This will result in HTTPS errors when attempting to interact with the cloud. To resolve this issue, you will need to manually configure certificates on other hosts or ignore SSL issues. To use the self-signed certificate, first copy it to the other hosts. The name and location of the generated certificate are configured by the ``pki_authorities`` and ``pki_trust_store_location`` variables respectively, which are used by the ``pki`` role provided by `ansible-role-pki`__. On an Ubuntu 22.04 host, these will default to ``ExampleCorpRoot`` and ``/usr/local/share/ca-certificates``, respectively. For example:
ru: Если вы включили настройку сертификата SSL (по умолчанию), все службы будут использовать самоподписанные сертификаты. Хотя хост сконфигурирован доверять этим сертификатам, для других хостов это не так. Это приведет к ошибкам HTTPS при попытке взаимодействия с облаком. Чтобы решить эту проблему, вам нужно будет вручную настроить сертификаты на других хостах или игнорировать проблемы SSL. Чтобы использовать самоподписанный сертификат, сначала скопируйте его на другие хосты. Имя и местоположение сгенерированного сертификата настраиваются переменными ``pki_authorities`` и ``pki_trust_store_location`` соответственно, которые используются ролью ``pki``, предоставляемой `ansible-role-pki`__. На хосте Ubuntu 22.04 они будут по умолчанию ``ExampleCorpRoot`` и ``/usr/local/share/ca-certificates`` соответственно. Например:

source: If you need to run some pre/post hooks for interfaces, you will need to configure a systemd service for that. It can be done using variable ``openstack_hosts_systemd_services``, like that:
ru: Если вам нужно запустить некоторые pre/post хуки для интерфейсов, вам нужно будет настроить для этого службу systemd. Это можно сделать с помощью переменной ``openstack_hosts_systemd_services``, например:

source: If you want to delegate management of network bridges and interfaces to OpenStack-Ansible, you can define variables ``openstack_hosts_systemd_networkd_devices`` and ``openstack_hosts_systemd_networkd_networks`` in `group_vars/lxc_hosts`, for example:
ru: Если вы хотите делегировать управление сетевыми мостами и интерфейсами OpenStack-Ansible, вы можете определить переменные ``openstack_hosts_systemd_networkd_devices`` и ``openstack_hosts_systemd_networkd_networks`` в `group_vars/lxc_hosts`, например:

source: If you want to keep basic ansible logging, you need either to create ``/openstack/log/ansible-logging/`` directory and allow user to write there, or define the following environment variable:
ru: Если вы хотите сохранить базовое ведение журнала ansible, вам нужно либо создать каталог ``/openstack/log/ansible-logging/`` и разрешить пользователю писать в него, либо определить следующую переменную среды:

source: If you wish to access the AIO deployment from another host - perhaps your local workstation - you will need either an ``openrc`` file or ``clouds.yaml`` file. You can download an ``openrc`` file from Horizon: simply click the User dropdown in the top-right corner and select ``OpenStack RC File``.
ru: Если вы хотите получить доступ к развертыванию AIO с другого хоста — возможно, с вашей локальной рабочей станции — вам понадобится файл ``openrc`` или файл ``clouds.yaml``. Вы можете загрузить файл ``openrc`` из Horizon: просто нажмите раскрывающийся список пользователя в правом верхнем углу и выберите ``OpenStack RC-файл``.

source: If you would like to reduce disk usage, an additional policy can be applied via OpenStack-Ansible as shown below:
ru: Если вы хотите сократить использование диска, можно применить дополнительную политику через OpenStack-Ansible, как показано ниже:

source: If you would like your domain included in the HSTS preload list, which is built into browsers, before submitting your request to be added to the HSTS preload list you must add the ``preload`` token to your response header. The ``preload`` token indicates to the maintainers of HSTS preload list that you are happy to have your site included.
ru: Если вы хотите, чтобы ваш домен был включен в список предварительной загрузки HSTS, встроенный в браузеры, перед отправкой запроса на добавление в список предварительной загрузки HSTS вы должны добавить токен ``preload`` в заголовок ответа. Токен ``preload`` указывает тем, кто поддерживает список предварительной загрузки HSTS, что вы согласны включить туда свой сайт.

source: If your environment does not have ``eth0``, but instead has ``p1p1`` or some other interface name, ensure that all references to ``eth0`` in all configuration files are replaced with the appropriate name. The same applies to additional network interfaces.
de: Wenn Ihre Umgebung nicht ``eth0``, sondern ``p1p1`` oder einen anderen Namen hat, stellen Sie sicher, dass alle Verweise auf ``eth0`` in allen Konfigurationsdateien durch den entsprechenden Namen ersetzt werden. Gleiches gilt für zusätzliche Netzwerkschnittstellen.
id: Jika lingkungan Anda tidak memiliki ``eth0``, tetapi sebaliknya memiliki ``p1p1`` atau nama antarmuka lainnya, pastikan bahwa semua referensi ke ``eth0`` di semua file konfigurasi diganti dengan nama yang sesuai. Hal yang sama berlaku untuk antarmuka jaringan tambahan.
ru: Если в вашем окружении нет интерфейса ``eth0``, но вместо него используется ``p1p1``, либо же какое-нибудь другое имя интерфейса, убедитесь, что все отсылки к ``eth0`` в конфигурационных файлах заменены на подходящее имя. Это же применимо ко всем дополнительным сетевым интерфейсам.

source: Implementing CSP could lead to broken content if a browser is blocked from accessing certain resources, therefore it is recommended that when testing CSP you use the ``Content-Security-Policy-Report-Only`` header, instead of ``Content-Security-Policy``, this reports CSP violations to the browser console, but does not enforce the policy.
ru: Реализация CSP может привести к повреждению контента, если браузеру будет заблокирован доступ к определенным ресурсам, поэтому при тестировании CSP рекомендуется использовать заголовок ``Content-Security-Policy-Report-Only`` вместо ``Content-Security-Policy``. Это сообщает о нарушениях CSP в консоль браузера, но не обеспечивает соблюдение политики.

source: In OpenStack-Ansible TLS to HAProxy is configured in HAProxy, TLS from HAProxy to noVNC is not currently enabled and TLS from nVNC to Compute nodes is enabled by default.
ru: В OpenStack-Ansible TLS для HAProxy настроен в HAProxy, TLS от HAProxy до noVNC в настоящее время не включен, а TLS от nVNC до вычислительных узлов включен по умолчанию.

source: In OpenStack-Ansible, ``security.txt`` is implemented in HAProxy as all public endpoints reside behind it. It defaults to directing any request paths that end with ``/security.txt`` to the text file using an ACL rule in HAProxy.
ru: В OpenStack-Ansible ``security.txt`` реализован в HAProxy, поскольку все публичные точки доступа находятся за ним. По умолчанию он направляет любые пути запросов, которые заканчиваются на ``/security.txt``, в текстовый файл с использованием правила ACL в HAProxy.

source: In OpenStack-Ansible, security headers are implemented in HAProxy as all the public endpoints reside behind it.
ru: В OpenStack-Ansible заголовки безопасности реализованы в HAProxy, поскольку все публичные точки доступа находятся за ним.

source: In ``cidr_networks`` add a network which should be used as "public" network for accessing APIs. For example we will be using `203.0.113.128/28`:
ru: В ``cidr_networks`` добавьте сеть, которая должна использоваться как "публичная" сеть для доступа к API. Например, мы будем использовать `203.0.113.128/28`:

source: In ``provider_networks`` you need to define a new container network and assign it to HAProxy group.
ru: В ``provider_networks`` необходимо определить новую сеть контейнеров и назначить ее группе HAProxy.

source: In ``used_ips`` you need to reserve IP address for your gateway and ``haproxy_keepalived_external_vip_cidr``/``external_lb_vip_address``
ru: В ``used_ips`` вам необходимо зарезервировать IP-адрес для вашего шлюза и ``haproxy_keepalived_external_vip_cidr``/``external_lb_vip_address``

source: In addition to this basic configuration, there are other network clients on the target hosts which may be configured to connect via a proxy. For example:
ru: В дополнение к базовой конфигурации имеются другие сетевые клиенты на целевых хостах, которые могут быть настроены для соединения через прокси. Например:

source: In addition, it is necessary to configure easy_install to use an alternative index. easy_install is used instead of pip to install anything listed under setup_requires in setup.py during wheel builds. See https://pip.pypa.io/en/latest/reference/pip_install/#controlling-setup-requires
id: Selain itu, perlu untuk mengkonfigurasi easy_install untuk menggunakan indeks alternatif. easy_install digunakan sebagai ganti pip untuk menginstal apa pun yang terdaftar di bawah setup_requires di setup.py selama pembuatan roda (wheel builds), Lihathttps://pip.pypa.io/en/latest/reference/pip_install/#controlling-setup-requires
ru: Кроме того, необходимо настроить easy_install для использования альтернативного индекса. easy_install используется вместо pip для установки всего, что указано в setup_requires в setup.py во время сборки wheel. См. https://pip.pypa.io/en/latest/reference/pip_install/#controlling-setup-requires

source: In case of any changes to ``haproxy_base_service_overrides`` variable you need to re-run ``openstack-ansible openstack.osa.haproxy --tags haproxy-service-config``.
ru: В случае каких-либо изменений в переменной ``haproxy_base_service_overrides`` необходимо повторно запустить ``openstack-ansible openstack.osa.haproxy --tags haproxy-service-config``.

source: In case of deploying HAProxy inside LXC you need to ensure connectivity with a public network and that ``haproxy_bind_external_lb_vip_address`` will be present inside the container as well as ``external_lb_vip_address`` is reachable.
ru: В случае развертывания HAProxy внутри LXC необходимо обеспечить подключение к публичной сети и то, что ``haproxy_bind_external_lb_vip_address`` будет присутствовать внутри контейнера, а ``external_lb_vip_address`` будет доступен.

source: In case you do need to have a Ceph RGW or want to combine domain-based with path-based approach - you can do that by defining two map files:
ru: Если вам действительно нужен Ceph RGW или вы хотите объединить подходы на основе домена и пути, вы можете сделать это, определив два файла карт:

source: In order for HAProxy to pass specific FQDN to it's own backend we will leverage `map files <https://www.haproxy.com/documentation/haproxy-configuration-tutorials/core-concepts/map-files/>`_ functionality.
ru: Для того чтобы HAProxy передавал определенное полное доменное имя в свой собственный бекэнд, мы воспользуемся функциональностью `файлов карты <https://www.haproxy.com/documentation/haproxy-configuration-tutorials/core-concepts/map-files/>`_.

source: In order for all the services to run, the host must be prepared with the appropriate disks partitioning, packages, network configuration and configurations for the OpenStack Deployment.
de: Damit alle Dienste ausgeführt werden können, muss der Host mit den entsprechenden Festplattenpartitionierungen, Paketen, Netzwerkkonfigurationen und Konfigurationen für die OpenStack-Bereitstellung vorbereitet sein.
id: Agar semua layanan berjalan, host harus dipersiapkan dengan partisi disk, paket, konfigurasi jaringan dan konfigurasi yang tepat untuk OpenStack Deployment.
ru: Для того, что бы все сервисы успешно запустились, сервер должен быть подготовлен с использованием соответствующей разметки дисков, настроек сети и настроек развертывания OpenStack.

source: In order to add support for multiple compute tiers (in with CPU overcommit and pinned CPUs) you need to create a file ``/etc/openstack_deploy/group_vars/pinned_compute_hosts`` with content:
ru: Чтобы добавить поддержку нескольких вычислительных уровней (с CPU overcommit и привязанным CPU), необходимо создать файл ``/etc/openstack_deploy/group_vars/pinned_compute_hosts`` со следующим содержимым:

source: In order to be able to execute a playbook only against hosts in a single Availability Zone, as well as be able to set AZ-specific variables, we need to define groups definitions. For that, create a file ``/etc/openstack_deploy/env.d/az.yml`` with the following content:
ru: Чтобы иметь возможность выполнять плейбук только для хостов в одной зоне доступности, а также иметь возможность устанавливать переменные, специфичные для AZ, нам нужно определить определения групп. Для этого создайте файл ``/etc/openstack_deploy/env.d/az.yml`` со следующим содержимым:

source: In order to configure the deployment to use an alternative index, create the file `/etc/pip.conf` with the following content and ensure that it resides on all hosts in the environment.
id: Untuk mengkonfigurasi penyebaran menggunakan indeks alternatif, buat file `/etc/pip.conf` dengan konten berikut dan pastikan bahwa itu berada di semua host di lingkungan.
ru: Что бы настроить развертывание на использование альтернативного источника при сборке, создайте файл `/etc/pip.conf` со следующим содержанием и убедитесь, что он имеется на всех хостах в окружении.

source: In order to make a public network available, you need to ensure having a corresponsive bridge on your hosts to which HAProxy containers will be plugged in with one side of a veth pair. The bridge should also contain a VLAN interface providing "public" connectivity.
ru: Чтобы сделать публичную сеть доступной, вам необходимо обеспечить наличие соответствующего моста на ваших хостах, к которому будут подключены контейнеры HAProxy с одной стороны пары veth. Мост также должен содержать интерфейс VLAN, обеспечивающий «публичное» подключение.

source: In order to properly configure Availability Zones, we need to leverage ``group_vars`` and define Availability Zone name used for each AZ there. For this, create files:
ru: Чтобы правильно настроить зоны доступности, нам нужно использовать `` group_vars`` и определить имя зоны доступности, используемое там для каждой AZ. Для этого создайте файлы:

source: In order to tell dynamic_inventory to generate a set of containers for HAProxy, you need to create a file ``/etc/openstack_deploy/env.d/haproxy.yml`` with the following content:
ru: Чтобы указать dynamic_inventory сгенерировать набор контейнеров для HAProxy, необходимо создать файл ``/etc/openstack_deploy/env.d/haproxy.yml`` со следующим содержимым:

source: In order to work around such limitations, starting from 2023.1 (Antelope) release, it is possible to have domain-based or path-based endpoints instead.
ru: Чтобы обойти эти ограничения, начиная с версии 2023.1 (Antelope), можно использовать точки доступа на основе домена или пути.
