Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-user.po
Languages: de, id, ru

source: Please mention, that RGW installation should be performed after deployment of Keystone service.
ru: Обратите внимание, что установку RGW следует выполнять после развертывания сервиса Keystone.

source: Please note, for this glance example, that you do not need to edit the ``inventory/group_vars/glance_all/source_git.yml`` file.
ru: Обратите внимание, что для этого примера Glance, вам не нужно редактировать файл ``inventory/group_vars/glance_all/source_git.yml``.

source: Please note, that Horizon does utilize `/identity` for its Keystone panel, so if you're serving Horizon on `/` (default) and using `/identity` to forward traffic to Keystone backend, management of users, roles, projects inside the Horizon will be broken due to a conflict.
ru: Обратите внимание, что Horizon использует `/identity` для своей панели Keystone, поэтому, если вы обслуживаете Horizon на `/` (по умолчанию) и используете `/identity` для пересылки трафика на бекэнд Keystone, управление пользователями, ролями и проектами внутри Horizon будет нарушено из-за конфликта.

source: Populate a "base" map file with search patterns per service backend. As each service is going to use its own FQDN we need to inform HAProxy which backend should be used when request is coming to the FQDN.
ru: Заполните файл "базового" сопоставления шаблонов поиска для каждого бэкенда служб. Поскольку каждый сервис будет использовать свой собственный FQDN, нам нужно сообщить HAProxy, какой бэкенд следует использовать, когда запрос поступает на FQDN.

source: Practice A: Mirror internet resources locally
de: Übung A: Spiegeln Sie Internetressourcen lokal
id: Praktek A: sumber daya internet mirror secara lokal
ru: Вариант А: создание локальных зеркал интернет-ресурсов

source: Practice B: Proxy access to internet resources
de: Übung B: Proxy-Zugriff auf Internetressourcen
id: Praktek B: Akses proxy ke sumber daya internet
ru: Вариант Б: доступ к интернет-ресурсам при помощи прокси

source: Prepare the host
id: Siapkan host
ru: Подготовка сервера

source: Prevent creation of a front-end per service. As we are now expecting traffic to come only on default `80` and `443` ports there is no need to have a separate frontend per service. A HAProxy map file is attached to a "base" frontend which is deployed with the ``haproxy_server`` role and is independent of any service definitions. The map file can be used to direct incoming requests to specific backends by using rules defined in the map file to match against host request headers.
ru: Предотвратить создание фронтенда на службу. Поскольку теперь мы ожидаем, что трафик будет поступать только на порты по умолчанию `80` и `443`, нет необходимости иметь отдельный фронтенд на службу. Файл карты HAProxy прикреплен к "базовому" фронтенду, который развернут с ролью ``haproxy_server`` и не зависит от каких-либо служб. Файл карты можно использовать для направления входящих запросов на определенные бэкенды с помощью правил, определенных в файле карты, для сопоставления с заголовками запросов хоста.

source: Production environment
de: Produktionsumfeld
id: Lingkungan produksi
ru: Рабочее окружение

source: Production environment host layout
ru: Схема серверов для рабочего окружения

source: Provide ``--become`` flag each time your run a playbook or ad-hoc command. Alternatively, you can define the following environment variable:
ru: Предоставляйте флаг ``--become`` каждый раз, когда вы запускаете playbook или ad-hoc команду. В качестве альтернативы вы можете определить следующую переменную окружения:

source: Provider network groups
id: Grup jaringan penyedia
ru: Сетевые группы провайдера

source: Proxying TLS traffic often interferes with the clients ability to perform successful validation of the certificate chain. Various configuration variables exist within the OpenStack-Ansible playbooks and roles that allow a deployer to ignore these validation failures. Disable certificate chain validation on a case by case basis and only after encountering failures that are known to only be caused by the proxy server(s).
ru: Проксирование трафика TLS часто мешает клиентам успешно выполнять проверку цепочки сертификатов. В плейбуках и ролях OpenStack-Ansible существуют различные переменные конфигурации, которые позволяют оператору игнорировать эти сбои проверки. Отключайте проверку цепочки сертификатов в каждом конкретном случае и только после обнаружения сбоев, которые, как известно, вызваны только прокси-сервером(ами).

source: Public API VIPs
ru: VIP публичного API

source: Public API, OpenStack external and management networks are represented as stretched L2 networks between Availability Zones.
ru: Публичный API, внешние сети OpenStack и сети управления представлены в виде растянутых сетей L2 между зонами доступности.

source: Python package repositories
de: Python-Paket-Repositories
id: Repositori paket Python
ru: Репозитории Python пакетов

source: Python packages
de: Python-Pakete
id: Paket python
ru: Python пакеты

source: QEMU-native TLS requires all compute hosts to accept TCP connections on port 16514 and port range 49152 to 49261.
ru: Для использования нативного протокола TLS в QEMU требуется, чтобы все вычислительные хосты принимали TCP-подключения на порту 16514 и в диапазоне портов 49152–49261.

source: Quickstart: AIO
de: Schnellstart: AIO
ru: Быстрое начало: AIO

source: RabbitMQ example
de: RabbitMQ Beispiel
id: Contoh RabbitMQ
ru: Пример RabbitMQ

source: Rebooting an AIO
de: Neustart eines AIO
id: Mem-boot ulang AIO
ru: Перезагрузка AIO

source: Rebuilding an AIO
de: Wiederaufbau eines AIO
id: Membangun kembali AIO
ru: Переустановка AIO

source: Recent changes to OpenStack-Ansible (OSA) enables deployers to define provider networks that apply to particular inventory groups and allows for a heterogeneous network configuration within a cloud environment. New groups can be created or existing inventory groups, such as ``network_hosts`` or ``compute_hosts``, can be used to ensure certain configurations are applied only to hosts that meet the given parameters.
ru: Недавние изменения в OpenStack-Ansible (OSA) позволяют операторам определять сети провайдера, которые применимы к конкретной группе в inventory и позволяют производить неоднородные сетевые настройки в окружении облака. Новые группы могут быть созданы или уже существующие, такие как ``network_hosts`` или ``compute_hosts``, могут быть использованы для применения определенной конфигурации только к хостам, которые удовлетворяют предоставленным параметрам.

source: Recommended server resources:
de: Empfohlene Serverressourcen:
id: Sumber daya server yang direkomendasikan:
ru: Рекомендуемые серверные ресурсы:

source: Redis as measure storage
id: Redis sebagai ukuran penyimpanan
ru: Redis как хранилище метрик

source: Reduce amount of cross-AZ traffic
ru: Уменьшение объема трафика между зонами AZ

source: Refer to `global_environment_variables:` and `deployment_environment_variables:` in the example `user_variables.yml` for details of configuring persistent and transient proxy environment variables.
de: Siehe `global_environment_variables:` und `deployment_environment_variables:` im Beispiel `user_variables.yml` für Details zum Konfigurieren von persistenten und transienten Proxy-Umgebungsvariablen.
id: Rujuk ke `global_environment_variables:` dan `deployment_environment_variables:` dalam contoh `user_variables.yml` untuk detail konfigurasi variabel lingkungan proxy yang persisten dan sementara.
ru: См. `global_environment_variables:` и `deployment_environment_variables:` в типовом `user_variables.yml` для получения деталей о настройке переменных окружения для постоянного и временного прокси.

source: Reference Diagram for an AIO Build
de: Referenzdiagramm für einen AIO Build
id: Referensi Diagram untuk AIO Build
ru: Справочная схема по развертыванию AIO

source: Referrer Policy
ru: Referrer политика

source: Reporting Violations
ru: Сообщение о нарушениях

source: Rest of variables can be defined in ``/etc/openstack_deploy/user_variables.yml`` but a lot of them will be referencing ``az_name`` variable, so it's presence (along with corresponding groups) are vital for this scenario.
ru: Остальные переменные можно определить в ``/etc/openstack_deploy/user_variables.yml``, но многие из них будут ссылаться на переменную ``az_name``, поэтому ее наличие (вместе с соответствующими группами) жизненно важно для этого сценария.

source: Review the `bootstrap-host role defaults`_ file to see various configuration options. Deployers have the option to change how the host is bootstrapped. This is useful when you wish the AIO to make use of a secondary data disk, or when using this role to bootstrap a multi-node development environment.
de: Überprüfen Sie die `bootstrap-host role defaults`_ Datei, um verschiedene Konfigurationsoptionen anzuzeigen. Bereitsteller haben die Möglichkeit zu ändern, wie der Host bootstrapped wird. Dies ist nützlich, wenn Sie möchten, dass das AIO eine sekundäre Datenfestplatte verwendet oder wenn Sie diese Rolle zum Bootstrap einer Entwicklungsumgebung mit mehreren Knoten verwenden.
id: Tinjau `strstrstrap-host role defaults`_ file untuk melihat berbagai opsi konfigurasi. Deployer memiliki opsi untuk mengubah cara host ditopang bootstrap. Ini berguna ketika Anda ingin AIO menggunakan disk data sekunder, atau ketika menggunakan peran ini untuk bootstrap lingkungan pengembangan multi-node.
ru: Просмотрите файл `bootstrap-host role defaults`_ - в нем содержатся различные настройки развертывания. Оператор имеет возможность настроить, каким образом сервер будет подготовлен. Это может быть полезно, когда вы хотите, что бы AIO использовал второй диск для данных, либо же использовать данную роль для подготовки развертывания окружения на несколько серверов.

source: Routed environment example
de: Beispiel für eine geroutete Umgebung
id: Contoh lingkungan yang diarahkan
ru: Пример маршрутизируемого окружения

source: Run all playbooks to configure HAProxy and OpenStack services.
ru: Запустите все сценарии для настройки служб HAProxy и OpenStack.

source: Run playbooks
de: Führe Playbooks aus
id: Jalankan playbook
ru: Запуск плейбуков

source: Run the OpenStack-Ansible playbooks to deploy the required services.
ru: Запустите плейбуки OpenStack-Ansible для развертывание требуемых сервисов.

source: Run the following to bootstrap Ansible and the required roles:
id: Jalankan berikut ini untuk bootstrap Ansible dan peran (role) yang diperlukan:
ru: Выполните следующие команды для подготовки Ansible и требуемых ролей:

source: Run the playbook for that service.
de: Führen Sie das Playbook für diesen Dienst aus.
id: Jalankan playbook untuk layanan itu.
ru: Запустите плейбуки для этого сервиса.

source: Running as non-root user
ru: Запуск от имени пользователя без прав root

source: Sample configuration for Keystone and Nova will look like this:
ru: Пример конфигурации для Keystone и Nova будет выглядеть следующим образом:

source: Securing services with SSL certificates
de: Sichern von Diensten mit SSL-Zertifikaten
id: Mengamankan layanan dengan sertifikat SSL
ru: Защита сервисов при помощи SSL сертификатов

source: Security Headers
ru: Заголовки безопасности

source: Security headers are HTTP headers that can be used to increase the security of a web application by restricting what modern browsers are able to run.
ru: Заголовки безопасности — это HTTP-заголовки, которые можно использовать для повышения безопасности веб-приложения путем ограничения того, что современные браузеры могут запускать.

source: Security settings
de: Sicherheitseinstellungen
id: Pengaturan keamanan
ru: Настройки безопасности

source: See `Setting up apt-get to use a http-proxy <https://help.ubuntu.com/community/AptGet/Howto#Setting_up_apt-get_to_use_a_http-proxy>`_
ru: См. `Настройка apt-get для использования http-прокси <https://help.ubuntu.com/community/AptGet/Howto#Setting_up_apt-get_to_use_a_http-proxy>`_

source: See the :deploy_guide:`Deployment Guide <index.html>` for a more detailed break down of how to implement your own configuration rather than to use the AIO bootstrap.
id: Lihat :deploy_guide:`Deployment Guide <index.html>` untuk perincian yang lebih rinci tentang bagaimana menerapkan konfigurasi Anda sendiri daripada menggunakan bootstrap AIO.
ru: Ознакомьтесь с :deploy_guide:`Deployment Guide <index.html>`, где более подробно описаны способы применения собственной конфигурации, вместо использования начальной подготовки AIO.

source: Self-service project/tenant networks for instances
id: Jaringan project/tenant self-service untuk instance
ru: Собственные сети проектов/тенантов для инстансов

source: Self-signed certificates
de: Selbstsignierte Zertifikate
id: Sertifikat yang ditandatangani sendiri (self-signed certificate)
ru: Самоподписанные сертификаты

source: Self-signed certificates are generated for each service during the first run of the playbook.
de: Während der ersten Ausführung des Playbooks werden für jeden Dienst selbstsignierte Zertifikate generiert.
id: Sertifikat yang ditandatangani sendiri dibuat untuk setiap layanan selama menjalankan pertama dari playbook.
ru: Самоподписанные сертификаты генерируются для каждого сервиса во время первого запуска плейбука.

source: Self-signed certificates can play an important role in securing internal services within the OpenStack-Ansible deployment, as they can only be issued by the private CA associated with the deployment. Using mutual TLS between backend services such as RabbitMQ and MariaDB with self-signed certificates and a robust CA setup can ensure that only correctly authenticated clients can connect to these internal services.
ru: Самоподписанные сертификаты могут играть важную роль в обеспечении безопасности внутренних служб в рамках развертывания OpenStack-Ansible, поскольку они могут быть выпущены только частным CA, связанным с развертыванием. Использование взаимного TLS между внутренними службами, такими как RabbitMQ и MariaDB, с самоподписанными сертификатами и надежной настройкой CA может гарантировать, что только правильно аутентифицированные клиенты смогут подключаться к этим внутренним службам.

source: Self-signed certificates enable you to start quickly and encrypt data in transit. However, they do not provide a high level of trust for public endpoints in highly secure environments. By default, self-signed certificates are used in OpenStack-Ansible. When self-signed certificates are used, certificate verification is automatically disabled.
ru: Самоподписанные сертификаты позволяют быстро начать работу и шифровать данные при передаче. Однако, они не обеспечивают высокий уровень доверия для публичных точек доступа в высокозащищенных средах. По умолчанию в OpenStack-Ansible используются самоподписанные сертификаты. При использовании самоподписанных сертификатов проверка сертификатов автоматически отключается.

source: Self-signed user certificates are generated but not installed for services outside of OpenStack-Ansible. These user certificates are signed by the same self-signed certificate authority as is used by OpenStack services but are intended to be used by user applications.
ru: Самоподписанные сертификаты пользователя генерируются, но не устанавливаются для служб за пределами OpenStack-Ansible. Эти сертификаты пользователя подписаны тем же самоподписанным центром сертификации, который используется службами OpenStack, но предназначены для использования пользовательскими приложениями.

source: Service configuration
ru: Конфигурация службы

source: Should an existing AIO environment need to be reinstalled, the most efficient method is to destroy the host operating system and start over. For this reason, AIOs are best run inside of some form of virtual machine or cloud guest.
de: Wenn eine vorhandene AIO-Umgebung neu installiert werden muss, besteht die effizienteste Methode darin, das Host-Betriebssystem zu zerstören und neu zu starten. Aus diesem Grund werden AIOs am ​​besten in Form einer virtuellen Maschine oder eines Cloud-Gastes ausgeführt.
id: Jika lingkungan AIO yang ada perlu diinstal ulang, metode yang paling efisien adalah menghancurkan sistem operasi host dan memulai kembali. Untuk alasan ini, AIO paling baik dijalankan di dalam beberapa bentuk mesin virtual (virtual machine) atau cloud guest.
ru: Если необходимо переустановить окружение AIO, самый эффективный способ это переустановить операционную систему на сервере и начать с начала. По этой причине лучше всего запускать AIO в виртуальной машине или гостевом облаке.

source: Similar to domain-based endpoints we rely on HAProxy maps functionality. But instead of ``map_dom`` we will be using ``map_reg``.
ru: Подобно доменным точкам доступа мы полагаемся на функциональность карт HAProxy. Но вместо ``map_dom`` мы будем использовать ``map_reg``.

source: Similar to the domain-based endpoints we need to override endpoints definition for each service. Endpoints are usually defined with following variables:
ru: Подобно доменным точкам доступа нам нужно переопределить значение точек доступа для каждой службы. Точки доступа обычно определяются со следующими переменными:

source: Single interface or bond
id: Antarmuka tunggal atau rangkaian
ru: Одиночный интерфейс или агрегация

source: So even if you only want to override the ``_git_install_branch`` for a repository, you should also define the ``_git_repo`` variable in your user variables.
de: Selbst wenn Sie nur den `` _git_install_branch`` für ein Repository überschreiben wollen, sollten Sie auch die Variable `` _git_repo`` in Ihren Benutzervariablen definieren.
id: Jadi, bahkan jika Anda hanya ingin mengganti ``_git_install_branch`` untuk repositori, Anda juga harus mendefinisikan variabel ``_git_repo`` dalam variabel pengguna Anda.
ru: Таким образом, даже если вы хотите переопределить ``_git_install_branch`` для репозитория, вам необходимо также определить и переменную ``_git_repo`` среди пользовательских переменных.

source: So first of all setup a redis server/cluster, e.g. with this `ansible role`_. Next, you have to configure Gnocchi with OpenStack-Ansible to use the Redis Cluster as incoming storage:
id: Jadi, pertama-tama, atur redis server/cluster, mis. dengan `ansible role`_. ini. Selanjutnya, Anda harus mengkonfigurasi Gnocchi dengan OpenStack-Ansible untuk menggunakan Redis Cluster sebagai penyimpanan yang masuk:
ru: Сначала произведите установку сервера/кластера redis, например при помощи данной `ansible роли`_. Далее вам необходимо настроить Gnocchi с openStack-Ansible на использования кластера Redis в качестве хранилища для входящих метрик:

source: So we need to define a map file to be used and a way to parse it. For that we need to apply an override for the `base` service.
ru: Итак, нам нужно определить файл карты, который будет использоваться, и способ его анализа. Для этого нам нужно применить переопределение для службы `base`.

source: So we now need to make service respect the path and respond correctly on it. One way of doing that could be using rewrite mechanism in uWSGI, for example:
ru: Итак, теперь нам нужно заставить службу уважать путь и правильно реагировать на него. Одним из способов сделать это может быть использование rewrite механизма в uWSGI, например:

source: So your Let's Encrypt configuration may look like this:
ru: Итак, ваша конфигурация Let's Encrypt может выглядеть следующим образом:

source: Some networks have no routed access to the Internet, or require certain traffic to use application specific gateways such as HTTP or SOCKS proxy servers.
de: Einige Netzwerke haben keinen gerouteten Zugriff auf das Internet oder erfordern einen bestimmten Datenverkehr, um anwendungsspezifische Gateways wie HTTP- oder SOCKS-Proxy-Server zu verwenden.
id: Beberapa jaringan tidak memiliki akses terarah ke Internet, atau memerlukan lalu lintas tertentu untuk menggunakan gateway khusus aplikasi seperti server proxy HTTP atau SOCKS.
ru: Некоторые сети не имеют маршрутизируемого доступа в Интернет, или требуют для определенного трафика использовать специфичные шлюзы, такие как HTTP или SOCKS прокси серверы.

source: Some services, like keystone, have a configuration options which may control how `href` is being defined. For instance, keystone does have `[DEFAULT]/public_endpoint` option, but this approach is not consistent across services. Moreover, keystone will return provided `public_endpoint` for all endpoints, including admin and internal.
ru: Некоторые службы, такие как keystone, имеют параметры конфигурации, которые могут контролировать, как определяется `href`. Например, keystone имеет параметр `[DEFAULT]/public_endpoint`, но этот подход не является единообразным для всех служб. Более того, keystone вернет предоставленный `public_endpoint` для всех точек доступа, включая административную и внутреннюю.

source: Sometimes it may be useful to destroy all the containers and rebuild the AIO. While it is preferred that the AIO is entirely destroyed and rebuilt, this isn't always practical. As such the following may be executed instead:
de: Manchmal kann es nützlich sein, alle Container zu zerstören und das AIO neu aufzubauen. Während es bevorzugt wird, dass der AIO vollständig zerstört und neu aufgebaut wird, ist dies nicht immer praktisch. Daher kann stattdessen Folgendes ausgeführt werden:
id: Kadang-kadang mungkin berguna untuk menghancurkan semua kontainer dan membangun kembali AIO. Meskipun lebih disukai bahwa AIO sepenuhnya dihancurkan dan dibangun kembali, ini tidak selalu praktis. Karena itu, hal-hal berikut dapat dieksekusi sebagai gantinya:
ru: Иногда может быть полезным удаление всех контейнеров и переустановка AIO. Хоть и рекомендуется полное удаление AIO и переустановка с нуля, это не всегда практично. Потому, можно выполнить следующее, вместо полной переустановки:

source: Source code repositories
de: Quellcode-Repositories
id: Repositori kode sumber
ru: Репозитории с исходным кодом

source: Source overriding examples
de: Quellüberschreibende Beispiele
id: Contoh menimpa sumber
ru: Пример переопределения источников

source: Specify the path to your SSL certificate, key, and CA certificate in the ``/etc/openstack_deploy/user_variables.yml`` file.
de: Geben Sie den Pfad zu Ihrem SSL-Zertifikat, Schlüssel und CA-Zertifikat in der Datei `` / etc / openstack_deploy / user_variables.yml`` an.
id: Tentukan path ke sertifikat SSL, kunci, dan sertifikat CA Anda di file ``/etc/openstack_deploy/user_variables.yml``.
ru: Укажите путь к вашему SSL сертификату, ключу и промежуточным сертификатам в файле ``/etc/openstack_deploy/user_variables.yml``.

source: Spread load across Availability Zones
ru: Распределение нагрузки по зонам доступности

source: Standard deployment of RabbitMQ server
ru: Стандартная установка RabbitMQ сервера

source: Start by cloning the OpenStack-Ansible repository and changing into the repository root directory:
de: Klonen Sie zunächst das OpenStack-Ansible-Repository und wechseln Sie in das Repository-Stammverzeichnis:
id: Mulailah dengan menggandakan repositori OpenStack-Ansible dan mengubah ke direktori root repositori:
ru: Начните с клонирования репозитория OpenStack-Ansible и перехода в его корневую директорию:
