Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-contributor.po
Languages: de, id

source: Participate in team sessions at the OpenStack Projects Team Gatherings (PTG)
de: Teilnahme an Teamveranstaltungen auf den OpenStack Projects Team Gatherings (PTG)
id: Berpartisipasi dalam sesi tim di OpenStack Projects Team Gatherings (PTG)

source: Pass functional tests
de: Bestehe Funktionstests
id: Lulus tes fungsional

source: Patches should be focused on solving one problem at a time. If the review is overly complex or generally large the initial commit will receive a "**-2**" and the contributor will be asked to split the patch up across multiple reviews. In the case of complex feature additions the design and implementation of the feature should be done in such a way that it can be submitted in multiple patches using dependencies. Using dependent changes should always aim to result in a working build throughout the dependency chain. Documentation is available for `advanced gerrit usage`_ too.
de: Patches sollten sich darauf konzentrieren, ein Problem auf einmal zu lösen. Wenn die Rezension zu komplex oder allgemein zu groß ist, erhält die initiale Festschreibung eine ``**-2**``, und der Beitragende wird aufgefordert, den Patch auf mehrere Überprüfungen aufzuteilen. Bei komplexen Feature-Ergänzungen sollte das Design und die Implementierung des Features so gestaltet werden, dass es in mehreren Patches über Abhängigkeiten übergeben werden kann. Die Verwendung abhängiger Änderungen sollte immer darauf abzielen, zu einem funktionierenden Build in der gesamten Abhängigkeitskette zu führen. Die Dokumentation steht auch in `advanced gerrit usage`_ zur Verfügung.
id: Patch harus difokuskan pada penyelesaian satu masalah pada satu waktu. Jika ulasan terlalu rumit atau umumnya besar, komit awal akan menerima "**-2**" dan kontributor akan diminta untuk membagi patch di beberapa ulasan. Dalam hal penambahan fitur yang kompleks, desain dan implementasi fitur harus dilakukan sedemikian rupa sehingga dapat diajukan dalam beberapa patch menggunakan dependensi. Menggunakan perubahan dependen harus selalu bertujuan untuk menghasilkan membangun kerja di seluruh rantai ketergantungan. Dokumentasi juga tersedia untuk `advanced gerrit usage`_.

source: Perform any other host preparation (such as the tasks performed by the ``bootstrap-aio.yml`` playbook). This includes any preparation tasks that are particular to your service.
de: Führen Sie eine andere Host-Vorbereitung durch (z. B. die Tasks, die von der ``bootstrap-aio.yml``-Playbook ausgeführt werden). Dies umfasst alle Vorbereitungsaufgaben, die für Ihren Service spezifisch sind.
id: Lakukan persiapan host lainnya (seperti tugas yang dilakukan oleh playbook ``bootstrap-aio.yml``). Ini termasuk tugas persiapan apa pun yang khusus untuk layanan Anda.

source: Periodic Work
de: Periodische Arbeit
id: Pekerjaan Berkala

source: Please be aware that any patch can be refused by the community if they don't match the :ref:`codeguidelines`.
de: Bitte beachten Sie, dass ein Patch von der Community abgelehnt werden kann, wenn sie nicht mit den folgenden Regeln übereinstimmt :ref:`codeguidelines`.
id: Perlu diketahui bahwa patch apa pun dapat ditolak oleh komunitas jika tidak cocok :ref:`codeguidelines`.

source: Please check our :ref:`bug report<bug_reporting>` and :ref:`bug triage<bug_triage>` processes.
de: Bitte überprüfen Sie unseren :ref:`bug report<bug_reporting>` und :ref:`bug triage <bug_triage>` Prozesse.
id: Silakan periksa :ref:`bug report <bug_reporting>` dan :ref:`bug triage <bug_triage>` proses.

source: Please have a look at a role like os_cinder, os_keystone, or os_neutron for latest files.
de: Bitte sehen Sie sich eine Rolle wie os_cinder, os_keystone oder os_neutron für die neuesten Dateien an.
id: Silakan lihat peran seperti os_cinder, os_keystone, atau os_neutron untuk file terbaru.

source: Please leave the **status** of an issue alone until someone confirms it or a member of the bugs team triages it. While waiting for the issue to be confirmed or triaged the status should remain as **New**.
de: Bitte lassen Sie den **Status** eines Problems alleine, bis jemand es bestätigt oder ein Mitglied des Bugs-Teams es ausprobiert. Während Sie darauf warten, dass das Problem bestätigt oder bestätigt wird, sollte der Status als **New** beibehalten werden.
id: Silakan tinggalkan **status** dari suatu masalah sendirian sampai seseorang mengonfirmasi atau anggota dari tim bug melakukan triage (menetapkan derajat urgensi). Sambil menunggu masalah untuk dikonfirmasi atau diprioritaskan, status harus tetap sebagai **New**.

source: Please look through :dev_docs:`Contributor Guidelines <contributor/contribute.html>` page for more information about the process.
id: Silakan melihat halaman dev_docs:`Contributor Guidelines <contributor/contribute.html>` untuk informasi lebih lanjut tentang proses.

source: Please note in-person attendance at PTG, Summit, mid-cycles, and other code sprints is not a requirement to be a core reviewer. The team will do its best to facilitate virtual attendance at all events. Travel is not to be taken lightly, and we realize the costs involved for those who attend these events.
de: Bitte beachten Sie, dass die Teilnahme an PTG-, Summit-, Mid-Cycle- und anderen Code-Sprints nicht erforderlich ist, um ein Core-Reviewer zu sein. Das Team wird sein Bestes tun, um die virtuelle Teilnahme an allen Veranstaltungen zu erleichtern. Reisen wird nicht auf die leichte Schulter genommen, und wir realisieren die Kosten für diejenigen, die an diesen Veranstaltungen teilnehmen.
id: Harap perhatikan kehadiran langsung di PTG, Summit, mid-cycles, dan kode sprint lainnya bukanlah persyaratan untuk menjadi reviewer inti. Tim akan melakukan yang terbaik untuk memfasilitasi kehadiran virtual di semua acara. Perjalanan tidak bisa dianggap enteng, dan kami menyadari biaya yang harus dikeluarkan untuk mereka yang menghadiri acara ini.

source: Please note that branches before Stein will require cleanup of the YAML file generated by new_releases, as it will contain ALL the roles and openstack-ansible repo SHAs. We have decided to NOT tag the roles anymore, so you will need to remove all the lines which are not relevant to the `openstack-ansible` repository.
id: Harap dicatat bahwa branch sebelum Stein akan membutuhkan pembersihan file YAML yang dihasilkan oleh new_releases, karena akan berisi ALL role dan openstack-ansible repo SHA. Kami telah memutuskan untuk NOT menandai role lagi, jadi Anda harus menghapus semua baris yang tidak relevan dengan repositori `openstack-ansible`.

source: Please reference the `Project Team Guide bugs reference_` for information about bug status/importance and the life cycle of a bug.
de: Bitte beziehen Sie sich auf den `Project Team Guide bugs reference_` für Informationen über Fehlerstatus/Wichtigkeit und den Lebenszyklus eines Fehlers.
id: Silakan referensi `Project Team Guide bugs reference_` untuk informasi tentang bug status/importance dan siklus hidup bug.

source: Prioritize or reprioritize OpenStack-Ansible `confirmed bugs`_.
de: Priorisieren oder repriorisieren Sie OpenStack-Ansible `confirmed bugs`_.
id: Prioritaskan atau prioritaskan ulang OpenStack-Ansible `confirmed bugs`_.

source: Project Onboarding
de: Projekt Onboarding
id: Onboarding Proyek

source: Project repositories
de: Projekt-Repositories
id: Repositori proyek

source: Pull requests submitted through GitHub will be ignored and closed without regard.
de: Pull-Anfragen, die über GitHub gesendet werden, werden ignoriert und ohne Rücksicht geschlossen.
id: Permintaan penarikan yang diajukan melalui GitHub akan diabaikan dan ditutup tanpa memperhatikan.

source: Put together a service install playbook file for your role. This can also be modeled from any existing service playbook that has similar dependencies to your service (database, messaging, storage drivers, container mount points, etc.). A common place to keep playbook files in a Galaxy role is in an ``examples`` directory off the root of the role. If the playbook is meant for installing an OpenStack service, name it ``os-<service>-install.yml`` and target it at the appropriate group defined in the service ``env.d`` file. It is crucial that the implementation of the service is optional and that the deployer must opt-in to the deployment through the population of a host in the applicable host group. If the host group has no hosts, Ansible skips the playbook's tasks automatically.
de: Stellen Sie eine Service-Installations-Playbook-Datei für Ihre Rolle zusammen. Dies kann auch aus jedem vorhandenen Dienst-Playbook modelliert werden, das ähnliche Abhängigkeiten zu Ihrem Dienst aufweist (Datenbank, Messaging, Speichertreiber, Containerbereitstellungspunkte usw.). Ein gängiger Platz zum Speichern von Playbook-Dateien in einer Galaxy-Rolle befindet sich in einem ``examples``-Verzeichnis außerhalb des Stamms der Rolle. Wenn das Playbook zur Installation eines OpenStack-Dienstes gedacht ist, nennen Sie es ``os<service> -install.yml`` und zielen Sie auf die entsprechende Gruppe ab, die in der Service-Datei ``env.d`` definiert ist. Es ist von entscheidender Bedeutung, dass die Implementierung des Service optional ist und dass der Deployer die Bereitstellung über die Population eines Hosts in der entsprechenden Hostgruppe aktivieren muss. Wenn die Hostgruppe keine Hosts hat, überspringt Ansible automatisch die Aufgaben des Playbooks.
id: Menyatukan layanan menginstal file playbook untuk peran Anda. Ini juga dapat dimodelkan dari buku pedoman layanan apa pun yang ada yang memiliki dependensi serupa dengan layanan Anda (basis data, pengiriman pesan, driver penyimpanan, titik pemasangan kontainer (container mount points), dll.). Tempat umum untuk menyimpan file playbook di peran Galaxy adalah dalam direktori ``examples`` dari root peran. Jika playbook dimaksudkan untuk menginstal layanan OpenStack, beri nama ``os- <service> -install.yml`` dan targetkan pada grup yang sesuai yang ditentukan dalam file layanan ``env.d``. Sangat penting bahwa implementasi layanan bersifat opsional dan bahwa pemilik harus memilih untuk menggunakan penyebaran melalui populasi host di grup host yang berlaku. Jika grup host tidak memiliki host, Ansible melompati tugas playbook secara otomatis.

source: Python coding conventions are tested using `PEP8`_, with the following convention exceptions:
de: Python-Kodierungskonventionen werden mit `PEP8`_ mit den folgenden Konvention-Ausnahmen getestet:
id: Konvensi pengkodean python diuji menggunakan `PEP8`_, dengan pengecualian konvensi berikut:

source: RST formatting conventions
de: RST-Formatierungskonventionen
id: Konvensi pemformatan RST

source: Refactoring work must not be backported to a "released" branch.
de: Refactoring-Arbeiten dürfen nicht in einen ``freigegebenen`` Branch zurückportiert werden.
id: Pekerjaan refactoring tidak boleh di-backport ke branch "released".

source: Refactoring work should never include additional "rider" features. Features that may pertain to something that was re-factored should be raised as an issue and submitted in prior or subsequent patches.
de: Refactoring-Arbeiten sollten niemals zusätzliche ``Rider`` -Funktionen enthalten. Funktionen, die sich auf etwas beziehen können, das neu strukturiert wurde, sollten als Problem behandelt und in vorherigen oder nachfolgenden Patches eingereicht werden.
id: Pekerjaan refactoring tidak boleh menyertakan fitur "rider" tambahan. Fitur yang mungkin berkaitan dengan sesuatu yang difaktorkan ulang harus dimunculkan sebagai masalah dan diajukan dalam patch sebelum atau sesudahnya.

source: Refresh static elements in roles. For example, update a specific version of the software packages.
de: Aktualisieren Sie statische Elemente in Rollen. Aktualisieren Sie beispielsweise eine bestimmte Version der Softwarepakete.
id: Segarkan elemen statis dalam peran. Misalnya, perbarui versi tertentu dari paket perangkat lunak.

source: Release Notes
de: Versionshinweise
id: Catatan Rilis

source: Release notes are generated using `the reno tool`_. Release notes must be written with the following guidelines in mind:
de: Versionshinweise werden mit dem `the reno tool`_ erzeugt. Versionshinweise müssen unter Berücksichtigung der folgenden Richtlinien erstellt werden:
id: Catatan rilis dihasilkan menggunakan `the reno tool`_. Catatan rilis harus ditulis dengan pedoman berikut dalam pikiran:

source: Release notes are generated using the `the reno tool`_ and compiled into HTML using Sphinx.
de: Release-Notes werden mit dem `the reno tool`_ generiert und mit Sphinx in HTML übersetzt.
id: Catatan rilis dihasilkan menggunakan `the reno tool`_ dan dikompilasi ke dalam HTML menggunakan Sphinx.

source: Release notes building
de: Versionshinweise erstellen
id: Catatan rilis bangunan

source: Release notes may be built locally by executing:
de: Versionshinweise können lokal erstellt werden, indem Sie Folgendes ausführen:
id: Catatan rilis dapat dibuat secara lokal dengan mengeksekusi:

source: Reported bugs need confirmation, prioritization, and ensure they do not go stale. If you care about OpenStack stability but are not wanting to actively develop the roles and playbooks used within the OpenStack-Ansible project, consider contributing in the area of bug triage.
de: Berichtete Fehler müssen bestätigt und priorisiert werden und sicherstellen, dass sie nicht veraltet sind. Wenn Sie an der Stabilität von OpenStack interessiert sind, aber die Rollen und Playbooks, die im OpenStack-Ansible-Projekt verwendet werden, nicht aktiv entwickeln möchten, sollten Sie einen Beitrag im Bereich der Fehlersuche leisten.
id: Bug yang dilaporkan perlu konfirmasi, prioritas, dan memastikan bug tidak basi. Jika Anda peduli tentang stabilitas OpenStack tetapi tidak ingin secara aktif mengembangkan peran dan buku pedoman yang digunakan dalam proyek OpenStack-Ansible, pertimbangkan untuk berkontribusi dalam bidang bug triage.

source: Reporting a Bug
id: Melaporkan Bug

source: Repository purpose
de: Repository-Zweck
id: Tujuan repositori

source: Repository type or name
de: Repository-Typ oder Name
id: Jenis atau nama repositori

source: Review patch submissions actively and consistently
de: Überprüfen Sie Patch-Eingaben aktiv und konsistent
id: Tinjau pengiriman patch secara aktif dan konsisten

source: Review process
de: Überprüfungsprozess
id: Proses peninjauan

source: Role development maturity
de: Rollenentwicklungsreife
id: Kematangan perkembangan peran

source: Roles functional or scenario testing
de: Rollenfunktions- oder Szenariotests
id: Peran pengujian fungsional atau skenario

source: Running tests locally
de: Tests lokal ausführen
id: Menjalankan tes secara lokal

source: Search for in the `OpenStack-Ansible Launchpad project`_ for the feature request.
de: Suchen Sie im `OpenStack-Ansible Launchpad-Projekt`_ nach der Feature-Anforderung.
id: Cari di `OpenStack-Ansible Launchpad project`_ untuk permintaan fitur.

source: Secrets
de: Geheimnisse
id: Rahasia

source: See also our :ref:`user-overrides` page.
de: Siehe auch unsere :ref:`user-overrides` Seite.
id: Lihat juga halaman kami :ref:`user-overrides`.

source: See also the `OpenStack developers getting started page`_. and our :ref:`contributor guidelines<contributing>` before hacking.
de: Siehe auch die `OpenStack-Entwickler Erste-Schritte-Seite`_. und unsere :ref:`contributor guidelines <contributing>` vor dem Hacken.
id: Lihat juga `OpenStack developers getting started page`_. dan kami :ref:`contributor guidelines<contributing>` sebelum meretas.

source: See also the `working on bugs`_ section of the openstack documentation.
de: Siehe auch den Abschnitt `working on bugs`_ in der openstack-Dokumentation.
id: Lihat juga bagian `working on bugs`_ section dari dokumentasi openstack.

source: See also the `zuul user guide`_.
de: Siehe auch `zuul user guide`_.
id: Lihat juga `zuul user guide`_.

source: See our :ref:`supported-distros` page.
de: Siehe unsere Seite :ref:`supported-distros`.
id: Lihat halaman kami :ref:`supported-distros`.

source: Send a thank you note to all the contributors through the mailing lists. They deserve it.
id: Kirim catatan terima kasih kepada semua kontributor melalui milis. Mereka layak mendapatkannya.

source: Send an email to the openstack-discuss list with the `list of bugs to triage`_ during the week. A new bug marked as *Critical* or *High* must be treated in priority.
de: Senden Sie eine E-Mail an die openstack-discuss-Liste mit der `Liste der Fehler, die während der Woche ausgewählt werden sollen`_. Ein neuer Fehler, der mit *Critical* oder *High* markiert ist, muss vorrangig behandelt werden.
id: Kirim email ke daftar openstack-discuss dengan `list of bugs to triage`_ selama seminggu. Bug baru yang ditandai sebagai *Critical* atau *High* harus diperlakukan sebagai prioritas.

source: Should only be touched if it is a Blocker/Gating issue. If it is, please set to **High**, and only use **Critical** if you have found a bug that can take down whole infrastructures. Once the importance has been changed the status should be changed to **Triaged** by someone other than the bug creator.
de: Sollte nur angefasst werden, wenn es sich um ein Blocker/Gating-Problem handelt. Wenn dies der Fall ist, stellen Sie bitte **High** ein und verwenden Sie nur **Critical**, wenn Sie einen Fehler gefunden haben, der ganze Infrastrukturen zerstören kann. Sobald die Wichtigkeit geändert wurde, sollte der Status von jemand anderem als dem Ersteller des Bugs auf **Triaged** geändert werden.
id: Hanya harus disentuh jika itu adalah masalah Blocker/Gating. Jika ya, setel ke **High**, dan hanya gunakan **Critical** jika Anda telah menemukan bug yang dapat menghapus seluruh infrastruktur. Begitu pentingnya telah diubah, status harus diubah menjadi **Triaged** oleh orang lain selain pencipta bug.

source: Since then, the OpenStack-Ansible has agreed to provide more metadata necessary for releasing into the openstack-ansible code tree. This allowed the tooling for releasing to be more flexible, and lighter, over time.
id: Sejak itu, OpenStack-Ansible telah setuju untuk memberikan lebih banyak metadata yang diperlukan untuk rilis ke openstack-ansible code tree. Ini memungkinkan perangkat untuk rilis menjadi lebih fleksibel, dan lebih ringan, seiring waktu.

source: So You Want to Contribute...
id: Jadi Anda Ingin Berkontribusi ...

source: Some roles have extra tests, like neutron, defined in ``tox.ini``.
id: Beberapa peran memiliki tes tambahan, seperti neutron, yang didefinisikan dalam``tox.ini``.

source: Steps to reproduce the problem if possible.
de: Schritte, um das Problem nach Möglichkeit zu reproduzieren.
id: Langkah-langkah untuk mereproduksi masalah jika memungkinkan.

source: Submit your code for review, with its necessary documentation and release notes.
de: Senden Sie den Code zur Überprüfung mit den erforderlichen Dokumentationen und Versionshinweisen ein.
id: Kirim kode Anda untuk ditinjau, dengan dokumentasi yang diperlukan dan catatan rilis.

source: Submit your role for review.
de: Reichen Sie Ihre Rolle zur Überprüfung ein.
id: Kirim peran Anda untuk ditinjau.

source: Submitting a specification
de: Einreichen einer Spezifikation
id: Mengirimkan spesifikasi

source: Supported distributions
de: Unterstützte Distributionen
id: Distribusi yang didukung

source: Tags and tags conventions
de: Tags und Tags Konventionen
id: Konvensi tag dan tag

source: Tags are assigned based on the relevance of each individual item. Higher level includes (for example in the ``tasks/main.yml``) need high level tags. For example, ``*-config`` or ``*-install``. Included tasks can have more detailed tags.
de: Tags werden basierend auf der Relevanz jedes einzelnen Elements zugewiesen. Höhere Level beinhalten (z.B. in den ``tasks/main.yml``) High-Level-Tags. Zum Beispiel ``*-config`` oder ``*-install``. Enthaltene Aufgaben können detailliertere Tags enthalten.
id: Tag diberikan berdasarkan relevansi masing-masing item. Level yang lebih tinggi termasuk (misalnya dalam ``tasks/main.yml``) perlu tag tingkat tinggi. Misalnya, ``*-config`` or ``*-install``. Tugas yang disertakan dapat memiliki tag yang lebih detail.

source: Task Tracking
id: Pelacakan Tugas (Task Tracking)

source: Task files conventions
de: Task-Dateien Konventionen
id: Konvensi file tugas

source: Test the role on a new machine, using our provided scripts.
de: Testen Sie die Rolle auf einem neuen Computer mit unseren bereitgestellten Skripts.
id: Uji peran pada mesin baru, menggunakan skrip yang disediakan kami.

source: Test your new scenario with a new machine. See also the :ref:`devel_and_testing` page.
de: Testen Sie Ihr neues Szenario mit einer neuen Maschine. Siehe auch die Seite :ref:`devel_and_testing`.
id: Uji skenario baru Anda dengan mesin baru. Lihat juga halaman :ref:`devel_and_testing`.

source: Testing a new role with an AIO
de: Testen einer neuen Rolle mit einem AIO
id: Menguji peran baru dengan AIO

source: Testing may be done locally by executing:
de: Das Testen kann lokal ausgeführt werden, indem Sie Folgendes ausführen:
id: Pengujian dapat dilakukan secara lokal dengan menjalankan:

source: Tests conventions
de: Test Konventionen
id: Tes konvensi

source: The **OpenStack-Ansible roles** repositories
de: Die **OpenStack-Ansible-Rollen** -Repositorys
id: Repositori **OpenStack-Ansible roles**

source: The **ops** repository
de: Das Repository **ops**
id: Repositori **ops**

source: The **specs** repository
de: Das Repository **Spezifikationen**
id: Repositori **specs**

source: The :deploy_guide:`Deployment Guide <index.html>` intends to help deployers deploy OpenStack-Ansible for the first time.
de: Der :deploy_guide:`Deployment Guide <index.html>` beabsichtigt, den Bereitstellern zu helfen, OpenStack-Ansible zum ersten Mal bereitzustellen.
id: The :deploy_guide:`Deployment Guide <index.html>` bermaksud untuk membantu para deployer menggunakan OpenStack-Ansible untuk pertama kalinya.

source: The :dev_docs:`Operations Guide <admin/index.html>` provide help on how to manage and operate OpenStack-Ansible.
de: Das :dev_docs:`Betriebshandbuch <admin/index.html>` gibt Hilfestellung bei der Verwaltung und dem Betrieb von OpenStack-Ansible.
id: The :dev_docs:`Operations Guide <admin/index.html>` memberikan bantuan tentang cara mengelola dan mengoperasikan OpenStack-Ansible.

source: The :dev_docs:`User Guide <user/index.html>` intends to provide user stories on how to do specific things with OpenStack-Ansible.
de: Das :dev_docs:`Benutzerhandbuch <user/index.html>` beabsichtigt, Benutzer Informationen darüber bereitzustellen, wie bestimmte Dinge mit OpenStack-Ansible durchgeführt werden können.
id: The :dev_docs:`User Guide <user/index.html>` bermaksud untuk memberikan kisah pengguna tentang cara melakukan hal-hal spesifik dengan OpenStack-Ansible.

source: The :ref:`bug_triage` will classify if this new feature requires a spec or not.
de: Das :ref:`bug_triage` wird klassifiziert, wenn diese neue Funktion eine Spezifikation erfordert oder nicht.
id: :ref:`bug_triage` akan mengklasifikasikan jika fitur baru ini memerlukan spesifikasi atau tidak.

source: The OpenStack Infrastructure automated tests
de: Die automatisierten OpenStack Infrastructure-Tests
id: OpenStack Infrastructure menguji secara otomatis

source: The OpenStack-Ansible community communicates a lot through IRC, in the #openstack-ansible channel, on freenode. This channel is logged, and its logs are published on http://eavesdrop.openstack.org/irclogs/%23openstack-ansible/.
id: Komunitas OpenStack-Ansible berkomunikasi banyak melalui IRC, di saluran #openstack-ansible, di freenode. Saluran ini dicatat, dan lognya diterbitkan pada http://eavesdrop.openstack.org/irclogs/%23openstack-ansible/.
