Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: de, id

source: Replace the failed hardware and validate the new hardware is functioning.
de: Ersetzen Sie die fehlerhafte Hardware und überprüfen Sie, ob die neue Hardware funktioniert.
id: Ganti perangkat keras yang gagal dan validasikan perangkat keras yang berfungsi.

source: Replacing failed hardware
de: Ersetzen von fehlgeschlagener Hardware
id: Mengganti perangkat keras yang gagal

source: Required
de: Erforderlich

source: Resize or rebuild any instance
de: Ändern Sie die Größe einer Instanz oder erstellen Sie sie neu
id: Ubah ukuran atau rekondisi setiap instance

source: Resizing and moving instances to better hardware
de: Ändern der Größe und Verschieben von Instanzen zu besserer Hardware
id: Mengubah ukuran dan memindahkan instance ke perangkat keras yang lebih baik

source: Resolving some issues may require destroying a container, and rebuilding that container from the beginning. It is possible to destroy and re-create a container with the ``lxc-containers-destroy.yml`` and ``lxc-containers-create.yml`` commands. These Ansible scripts reside in the ``openstack-ansible/playbooks`` repository.
de: Das Beheben einiger Probleme erfordert möglicherweise das Zerstören eines Containers und das erneute Erstellen des Containers von Anfang an. Mit den Befehlen ``lxc-containers-destroy.yml`` und ``lxc-containers-create.yml`` kann ein Container gelöscht und neu erstellt werden. Diese Ansible-Skripte befinden sich im Repository ``openstack-ansible/playbooks``.
id: Menyelesaikan beberapa masalah mungkin memerlukan penghancuran kontainer, dan membangun kembali kontainer itu dari awal. Anda dapat menghancurkan dan menciptakan kembali kontainer dengan perintah ``lxc-containers-destroy.yml`` dan ``lxc-containers-create.yml``. Skrip Ansible ini berada di repositori ``openstack-ansible/playbooks``.

source: Restart MariaDB in the new container and verify that it rejoins the cluster.
de: Starten Sie MariaDB in dem neuen Container neu, und vergewissern Sie sich, dass es erneut dem Cluster beitritt.
id: Mulai ulang MariaDB di kontainer baru dan verifikasi bahwa ini bergabung kembali dengan kluster.

source: Restart MariaDB on the failed node and verify that it rejoins the cluster.
de: Starten Sie MariaDB auf dem fehlgeschlagenen Knoten neu, und vergewissern Sie sich, dass es erneut dem Cluster beitritt.
id: Restart MariaDB pada node gagal dan verifikasi bahwa itu bergabung kembali dengan cluster.

source: Restart MariaDB on the failed nodes and verify that they rejoin the cluster:
de: Starten Sie MariaDB auf den ausgefallenen Knoten neu und vergewissern Sie sich, dass sie dem Cluster wieder beitreten:
id: Restart MariaDB pada node gagal dan verifikasi bahwa mereka bergabung kembali dengan cluster:

source: Restart MariaDB on the other nodes (replace [0] from previous ansible command with [1:]) and verify that they rejoin the cluster.
de: Starten Sie MariaDB auf den anderen Knoten neu (ersetzen Sie [0] von dem vorherigen Befehl ansible mit [1:]), und vergewissern Sie sich, dass sie dem Cluster wieder beitreten.
id: Restart MariaDB pada node lain (ganti [0] dari perintah ansible sebelumnya dengan [1:]) dan verifikasi bahwa mereka bergabung kembali dengan cluster.

source: Restart a Networking agent container
de: Starten Sie einen Container für den Netzwerkagenten neu
id: Nyalakan kembali kontainer agen Jaringan

source: Restart your OpenStack services by accessing every controller node. Some OpenStack services will require restart from other nodes in your environment.
de: Starten Sie Ihre OpenStack-Dienste neu, indem Sie auf jeden Controller-Knoten zugreifen. Einige OpenStack-Dienste erfordern einen Neustart von anderen Knoten in Ihrer Umgebung.
id: Mulai ulang (restart) layanan OpenStack Anda dengan mengakses setiap node pengontrol. Beberapa layanan OpenStack akan membutuhkan restart dari node lain di lingkungan Anda.

source: Restarting OpenStack services
de: Neustart der OpenStack-Dienste
id: Mulai ulang (restart) layanan OpenStack

source: Restarting services
de: Dienste neu starten
id: Memulai kembali layanan

source: Restore from backup if all of the nodes in a Galera cluster fail (do not shutdown gracefully). Change to the ``playbook`` directory and run the following command to determine if all nodes in the cluster have failed:
de: Von der Sicherung wiederherstellen, wenn alle Knoten in einem Galera-Cluster fehlschlagen (nicht ordnungsgemäß herunterfahren). Wechseln Sie in das Verzeichnis ``playbook`` und führen Sie den folgenden Befehl aus, um festzustellen, ob alle Knoten im Cluster ausgefallen sind:
id: Kembalikan dari backup jika semua node dalam gugus Galera gagal (jangan mematikan dengan perlahan). Ubah ke direktori ``playbook`` dan jalankan perintah berikut untuk menentukan apakah semua node dalam gugus telah gagal:

source: Restoring inventory from backup
de: Inventar von der Sicherung wiederherstellen
id: Memulihkan inventaris dari backup

source: Review container networking traffic
de: Überprüfen Sie den Netzwerkverkehr des Containers
id: Tinjau lalu lintas jaringan kontainer

source: Routine maintenance includes gracefully adding or removing nodes from the cluster without impacting operation and also starting a cluster after gracefully shutting down all nodes.
de: Die routinemäßige Wartung umfasst das Hinzufügen oder Entfernen von Knoten aus dem Cluster ohne Auswirkungen auf den Betrieb und das Starten eines Clusters nach dem ordnungsgemäßen Herunterfahren aller Knoten.
id: Pemeliharaan rutin termasuk menambahkan atau menghapus node dari cluster tanpa mengurangi operasi dan juga memulai cluster setelah secara anggun menutup semua node.

source: Run ``rabbitmqctl cluster_status`` from either node.
de: Führen Sie ``rabbitmqctl cluster_status`` von jedem Knoten aus.
id: Jalankan ``rabbitmqctl cluster_status`` dari salah satu node.

source: Run an OpenStack command that uses one or more APIs. For example:
de: Führen Sie einen OpenStack-Befehl aus, der eine oder mehrere APIs verwendet. Beispielsweise:
id: Jalankan perintah OpenStack yang menggunakan satu atau lebih API. Sebagai contoh:

source: Run an OpenStack command to ensure all the compute services are working (the output depends on your configuration) For example:
de: Führen Sie einen OpenStack-Befehl aus, um sicherzustellen, dass alle Compute-Services funktionieren (die Ausgabe hängt von Ihrer Konfiguration ab). Beispiel:
id: Jalankan perintah OpenStack untuk memastikan semua layanan komputasi bekerja (output tergantung pada konfigurasi Anda) Misalnya:

source: Run an OpenStack command to ensure the block storage services are working (depends on your configuration). For example:
de: Führen Sie einen OpenStack-Befehl aus, um sicherzustellen, dass die Blockspeicherdienste funktionieren (abhängig von Ihrer Konfiguration). Beispielsweise:
id: Jalankan perintah OpenStack untuk memastikan layanan penyimpanan blok berfungsi (tergantung pada konfigurasi Anda). Sebagai contoh:

source: Run an OpenStack command to ensure the image storage service is working (depends on your uploaded images). For example:
de: Führen Sie einen OpenStack-Befehl aus, um sicherzustellen, dass der Abbildspeicherdienst funktioniert (abhängig von Ihren hochgeladenen Abbildern). Beispielsweise:
id: Jalankan perintah OpenStack untuk memastikan layanan penyimpanan image berfungsi (tergantung pada gambar yang Anda unggah). Sebagai contoh:

source: Run an OpenStack command to ensure the networking services are working (the output also depends on your configuration) For example:
de: Führen Sie einen OpenStack-Befehl aus, um sicherzustellen, dass die Netzwerkdienste funktionieren (die Ausgabe hängt auch von Ihrer Konfiguration ab). Beispiel:
id: Jalankan perintah OpenStack untuk memastikan layanan jaringan berfungsi (hasilnya juga tergantung pada konfigurasi Anda) Misalnya:

source: Run an OpenStack command to reveal all endpoints from your deployment. For example:
de: Führen Sie einen OpenStack-Befehl aus, um alle Endpunkte Ihrer Bereitstellung anzuzeigen. Beispielsweise:
id: Jalankan perintah OpenStack untuk mengungkapkan semua titik akhir dari penerapan Anda. Sebagai contoh:

source: Run the **openstack-ansible lxc-containers-destroy.yml** commands, specifying the target containers and the container to be destroyed.
de: Führen Sie die Befehle **openstack-ansible lxc-containers-destroy.yml** aus und geben Sie die Zielcontainer und den zu zerstörenden Container an.
id: Jalankan perintah **openstack-ansible lxc-containers-destroy.yml**, tentukan kontainer target dan kontainer yang akan dihancurkan.

source: Run the ``galera-install`` playbook using the ``galera-bootstrap`` tag to automatically recover a node or an entire environment.
de: Führen Sie das ``galera-install`` Playbook mit dem ``galera-bootstrap`` Tag aus, um einen Knoten oder eine gesamte Umgebung automatisch wiederherzustellen.
id: Jalankan ``galera-install`` playbook menggunakan tag ``galera-bootstrap`` untuk memulihkan node atau seluruh lingkungan secara otomatis.

source: Run the ``openstack image list`` command to ensure that the API and registry is working.
de: Führen Sie den Befehl ``openstack image list`` aus, um sicherzustellen, dass die API und die Registrierung funktionieren.
id: Jalankan perintah ``openstack image list`` untuk memastikan bahwa API dan registri berfungsi.

source: Run the ``remove_compute_node.yml`` Ansible playbook with the ``host_to_be_removed`` user variable set:
de: Führen Sie das ``remove_compute_node.yml`` Ansible-Playbook mit der ``host_to_be_removed``-Benutzervariablen aus:
id: Jalankan playbook ``remove_compute_node.yml`` yang dimungkinkan dengan set variabel pengguna ``host_to_be_removed``:

source: Run the ``setup-everything.yml`` playbook with the ``limit`` argument.
de: Führen Sie das ``setup-everything.yml``-Playbook mit dem ``limit``-Argument aus.
id: Jalankan playbook ``play-everything.yml`` dengan argumen ``limit``.

source: Run the ad-hoc Ansible commands from the ``openstack-ansible/playbooks`` directory.
de: Führen Sie die Ad-hoc-Ansible-Befehle aus dem Verzeichnis ``openstack-ansible/playbooks`` aus.
id: Jalankan perintah Ad-hoc Ansible dari direktori ``openstack-ansible/playbooks``.

source: Run the appropriate playbook commands after changing the configuration to create the new containers, and install the appropriate services.
de: Führen Sie die entsprechenden Playbook-Befehle aus, nachdem Sie die Konfiguration geändert haben, um die neuen Container zu erstellen, und installieren Sie die entsprechenden Dienste.
id: Jalankan perintah playbook yang sesuai setelah mengubah konfigurasi untuk membuat kontainer baru, dan instal layanan yang sesuai.

source: Run the appropriate playbooks depending on the ``group_binds`` section.
de: Führen Sie die entsprechenden Playbooks aus, abhängig vom Abschnitt ``group_binds``.
id: Jalankan playbook yang sesuai tergantung pada bagian ``group_binds``.

source: Run the following Ansible command to show the failed nodes:
de: Führen Sie den folgenden Ansible-Befehl aus, um die ausgefallenen Knoten anzuzeigen:
id: Jalankan perintah Ansible berikut untuk menunjukkan node yang gagal:

source: Run the following command to `rebootstrap <https://galeracluster.com/documentation-webpages/quorumreset.html>`_ the operational node into the cluster:
de: Führen Sie den folgenden Befehl aus, zur `Wiederaufnahme <https://galeracluster.com/documentation-webpages/quorumreset.html>`_ der operative Knoten in den Cluster:
id: Jalankan perintah berikut untuk `rebootstrap <https://galeracluster.com/documentation-webpages/quorumreset.html>`_ node operasional ke dalam kluster:

source: Run the following command to remove all currently cached facts for all hosts:
de: Führen Sie den folgenden Befehl aus, um alle aktuell zwischengespeicherten Fakten für alle Hosts zu entfernen:
id: Jalankan perintah berikut untuk menghapus semua fakta yang di-cache saat ini untuk semua host:

source: Run the following commands to add the host. Replace ``NEW_HOST_NAME`` with the name of the new host.
de: Führen Sie die folgenden Befehle aus, um den Host hinzuzufügen. Ersetzen Sie ``NEW_HOST_NAME`` durch den Namen des neuen Hosts.
id: Jalankan perintah berikut untuk menambahkan host. Ganti ``NEW_HOST_NAME`` dengan nama host baru.

source: Run the following commands:
de: Führen Sie die folgenden Befehle aus:
id: Jalankan perintah berikut:

source: Run the host setup playbook to rebuild the container on node 3:
de: Führen Sie das Host-Setup-Playbook aus, um den Container auf Knoten 3 neu zu erstellen:
id: Jalankan host setup playbook untuk membangun kembali kontainer pada node 3:

source: Run the infrastructure playbook to configure the container specifically on node 3:
de: Führen Sie das Infrastruktur-Playbook aus, um den Container speziell auf Knoten 3 zu konfigurieren:
id: Jalankan playbook infrastruktur untuk mengonfigurasi kontainer secara spesifik di node 3:

source: Running ad-hoc Ansible plays
de: Lauf Ad-hoc Ansible spielt
id: Menjalankan ad-hoc Ansible plays

source: Running the copy module
de: Das Kopiermodul ausführen
id: Menjalankan modul copy

source: Running the shell module
de: Das Shell-Modul ausführen
id: Menjalankan modul shell

source: Running the upgrade script
de: Ausführen des Upgrade-Skripts
id: Menjalankan skrip pemutakhiran

source: Scale individual services
de: Skalieren Sie einzelne Dienste
id: Skala layanan individual

source: Scaling your environment
de: Skalieren Sie Ihre Umgebung
id: Scaling lingkungan Anda

source: See the following links for additional information to verify OpenStack services:
de: Weitere Informationen zum Überprüfen der OpenStack-Dienste finden Sie in den folgenden Links:
id: Lihat tautan berikut untuk informasi tambahan untuk memverifikasi layanan OpenStack:

source: See the hosts in the ``nova_compute`` group that a playbook runs against:
de: Sehen Sie sich die Hosts in der ``nova_compute``-Gruppe an, gegen die ein Playbook ausgeführt wird:
id: Lihat beberapa host di grup ``nova_compute`` dimana playbook bertentangan:

source: See the tasks that are executed on hosts in the ``nova_compute`` group:
de: Sehen Sie sich die Aufgaben an, die auf Hosts in der ``nova_compute``-Gruppe ausgeführt werden:
id: Lihat tugas yang dijalankan pada host di grup ``nova_compute``:

source: Select an instance from the list of available instances.
de: Wählen Sie eine Instanz aus der Liste der verfügbaren Instanzen.
id: Pilih sebuah instance dari daftar instance yang tersedia.

source: Select the **Admin** tab in the navigation pane and click **images**.
de: Wählen Sie im Navigationsbereich die Registerkarte **Admin** und klicken Sie auf **Abbilder**.
id: Pilih tab **Admin** di panel navigasi dan klik **images**.

source: Selective Pruning
de: Selektives Beschneiden
id: Pemangkasan Selektif

source: Set instances on the failed node to be hosted on a different node:
de: Legen Sie Instanzen auf dem ausgefallenen Knoten fest, die auf einem anderen Knoten gehostet werden sollen:
id: Setel instance pada node yang gagal untuk di-host pada node yang berbeda:

source: Show all groups and which hosts belong to them:
de: Zeige alle Gruppen und welche Hosts gehören zu ihnen:
id: Tunjukkan semua grup dan host mana yang menjadi milik mereka:

source: Show all hosts and the groups to which they belong:
de: Zeige alle Hosts und die Gruppen denen sie angehören:
id: Tunjukkan semua host dan grup tempat mereka berada:

source: Shut down the Block Storage host:
de: Fahren Sie den Blockspeicher-Host herunter:
id: Matikan host Block Storage:

source: Shut down the Compute host:
de: Fahren Sie den Compute-Host herunter:
id: Matikan host Compute:

source: Shut down the instances:
de: Herunterfahren der Instanzen:
id: Matikan instance:

source: Shutting down the Block Storage host
de: Den Blockspeicher-Host herunterfahren
id: Mematikan host Block Storage

source: Shutting down the Compute host
de: Herunterfahren des Compute-Hosts
id: Mematikan host Compute

source: Similar to adding a provider network, the removal process uses the same procedure but in a reversed order. The Neutron ports will need to be removed, prior to the removal of the OpenStack-Ansible configuration.
de: Ähnlich wie beim Hinzufügen eines Provider-Netzwerks wird beim Entfernen derselbe Vorgang verwendet, jedoch in umgekehrter Reihenfolge. Die Neutron-Ports müssen vor dem Entfernen der OpenStack-Ansible-Konfiguration entfernt werden.
id: Mirip dengan menambahkan jaringan penyedia, proses penghapusan menggunakan prosedur yang sama tetapi dalam urutan terbalik. Port Neutron perlu dihapus, sebelum penghapusan konfigurasi OpenStack-Ansible.

source: Skipping the ``nova-key`` tag is necessary so that the keys on all Compute hosts are not gathered.
de: Das Überspringen des ``nova-key``-Tags ist erforderlich, damit die Schlüssel auf allen Compute-Hosts nicht erfasst werden.
id: Melewati tag ``nova-key`` diperlukan sehingga kunci pada semua host Compute tidak terkumpul.

source: Soft or hard reset the instance
de: Weiches oder hartes Zurücksetzen der Instanz
id: Pengaturan ulang perangkat lunak atau keras instance

source: Some containers, such as ``cinder``, ``glance``, ``neutron_agents``, and ``swift_proxy`` have more than two interfaces to support their functions.
de: Einige Container wie ``cinder``, ``glance``,``neutron_agents`` und ``swift_proxy`` haben mehr als zwei Schnittstellen, um ihre Funktionen zu unterstützen.
id: Beberapa kontainer, seperti ``cinder``, ``glance``, ``neutron_agents``, dan ``swift_proxy`` memiliki lebih dari dua antarmuka untuk mendukung fungsinya.

source: Source the ``admin`` tenant credentials:
de: Geben Sie die Anmeldeinformationen für den Administrator ``admin`` an:
id: Beri sumber kredensial penyewa (tenant credential) ``admin``:

source: Specify a customisation script. This script runs after the instance launches and becomes active.
de: Geben Sie ein Anpassungsskript an. Dieses Skript wird ausgeführt, nachdem die Instanz gestartet wurde und aktiv wird.
id: Tentukan skrip penyesuaian. Skrip ini berjalan setelah instance diluncurkan dan menjadi aktif.

source: Specify a key pair with this option. If the image uses a static key set (not recommended), a key pair is not needed.
de: Geben Sie ein Schlüsselpaar mit dieser Option an. Wenn das Abbild einen statischen Schlüsselsatz verwendet (nicht empfohlen), wird kein Schlüsselpaar benötigt.
id: Tentukan pasangan kunci dengan opsi ini. Jika image menggunakan static key set (tidak disarankan), pasangan kunci tidak diperlukan.

source: Specify whether the instance will be based on an image or a snapshot. If it is the first time creating an instance, there will not yet be any snapshots available.
de: Geben Sie an, ob die Instanz auf einem Abbild oder einem Snapshot basieren soll. Wenn Sie zum ersten Mal eine Instanz erstellen, sind noch keine Snapshots verfügbar.
id: Tentukan apakah instance akan didasarkan pada image atau snapshot. Jika ini kali pertama membuat instance, belum akan ada snapshot yang tersedia.

source: Start a cluster
de: Starten Sie einen Cluster
id: Mulai kluster

source: Start a new cluster on the most advanced node. Change to the ``playbooks`` directory and check the ``seqno`` value in the ``grastate.dat`` file on all of the nodes:
de: Starten Sie einen neuen Cluster auf dem am weitesten fortgeschrittenen Knoten. Wechseln Sie in das Verzeichnis ``playbooks`` und überprüfen Sie den Wert ``seqno`` in der Datei ``grastate.dat`` auf allen Knoten:
id: Mulai kluster baru di node paling canggih. Ubah ke direktori ``playbook`` dan periksa nilai ``seqno`` di file ``grastate.dat`` pada semua node:

source: Start your instances and confirm all of the instances are started:
de: Starten Sie Ihre Instanzen und bestätigen Sie, dass alle Instanzen gestartet wurden:
id: Mulai instance Anda dan konfirmasikan semua instance sudah dimulai:

source: Stop and restart a RabbitMQ cluster
de: Stoppen und starten Sie einen RabbitMQ-Cluster neu
id: Berhenti dan mulai kembali klaster RabbitMQ

source: Terminate the instance under the **Actions** column.
de: Beenden Sie die Instanz in der Spalte **Aktionen**.
id: Hentikan instance di bawah kolom **Actions**.

source: Test new compute nodes
de: Testen Sie neue Compute-Knoten
id: Uji node komputasi baru

source: Test new infra nodes
de: Testen Sie neue Infra-Knoten
id: Uji infra node baru

source: The **Actions** column includes the following options:
de: Die Spalte **Aktionen** enthält die folgenden Optionen:
id: Kolom **Actions** berisi opsi berikut:

source: The **openstack flavor list** command lists the *flavors* that are available. These are different disk sizes that can be assigned to images:
de: Der Befehl **openstack flavor list** listet die verfügbaren *flavors* auf. Dies sind unterschiedliche Datenträgergrößen, die Abbildern zugeordnet werden können:
id: Perintah **openstack flavor list** mencantumkan *flavors* yang tersedia. Ini adalah berbagai ukuran disk yang dapat ditetapkan untuk images:

source: The **openstack floating ip list** command lists the currently available floating IP addresses and the instances they are associated with:
de: Der Befehl **openstack floating ip list** listet die derzeit verfügbaren Floating-IP-Adressen und die Instanzen auf, denen sie zugeordnet sind:
id: Perintah **openstack floating ip list** mencantumkan alamat IP mengambang yang tersedia saat ini dan instance yang terkait dengan:

source: The ``/etc/openstack_deploy/`` directory contains a live inventory, host structure, network information, passwords, and options that are applied to the configuration files for each service in your OpenStack deployment. Back up the ``/etc/openstack_deploy/`` directory to a remote location.
de: Das Verzeichnis ``/etc/openstack_deploy/`` enthält eine Live-Bestandsliste, eine Hoststruktur, Netzwerkinformationen, Kennwörter und Optionen, die auf die Konfigurationsdateien für jeden Dienst in Ihrer OpenStack-Bereitstellung angewendet werden. Sichern Sie das Verzeichnis ``/etc/openstack_deploy/`` an einem Remote-Speicherort.
id: Direktori ``/etc/openstack_deploy/`` berisi inventaris langsung, struktur host, informasi jaringan, kata sandi, dan opsi yang diterapkan ke file konfigurasi untuk setiap layanan dalam penerapan OpenStack Anda. Cadangkan direktori ``/etc/openstack_deploy/`` ke lokasi terpencil (remote).

source: The ``Link:`` lines will show the network interfaces that are attached to the utility container.
de: Die ``Link:``-Zeilen zeigen die Netzwerkschnittstellen, die an den Utility-Container angehängt sind.
id: Baris ``Link:`` akan menampilkan antarmuka jaringan yang terpasang pada kontainer utilitas.

source: The `openstack-ansible-ops <https://opendev.org/openstack/openstack-ansible-ops>`_ repository contains a playbook for removing a compute host from an OpenStack-Ansible environment. To remove a compute host, follow the below procedure.
de: Die `openstack-ansible-ops <https://opendev.org/openstack/openstack-ansible-ops>`_ repository enthält ein Playbook zum Entfernen eines Compute-Hosts aus einer OpenStack-Ansible-Umgebung. Gehen Sie folgendermaßen vor, um einen Computerhost zu entfernen.
id: The `openstack-ansible-ops <https://opendev.org/openstack/openstack-ansible-ops>`_ repositori berisi buku pedoman untuk menghapus host komputasi dari lingkungan OpenStack-Ansible. Untuk menghapus host komputasi, ikuti prosedur di bawah ini.
