Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-user.po
Languages: de, id, ru

source: Variables ``haproxy_security_child_src_records`` and ``haproxy_security_connect_src_records`` are only available staring with 2024.2 (Dalmatian) version. You need to override ``haproxy_security_headers_csp`` as a whole for earlier releases
ru: Переменные ``haproxy_security_child_src_records`` и ``haproxy_security_connect_src_records`` доступны только начиная с версии 2024.2 (Dalmatian). Для более ранних версий вам необходимо полностью переопределить ``haproxy_security_headers_csp``

source: Virtual machines with SSD storage: ~ 45-60 minutes
de: Virtuelle Maschinen mit SSD-Speicher: ~ 45-60 Minuten
id: Mesin virtual dengan penyimpanan SSD: ~ 45-60 menit
ru: Виртуальные серверы с SSD диском: ~45-60 минут

source: We also need to define a complete new set of groups for Ceph, to deploy multiple independent instances of it.
ru: Нам также необходимо определить совершенно новый набор групп для Ceph, чтобы развернуть несколько его независимых инстансов.

source: We also need to define a couple of extra Keepalived instances in order to secure DNS RR approach, along with configuring Keepalived in unicast mode. For that create a file ``/etc/openstack_deploy/group_vars/haproxy/keepalived.yml`` with following content:
ru: Нам также нужно определить несколько дополнительных инстансов Keepalived для обеспечения подхода DNS RR, а также настроить Keepalived в одноадресном режиме. Для этого создайте файл ``/etc/openstack_deploy/group_vars/haproxy/keepalived.yml`` со следующим содержимым:

source: We need to make adjustments to each HAProxy service definition to:
ru: Нам необходимо внести изменения в каждое определение службы HAProxy, чтобы:

source: We recommend you set your ``/etc/environment`` variables with proxy settings before launching any scripts or playbooks to avoid failure.
de: Wir empfehlen, dass Sie Ihre `` / etc / environment``-Variablen mit Proxy-Einstellungen festlegen, bevor Sie Skripte oder Playbooks starten, um Fehler zu vermeiden.
id: Kami menyarankan Anda mengatur variabel ``/etc/environment`` Anda dengan pengaturan proxy sebelum meluncurkan skrip atau playbook apa saja untuk menghindari kegagalan.
ru: Мы рекомендуем задать ваши переменные окружения с настройками прокси в ``/etc/environment`` перед запуском каких-либо скриптов или плейбуков что бы избежать ошибок.

source: We suggest referring to each service api-paste.ini for more details on how to properly configure overrides.
ru: Мы рекомендуем обратиться к api-paste.ini каждой службы для получения более подробной информации о том, как правильно настроить переопределения.

source: When building an AIO on a new server, it is recommended that all system packages are upgraded and then reboot into the new kernel:
de: Wenn Sie ein AIO auf einem neuen Server erstellen, wird empfohlen, dass alle Systempakete aktualisiert werden und anschließend in den neuen Kernel neu gestartet werden:
id: Ketika membangun AIO di server baru, disarankan agar semua paket sistem ditingkatkan dan kemudian reboot ke kernel baru:
ru: Перед установкой AIO на новый сервер, рекомендуется обновить все системные пакеты и после этого выполнить перезагрузку в новое ядро:

source: When creating a custom group, first create a skeleton in ``/etc/openstack_deploy/env.d/``. The following is an example of an inventory skeleton for a group named ``custom2_hosts`` that will consist of bare metal hosts, and has been created at ``/etc/openstack_deploy/env.d/custom2_hosts.yml``.
id: Saat membuat grup kustom, pertama buat kerangka (skeleton) di ``/etc/openstack_deploy/env.d/``. Berikut ini adalah contoh inventory skeleton untuk grup bernama ``custom2_hosts`` yang akan terdiri dari host bare metal, dan telah dibuat di ``/etc/openstack_deploy/env.d/custom2_hosts.yml``.
ru: Когда создается пользовательская группа, сначала создайте структуру в ``/etc/openstack_deploy/env.d/``. Следующий пример содержит в себе структуру inventory для группы с названием ``custom2_hosts``, который будет состоять из физических серверов и создан в ``/etc/openstack_deploy/env.d/custom2_hosts.yml``.

source: When deploying RabbitMQ with support for quorum and stream queues, the retention behaviour for messages changes. Stream queues maintain an append only log on disk of all messages received until a retention policy indicates they should be disposed of. By default, this policy is set with a per-stream `x-max-age` of 1800 seconds. However, as noted in the `RabbitMQ docs`_, this only comes into effect ones a stream has accumulated enough messages to fill a segment, which has a default size of 500MB.
ru: При развертывании RabbitMQ с поддержкой очередей кворума и потоков, поведение хранения сообщений меняется. Потоковые очереди поддерживают журнал только для добавления на диск всех полученных сообщений до тех пор, пока политика хранения не укажет, что их следует удалить. По умолчанию эта политика установлена ​​с `x-max-age` для каждого потока в 1800 секунд. Однако, как отмечено в `документации RabbitMQ`_, это вступает в силу только тогда, когда поток накопил достаточно сообщений для заполнения сегмента, размер которого по умолчанию составляет 500 МБ.

source: When deploying with OpenStack-Ansible, you can either use self-signed certificates that are generated during the deployment process or provide SSL certificates, keys, and CA certificates from your own trusted certificate authority. Highly secured environments use trusted, user-provided certificates for as many services as possible.
de: Bei der Bereitstellung mit OpenStack-Ansible können Sie entweder selbst signierte Zertifikate verwenden, die während des Bereitstellungsprozesses generiert werden, oder SSL-Zertifikate, Schlüssel und CA-Zertifikate von Ihrer eigenen vertrauenswürdigen Zertifizierungsstelle bereitstellen. In stark gesicherten Umgebungen werden vertrauenswürdige, vom Benutzer bereitgestellte Zertifikate für so viele Dienste wie möglich verwendet.
id: Saat menggunakan dengan OpenStack-Ansible, Anda bisa menggunakan sertifikat yang ditandatangani sendiri yang dihasilkan selama proses penyebaran atau memberikan sertifikat SSL, kunci, dan sertifikat CA dari otoritas sertifikat tepercaya Anda sendiri. Lingkungan yang sangat aman menggunakan sertifikat terpercaya, user-provided (disediakan pengguna) untuk sebanyak mungkin layanan.
ru: Во время развертывания с OpenStack-Ansible вы можете либо использовать самоподписанные сертификаты, которые будут сгенерированы во время процесса развертывания, либо предоставить SSL сертификаты, ключи и промежуточные сертификаты для вашего доверенного центра сертификации. Высокозащищенные окружения используют доверенные сертификаты, предоставленные пользователями, для максимально возможного количества сервисов.

source: When enabled HAProxy will use the same TLS certificate on all interfaces (internal and external). It is not currently possible in OpenStack-Ansible to use different self-signed or user-provided TLS certificates on different HAProxy interfaces.
ru: При включении HAProxy будет использовать один и тот же сертификат TLS на всех интерфейсах (внутренних и внешних). В настоящее время в OpenStack-Ansible невозможно использовать различные самоподписанные или предоставленные пользователем сертификаты TLS на различных интерфейсах HAProxy.

source: When running OpenStack-Ansible in network environments that block internet connectivity, we recommend the following set of practices and configuration overrides for deployers to use.
id: Saat menjalankan OpenStack-Ansible di lingkungan jaringan yang memblokir konektivitas internet, kami menyarankan serangkaian praktik dan konfigurasi yang ditimpa untuk digunakan oleh deployers.
ru: При запуске OpenStack-Ansible в окружениях, которые блокируют интернет соединение, мы рекомендуем использовать следующий набор практик и переопределений настроек для использования.

source: When using VNC for console access there are 3 connections to secure, client to HAProxy, HAProxy to noVNC Proxy and noVNC Proxy to Compute nodes. The `OpenStack Nova Docs for remote console access`_ cover console security in much more detail.
ru: При использовании VNC для доступа к консоли необходимо защитить 3 соединения: клиент к HAProxy, HAProxy к noVNC Proxy и noVNC Proxy к вычислительным узлам. В `OpenStack Nova Docs for remote console access`_ безопасность консоли рассматривается гораздо более подробно.

source: When using federated login you will need to override the default Content Security Policy to allow access to your authorisation server by overriding the ``haproxy_horizon_csp`` variable in the ``/etc/openstack_deploy/user_variables.yml`` file:
ru: При использовании федеративного входа вам потребуется переопределить политику безопасности контента по умолчанию, чтобы разрешить доступ к вашему серверу авторизации, переопределив переменную ``haproxy_horizon_csp`` в файле ``/etc/openstack_deploy/user_variables.yml``:

source: When you deployed Gnocchi on multiple servers to distribute the work, add Zookeeper as coordination backend. To setup Zookeeper, you can use `this ansible role`_.
id: Saat Anda menggunakan Gnocchi di beberapa server untuk mendistribusikan pekerjaan, tambahkan Zookeeper sebagai backend koordinasi. Untuk mengatur Zookeeper, Anda dapat menggunakan `this ansible role`_.
ru: Когда вы установили Gnocchi на нескольких серверах для распределения работы, добавьте Zookeper для координации. Для установки Zookeeper, вы можете использовать `эту ansible роль`_.

source: When your Swift API endpoint uses Ceph as a backend, the only one left for this setup is Redis.
ru: Если эндпойнт Swift API использует Ceph в качестве бекэнда, для этой настройки остается только Redis.

source: While path-based endpoints might look tempting due to using FQDN and thus not having the need for wildcard TLS, they are harder to maintain and more complex to set up. Also worth mentioning, that not all services are ready to support path-based endpoints, despite this approach being used in devstack.
ru: Хотя точки доступа на основе пути могут выглядеть заманчиво из-за использования FQDN и, таким образом, отсутствия необходимости в wildcard TLS, их сложнее поддерживать и настраивать. Также стоит упомянуть, что не все службы готовы поддерживать точки доступа на основе пути, несмотря на то, что этот подход используется в devstack.

source: While these are all changes, that need to be done in ``openstack_user_config.yml``, there is one more override that needs to be applied.
ru: Хотя все эти изменения необходимо внести в ``openstack_user_config.yml``, необходимо применить еще одно переопределение.

source: While this is the simplest approach, as it does not require any extra configuration and is easy to start with, it also has some disadvantages. For example, some clients or organizations might not be allowed to connect to custom ports which completely disables the ability to use them in such deployments.
ru: Хотя это самый простой подход, так как он не требует дополнительной настройки и прост в запуске, он также имеет некоторые недостатки. Например, некоторым клиентам или организациям может быть запрещено подключаться к произвольным портам, что полностью отключает возможность их использования в таких развертываниях.

source: While you can consider having a wildcard or SAN TLS certificate for the domain to cover all service endpoints in this setup, it is still possible to use Let's Encrypt certificates with dns-01 authentication or by supplying a list of subdomains which issued certificate will cover.
ru: Хотя вы можете рассмотреть возможность использования wildcard сертификата или сертификата SAN TLS для домена, чтобы охватить все точки доступа службы в этой настройке, по-прежнему можно использовать сертификаты Let's Encrypt с аутентификацией dns-01 или предоставить список поддоменов, на которые будет распространяться выданный сертификат.

source: With changes made to ``haproxy_<service>_service_overrides`` variable you need to re-run a service-specific playbook with `haproxy-service-config` tag, for example ``openstack-ansible openstack.osa.keystone --tags haproxy-service-config``.
ru: После внесения изменений в переменную ``haproxy_<service>_service_overrides`` вам необходимо повторно запустить сценарий для конкретной службы с тегом `haproxy-service-config`, например ``openstack-ansible openstack.osa.keystone --tags haproxy-service-config``.

source: With content like below, where N should be AZ number depending on the file:
ru: С контентом как указано ниже, где N должен быть номером AZ в зависимости от файла:

source: With that, the only correct approach here would be to adjust ``api-paste.ini`` for each respective service. But, Keystone specifically, does not support api-paste.ini files. So the only way around it is actually a uWSGI rewrite and to define a `public_endpoint` in `keystone.conf`:
ru: При этом единственным правильным подходом здесь будет настройка ``api-paste.ini`` для каждой соответствующей службы. Но, в частности, Keystone не поддерживает файлы api-paste.ini. Поэтому единственный способ обойти это — фактически использовать uWSGI rewrite и определить `public_endpoint` в `keystone.conf`:

source: Within defined provider networks, ``address_prefix`` is used to override the prefix of the key added to each host that contains IP address information. This should usually be one of either ``container``, ``tunnel``, or ``storage``. ``reference_group`` contains the name of a defined pod group and is used to limit the scope of each provider network to that group.
de: Innerhalb definierter Provider-Netzwerke wird `address_prefix`` verwendet, um das Präfix des Schlüssels zu überschreiben, der jedem Host hinzugefügt wurde, der IP-Adressinformationen enthält. Dies sollte normalerweise entweder ``Container``, ``Tunnel`` oder ``Speicher`` sein. `` reference_group`` enthält den Namen einer definierten Pod-Gruppe und wird verwendet, um den Umfang jedes Provider-Netzwerks auf diese Gruppe zu beschränken.
id: Dalam jaringan penyedia yang ditentukan, ``address_prefix`` digunakan untuk mengganti awalan kunci yang ditambahkan ke setiap host yang berisi informasi alamat IP. Ini biasanya salah satu dari ``container``, ``tunnel``, atau ``storage``. ``reference_group`` berisi nama grup pod yang ditentukan dan digunakan untuk membatasi ruang lingkup setiap jaringan penyedia ke grup itu.
ru: С определенными сетями провайдера, ``address_prefix`` используется для переопределения префикса ключа, добавленного на каждый хост, который содержит информацию об IP адресе. Это, обычно, должен быть один из ``container``, ``tunnel`` или ``storage``. ``reference_group`` содержит имя определенной группы и используется для ограничения зоны видимости каждой сети провайдера к данной группе.

source: Within defined provider networks, ``address_prefix`` is used to override the prefix of the key added to each host that contains IP address information. We use AZ-specific prefixes for ``container``, ``tunnel``, or ``storage``. ``reference_group`` contains the name of a defined AZ group and is used to limit the scope of each provider network to that group.
ru: Внутри определенных сетей провайдера `` address_prefix`` используется для переопределения префикса ключа, добавленного к каждому хосту, который содержит информацию IP -адреса. Мы используем AZ-специфические префиксы для `` necuter``, `` tunnel`` или `` storage``. `` reference_group`` содержит имя определенной группы AZ и используется для ограничения объема каждой сети провайдера этой группой.

source: Withstand a single Availability Zone failure
ru: Выдерживание отказа одной зоны доступности

source: Write the contents of the ``security.txt`` file in accordance with the standard.
ru: Запишите содержимое файла ``security.txt`` в соответствии со стандартом.

source: YAML Anchors and Aliases are used heavily in the example below to populate all groups that might become handy while not repeating hosts definitions each time. You can read more about the topic in `Ansible Documentation <https://docs.ansible.com/ansible/latest/playbook_guide/playbooks_advanced_syntax.html#yaml-anchors-and-aliases-sharing-variable-values>`_
ru: Якоря и алиасы YAML широко используются в примере ниже для заполнения всех групп, которые могут стать удобными, одновременно не повторяя определения хостов каждый раз. Вы можете прочитать больше по теме в `Ansible Documentation <https://docs.ansible.com/ansible/latest/playbook_guide/playbooks_advanced_syntax.html#yaml-anchors-and-aliases-sharing-variable-values>`_

source: You also have to configure Ceilometer to actually query radosgw. When your ceilometer isn't configured to poll everything, add these pollsters to your polling.yml file:
id: Anda juga harus mengonfigurasi Ceilometer untuk benar-benar meminta radosgw. Ketika ceilometer Anda tidak dikonfigurasikan untuk melakukan polling segalanya, tambahkan pollster ini ke file polling.yml Anda:
ru: Также необходимо настроить Ceilometer для непосредственного опроса radosgw. Если ceilometer не настроен опрашивать все доступные метрики, добавьте следующие метрики для опроса в файл polling.yaml:

source: You also have to install additional packages:
id: Anda juga harus menginstal paket tambahan:
ru: Вам также может потребоваться установить дополнительные пакеты:

source: You also have to install additional pip/distro packages to use the redis cluster:
id: Anda juga harus menginstal paket pip/distro tambahan untuk menggunakan redis cluster:
ru: Вам также потребуется установить дополнительные pip/системные пакеты для использования redis кластера:

source: You also might need to take care of expanding CN names for issued SAN certificate by the PKI role. For that you will have to override ``haproxy_vip_binds`` variable like in example below:
ru: Вам также может понадобиться позаботиться о расширении имен CN для выданных SAN-сертификатов ролью PKI. Для этого вам придется переопределить переменную ``haproxy_vip_binds``, как в примере ниже:

source: You also might want to adjust HSTS headers defined by ``haproxy_security_headers_csp`` variable. While default rules do allow subdomains out of the box, you might want to restrict records a bit more to disallow access on arbitrary ports.
ru: Вы также можете захотеть настроить заголовки HSTS, определенные переменной ``haproxy_security_headers_csp``. Хотя правила по умолчанию разрешают поддомены из коробки, вы можете захотеть ограничить записи немного больше, чтобы запретить доступ к произвольным портам.

source: You can add environment variables from that section to ``user.rc`` file inside openstack_deploy folder (``${OSA_CONFIG_DIR}/user.rc``). ``user.rc`` file is sourced each time you run ``openstack-ansible`` binary.
ru: Вы можете добавить переменные среды из этого раздела в файл ``user.rc`` внутри папки openstack_deploy (``${OSA_CONFIG_DIR}/user.rc``). Файл ``user.rc`` создается каждый раз при запуске бинарного файла ``openstack-ansible``.

source: You can also add the environment variable to ``user.rc`` file inside openstack_deploy folder (``${OSA_CONFIG_DIR}/user.rc``). ``user.rc`` file is sourced each time you run ``openstack-ansible`` binary.
ru: Вы также можете добавить переменную среды в файл ``user.rc`` внутри папки openstack_deploy (``${OSA_CONFIG_DIR}/user.rc``). Файл ``user.rc`` создается каждый раз при запуске бинарного файла ``openstack-ansible``.

source: You can also declare a custom group for each pod that will also include all containers from hosts that belong to this pod. This might be handy if you want to define some variable for all hosts in the pod using group_variables.
ru: Вы также можете объявить произвольную группу для каждого pod-а, которая будет в том числе включать все контейнеры с хостов, которые принадлежат данному pod-у. Это может быть удобно, если вы хотите определить переменные для всех хостов, которые расположены в pod-е через group_vars.

source: You can apply security hardening configurations to an existing environment or audit an environment by using a playbook supplied with OpenStack-Ansible:
de: Sie können Konfigurationen zur Sicherheitssicherung auf eine vorhandene Umgebung anwenden oder eine Umgebung mithilfe eines mit OpenStack-Ansible gelieferten Playbooks überwachen:
id: Anda dapat menerapkan konfigurasi pengerasan keamanan untuk lingkungan yang ada atau mengaudit lingkungan dengan menggunakan playbook yang disediakan dengan OpenStack-Ansible:
ru: Вы можете применить настройки усиления безопасности к существующему окружению или провести аудит окружения при помощи предоставляемого OpenStack-Ansible-ом плейбука:

source: You can avoid usage of the ``root`` user on a deployment by following these guidelines:
ru: Вы можете избежать использования пользователя ``root`` при развертывании, следуя следующим рекомендациям:

source: You can create a bridge manually or leverage our systemd_networkd role which is capable of configuring required networking on hosts.
ru: Вы можете создать мост вручную или использовать нашу роль systemd_networkd, которая способна настраивать необходимые сетевые подключения на хостах.

source: You can do that following in multiple ways:
ru: Вы можете сделать это различными способами:

source: You have to add some pip packages to your gnocchi setup:
id: Anda harus menambahkan beberapa paket pip ke pengaturan gnocchi Anda:
ru: Вам необходимо добавить несколько pip пакетов к вашей установке gnocchi:

source: You may also want to add the ``rgw_dns_name`` option if you want to enable bucket hostnames with the S3 API.
id: Anda mungkin juga ingin menambahkan opsi ``rgw_dns_name`` jika Anda ingin mengaktifkan nama host bucket dengan API S3.
ru: Вы, возможно, также захотите добавить параметр ``rgw_dns_name``, что бы включить имя серверов вместе с S3 API.

source: You may be tempted to copy the ``openrc`` or ``clouds.yaml`` files created by the ``openstack_openrc`` role. However, these files use the ``internal`` `interface`__ by default. This interface use the management network (``172.29.236.0/22``) , which is not routable from outside the host. If you wish to use these files, you will need to change the interface to ``public``.
ru: У вас может возникнуть желание скопировать файлы ``openrc`` или ``clouds.yaml``, созданные ролью ``openstack_openrc``. Однако эти файлы по умолчанию используют ``internal`` `interface`__. Этот интерфейс использует сеть управления (``172.29.236.0/22``), которая не маршрутизируется извне хоста. Если вы хотите использовать эти файлы, вам нужно будет изменить интерфейс на ``public``.

source: You may choose to operate and maintain mirrors of OpenStack-Ansible and OpenStack dependencies. Mirrors often provide a great deal of risk mitigation by reducing dependencies on resources and systems outside of your direct control. Mirrors can also provide greater stability, performance and security.
de: Sie können wählen, Mirrors von OpenStack-Ansible und OpenStack-Abhängigkeiten zu betreiben und zu pflegen. Mirrors bieten oft eine große Risikominderung, da Abhängigkeiten von Ressourcen und Systemen, auf die Sie keinen direkten Einfluss haben, reduziert werden. Spiegel können auch für mehr Stabilität, Leistung und Sicherheit sorgen.
id: Anda dapat memilih untuk mengoperasikan dan memelihara mirror dependensi OpenStack-Ansible dan OpenStack. Mirror sering kali memberikan banyak mitigasi risiko dengan mengurangi ketergantungan pada sumber daya dan sistem di luar kendali langsung Anda. Mirror juga dapat memberikan stabilitas, kinerja, dan keamanan yang lebih besar.
ru: Вы можете управлять и поддерживать зеркала OpenStack-Ansible и зависимостей OpenStack. Зеркала обычно предоставляют значительное снижение рисков путем уменьшения зависимости от ресурсов и систем вне вашего прямого контроля. Зеркала также могут дать более высокую стабильность, производительность и безопасность.
