Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-contributor.po
Languages: de, id

source: To run a functional test of the role, execute:
de: Führen Sie zum Ausführen eines Funktionstests der Rolle Folgendes aus:
id: Untuk menjalankan tes fungsional peran, jalankan:

source: To test the integrated repo, follow the :deploy_guide:`Deployment Guide <index.html>`
de: Um den integrierten Repo zu testen, folgen Sie dem :deploy_guide:`Deployment Guide <index.html>`
id: Untuk menguji repo terintegrasi, ikuti :deploy_guide:`Deployment Guide <index.html>`

source: Unfreeze of master.
id: Melarutkan (unfreeze) master.

source: Updating the roles to their latest version per branch is done through ``osa releases bump_roles $gitbranchname``.
id: Updating role ke versi terbaru mereka per branch dilakukan melalui ``osa releases bump_roles $gitbranchname``.

source: Usage of the ">" and "|" operators should be limited to Ansible conditionals and command modules such as the Ansible ``shell`` or ``command``.
de: Verwendung der ">" und "|" Operatoren sollten auf Ansible-Bedingungen und Befehlsmodule wie Ansible ``shell`` oder ``command`` beschränkt sein.
id: Penggunaan ">" dan "|" operator harus dibatasi pada modul kondisional dan modul perintah yang mungkin seperti ``shell`` atau ``command`` yang dimungkinkan.

source: Use the topic ``create-<branchname>`` (e.g: ``create-stein``) for future reference.
id: Gunakan topik ``create-<branchname>`` (misal: ``create-stein``)untuk referensi di masa mendatang.

source: Usually not. This bug report has an inconsistent state though. If a bug report has an assignee, it should be In Progress and have an importance set.
de: Normalerweise nicht. Dieser Fehlerbericht weist jedoch einen inkonsistenten Status auf. Wenn ein Fehlerbericht einen Bearbeiter hat, sollte dieser in Bearbeitung sein und eine Wichtigkeits-Einstellung haben.
id: Biasanya tidak. Laporan bug ini memiliki kondisi yang tidak konsisten. Jika laporan bug memiliki orang yang ditunjuk, itu harus dalam Progress dan memiliki set penting.

source: Variable files conventions
de: Konventionen für variable Dateien
id: Konvensi file variabel

source: Voting
de: Wählen
id: Pemungutan suara

source: We follow openstack guidelines for the `code reviewing <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html>`_ process.
de: Wir befolgen die Openstack-Richtlinien für die ``Code-Überprüfung`` <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html>`_ Prozess.
id: Kami mengikuti pedoman openstack untuk proses `code reviewing <https://docs.openstack.org/project-team-guide/review-the-openstack-way.html>` _.

source: We track our tasks in Launchpad
id: Kami melacak tugas kami di Launchpad

source: Weekly meetings are held in our IRC channel. The schedule and logs can be found on http://eavesdrop.openstack.org/#OpenStack_Ansible_Deployment_Meeting. Next meeting agenda can be found on our `Meetings wiki page <https://wiki.openstack.org/wiki/Meetings/openstack-ansible>`_.
de: Wöchentliche Treffen finden in unserem IRC-Kanal statt. Der Zeitplan und die Protokolle finden Sie unter http://eavesdrop.openstack.org/#OpenStack_Ansible_Deployment_Meeting. Das nächste Meeting-Programm finden Sie auf unserer `Meetings Wiki-Seite <https://wiki.openstack.org/wiki/Meetings/openstack-ansible>`_.
id: Pertemuan mingguan diadakan di saluran IRC kami. Jadwal dan log dapat ditemukan di http://eavesdrop.openstack.org/#OpenStack_Ansible_Deployment_Meeting. Agenda pertemuan berikutnya dapat ditemukan di kami `Meetings wiki page <https://wiki.openstack.org/wiki/Meetings/openstack-ansible>`_.

source: Weekly meetings are held in our IRC channel. The schedule and logs can be found on http://eavesdrop.openstack.org/#OpenStack_Ansible_Deployment_Meeting. The agenda for the next meeting can be found on our `Meetings wiki page <https://wiki.openstack.org/wiki/Meetings/openstack-ansible>`_.
id: Pertemuan mingguan diadakan di saluran IRC kami. Jadwal dan log dapat ditemukan di http://eavesdrop.openstack.org/#OpenStack_Ansible_Deployment_Meeting. Agenda untuk pertemuan berikutnya dapat ditemukan di kami `Meetings wiki page <https://wiki.openstack.org/wiki/Meetings/openstack-ansible>`_.

source: What is a bug triage
de: Was ist eine Fehlersuche?
id: Apa itu bug triage

source: What is the best status to close a bug report if its issue cannot be reproduced?
de: Was ist der beste Status, um einen Fehlerbericht zu schließen, wenn das Problem nicht reproduziert werden kann?
id: Apa status terbaik untuk menutup laporan bug jika masalahnya tidak dapat direproduksi?

source: What is the goal of the bug skimming duty?
de: Was ist die Aufgabe des Bug Skimming Duty?
id: Apa tujuan dari tugas pencarian sekilas kesalahan bug?

source: When a cherry-pick is modified in any way, the changes made and the reasons for them must be explicitly expressed in the commit message.
de: Wenn ein Cherry-Pick in irgendeiner Weise verändert wird, müssen die vorgenommenen Änderungen und die Gründe dafür explizit in der Commit-Nachricht ausgedrückt werden.
id: Ketika cherry-pick dimodifikasi dengan cara apa pun, perubahan yang dilakukan dan alasannya harus dinyatakan secara eksplisit dalam pesan komit.

source: When cherry-picking a commit from one branch to another the commit message should be amended with any files that may have been in conflict while performing the cherry-pick operation. Additionally, cherry-pick commit messages should contain the original commit *SHA* near the bottom of the new commit message. This can be done with ``cherry-pick -x``. Here's more information on `Submitting a change to a branch for review`_.
de: Wenn Sie einen Commit von einem Branch zu einem anderen auswählen, sollte die Commit-Nachricht mit allen Dateien geändert werden, die möglicherweise während der Durchführung des Cherry-Pick-Vorgangs in Konflikt standen. Außerdem sollten Cherry-Pick-Commit-Nachrichten den ursprünglichen Commit *SHA* am Ende der neuen Commit-Nachricht enthalten. Dies kann mit ``cherry-pick -x`` gemacht werden. Weitere Informationen finden Sie unter `Submitting a change to a branch for review`_.
id: Ketika cherry-picking commit dari satu branch ke yang lain, pesan komit harus diubah dengan file yang mungkin ada konflik saat melakukan operasi cherry-pick. Selain itu, pesan komit pilihan cherry harus mengandung komit asli *SHA* di dekat bagian bawah pesan komit baru. Ini bisa dilakukan dengan ``cherry-pick -x``. Berikut informasi lebih lanjut tentang `Submitting a change to a branch for review`_.

source: When creating tasks and other roles for use in Ansible please create them using the YAML dictionary format.
de: Wenn Sie Aufgaben und andere Rollen für die Verwendung in Ansible erstellen, erstellen Sie diese bitte im YAML-Wörterbuchformat.
id: Saat membuat tugas dan peran lain untuk digunakan di Ansible, buat tugas menggunakan format kamus YAML.

source: When submitting a bug, or working on a bug, please ensure the following criteria are met:
de: Wenn Sie einen Fehler senden oder an einem Fehler arbeiten, stellen Sie bitte sicher, dass die folgenden Kriterien erfüllt sind:
id: Saat mengirimkan bug, atau mengerjakan bug, pastikan kriteria berikut terpenuhi:

source: When the patches to update SHAs and roles have landed, you can propose the parent SHA as a release in the releases repo.
id: Ketika patch untuk memperbarui SHA dan peran telah mendarat (roles have landed), Anda dapat mengusulkan induk SHA sebagai rilis di repo rilis.

source: Where possible the documentation in OpenStack-Ansible should steer clear of trying to explain OpenStack concepts. Those explanations belong in the OpenStack Manuals or service documentation and OpenStack-Ansible documentation should link to those documents when available, rather than duplicate their content.
de: Wo immer möglich, sollte die Dokumentation in OpenStack-Ansible nicht versuchen, OpenStack-Konzepte zu erklären. Diese Erläuterungen gehören in die OpenStack-Handbücher oder die Servicedokumentation, und die OpenStack-Ansible-Dokumentation sollte, wenn verfügbar, mit diesen Dokumenten verknüpft werden, anstatt deren Inhalt zu duplizieren.
id: Bila memungkinkan, dokumentasi di OpenStack-Ansible harus menghindari mencoba menjelaskan konsep OpenStack. Penjelasan-penjelasan itu termasuk dalam Manual OpenStack atau dokumentasi layanan dan dokumentasi OpenStack-Ansible harus terhubung ke dokumen-dokumen itu jika tersedia, daripada menduplikasi konten mereka.

source: While everyone is encouraged to review changes, members of the core reviewer team have the ability to +2/-2 and +W changes to these repositories. This is an extra level of responsibility not to be taken lightly. Correctly merging code requires not only understanding the code itself, but also how the code affects things like documentation, testing, upgrade impacts and interactions with other projects. It also means you pay attention to release milestones and understand if a patch you are merging is marked for the release, especially critical during the feature freeze.
id: Sementara setiap orang didorong untuk meninjau perubahan, anggota tim peninjau inti memiliki kemampuan untuk +2/-2 dan +W perubahan pada repositori ini. Ini adalah tingkat tanggung jawab ekstra untuk tidak dianggap enteng. Menggabungkan kode dengan benar membutuhkan tidak hanya memahami kode itu sendiri, tetapi juga bagaimana kode mempengaruhi hal-hal seperti dokumentasi, pengujian, peningkatan dampak dan interaksi dengan proyek lain. Ini juga berarti Anda memperhatikan rilis tonggak (milestone) dan memahami jika patch yang Anda gabungkan ditandai untuk rilis, terutama penting selama pembekuan fitur.

source: While this script is primarily developed and maintained for use in OpenStack-CI, it can be used in other environments.
de: Obwohl dieses Skript hauptsächlich für die Verwendung in OpenStack-CI entwickelt und verwaltet wird, kann es in anderen Umgebungen verwendet werden.
id: Walaupun skrip ini dikembangkan dan dipelihara untuk digunakan di OpenStack-CI, skrip ini dapat digunakan di lingkungan lain.

source: Work on the role files, following our :ref:`code_rules`.
de: Arbeiten Sie an den Role-Dateien, folgen Sie unserem :ref:`code_rules`.
id: Kerjakan file peran, ikuti kami :ref:`code_rules`.

source: Working on bug fixes
de: Arbeiten an Bugfixes
id: Bekerja pada perbaikan bug

source: Working on new features
de: Arbeiten an neuen Funktionen
id: Mengerjakan fitur baru

source: Write good commit messages. We follow the OpenStack "`Git Commit Good Practice`_" guide. if you have any questions regarding how to write good commit messages please review the upstream OpenStack documentation.
de: Schreiben Sie gute Commit-Nachrichten. Wir folgen dem OpenStack-Leitfaden "`Git Commit Good Practice`_". Wenn Sie Fragen zum Schreiben von Gute-Commit-Nachrichten haben, lesen Sie die Upstream-Dokumentation.
id: Tulis pesan komit yang baik. Kami mengikuti panduan OpenStack "`Git Commit Good Practice`_" . jika Anda memiliki pertanyaan tentang cara menulis pesan komit yang baik, silakan tinjau dokumentasi OpenStack hulu.

source: Writing style
de: Schreibstil
id: Gaya menulis

source: YAML formatting
de: YAML-Formatierung
id: Pemformatan YAML

source: You can check the current PyPI pins that are used in openstack-ansible repository by running ``osa releases check_pins``. This will display a table, showing the current pin in OSA, and what is available upstream on PyPI.
id: Anda dapat memeriksa pin PyPI saat ini yang digunakan dalam repositori yang dimungkinkan openstack dengan menjalankan ``osa releases check_pins``. Ini akan menampilkan tabel, menunjukkan pin saat ini di OSA, dan apa yang tersedia di hulu di PyPI.

source: You can follow examples from other roles, making the appropriate modifications being sure that group labels in ``env.d`` and ``conf.d`` files are consistent.
de: Sie können Beispielen aus anderen Rollen folgen und die entsprechenden Änderungen vornehmen, um sicherzustellen, dass Gruppenbezeichnungen in den Dateien ``env.d`` und ``conf.d`` konsistent sind.
id: Anda dapat mengikuti contoh dari peran lain, membuat modifikasi yang sesuai memastikan bahwa label grup dalam file ``env.d`` dan ``conf.d`` konsisten.

source: You can install the latest version of this tooling by running:
id: Anda dapat menginstal versi terbaru dari alat ini dengan menjalankan:

source: You can review roles which may be currently in development by checking our `specs repository`_ and `unmerged specs`_ on review.openstack.org. If you do not find a spec for the role, propose a blueprint/spec. See also :ref:`specs`.
de: Sie können Rollen überprüfen, die sich gerade in der Entwicklung befinden, indem Sie auf review.openstack.org unser `specs repository`_ und die `unmerged specs`_ überprüfen. Wenn Sie keine Spezifikation für die Rolle finden, schlagen Sie einen Entwurf/eine Spezifikation vor. Siehe auch :ref:`specs`.
id: Anda dapat meninjau peran yang saat ini sedang dalam pengembangan dengan memeriksa `specs repository`_ dan `unmerged specs`_ kami di review.openstack.org. Jika Anda tidak menemukan spek untuk peran tersebut, usulkan blueprint/spec. Lihat juga :ref:`specs`.

source: You found an issue and want to make sure we are aware of it? You can do so on `Launchpad <https://bugs.launchpad.net/openstack-ansible>`_.
id: Anda menemukan masalah dan ingin memastikan kami mengetahuinya? Anda bisa melakukannya `Launchpad <https://bugs.launchpad.net/openstack-ansible>`_.

source: ``.gitignore``: A standard git configuration file for the repository which should be pretty uniform across all the repositories. This must be copied from the ``openstack-ansible-tests`` repository and will be automatically be overridden by our proposal bot should any change happen.
de: ``.gitignore``: Eine Standard-Git-Konfigurationsdatei für das Repository, die in allen Repositories ziemlich einheitlich sein sollte. Dies muss aus dem ``openstack-ansible-tests``-Repository kopiert werden und wird automatisch von unserem Vorschlags-Bot überschrieben, sollte eine Änderung eintreten.
id: ``.gitignore``: File konfigurasi git standar untuk repositori yang seharusnya cukup seragam di semua repositori. Ini harus disalin dari repositori ``openstack-ansible-tests`` dan akan secara otomatis diganti oleh bot proposal kami jika terjadi perubahan.

source: ``.gitreview``: A standard file configured for the project to inform the ``git-review`` plugin where to find the upstream gerrit remote for the repository.
de: ``.gitreview``: Eine Standarddatei, die für das Projekt konfiguriert wurde, um das Plugin ``git-review`` zu informieren, wo sich der Upstream-Gerrit-Remote für das Repository befindet.
id: ``.gitreview``: File standar yang dikonfigurasi untuk proyek untuk menginformasikan kepada plugin ``git-review`` di mana menemukan remote gerrit hulu untuk repositori.

source: ``<role name>-overrides.yml``. This var file is automatically loaded by our shell script in our `tests repository`_.
de: ``<role name> -overrides.yml``. Diese var-Datei wird automatisch von unserem Shell-Skript in unser `tests repository`_ geladen.
id: ``<role name>-overrides.yml``. File var ini secara otomatis dimuat oleh skrip shell kami di `tests repository`_.

source: ``README.rst``, ``LICENSE``, ``CONTRIBUTING.rst``: A set of standard files whose content is self-explanatory.
de: ``README.rst``, ``LICENSE``, ``CONTRIBUTING.rst``: Ein Satz von Standard-Dateien, deren Inhalt selbsterklärend ist.
id: ``README.rst``, ``LICENSE``, ``CONTRIBUTING.rst``: Satu set file standar yang isinya cukup jelas.

source: ``Vagrantfile``: A configuration file to allow a developer to easily create a test virtual machine using `Vagrant`_. This must automatically execute ``run_tests.sh``. This must be copied from the ``openstack-ansible-tests`` repository and will be automatically be overridden by our proposal bot should any change happen.
de: ``Vagrantfile``: Eine Konfigurationsdatei, die es einem Entwickler ermöglicht, einfach eine virtuelle Testmaschine mit `Vagrant`_ zu erstellen. Dies muss automatisch ``run_tests.sh`` ausführen. Dies muss aus dem ``openstack-ansible-tests``-Repository kopiert werden und wird automatisch von unserem Vorschlags-Bot überschrieben, sollte eine Änderung eintreten.
id: ``Vagrantfile``: File konfigurasi untuk memungkinkan pengembang membuat mesin virtual pengujian dengan mudah menggunakan `Vagrant`_. Ini harus secara otomatis menjalankan ``run_tests.sh``. Ini harus disalin dari repositori ``openstack-ansible-tests`` dan akan secara otomatis diganti oleh bot proposal kami jika terjadi perubahan.

source: ``ansible-role-requirements.yml``. This should be fairly straightforward: this file contains all the roles to clone before running your role. The roles' relative playbooks will have to be listed in the ``test.yml`` file. However, keep in mind to NOT re-invent the wheel. For example, if your role needs keystone, you don't need to create your own keystone install playbook, because we have a generic keystone install playbook in the `tests repository`.
de: ``ansible-role-requirements.yml``. Dies sollte ziemlich einfach sein: Diese Datei enthält alle zu klonenden Rollen, bevor Sie Ihre Rolle ausführen. Die relativen Playbooks der Rollen müssen in der Datei ``test.yml`` aufgeführt sein. Denken Sie jedoch daran, das Rad NICHT neu zu erfinden. Wenn Ihre Rolle beispielsweise Keystone benötigt, müssen Sie kein eigenes Keystone-Installations-Playbook erstellen, da wir ein generisches Keystone-Installations-Playbook im `tests repository` haben.
id: ``ansible-role-requirements.yml``. Ini harus cukup mudah: file ini berisi semua peran yang harus dikloning sebelum menjalankan peran Anda. Buku pedoman relatif peran harus dicantumkan dalam file ``test.yml``. Namun, perlu diingat untuk NOT menciptakan kembali roda (wheel). Misalnya, jika peran Anda memerlukan keystone, Anda tidak perlu membuat playbook instal keystone Anda sendiri, karena kami memiliki playbook instal keystone generik dalam `tests repository`.

source: ``bindep.txt``: The binary requirements that must be installed on the host the tests are executed on for the Python requirements and the tox execution to work. This must be copied from the ``openstack-ansible-tests`` repository and will be automatically be overridden by our proposal bot should any change happen.
de: ``bindep.txt``: Die binären Anforderungen, die auf dem Host installiert werden müssen, auf dem die Tests ausgeführt werden, damit die Python-Anforderungen und die Tox-Ausführung funktionieren. Dies muss aus dem ``openstack-ansible-tests``-Repository kopiert werden und wird automatisch von unserem Vorschlags-Bot überschrieben, sollte eine Änderung eintreten.
id: ``bindep.txt``: Persyaratan biner yang harus diinstal pada host pengujian dijalankan untuk persyaratan Python dan eksekusi toks agar berfungsi. Ini harus disalin dari repositori ``openstack-ansible-tests`` dan akan secara otomatis diganti oleh bot proposal kami jika terjadi perubahan.

source: ``deprecations``: If a variable has been deprecated (ideally using the deprecation filter), then it should be communicated through notes in this section. Note that if a variable has been removed entirely then it has not been deprecated and the removal should be noted in the ``upgrade`` section.
de: ``deprecations``: Wenn eine Variable veraltet ist (idealerweise mit dem Deprecation-Filter), sollte sie durch Anmerkungen in diesem Abschnitt kommuniziert werden. Beachten Sie, dass, wenn eine Variable vollständig entfernt wurde, sie nicht veraltet ist und das Entfernen im Abschnitt ``Upgrade`` vermerkt sein sollte.
id: ``deprecations``: Jika suatu variabel telah ditinggalkan (idealnya menggunakan filter penghentian), maka itu harus dikomunikasikan melalui catatan di bagian ini. Perhatikan bahwa jika suatu variabel telah dihapus seluruhnya maka itu tidak ditinggalkan dan penghapusan harus dicatat di bagian ``upgrade`` .

source: ``docs/`` and ``releasenotes/`` folders need to be exist and be properly configured.
de: ``docs/`` und ``release_notes/`` Ordner müssen existieren und korrekt konfiguriert sein.
id: Folder ``docs/`` dan ``releasenotes/`` perlu ada dan dikonfigurasikan dengan benar.

source: ``features``: This should inform the deployer briefly about a new feature and should describe how to use it either by referencing the variables to set or by referring to documentation.
de: ``features``: Dies sollte den Deployer kurz über ein neues Feature informieren und sollte beschreiben, wie man es verwendet, indem man entweder auf die Variablen verweist oder auf die Dokumentation verweist.
id: ``features``: Ini harus memberi tahu penyebar secara singkat tentang fitur baru dan harus menjelaskan cara menggunakannya dengan merujuk variabel yang akan diatur atau dengan merujuk pada dokumentasi.

source: ``group_vars`` and ``host_vars``. These folders will hold override the necessary files for testing. For example, this is where you override the IP addresses, IP ranges, and ansible connection details.
de: ``group_vars`` und ``host_vars``. In diesen Ordnern werden die zum Testen erforderlichen Dateien überschrieben. Hier überschreiben Sie beispielsweise die IP-Adressen, IP-Bereiche und möglichen Verbindungsdetails.
id: ``group_vars`` dan ``host_vars``. Folder ini akan menahan override file yang diperlukan untuk pengujian. Misalnya, ini adalah tempat Anda mengganti alamat IP, rentang IP, dan detail koneksi yang dimungkinkan.

source: ``inventory``. A static inventory for role testing. It's possible some roles have multiple inventories. See for example the neutron role with its ``lxb_inventory``, ``calico_inventory``.
id: ``inventory``. Inventaris statis untuk pengujian peran. Mungkin saja beberapa peran memiliki banyak inventaris. Lihat misalnya peran neutron dengan ``lxb_inventory``, ``calico_inventory``.

source: ``issues``: This should inform the deployer about known issues. This may be used when fixing an issue and wanting to inform deployers about a workaround that can be used for versions prior to that which contains the patch that fixes the issue. Issue notes should specifically make mention of what versions of OpenStack-Ansible are affected by the issue.
de: ``issues``: Dies sollte den Deployer über bekannte Probleme informieren. Dies kann verwendet werden, wenn ein Problem behoben wird und die Bereitsteller über eine Problemumgehung informiert werden sollen, die für frühere Versionen verwendet werden kann, die den Patch enthalten, der das Problem behebt. In den Notizen sollte speziell erwähnt werden, welche Versionen von OpenStack-Ansible von dem Problem betroffen sind.
id: ``issues``: Ini harus memberi tahu penyebar tentang masalah yang diketahui. Ini dapat digunakan saat memperbaiki masalah dan ingin memberi tahu penyebar tentang solusi yang dapat digunakan untuk versi sebelum yang berisi patch yang memperbaiki masalah. Catatan masalah harus secara khusus menyebutkan versi OpenStack-Ansible apa yang dipengaruhi oleh masalah ini.

source: ``run_tests.sh``: A script for developers to execute all standard tests on a suitable host. This must be copied from the ``openstack-ansible-tests`` repository and will be automatically be overridden by our proposal bot should any change happen.
de: ``run_tests.sh``: Ein Skript, mit dem Entwickler alle Standardtests auf einem geeigneten Host ausführen können. Dies muss aus dem ``openstack-ansible-tests``-Repository kopiert werden und wird automatisch von unserem Vorschlags-Bot überschrieben, sollte eine Änderung eintreten.
id: ``run_tests.sh``: Script untuk pengembang untuk menjalankan semua tes standar pada host yang sesuai. Ini harus disalin dari repositori ``openstack-ansible-tests`` dan akan secara otomatis diganti oleh bot proposal kami jika terjadi perubahan.
