Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: de, id

source: This configuration deploys a Memcached container and a database container on each host, but no RabbitMQ containers.
de: Diese Konfiguration stellt auf jedem Host einen Memcached-Container und einen Datenbankcontainer, jedoch keine RabbitMQ-Container bereit.
id: Konfigurasi ini menyebarkan kontainer Memcached dan kontainer basis data pada setiap host, tetapi tidak ada kontainer RabbitMQ.

source: This does mean that a stable OSA deployment will include a version of a service (eg: nova-17.0.3dev4) which does not match a tag exactly as you may expect (eg: nova-17.0.3).
id: Ini berarti bahwa penyebaran OSA yang stabil akan mencakup versi layanan (misalnya: nova-17.0.3dev4) yang tidak cocok dengan tag persis seperti yang Anda harapkan (misalnya: nova-17.0.3).

source: This flexibility enables deployers to choose how to deploy OpenStack in the appropriate way for the specific use case.
de: Dank dieser Flexibilität können die Implementierer wählen, wie OpenStack für den jeweiligen Anwendungsfall entsprechend bereitgestellt wird.
id: Fleksibilitas ini memungkinkan penggelar untuk memilih cara menyebarkan OpenStack dengan cara yang sesuai untuk kasus penggunaan khusus.

source: This invocation is useful when testing changes to the dynamic inventory script.
de: Dieser Aufruf ist nützlich, wenn Änderungen am dynamischen Inventarscript getestet werden.
id: Seruan ini berguna saat menguji perubahan pada skrip inventory dinamis.

source: This means that OpenStack services and their python dependencies are built and installed from source code as found within the OpenStack Git repositories by default, but allow deployers to point to their own repositories.
de: Dies bedeutet, dass OpenStack-Dienste und ihre Python-Abhängigkeiten standardmäßig aus Quellcode erstellt und installiert werden, wie er in den OpenStack Git-Repositorys gefunden wird. Erlaubt es den Deployern jedoch, auf ihre eigenen Repositories zu verweisen.
id: Ini berarti bahwa layanan OpenStack dan dependensi python mereka dibangun dan diinstal dari source code seperti yang ditemukan dalam repositori Git OpenStack secara default, tetapi memungkinkan deployer untuk menunjuk ke repositori mereka sendiri.

source: This means that there will never be a time where OpenStack specific packages, as provided by the distributions, are being used for OpenStack services. Third party repositories like *CloudArchive* and or *RDO* may still be required within a given deployment but only as a means to meet application dependencies.
de: Das bedeutet, dass es nie einen Zeitpunkt gibt, an dem OpenStack-spezifische Pakete, wie sie von den Distributionen bereitgestellt werden, für OpenStack-Dienste verwendet werden. Third-Party-Repositories wie *CloudArchive* und oder *RDO* können innerhalb einer gegebenen Bereitstellung zwar immer noch benötigt werden, aber nur um Anwendungsabhängigkeiten zu erfüllen.
id: Ini berarti bahwa tidak akan pernah ada waktu di mana paket khusus OpenStack, seperti yang disediakan oleh distro, digunakan untuk layanan OpenStack. Repositori pihak ketiga seperti *CloudArchive* dan atau *RDO* mungkin masih diperlukan dalam penyebaran tertentu tetapi hanya sebagai sarana untuk memenuhi dependensi aplikasi.

source: This module was not accepted into Ansible Core (see `PR1`_ and `PR2`_), and will never be.
de: Dieses Modul wurde nicht in Ansible Core übernommen (siehe `PR1`_ und `PR2`_) und wird es niemals sein.
id: Modul ini tidak diterima di Ansible Core (lihat `PR1`_ dan `PR2`_), dan tidak akan pernah ada.

source: This project does **not** PXE boot hosts. Host setup and lifecycle management is left to the deployer. This project also requires that bridges are setup within the hosts to allow the containers to attach to a local bridge for network access. See also the :dev_docs:`Container networking <reference/architecture/container-networking.html>`.
de: Dieses Projekt bootet Hosts **nicht** PXE. Host-Setup und Lifecycle-Management bleiben dem Deployer vorbehalten. Dieses Projekt erfordert außerdem, dass Bridges innerhalb der Hosts eingerichtet werden, damit die Container für den Netzwerkzugriff eine Verbindung zu einer lokalen Bridge herstellen können. Siehe auch :dev_docs:`Container networking<reference/architecture/container-networking.html>`.
id: Proyek ini melakukan **not** PXE boot hosts. Penyiapan host dan manajemen siklus hidup diserahkan kepada operator. Proyek ini juga mengharuskan jembatan diset dalam host untuk memungkinkan kontainer untuk melampirkan ke jembatan lokal untuk akses jaringan. Lihat juga :dev_docs:`Container networking <reference/architecture/container-networking.html>`.

source: This project introduces containers as a means to abstract services from one another.
de: In diesem Projekt werden Container eingeführt, um Dienste voneinander zu abstrahieren.
id: Proyek ini memperkenalkan wadah sebagai sarana untuk memisahkan layanan dari satu sama lain.

source: This project will be a **Batteries included** project. Which means deployer can expect that deploying from any of the named feature branches or tags should provide an OpenStack cloud built for production which will be available at the successful completion of the deployment.
de: Bei diesem Projekt handelt es sich um ein Projekt **Batterien eingeschlossen**. Dies bedeutet, dass der Bereitsteller erwarten kann, dass die Bereitstellung aus einem der genannten Feature-Zweige oder -Tags eine OpenStack-Cloud bereitstellen sollte, die für die Produktion erstellt wurde und nach dem erfolgreichen Abschluss der Bereitstellung verfügbar ist.
id: Proyek ini akan menjadi proyek **Batteries included**. Yang artinya, deployer dapat memperkirakan bahwa penerapan dari cabang atau tag fitur apa pun yang disebutkan harus menyediakan cloud OpenStack yang dibuat untuk produksi yang akan tersedia pada penyelesaian penerapan yang berhasil.

source: This section explains how ansible runs the inventory, and how you can run it manually to see its behavior.
de: In diesem Abschnitt wird erläutert, wie ansible das Inventar ausführt und wie Sie es manuell ausführen können, um sein Verhalten zu sehen.
id: Bagian ini menjelaskan cara menjalankan inventory, dan bagaimana Anda dapat menjalankannya secara manual untuk melihat perilakunya.

source: This variable should point to ``/etc/ansible/plugins/library``. Doing so allows roles and playbooks to access OpenStack-Ansible's included Ansible modules.
de: Diese Variable sollte auf ``/etc/ansible/plugins/library`` zeigen. Auf diese Weise können Rollen und Playbooks auf die enthaltenen Ansible-Module von OpenStack-Ansible zugreifen.
id: Variabel ini harus mengarah ke ``/etc/ansible/plugins/library``. Melakukan hal itu memungkinkan peran dan playbook untuk mengakses modul Ansible yang disertakan OpenStack-Ansible.

source: This variable should point to ``/etc/ansible/roles`` by default. This allows Ansible to properly look up any OpenStack-Ansible roles that extension roles may reference.
de: Diese Variable sollte standardmäßig auf ``/etc/ansible/roles`` zeigen. Dadurch kann Ansible alle OpenStack-Ansible-Rollen, auf die sich die Erweiterungsrollen beziehen, ordnungsgemäß nachschlagen.
id: Variabel ini harus menunjuk ke ``/etc/ansible/roles`` secara default. Hal ini memungkinkan Ansible untuk mencari peran OpenStack-Ansible yang dapat direferensikan oleh peran ekstensi.

source: This variable should point to ``openstack-ansible/inventory/dynamic_inventory.py``. With this setting, extensions have access to the same dynamic inventory that OpenStack-Ansible uses.
de: Diese Variable sollte auf ``openstack-ansible/inventory/dynamic_inventory.py`` zeigen. Mit dieser Einstellung haben Erweiterungen Zugriff auf dasselbe dynamische Inventar, das OpenStack-Ansible verwendet.
id: Variabel ini harus mengarah ke ``openstack-ansible/inventory/dynamic_inventory.py``. Dengan pengaturan ini, ekstensi memiliki akses ke inventaris dinamis yang sama yang menggunakan OpenStack-Ansible.

source: This will *not* change the LXC configuration until the associated playbooks are run and the containers restarted, which will result in API downtime.
de: Dies ändert *nicht* die LXC-Konfiguration, bis die zugehörigen Playbooks ausgeführt und die Container neu gestartet werden, was zu einer API-Ausfallzeit führt.
id: Ini *not* akan mengubah konfigurasi LXC sampai playbook terkait dijalankan dan container dimulai kembali (restarted), yang akan menyebabkan downtime API.

source: Three hosts are assigned to the `shared-infra_hosts` group, OpenStack-Ansible ensures that each host runs a single database container, a single Memcached container, and a single RabbitMQ container. Each host has an affinity of 1 by default, which means that each host runs one of each container type.
de: Drei Hosts sind der Gruppe ``shared-infra_hosts`` zugeordnet. OpenStack-Ansible stellt sicher, dass jeder Host einen einzelnen Datenbankcontainer, einen einzelnen Memcached-Container und einen einzelnen RabbitMQ-Container ausführt. Jeder Host hat standardmäßig eine Affinität von 1, was bedeutet, dass jeder Host einen von jedem Containertyp ausführt.
id: Tiga host ditugaskan ke grup `shared-infra_hosts`, OpenStack-Ansible memastikan bahwa setiap host menjalankan kontainer basis data tunggal, kontainer Memcached tunggal, dan kontainer RabbitMQ tunggal. Setiap host memiliki afinitas 1 secara default, yang berarti bahwa setiap host menjalankan satu dari setiap jenis kontainer.

source: To assist you in finding the appropriate variable name to use for overrides, the general format for the variable name is ``<service>_policy_overrides``.
de: Um Ihnen bei der Suche nach dem geeigneten Variablennamen zu helfen, der für Überschreibungen verwendet werden kann, lautet das allgemeine Format für den Variablennamen ``<service> _policy_overrides``.
id: Untuk membantu Anda dalam menemukan nama variabel yang sesuai untuk digunakan untuk penggantian, format umum untuk nama variabel adalah ``<service>_policy_overrides``.

source: To avoid extra configuration, a series of conventions are set into code.
de: Um eine zusätzliche Konfiguration zu vermeiden, wird eine Reihe von Konventionen in Code gesetzt.
id: Untuk menghindari konfigurasi tambahan, serangkaian konvensi ditetapkan ke dalam kode.

source: To continue the example, the ``memcache.yml`` file defines the ``memcache_container`` container group. This group is a subset of the ``shared-infra_containers`` group, which is itself a subset of the ``all_containers`` inventory group.
de: Um das Beispiel fortzusetzen, definiert die ``memcache.yml`` Datei die ``memcache_container`` Containergruppe. Diese Gruppe ist eine Untergruppe der Gruppe ``shared-infra_containers``, die ihrerseits eine Teilmenge der Bestandsgruppe ``all_containers`` darstellt.
id: Untuk melanjutkan contoh, file ``memcache.yml`` menentukan grup container ``memcache_container``. Grup ini adalah subset dari grup ``shared-infra_containers``, yang merupakan subset grup persediaan ``all_containers``.

source: To customize the layout of the components for your deployment, modify the host groups and container groups appropriately before running the installation playbooks.
de: Um das Layout der Komponenten für Ihre Bereitstellung anzupassen, ändern Sie die Hostgruppen und Containergruppen entsprechend, bevor Sie die Installations-Playbooks ausführen.
id: Untuk menyesuaikan tata letak komponen untuk penggunaan Anda, modifikasi grup host dan grup container dengan tepat sebelum menjalankan playbook instalasi.

source: To deploy a component directly on the host instead of within a container, set the ``is_metal`` property to ``true`` for the container group in the ``container_skel`` section in the appropriate file.
de: Um eine Komponente direkt auf dem Host anstatt innerhalb eines Containers bereitzustellen, setzen Sie die Eigenschaft ``is_metal`` auf ``true`` für die Containergruppe im Abschnitt ``container_skel`` der entsprechenden Datei.
id: Untuk menggunakan komponen secara langsung pada host daripada di dalam sebuah container, atur properti ``is_metal`` menjadi ``true`` untuk grup kontainer di bagian ``container_skel`` dalam file yang sesuai.

source: To deploy within containers on these dedicated hosts, omit the ``is_metal: true`` property.
de: Zur Bereitstellung in Containern auf diesen dedizierten Hosts muss die Eigenschaft ``is_metal: true`` weggelassen werden.
id: Untuk menggunakan dalam container pada host khusus ini, abaikan properti ``is_metal: true``.

source: To do this, you use the following configuration entry in the ``/etc/openstack_deploy/user_variables.yml`` file:
de: Dazu verwenden Sie den folgenden Konfigurationseintrag in der Datei ``/etc/openstack_deploy/user_variables.yml``:
id: Untuk melakukan ini, Anda menggunakan entri konfigurasi berikut di file ``/etc/openstack_deploy/user_variables.yml``:

source: To implement access controls that are different from the ones in a standard OpenStack environment, you can adjust the default policies applied by services. Policy files are in a ``JSON`` format.
de: Um Zugriffskontrollen zu implementieren, die sich von denen in einer Standard-OpenStack-Umgebung unterscheiden, können Sie die Standardrichtlinien anpassen, die von den Services angewendet werden. Richtliniendateien haben das Format ``JSON``.
id: Untuk menerapkan kontrol akses yang berbeda dari yang ada di lingkungan OpenStack standar, Anda dapat menyesuaikan kebijakan default yang diterapkan oleh layanan. File kebijakan dalam format ``JSON``.

source: To learn more about how to customize the deployment of encrypted communications, see `Securing services with SSL certificates </user/security/index.html>`_.
id: Untuk mempelajari lebih lanjut tentang cara menyesuaikan penyebaran komunikasi terenkripsi, lihat `Securing services with SSL certificates </user/security/index.html>`_.

source: To manage file size, we recommend that you define new inventory groups, particularly for new services, by using a new file in the ``conf.d/`` directory.
de: Um die Dateigröße zu verwalten, empfehlen wir, neue Inventargruppen, insbesondere für neue Dienste, zu definieren, indem Sie eine neue Datei im Verzeichnis ``conf.d /`` verwenden.
id: Untuk mengelola ukuran file, kami sarankan Anda mendefinisikan grup inventory baru, terutama untuk layanan baru, dengan menggunakan file baru di direktori ``conf.d/``.

source: To omit a component from a deployment, you can use one of several options:
de: Um eine Komponente aus einer Bereitstellung auszulassen, können Sie eine der folgenden Optionen verwenden:
id: Untuk menghilangkan komponen dari penerapan, Anda dapat menggunakan salah satu dari beberapa opsi:

source: To see a listing of hosts and containers by their group, use ``--list-groups/-g``.
de: Um eine Liste von Hosts und Containern nach ihrer Gruppe anzuzeigen, verwenden Sie ``--list-groups/-g``.
id: Untuk melihat daftar host dan container menurut grup mereka, gunakan ``--list-groups/-g``.

source: To see all of the containers, use ``--list-containers/-G``.
de: Um alle Container zu sehen, benutzen Sie ``--list-containers/-G``.
id: Untuk melihat semua container, gunakan ``--list-containers/-G``.

source: To understand how the dynamic inventory works, see :ref:`inventory-in-depth`.
de: Um zu verstehen, wie das dynamische Inventar funktioniert, siehe :ref:`inventory-in-depth`.
id: Untuk memahami cara kerja inventaris dinamis, lihat :ref:`inventory-in-depth`.

source: Unbound DNS container
id: Kontainer DNS tidak terikat

source: Understanding container groups (env.d structure)
de: Container-Gruppen verstehen (Struktur env.d)
id: Memahami grup container (env.d structure)

source: Understanding host groups (conf.d structure)
de: Grundlegendes zu Host-Gruppen (conf.d-Struktur)
id: Memahami grup host (conf.d structure)

source: Understanding the inventory
de: Das Inventar verstehen
id: Memahami inventory

source: Use the host's name as an argument.
de: Verwenden Sie den Namen des Hosts als Argument.
id: Gunakan nama host sebagai argumen.

source: Use this method for any files with the ``INI`` format for in OpenStack projects deployed in OpenStack-Ansible.
de: Verwenden Sie diese Methode für alle Dateien mit dem Format ``INI`` für OpenStack-Projekte, die in OpenStack-Ansible bereitgestellt werden.
id: Gunakan metode ini untuk file apa pun dengan format ``INI`` untuk di proyek OpenStack yang digunakan di OpenStack-Ansible.

source: Use this method for any files with the ``JSON`` format in OpenStack projects deployed in OpenStack-Ansible.
de: Verwenden Sie diese Methode für alle Dateien mit dem Format ``JSON`` in OpenStack-Projekten, die in OpenStack-Ansible bereitgestellt werden.
id: Gunakan metode ini untuk file apa pun dengan format ``JSON`` di proyek OpenStack yang digunakan di OpenStack-Ansible.

source: Userspace configurations
de: Userspace-Konfigurationen
id: Konfigurasi userspace

source: Using OpenStack-Ansible within your project
id: Menggunakan OpenStack-Ansible dalam proyek Anda

source: Using ``shared-infra_hosts`` as an example, consider this ``openstack_user_config.yml`` configuration:
de: Verwenden Sie ``shared-infra_hosts`` als Beispiel und betrachten Sie diese ``openstack_user_config.yml`` Konfiguration:
id: Dengan menggunakan ``shared-infra_hosts`` sebagai contoh, pertimbangkan konfigurasi ``openstack_user_config.yml`` ini:

source: Using the ``--check`` flag when running ``dynamic_inventory.py`` will run the inventory build process and look for known errors, but not write any files to disk.
id: Menggunakan flag ``--check`` saat menjalankan ``dynamic_inventory.py`` akan menjalankan proses pembuatan inventory dan mencari kesalahan yang diketahui, tetapi tidak menulis file apa pun ke disk.

source: Using these extension points, deployers can provide a more 'opinionated' installation of OpenStack that may include their own software.
de: Mithilfe dieser Erweiterungspunkte können die Bereitsteller eine ``eigenwilligere`` Installation von OpenStack bereitstellen, die möglicherweise ihre eigene Software enthält.
id: Dengan menggunakan extension point, para deployer dapat menyediakan instalasi OpenStack yang lebih 'opinionated' yang mungkin menyertakan perangkat lunak mereka sendiri.

source: Using this name for a group in the configuration will result in a runtime error.
de: Die Verwendung dieses Namens für eine Gruppe in der Konfiguration führt zu einem Laufzeitfehler.
id: Menggunakan nama ini untuk grup dalam konfigurasi akan menghasilkan kesalahan runtime.

source: Utility container
de: Dienstprogramm-Container
id: Utility container (wadah utilitas)

source: Viewing the inventory
de: Anzeigen des Inventars
id: Melihat inventory

source: We believe that this approach brings a balance of both reasonable stability, while still being able to do pro-active backports.
de: Wir sind davon überzeugt, dass dieser Ansatz sowohl eine angemessene Stabilität als auch einen proaktiven Backport ermöglicht.
id: Kami percaya bahwa pendekatan ini membawa keseimbangan stabilitas yang masuk akal, sementara masih dapat melakukan backports pro-aktif.

source: What is the OSA release model
id: Apa model rilis OSA

source: What version of OpenStack is deployed by OSA?
id: Versi OpenStack apa yang digunakan oleh OSA?

source: When Neutron agents are deployed "on metal" on a network node or collapsed infra/network node, the ``Neutron Agents`` container and respective virtual interfaces are no longer implemented. In addition, use of the ``host_bind_override`` override when defining provider networks allows Neutron to interface directly with a physical interface or bond instead of the ``br-vlan`` bridge. The following diagram reflects the differences in the virtual network layout.
id: Ketika agen Neutron digunakan "on metal" pada node jaringan atau node infra/network yang collapsed, container ``Neutron Agents`` dan masing-masing antarmuka virtual tidak lagi diimplementasikan. Selain itu, penggunaan override ``host_bind_override`` ketika mendefinisikan jaringan penyedia memungkinkan Neutron untuk berinteraksi langsung dengan antarmuka fisik atau mengikat jembatan ``br-vlan`` sebagai gantinya. Diagram berikut mencerminkan perbedaan dalam tata letak jaringan virtual.

source: When OpenStack-Ansible generates its dynamic inventory, the affinity setting determines how many containers of a similar type are deployed on a single physical host.
de: Wenn OpenStack-Ansible sein dynamisches Inventar generiert, bestimmt die Affinitätseinstellung, wie viele Container eines ähnlichen Typs auf einem einzelnen physischen Host bereitgestellt werden.
id: Ketika OpenStack-Ansible menghasilkan inventaris dinamisnya, pengaturan affinity (pertalian) menentukan berapa banyak kontainer dari jenis yang sama yang digunakan pada satu host fisik.

source: When a client requests an image, the ``glance-api`` service accesses the appropriate store on the storage device over the storage network (``br-storage``) and pulls it into its cache. When the same image is requested again, it is given to the client directly from the cache.
de: Wenn ein Client ein Abbild anfordert, greift der ``glance-api`` -Dienst über das Speichernetzwerk (``br-storage``) auf den entsprechenden Speicher auf dem Speichergerät zu und zieht ihn in seinen Cache. Wenn dasselbe Abbild erneut angefordert wird, wird es dem Client direkt aus dem Cache übergeben.
id: Ketika klien meminta image, layanan ``glance-api`` mengakses penyimpanan yang sesuai pada perangkat penyimpanan melalui jaringan penyimpanan (``br-storage``) dan menariknya ke dalam cache. Ketika image yang sama diminta lagi, itu diberikan kepada klien langsung dari cache.

source: When adding groups, keep the following in mind:
de: Beachten Sie beim Hinzufügen von Gruppen Folgendes:
id: Saat menambahkan grup, perhatikan hal berikut:

source: When an instance is scheduled for creation on a Compute host, the ``nova-compute`` service requests the image from the ``glance-api`` service over the management network (``br-mgmt``).
de: Wenn eine Instanz für die Erstellung auf einem Compute-Host geplant ist, fordert der Dienst ``nova-compute`` das Abbild des Dienstes ``glance-api`` über das Verwaltungsnetzwerk an (``br-mgmt``).
id: Ketika sebuah instance dijadwalkan untuk dibuat pada host Compute, layanan ``nova-compute`` meminta image dari layanan ``glance-api`` melalui jaringan manajemen (``br-mgmt``).

source: When does a patch to an OSA role get into a release?
id: Kapan patch ke peran OSA masuk ke rilis?

source: When including OpenStack-Ansible in a project, consider using a parallel directory structure as shown in the ``ansible.cfg`` files section.
de: Wenn Sie OpenStack-Ansible in einem Projekt verwenden, sollten Sie eine parallele Verzeichnisstruktur verwenden, wie im Abschnitt `` ansible.cfg``-Dateien gezeigt.
id: Ketika memasukkan OpenStack-Ansible dalam proyek, pertimbangkan untuk menggunakan struktur direktori paralel seperti yang ditunjukkan pada bagian file ``ansible.cfg``.

source: When running an Ansible command (such as ``ansible``, ``ansible-playbook`` or ``openstack-ansible``) Ansible automatically executes the ``dynamic_inventory.py`` script and use its output as inventory.
de: Beim Ausführen eines Ansible-Befehls (wie ``ansible``, ``ansible-playbook`` oder ``openstack-ansible``) führt Ansible automatisch das ``dynamic_inventory.py``-Skript aus und verwendet seine Ausgabe als Inventar.
id: Saat menjalankan perintah Ansible (seperti ``ansible``, ``ansible-playbook`` atau ``openstack-ansible``) Kemungkinan secara otomatis menjalankan skrip ``dynamic_inventory.py`` dan menggunakan outputnya sebagai inventaris.
