Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: de, id

source: When the File System store is used, the Image service has no mechanism of its own to replicate the image between Image service hosts. We recommend using a shared storage back end (via a file system mount) to ensure that all``glance-api`` services have access to all images. Doing so prevents losing access to images when an infrastructure (control plane) host is lost.
id: Ketika penyimpanan File System digunakan, layanan Image tidak memiliki mekanisme sendiri untuk mereplikasi image antara host layanan Image. Kami merekomendasikan penggunaan back end penyimpanan bersama (melalui sistem file mount) untuk memastikan bahwa semua layanan ``glance-api`` memiliki akses ke semua image. Melakukan hal itu mencegah kehilangan akses ke image ketika host infrastruktur control plane) hilang.

source: When the OpenStack-Ansible project was created, it was required to provide a system able to override any OpenStack upstream source code.
de: Wenn das OpenStack-Ansible-Projekt erstellt wurde, war es erforderlich, ein System bereitzustellen, das jeden OpenStack-Upstream-Quellcode überschreiben kann.
id: Ketika proyek OpenStack-Ansible dibuat, diperlukan untuk menyediakan sistem yang dapat mengesampingkan sembarang upstream source code OpenStack.

source: When the dynamic inventory script creates a container name, the host on which the container resides is added to the ``lxc_hosts`` inventory group.
de: Wenn das dynamische Inventarscript einen Containernamen erstellt, wird der Host, auf dem sich der Container befindet, zur Bestandsgruppe ``lxc_hosts`` hinzugefügt.
id: Ketika skrip inventory dinamis membuat nama container, host tempat container tersebut ditambahkan ke grup inventory ``lxc_hosts``.

source: When the flavors in the Compute service are configured to provide instances with root or ephemeral disks, the ``nova-compute`` service manages these allocations using its ephemeral disk storage location.
de: Wenn die Flavors im Compute-Dienst so konfiguriert sind, dass Instanzen mit Root- oder Ephemeral-Festplatten bereitgestellt werden, verwaltet der Dienst ``nova-compute`` diese Zuweisungen unter Verwendung seines temporären Speicherplatzes.
id: Ketika flavor dalam layanan Compute dikonfigurasikan untuk memberikan instance dengan disk root atau ephemeral, layanan ``nova-compute`` mengelola alokasi ini menggunakan lokasi penyimpanan disk ephemeralnya.

source: While nspawn is an available containerization technology it should be considered experemental at this time. Even though this subsystem is not yet recommended for production, it is stable enough to introduce to the community and something we'd like feedback on as we improve it over the next cycle.
id: Meskipun nspawn adalah teknologi kontainerisasi yang tersedia, itu harus dipertimbangkan sebagai pengalaman saat ini. Meskipun subsistem ini belum direkomendasikan untuk produksi, ini cukup stabil untuk diperkenalkan kepada masyarakat dan kami ingin umpan balik ketika kami memperbaikinya pada siklus berikutnya.

source: While the pre-built packages in the repository-infrastructure are comprehensive, it may be needed to change the source locations and versions of packages to suit different deployment needs. Adding additional repositories as overrides is as simple as listing entries within the variable file of your choice. Any ``user_.*.yml`` file within the "/etc/openstack_deployment" directory will work to facilitate the addition of a new packages.
de: Während die vorgefertigten Pakete in der Repository-Infrastruktur umfassend sind, kann es erforderlich sein, die Quellorte und -versionen von Paketen an unterschiedliche Bereitstellungsanforderungen anzupassen. Das Hinzufügen zusätzlicher Repositorys als Overrides ist so einfach wie das Auflisten von Einträgen in der Variablendatei Ihrer Wahl. Jede ``user _. *.yml`` -Datei im Verzeichnis ``/etc/openstack_deployment`` erleichtert das Hinzufügen neuer Pakete.
id: Sementara paket pre-built dalam repository-infrastructure bersifat komprehensif, mungkin diperlukan untuk mengubah lokasi sumber dan versi paket agar sesuai dengan kebutuhan penyebaran yang berbeda. Menambahkan repositori tambahan sebagai ganti adalah sesederhana daftar entri dalam file variabel pilihan Anda. Setiap file ``user_.*.yml`` dalam direktori "/etc/openstack_deployment" akan berfungsi untuk memfasilitasi penambahan paket baru.

source: Within a ``physical_skel`` section, the OpenStack-Ansible dynamic inventory expects to find a pair of keys. The first key maps to items in the ``container_skel`` section, and the second key maps to the target host groups (described above) that are responsible for hosting the service component.
de: In einem ``physical_skel``-Abschnitt erwartet das OpenStack-Ansible-dynamische Inventar ein Schlüsselpaar. Der erste Schlüssel wird Objekten im Abschnitt ``container_skel`` zugeordnet, und der zweite Schlüssel wird den oben beschriebenen Zielhostgruppen zugeordnet, die für das Hosten der Servicekomponente verantwortlich sind.
id: Di dalam bagian ``physical_skel``, inventaris dinamis OpenStack-Ansible mengharapkan untuk menemukan sepasang kunci. Kunci utama memetakan item di bagian ``container_skel``, dan kunci kedua memetakan ke grup host target (dijelaskan di atas) yang bertanggung jawab untuk meng-hosting komponen layanan.

source: Writing debug logs
de: Debug-Protokolle schreiben
id: Menulis log debug

source: You can also apply overrides on a per-host basis with the following configuration in the ``/etc/openstack_deploy/openstack_user_config.yml`` file:
de: Sie können auch Überschreibungen pro Host mit der folgenden Konfiguration in der Datei ``/etc/openstack_deploy/openstack_user_config.yml`` anwenden:
id: Anda juga dapat menerapkan penggantian pada basis per-host dengan konfigurasi berikut di file ``/etc/openstack_deploy/openstack_user_config.yml``:

source: You can create your own playbook, variable, and role structure while still including the OpenStack-Ansible roles and libraries by setting environment variables or by adjusting ``/usr/local/bin/openstack-ansible.rc``.
de: Sie können Ihre eigene Playbook-, Variablen- und Rollenstruktur erstellen, während Sie weiterhin die OpenStack-Ansible-Rollen und -Bibliotheken enthalten, indem Sie Umgebungsvariablen festlegen oder ``/usr/local/bin/openstack-ansible.rc`` anpassen.
id: Anda dapat membuat playbook, variabel, dan struktur peran Anda sendiri sambil tetap menyertakan peran dan pustaka yang dimungkinkan OpenStack dengan mengatur variabel lingkungan atau dengan menyesuaikan ``/usr/local/bin/openstack-ansible.rc``.

source: You can override ``.yml`` file values by supplying replacement YAML content.
de: Sie können `.yml`` Dateiwerte überschreiben, indem Sie Ersatz-YAML-Inhalt bereitstellen.
id: Anda dapat mengganti nilai file ``.yml`` dengan memasok konten YAML pengganti.

source: You can override the ansible-role-requirement file used by defining the environment variable ``ANSIBLE_ROLE_FILE`` before running the ``bootstrap-ansible.sh`` script.
id: Anda dapat mengganti file ansible-role-requirement yang digunakan dengan mendefinisikan variabel lingkungan ``ANSIBLE_ROLE_FILE`` sebelum menjalankan skrip ``bootstrap-ansible.sh``.

source: You can override the existing group vars (and host vars) by creating your own folder in /etc/openstack_deploy/group_vars (and /etc/openstack_deploy/host_vars respectively).
de: Sie können die vorhandenen Gruppenvariablen (und Hostvariablen) überschreiben, indem Sie in /etc/openstack_deploy/group_vars (bzw. /etc/openstack_deploy/host_vars) einen eigenen Ordner erstellen.
id: Anda dapat mengganti group vars yang ada (dan host vars) dengan membuat folder Anda sendiri /etc/openstack_deploy/group_vars (dan /etc/openstack_deploy/host_vars masing-masing).

source: You define *container groups*, which can map from the service components to be deployed up to host groups, through files in the ``/etc/openstack_deploy/env.d/`` directory.
de: Sie definieren *Containergruppen*, die von den zu implementierenden Servicekomponenten bis zu Hostgruppen durch Dateien im Verzeichnis ``/etc/openstack_deploy/env.d/`` abbilden können.
id: Anda mendefinisikan *container groups*, yang dapat memetakan dari komponen layanan yang akan digunakan hingga kelompok host, melalui file di direktori ``/etc/openstack_deploy/env.d/``.

source: You define host groups, which gather the target hosts into *inventory groups*, through the ``/etc/openstack_deploy/openstack_user_config.yml`` file and the contents of the ``/etc/openstack_deploy/conf.d/`` directory.
de: Sie definieren Host-Gruppen, die die Ziel-Hosts in *Inventory Groups* zusammenfassen, über die Datei `/etc/openstack_deploy/openstack_user_config.yml` und den Inhalt des Verzeichnisses ``/etc/openstack_deploy/conf.d/``.
id: Anda mendefinisikan grup host, yang mengumpulkan host target menjadi *inventory groups*, melalui file ``/etc/openstack_deploy/openstack_user_config.yml`` dan isi dari direktori ``/etc/openstack_deploy/conf.d/``.

source: ``ANSIBLE_ROLE_FILE`` is an environment variable pointing to the location of a YAML file which ansible-galaxy can consume, specifying which roles to download and install. The default value for this is ``ansible-role-requirements.yml``.
de: ``ANSIBLE_ROLE_FILE`` ist eine Umgebungsvariable, die auf den Speicherort einer YAML-Datei verweist, die ansible-galaxy konsumieren kann, wobei angegeben wird, welche Rollen heruntergeladen und installiert werden sollen. Der Standardwert dafür ist ``ansible-role-anforderungen.yml``.
id: ``ANSIBLE_ROLE_FILE`` adalah variabel lingkungan yang menunjuk ke lokasi file YAML dimana ansible-galaxy dapat mengkonsumsi, menentukan dimana peran mengunduh dan menginstal. Nilai default untuk ini adalah ``ansible-role-requirements.yml``.

source: ``all`` contains global network information such as the load balancer IPs and provider network metadata.
de: ``all`` enthält globale Netzwerkinformationen wie die Load Balancer IPs und Provider-Netzwerk-Metadaten.
id: ``all`` berisi informasi jaringan global seperti IP penyeimbang beban (load balancer) dan metadata jaringan penyedia (provider network).

source: ``env.d`` (for environment customization)
de: ``env.d`` (für die Anpassung der Umgebung)
id: ``env.d`` (untuk penyesuaian lingkungan)

source: ``hosts`` contains a map of a host's name to its variable and group data.
de: ``hosts`` enthält eine Zuordnung des Namens eines Hosts zu seinen Variablen- und Gruppendaten.
id: ``hosts`` berisi peta nama host untuk variabel dan data grupnya.

source: ``user_*.yml`` files contain YAML variables which are applied as extra-vars when executing ``openstack-ansible`` to run playbooks. They will be sourced in alphanumeric order by ``openstack-ansible``. If duplicate variables occur in the ``user_*.yml`` files, the variable in the last file read will take precedence.
de: `user_*. yml`` Dateien enthalten YAML-Variablen, die als extra-vars angewendet werden, wenn ``openstack-ansible`` zum Ausführen von Playbooks ausgeführt wird. Sie werden in alphanumerischer Reihenfolge von ``openstack-ansible`` bezogen. Wenn doppelte Variablen in den Dateien ``user_*.yml`` auftreten, hat die Variable in der zuletzt gelesenen Datei Vorrang.
id: File ``user_*.yml`` berisi variabel-variabel YAML yang diterapkan sebagai extra-vars ketika menjalankan ``openstack-ansible`` untuk menjalankan playbooks. Mereka akan bersumber dalam urutan alfanumerik dengan ``openstack-ansible``. Jika variabel duplikat terjadi dalam file ``user_*.yml``, variabel dalam pembacaan file terakhir akan diutamakan.

source: ``user_variables.yml`` and ``user_secrets.yml`` are used directly by OpenStack-Ansible. Adding custom variables used by your own roles and playbooks to these files is not recommended. Doing so will complicate your upgrade path by making comparison of your existing files with later versions of these files more arduous. Rather, recommended practice is to place your own variables in files named following the ``user_*.yml`` pattern so they will be sourced alongside those used exclusively by OpenStack-Ansible.
de: ``user_variables.yml`` und ``user_secrets.yml`` werden direkt von OpenStack-Ansible verwendet. Es wird nicht empfohlen, benutzerdefinierte Variablen hinzuzufügen, die von Ihren eigenen Rollen und Playbooks für diese Dateien verwendet werden. Dies erschwert den Upgrade-Pfad, da der Vergleich Ihrer vorhandenen Dateien mit späteren Versionen dieser Dateien schwieriger wird. Stattdessen empfiehlt es sich, Ihre eigenen Variablen in Dateien zu speichern, die nach dem ``user_*.yml``-Muster benannt sind, so dass sie zusammen mit denen verwendet werden, die ausschließlich von OpenStack-Ansible verwendet werden.
id: ``user_variables.yml`` dan ``user_secrets.yml`` digunakan langsung oleh OpenStack-Ansible. Menambahkan variabel khusus yang digunakan oleh peran dan buku pedoman Anda sendiri ke file ini tidak disarankan. Melakukan hal itu akan mempersulit jalur upgrade Anda dengan membuat perbandingan file yang ada dengan versi yang lebih baru dari file ini lebih sulit. Sebaliknya, praktik yang disarankan adalah menempatkan variabel Anda sendiri dalam file bernama mengikuti pola ``user_*.yml`` sehingga mereka akan bersumber di samping yang digunakan secara eksklusif oleh OpenStack-Ansible.

source: config_template documentation
de: Dokumentation der config_template
id: dokumentasi config_template

source: openstack_user_config settings reference
de: openstack_user_config Einstellungsreferenz
id: referensi pengaturan openstack_user_config

source: user_*.yml files in more details
de: user_*.yml-Dateien in weiteren Einzelheiten
id: file user_*.yml lebih detail

source: Block Storage (cinder)
de: Blockspeicher (cinder)

source: Ephemeral storage (nova)
de: Ephemer Speicher (Nova)

source: Filesystem storage (manila)
de: Datei Storage (manila)

source: Image storage (glance)
de: Abbildspeicher (glance)

source: Inputs
de: Eingänge

source: Inventory
de: Inventar

source: Linux Container commands
de: Linux Container Befehle

source: Object Storage (swift)
de: Objektspeicher (swift)

source: OpenStack-Ansible uses an included script to generate the inventory of hosts and containers within the environment. This script is called by Ansible through its `dynamic inventory functionality <https://docs.ansible.com/ansible/intro_dynamic_inventory.html>`_.
de: OpenStack-Ansible verwendet ein enthaltenes Skript, um das Inventar von Hosts und Containern in der Umgebung zu generieren. Dieses Skript wird von Ansible über seine `dynamische Inventarisierungsfunktion <https://docs.ansible.com/ansible/intro_dynamic_inventory.html>`_ aufgerufen.

source: Outputs
de: Ausgänge

source: Role defaults
de: Rollenvorgaben

source: To learn more about how to customize the deployment of encrypted communications, see :ref:`Securing services with SSL certificates <security_settings>`.
de: Weitere Informationen zum Anpassen der Bereitstellung verschlüsselter Kommunikation finden Sie unter :ref:`Sichern von Diensten mit SSL-Zertifikaten <security_settings>`.

source: User variables
de: Benutzervariablen

source: Variable precedence
de: Variable Priorität

source: When the File System store is used, the Image service has no mechanism of its own to replicate the image between Image service hosts. We recommend using a shared storage back end (via a file system mount) to ensure that all ``glance-api`` services have access to all images. Doing so prevents losing access to images when an infrastructure (control plane) host is lost.
de: Wenn der Dateisystemspeicher verwendet wird, hat der Abbild-Dienst keinen eigenen Mechanismus, um das Abbild zwischen Abbild-Service-Hosts zu replizieren. Wir empfehlen die Verwendung eines gemeinsamen Speicher-Backends (über ein Dateisystem-Mount), um sicherzustellen, dass alle ``glance-api``-Dienste Zugriff auf alle Abbilder haben. Dadurch wird verhindert, dass der Zugriff auf Abbilder verloren geht, wenn ein Host der Infrastruktur (Kontrollebene) verloren geht.
