Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: de, id

source: A Git repository that contains a copy of the source code that is used to prepare the packages for all OpenStack services
de: Ein Git-Repository, das eine Kopie des Quellcodes enthält, mit dem die Pakete für alle OpenStack-Dienste vorbereitet werden
id: Repositori Git yang berisi salinan kode sumber yang digunakan untuk menyiapkan paket untuk semua layanan OpenStack

source: A firewall must be used to restrict access to the network.
de: Um den Zugriff auf das Netzwerk zu beschränken, muss eine Firewall verwendet werden.
id: Firewall harus digunakan untuk membatasi akses ke jaringan.

source: A git submodule pointed to a released tag.
de: Ein Git-Submodul zeigte auf ein freigegebenes Tag.
id: Git submodule menunjuk ke tag yang dirilis.

source: A group can contain child groups
de: Eine Gruppe kann untergeordnete Gruppen enthalten
id: Grup dapat berisi grup anak (child group)

source: A group can contain hosts
de: Eine Gruppe kann Hosts enthalten
id: Grup dapat berisi host

source: A host can be removed with the ``--remove-item/-r`` parameter.
de: Ein Host kann mit dem Parameter ``-remove-item/-r`` entfernt werden.
id: Host dapat dihapus dengan parameter ``--remove-item/-r``.

source: A list of all hosts can be seen with the ``--list-host/-l`` argument
de: Eine Liste aller Hosts kann mit dem ``--list-host/-l`` Argument angezeigt werden
id: Daftar semua host dapat dilihat dengan argumen ``--list-host/-l``

source: A patch merged into a role is immediately tested by other role tests, ensuring that any major breaking change is caught. Once a minor/patch release is requested, the integrated build receives a 'SHA bump' patch to update the integrated build to using the latest available roles including that new patch. This new set is available for testing to anyone wanting to use the head of the stable branch, and is tested in periodic tests until the next release. In total, that means that the cycle time for a patch from merge to release is anywhere from two weeks to one month.
de: Ein Patch, der zu einer Rolle zusammengeführt wurde, wird sofort durch andere Rollentests getestet. So wird sichergestellt, dass jede wichtige Änderung behoben wird. Sobald eine Minor/Patch-Version angefordert wird, erhält der integrierte Build einen `SHA Bump`-Patch, um den integrierten Build zu aktualisieren und die neuesten verfügbaren Rollen einschließlich des neuen Patches zu verwenden. Dieses neue Set ist für jeden verfügbar, der den Leiter der Stable Branch verwenden möchte und wird in regelmäßigen Tests bis zur nächsten Version getestet. Insgesamt bedeutet dies, dass die Zykluszeit für das Zusammenführen eines Patches zur Freigabe zwischen zwei Wochen und einem Monat liegt.
id: Sebuah patch yang digabung menjadi sebuah role segera diuji oleh tes role lainnya, memastikan bahwa ada perubahan besar yang terjadi. Setelah rilis minor/patch diminta, build terintegrasi menerima patch 'SHA bump' untuk memperbarui build terintegrasi untuk menggunakan role terbaru yang tersedia termasuk patch baru itu. Set baru ini tersedia untuk pengujian kepada siapa saja yang ingin menggunakan kepala branch stabil (head of the stable branch), dan diuji dalam tes berkala hingga rilis berikutnya. Secara total, itu berarti bahwa waktu siklus untuk patch dari penggabungan hingga rilis adalah di mana saja dari dua minggu hingga satu bulan.

source: A rsyslog service is optionally set up to receive rsyslog traffic from all hosts and containers. You can replace rsyslog with any alternative log receiver.
id: Layanan rsyslog secara opsional diatur untuk menerima lalu lintas rsyslog dari semua host dan container. Anda dapat mengganti rsyslog dengan penerima log alternatif apa pun.

source: A script to automatically perform a git checkout of OpenStack-Ansible.
de: Ein Skript zum automatischen Ausführen eines Git-Checkouts von OpenStack-Ansible.
id: Sebuah skrip untuk secara otomatis melakukan checkout git dari OpenStack-Ansible.

source: A source based deployment, for Python-built parts of OpenStack, makes sense when dealing with scale and wanting consistency over long periods of time. A deployer should have the ability to deploy the same OpenStack release on every node throughout the life cycle of the cloud, even when some components are end of life. By providing a repository of the sources, the deployment can be re-created even years after the initial deployment, assuming the underlying operating systems and packages stay the same.
de: Eine quellbasierte Implementierung für von Python erstellte Teile von OpenStack ist sinnvoll, wenn es um Skalierung geht und Konsistenz über lange Zeiträume hinweg gewünscht wird. Ein Deployer sollte in der Lage sein, dieselbe OpenStack-Version auf jedem Knoten während des Lebenszyklus der Cloud bereitzustellen, selbst wenn einige Komponenten nicht mehr verwendet werden. Durch Bereitstellung eines Repositorys für die Quellen kann die Bereitstellung auch Jahre nach der ersten Bereitstellung wiederhergestellt werden, vorausgesetzt, die zugrunde liegenden Betriebssysteme und Pakete bleiben gleich.
id: Penyebaran berbasis sumber, untuk bagian OpenStack yang dibuat dengan Python, masuk akal ketika berhadapan dengan skala dan menginginkan konsistensi dalam jangka waktu yang lama. Seorang deployer harus memiliki kemampuan untuk menyebarkan rilis OpenStack yang sama pada setiap node sepanjang siklus hidup cloud, bahkan ketika beberapa komponen adalah akhir dari kehidupan. Dengan menyediakan repositori sumber, penyebaran dapat dibuat ulang walaupun bertahun-tahun setelah penerapan awal, dengan asumsi sistem operasi dan paket yang mendasarinya tetap sama.

source: A volume is created by the assigned ``cinder-volume`` service using the appropriate `cinder driver`_. The volume is created by using an API that is presented to the management network.
de: Ein Datenträger wird vom zugewiesenen Dienst ``cinder-volume`` mit dem entsprechenden `cinder driver`_ erstellt. Der Datenträger wird mithilfe einer API erstellt, die dem Verwaltungsnetzwerk bereitgestellt wird.
id: Volume dibuat oleh layanan ``cinder-volume`` yang ditugaskan menggunakan `driver cinder`_ yang sesuai. Volume dibuat dengan menggunakan API yang disajikan ke jaringan manajemen.

source: Adding extra python software
de: Hinzufügen von zusätzlicher Python-Software
id: Menambahkan perangkat lunak python tambahan

source: Adding new or overriding roles in your OpenStack-Ansible installation
de: Hinzufügen neuer oder übergeordneter Rollen in Ihrer OpenStack-Ansible-Installation
id: Menambahkan peran baru atau utama dalam instalasi OpenStack-Ansible Anda

source: Additional group mappings are located within files in the ``/etc/openstack_deploy/env.d/`` directory. These groups are treated as virtual mappings from the host groups (described above) onto the container groups, that define where each service deploys. By reviewing files within the ``env.d/`` directory, you can begin to see the nesting of groups represented in the default layout.
de: Weitere Gruppenzuordnungen befinden sich in Dateien im Verzeichnis ``/etc/openstack_deploy/env.d/``. Diese Gruppen werden als virtuelle Zuordnungen von den Hostgruppen (oben beschrieben) zu den Containergruppen behandelt, die definieren, wo sich jeder Dienst entfaltet. Wenn Sie Dateien im ``env.d/`` - Verzeichnis überprüfen, können Sie beginnen, die Verschachtelung von Gruppen zu sehen, die im Standardlayout dargestellt werden.
id: Pemetaan grup tambahan terdapat di dalam file di direktori ``/etc/openstack_deploy/env.d/``. Grup ini diperlakukan sebagai pemetaan virtual dari grup host (dijelaskan di atas) ke grup kontainer, yang menentukan di mana masing-masing layanan menyebarkan. Dengan meninjau file di dalam direktori ``env.d/``, Anda dapat mulai melihat kumpulan (nesting) grup yang diwakili dalam tata letak default.

source: Additional lists of python packages can also be overridden using a ``user_.*.yml`` variable file.
de: Zusätzliche Listen von Python-Paketen können auch mit einer ``user_. *.yml``-Variablendatei überschrieben werden.
id: Daftar tambahan paket python juga dapat diganti menggunakan file variabel ``user_.*.yml``.

source: Additional services should be defined with a YAML file in ``/etc/openstack_deploy/conf.d``, in order to manage file size.
de: Zusätzliche Dienste sollten mit einer YAML-Datei in ``/etc/openstack_deploy/conf.d`` definiert werden, um die Dateigröße zu verwalten.
id: Layanan tambahan harus didefinisikan dengan file YAML di ``/etc/openstack_deploy/conf.d``, untuk mengelola ukuran file.

source: Additionally, the configuration or environment could be spread between two additional sub-directories:
de: Darüber hinaus könnte die Konfiguration oder Umgebung auf zwei zusätzliche Unterverzeichnisse aufgeteilt werden:
id: Selain itu, konfigurasi atau lingkungan dapat tersebar di antara dua subdirektori tambahan:

source: Adjust the :ref:`affinity` to 0 for the host group. Similar to the second option listed here, Unless you specify the component to run directly on a host by using the ``is_metal`` property, a container is created for this component.
de: Passen Sie die Eigenschaft :ref:`affinity` für die Hostgruppe auf 0 an. Ähnlich wie bei der zweiten hier aufgeführten Option: Wenn Sie die Komponente nicht direkt über die Eigenschaft ``is_metal`` auf einem Host ausführen, wird ein Container für diese Komponente erstellt.
id: Sesuaikan :ref:`affinity` ke 0 untuk grup host. Mirip dengan opsi kedua yang tercantum di sini, Kecuali Anda menentukan komponen untuk dijalankan secara langsung pada host dengan menggunakan properti ``is_metal``, sebuah kontainer dibuat untuk komponen ini.

source: Advanced configuration
de: Erweiterte Konfiguration
id: Konfigurasi lanjutan

source: Advanced inventory topics
de: Erweiterte Inventar-Themen
id: Topik inventory lanjutan

source: After the hypervisor is connected to the volume, it presents the volume as a local hardware device to the instance.
de: Nachdem der Hypervisor mit dem Datenträger verbunden ist, stellt er den Datenträger als lokales Hardwaregerät für die Instanz bereit.
id: Setelah hypervisor terhubung ke volume, itu menyajikan volume sebagai perangkat keras lokal ke instance.

source: After the image is retrieved, the ``nova-compute`` service stores the image in its own image cache. When another instance is created with the same image, the image is retrieved from the local base image cache.
de: Nachdem das Abbild abgerufen wurde, speichert der ``nova-compute`` -Dienst das Abbild in seinem eigenen Abbild-Cache. Wenn eine andere Instanz mit demselben Abbild erstellt wird, wird das Abbild aus dem lokalen Basis-Image-Cache abgerufen.
id: Setelah image diambil, layanan ``nova-compute`` menyimpan image dalam cache image-nya sendiri. Ketika instance lain dibuat dengan image yang sama, image tersebut diambil dari cache image dasar lokal.

source: After the volume is created, the ``nova-compute`` service connects the Compute host hypervisor to the volume via the storage network.
de: Nachdem der Datenträger erstellt wurde, verbindet der Dienst ``nova-compute`` den Compute-Host-Hypervisor über das Speichernetzwerk mit dem Datenträger.
id: Setelah volume dibuat, layanan ``nova-compute`` menghubungkan hypervisor host Compute ke volume melalui jaringan penyimpanan.

source: All OpenStack services require an underlying database. MariaDB with Galera implements a multimaster database configuration, which simplifies its use as a highly available database with a simple failover model.
de: Alle OpenStack-Dienste erfordern eine zugrunde liegende Datenbank. MariaDB mit Galera implementiert eine Multimaster-Datenbankkonfiguration, die die Verwendung als hoch verfügbare Datenbank mit einem einfachen Failovermodell vereinfacht.
id: Semua layanan OpenStack membutuhkan basis data yang mendasarinya. MariaDB dengan Galera mengimplementasikan konfigurasi basis data multimaster, yang menyederhanakan penggunaannya sebagai basis data yang sangat tersedia dengan model failover sederhana.

source: All default YAML file content is completely overwritten by the overrides, so the entire YAML source (both the existing content and your changes) must be provided.
de: Der gesamte Inhalt der YAML-Datei wird vollständig durch die Überschreibungen überschrieben. Daher muss die gesamte YAML-Quelle (sowohl der vorhandene Inhalt als auch Ihre Änderungen) bereitgestellt werden.
id: Semua konten file YAML default sepenuhnya ditimpa oleh override, sehingga seluruh sumber YAML (konten yang ada dan perubahan Anda) harus disediakan.

source: All of the services that use YAML, JSON, or INI for configuration can receive overrides through the use of a Ansible action plugin named ``config_template``. The configuration template engine allows a deployer to use a simple dictionary to modify or add items into configuration files at run time that may not have a preset template option. All OpenStack-Ansible roles allow for this functionality where applicable. Files available to receive overrides can be seen in the ``defaults/main.yml`` file as standard empty dictionaries (hashes).
de: Alle Dienste, die YAML, JSON oder INI für die Konfiguration verwenden, können durch die Verwendung eines Ansible-Action-Plugins mit dem Namen ``config_template`` überschrieben werden. Die Konfigurationsvorlagen-Engine ermöglicht einem Bereitsteller, ein einfaches Wörterbuch zu verwenden, um Elemente zur Laufzeit in Konfigurationsdateien zu ändern oder hinzuzufügen, die möglicherweise keine voreingestellte Vorlagenoption haben. Alle OpenStack-Ansible-Rollen ermöglichen diese Funktionalität, wo anwendbar. Dateien, die für das Übernehmen von Überschreibungen verfügbar sind, können in der ``defaults/main.yml``-Datei als leere Standardwörterbücher (Hashes) gesehen werden.
id: Semua layanan yang menggunakan YAML, JSON, atau INI untuk konfigurasi dapat menerima penggantian melalui penggunaan plugin tindakan Ansible bernama ``config_template``. Mesin template konfigurasi memungkinkan deployer untuk menggunakan kamus sederhana untuk memodifikasi atau menambahkan item ke dalam file konfigurasi pada waktu berjalan yang mungkin tidak memiliki opsi template yang telah ditetapkan. Semua peran OpenStack-Ansible memungkinkan fungsionalitas ini jika berlaku. File yang tersedia untuk menerima penggantian dapat dilihat dalam file ``defaults/main.yml`` sebagai kamus standar kosong (hash).

source: All of these options can be specified in any way that suits your deployment. In terms of ease of use and flexibility it's recommended that you define your overrides in a user variable file such as ``/etc/openstack_deploy/user_variables.yml``.
de: Alle diese Optionen können auf jede für Ihre Bereitstellung geeignete Weise angegeben werden. In Bezug auf Benutzerfreundlichkeit und Flexibilität wird empfohlen, dass Sie Ihre Überschreibungen in einer Benutzervariablen-Datei wie ``/etc/openstack_deploy/user_variables.yml`` definieren.
id: Semua opsi ini dapat ditentukan dengan cara apa pun yang sesuai dengan penyebaran Anda. Dalam hal kemudahan penggunaan dan fleksibilitas, disarankan agar Anda mendefinisikan override Anda dalam file variabel pengguna seperti ``/etc/openstack_deploy/user_variables.yml``.

source: All roles are built as Galaxy compatible roles even when the given role is not intended for standalone use. While the project will offer a lot of built-in roles the deployer will be able to pull down or override roles with external ones using the built-in Ansible capabilities. This allows extreme flexibility for deployers.
de: Alle Rollen werden als mit Galaxy kompatible Rollen erstellt, auch wenn die angegebene Rolle nicht für die eigenständige Verwendung gedacht ist. Während das Projekt viele integrierte Rollen bietet, kann der Deployer Rollen mithilfe der integrierten Ansible-Funktionen mit externen Pull-down- oder Override-Funktionen versehen. Dies ermöglicht eine extreme Flexibilität für Bereitsteller.
id: Semua peran dibangun sebagai peran yang kompatibel dengan Galaxy bahkan ketika peran yang diberikan tidak dimaksudkan untuk penggunaan mandiri. Sementara proyek akan menawarkan banyak peran built-in, deployer akan dapat menurunkan atau mengesampingkan peran dengan peran eksternal menggunakan kemampuan Ansible built-in. Hal ini memungkinkan fleksibilitas ekstrem untuk para penyusun.

source: All the userspace configurations are expected to be in ``/etc/openstack_deploy/``.
de: Alle Userspace-Konfigurationen werden voraussichtlich in ``/etc/openstack_deploy/`` sein.
id: Semua konfigurasi userspace diharapkan berada di ``/etc/openstack_deploy/``.

source: Allows for network monitoring and alerting
de: Ermöglicht die Netzwerküberwachung und -benachrichtigung
id: Mengizinkan pemantauan jaringan dan peringatan

source: Also note that copying files into directories such as ``env.d`` or ``conf.d`` should be handled via some sort of script within the extension project.
de: Beachten Sie auch, dass das Kopieren von Dateien in Verzeichnisse wie `` env.d`` oder `` conf.d`` über eine Art Skript innerhalb des Erweiterungsprojekts erfolgen sollte.
id: Juga perhatikan bahwa menyalin file ke direktori seperti ``env.d`` atau ``conf.d`` harus ditangani melalui semacam skrip dalam proyek ekstensi.

source: An apt/yum proxy cache that is used to cache distribution packages installed in the environment
de: Ein apt/yum-Proxy-Cache, der zum Zwischenspeichern von in der Umgebung installierten Verteilungspaketen verwendet wird
id: Cache proxy apt/yum yang digunakan untuk cache paket distribusi yang diinstal di lingkungan

source: And here is the template file:
de: Und hier ist die Vorlagendatei:
id: Dan di sini adalah file templat:

source: Ansible Usage
de: Ansible Verwendung
id: Ansible Usage (penggunaan Ansible)

source: Ansible configuration
de: Ansible Konfiguration
id: Konfigurasi Ansible

source: Ansible is a simple yet powerful orchestration tool that is ideally equipped for deploying OpenStack-powered clouds. The declarative nature of Ansible allows the deployer to turn an entire deployment into a rather simple set of instructions.
de: Ansible ist ein einfaches, aber leistungsstarkes Orchestrierungstool, das ideal für die Bereitstellung von OpenStack-basierten Clouds geeignet ist. Die deklarative Natur von Ansible ermöglicht es dem Deployer, eine gesamte Bereitstellung in eine ziemlich einfache Menge von Anweisungen umzuwandeln.
id: Ansible adalah alat orkestrasi sederhana namun kuat yang idealnya dilengkapi untuk menyebarkan awan OpenStack-powered. Sifat deklaratif Ansible memungkinkan deployer untuk mengubah seluruh penyebaran menjadi satu set instruksi yang agak sederhana.

source: Ansible provides an automation platform to simplify system and application deployment. Ansible manages systems by using Secure Shell (SSH) instead of unique protocols that require remote daemons or agents.
de: Ansible bietet eine Automatisierungsplattform, um die Bereitstellung von Systemen und Anwendungen zu vereinfachen. Ansible verwaltet Systeme mithilfe von Secure Shell (SSH) anstelle von eindeutigen Protokollen, die Remote-Daemons oder -Agenten erfordern.
id: Ansible menyediakan platform otomasi untuk menyederhanakan penerapan sistem dan aplikasi. Ansible mengelola sistem dengan menggunakan Secure Shell (SSH) daripada protokol unik yang memerlukan daemon atau agen jarak jauh.

source: Ansible roles
de: Ansible Rollen
id: Peran Ansible

source: Ansible roles fetching
de: Ansible Rollen holen
id: Pengambilan peran Ansible

source: Ansible uses playbooks written in the YAML language for orchestration. For more information, see `Ansible - Intro to Playbooks <http://docs.ansible.com/playbooks_intro.html>`_.
id: Ansible menggunakan playbook yang ditulis dalam bahasa YAML untuk orkestrasi. Untuk informasi lebih lanjut, lihat `Ansible - Intro to Playbooks <http://docs.ansible.com/playbooks_intro.html>`_.

source: Any OpenStack cloud has sensitive information transmitted between services, including user credentials, service credentials or information about resources being created. Encrypting this traffic is critical in environments where the network cannot be trusted. (For more information about securing the network, see the :ref:`least-access-openstack-services` section.)
de: In jeder OpenStack-Cloud werden vertrauliche Informationen zwischen den Diensten ausgetauscht, einschließlich Benutzeranmeldeinformationen, Dienstanmeldeinformationen oder Informationen zu erstellten Ressourcen. Die Verschlüsselung dieses Datenverkehrs ist in Umgebungen wichtig, in denen das Netzwerk nicht vertrauenswürdig ist. (Weitere Informationen zum Sichern des Netzwerks finden Sie im Abschnitt :ref:`least-access-openstack-services`.)
id: Setiap OpenStack cloud memiliki informasi sensitif yang dikirimkan antara layanan, termasuk kredensial pengguna, kredensial layanan atau informasi tentang sumber daya yang dibuat. Mengenkripsi lalu lintas ini sangat penting dalam lingkungan di mana jaringan tidak dapat dipercaya. (Untuk informasi lebih lanjut tentang mengamankan jaringan, lihat bagian :ref:`least-access-openstack-services`).

source: Any changes to the containers must also be reflected in the deployment's load balancer.
de: Alle Änderungen an den Containern müssen sich auch im Load Balancer der Implementierung widerspiegeln.
id: Setiap perubahan pada kontainer juga harus tercermin dalam penyeimbang beban penempatan.

source: Any roles defined in ``openstack-ansible/ansible-role-requirements.yml`` will be installed by the ``openstack-ansible/scripts/bootstrap-ansible.sh`` script, and fetched into the ansible roles folder.
de: Alle in ``openstack-ansible/ansible-role-requirements.yml` definierten Rollen werden vom Script ``openstack-ansible/scripts/bootstrap-ansible.sh`` installiert und in den Ordner für Ansible Rollen geholt.
id: Setiap peran yang didefinisikan dalam ``openstack-ansible/ansible-role-requirements.yml`` akan diinstal oleh skrip ``openstack-ansible/scripts/bootstrap-ansible.sh``, dan diambil ke folder peran yang dimungkinkan.

source: Apply nondisruptively to a production OpenStack environment
de: Wenden Sie sie unterbrechungsfrei auf eine OpenStack-Produktionsumgebung an
id: Terapkan tanpa gangguan ke lingkungan OpenStack produksi

source: Architecture
de: Die Architektur
id: Arsitektur

source: As an example, consider the following excerpt from ``openstack_user_config.yml``:
de: Betrachten Sie als Beispiel den folgenden Auszug aus ``openstack_user_config.yml``:
id: Sebagai contoh, pertimbangkan kutipan berikut dari ``openstack_user_config.yml``:

source: As part of the initial configuration, each target host appears either in the ``/etc/openstack_deploy/openstack_user_config.yml`` file or in files within the ``/etc/openstack_deploy/conf.d/`` directory. The format used for files in the ``conf.d/`` directory is identical to the syntax used in the ``openstack_user_config.yml`` file.
de: Im Rahmen der Erstkonfiguration wird jeder Zielhost entweder in der Datei ``/etc/openstack_deploy/openstack_user_config.yml`` oder in Dateien im Verzeichnis ``/etc/openstack_deploy/conf.d/`` angezeigt. Das Format für Dateien im Verzeichnis ``conf.d/`` ist identisch mit der Syntax in der Datei ``openstack_user_config.yml``.
id: Sebagai bagian dari konfigurasi awal, setiap host target akan muncul di file ``/etc/openstack_deploy/openstack_user_config.yml`` atau dalam file dalam direktori``/etc/openstack_deploy/conf.d/``. Format yang digunakan untuk file dalam direktori ``conf.d/`` identik dengan sintaksis yang digunakan dalam file ``openstack_user_config.yml``.
