Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: de, id

source: **Availability Zone**
de: **Verfügbarkeitszone**

source: **Customisation Script**
de: **Anpassungs-Skript**

source: **Data flow example**
de: **Datenflussbeispiel**

source: **Flavor**
de: **Variante**

source: **Image Name**
de: **Abbildname**

source: **Image**
de: **Abbild**

source: **Instance Boot Source**
de: **Instanzstartquelle**

source: **Instance Count**
de: **Instanzanzahl**

source: **Instance Name**
de: **Instanzname**

source: **Keypair**
de: **Schlüsselpaar**

source: **Launching an instance options**
de: **Starten einer Instanz Optionen**

source: **Security Groups**
de: **Sicherheitsgruppen**

source: **Selected Networks**
de: **Ausgewählte Netzwerke**

source: A RabbitMQ broker is a logical grouping of one or several Erlang nodes with each node running the RabbitMQ application and sharing users, virtual hosts, queues, exchanges, bindings, and runtime parameters. A collection of nodes is often referred to as a `cluster`. For more information on RabbitMQ clustering, see `RabbitMQ cluster <https://www.rabbitmq.com/clustering.html>`_.
de: Ein RabbitMQ-Broker ist eine logische Gruppierung von einem oder mehreren Erlang-Knoten, wobei jeder Knoten die RabbitMQ-Anwendung ausführt und Benutzer, virtuelle Hosts, Warteschlangen, Austausch-, Bindungs- und Laufzeitparameter gemeinsam nutzt. Eine Sammlung von Knoten wird oft als ein `cluster` bezeichnet. Weitere Informationen zum RabbitMQ-Clustering finden Sie unter `RabbitMQ-Cluster <https://www.rabbitmq.com/clustering.html>`_.
id: Broker RabbitMQ adalah pengelompokan logis dari satu atau beberapa node Erlang dengan setiap node yang menjalankan aplikasi RabbitMQ dan berbagi pengguna, host virtual, antrian, pertukaran, bindings, dan parameter runtime. Kumpulan node sering disebut sebagai `cluster`. Untuk informasi lebih lanjut tentang pengelompokan RabbitMQ, lihat `RabbitMQ cluster <https://www.rabbitmq.com/clustering.html>`_.

source: A minor upgrade typically requires the following steps:
de: Ein geringfügiges Upgrade erfordert normalerweise die folgenden Schritte:
id: Pemutakhiran minor biasanya membutuhkan langkah-langkah berikut:

source: A newly deployed OpenStack-Ansible has no networks by default. If you need to add networks, you can use the openstack CLI, or you can use the ansible modules for it.
de: Ein neu bereitgestelltes OpenStack-Ansible hat standardmäßig keine Netzwerke. Wenn Sie Netzwerke hinzufügen müssen, können Sie die OpenStack-CLI verwenden oder Sie können die Ansible-Module dafür verwenden.
id: OpenStack-Ansible yang baru digunakan tidak memiliki jaringan secara default. Jika Anda perlu menambahkan jaringan, Anda dapat menggunakan CLI openstack, atau Anda dapat menggunakan modul ansible untuk itu.

source: Access the deployment groups section of the configuration file. Underneath the deployment group name, add an affinity value line to container scales OpenStack services:
de: Greifen Sie auf den Deployment-Gruppen-Abschnitt der Konfigurationsdatei zu. Fügen Sie unter dem Namen der Bereitstellungsgruppe eine Affinity-Wertlinie zu OpenSack-Services für Container-Maßstäbe hinzu:
id: Akses bagian kelompok penerapan dari file konfigurasi. Di bawah nama grup penerapan, tambahkan garis nilai afinitas (affinity value line) ke skala kontainer layanan OpenStack:

source: Access the utility container:
de: Zugriff auf den Dienstprogrammcontainer:
id: Akses kontainer utilitas:

source: Accessibility for multi-region Object Storage
de: Zugänglichkeit für den Multi-Region-Objektspeicher
id: Aksesibilitas untuk r multi-region Object Storage

source: Add a compute host
de: Fügen Sie einen Computer-Host hinzu
id: Tambahkan host komputasi

source: Add a new infrastructure host
de: Fügen Sie einen neuen Infrastrukturhost hinzu
id: Tambahkan host infrastruktur baru

source: Add customisation scripts, if needed, by clicking the **Post-Creation** tab. These run after the instance has been created. Some instances support user data, such as root passwords, or admin users. Enter the information specific to the instance here if required.
de: Fügen Sie bei Bedarf benutzerdefinierte Skripts hinzu, indem Sie auf die Registerkarte **Post-Creation** klicken. Diese werden ausgeführt, nachdem die Instanz erstellt wurde. Einige Instanzen unterstützen Benutzerdaten, z.B. Root-Kennwörter oder Admin-Benutzer. Geben Sie hier gegebenenfalls die für die Instanz spezifischen Informationen ein.
id: Tambahkan skrip kustomisasi, jika diperlukan, dengan mengklik tab **Post-Creation**. Ini berjalan setelah instance telah dibuat. Beberapa instance mendukung data pengguna, seperti kata sandi root, atau pengguna admin. Masukkan informasi khusus untuk instance di sini jika diperlukan.

source: Add each provider network to your cloud to be made known to OpenStack-Ansible and the operating system before you can execute the necessary playbooks to complete the configuration.
de: Fügen Sie jedes Provider-Netzwerk zu Ihrer Cloud hinzu, um es OpenStack-Ansible und dem Betriebssystem mitzuteilen, bevor Sie die erforderlichen Playbooks ausführen können, um die Konfiguration abzuschließen.
id: Tambahkan setiap jaringan penyedia ke cloud Anda untuk diketahui OpenStack-Ansible dan sistem operasi sebelum Anda dapat menjalankan playbook yang diperlukan untuk menyelesaikan konfigurasi.

source: Add provider bridges using new network interfaces
de: Hinzufügen von Provider-Bridges mithilfe neuer Netzwerkschnittstellen
id: Tambahkan jembatan penyedia (provider bridge) menggunakan antarmuka jaringan baru

source: Add the node to the ``infra_hosts`` stanza of the ``/etc/openstack_deploy/openstack_user_config.yml``
de: Fügen Sie den Knoten der Zeilengruppe ``infra_hosts`` der Datei ``/etc/openstack_deploy/openstack_user_config.yml`` hinzu
id: Tambahkan node ke stanza ``infra_hosts`` dari ``/etc/openstack_deploy/openstack_user_config.yml``

source: Adding an image using the Dashboard
de: Hinzufügen eines Abbildes mit dem Dashboard
id: Menambahkan image menggunakan Dasbor

source: Adding an image using the command line
de: Hinzufügen eines Abbildes über die Befehlszeile
id: Menambahkan image menggunakan command line

source: Adding images can be done through the Dashboard, or the command line. Another option available is the ``python-openstackclient`` tool, which can be installed on the controller node, or on a workstation.
de: Das Hinzufügen von Abbildern kann über das Dashboard oder die Befehlszeile erfolgen. Eine andere verfügbare Option ist das Tool ``python-openstackclient``, das auf dem Controller-Knoten oder auf einer Workstation installiert werden kann.
id: Menambahkan images dapat dilakukan melalui Dasbor, atau command line. Pilihan lain yang tersedia adalah alat ``python-openstackclient``, yang dapat diinstal pada node controller, atau di workstation.

source: Additional Nova flavor features like ephemeral storage or swap have an impact on live migration performance and success.
de: Zusätzliche Nova-Funktionen wie ephemere Speicherung oder Austausch wirken sich auf die Leistung und den Erfolg von Live-Migrationen aus.
id: Fitur Nova tambahan fitur seperti penyimpanan sementara atau swap berdampak pada kinerja dan kesuksesan migrasi langsung.

source: After creating a new infra node, test that the node runs correctly by launching a new instance. Ensure that the new node can respond to a networking connection test through the :command:`ping` command. Log in to your monitoring system, and verify that the monitors return a green signal for the new node.
de: Überprüfen Sie nach dem Erstellen eines neuen Infra-Knotens, ob der Knoten ordnungsgemäß ausgeführt wird, indem Sie eine neue Instanz starten. Stellen Sie sicher, dass der neue Knoten auf einen Netzwerkverbindungstest mit dem Befehl :command:`ping` reagieren kann. Melden Sie sich bei Ihrem Überwachungssystem an und vergewissern Sie sich, dass die Monitore ein grünes Signal für den neuen Knoten zurückgeben.
id: Setelah membuat infra node baru, uji bahwa node berjalan dengan benar dengan meluncurkan instance baru. Pastikan bahwa node baru dapat menanggapi tes koneksi jaringan melalui perintah :command:`ping`. Masuk ke sistem pemantauan Anda, dan verifikasi bahwa monitor mengembalikan sinyal hijau untuk node baru.

source: After creating a new node, test that the node runs correctly by launching an instance on the new node.
de: Überprüfen Sie nach dem Erstellen eines neuen Knotens, dass der Knoten ordnungsgemäß ausgeführt wird, indem Sie eine Instanz auf dem neuen Knoten starten.
id: Setelah membuat node baru, uji bahwa node berjalan dengan benar dengan meluncurkan sebuah instance pada node baru.

source: After the playbook completes, remove the compute node from the OpenStack-Ansible configuration file in ``/etc/openstack_deploy/openstack_user_config.yml``.
de: Nachdem das Playbook abgeschlossen ist, entfernen Sie den Compute-Knoten aus der OpenStack-Ansible-Konfigurationsdatei in ``/etc/openstack_deploy/openstack_user_config.yml``.
id: Setelah playbook selesai, hapus node komputasi dari file konfigurasi OpenStack-Ansible di ``/etc/openstack_deploy/openstack_user_config.yml``.

source: All LXC containers on the host have at least two virtual Ethernet interfaces:
de: Alle LXC-Container auf dem Host verfügen über mindestens zwei virtuelle Ethernet-Schnittstellen:
id: Semua kontainer LXC pada host memiliki setidaknya dua antarmuka Ethernet virtual:

source: All provider networks need to be added to the OpenStack-Ansible configuration.
de: Alle Provider-Netzwerke müssen der OpenStack-Ansible-Konfiguration hinzugefügt werden.
id: Semua jaringan penyedia perlu ditambahkan ke konfigurasi OpenStack-Ansible.

source: All the nodes have failed if ``mysqld`` is not running on any of the nodes and all of the nodes contain a ``seqno`` value of -1.
de: Alle Knoten sind fehlgeschlagen, wenn ``mysqld`` auf keinem der Knoten läuft und alle Knoten einen ``seqno`` Wert von -1 enthalten.
id: Semua node telah gagal jika ``mysqld`` tidak berjalan di salah satu node dan semua node mengandung nilai ``seqno`` dari -1.

source: An example for the latter is in the ``openstack-ansible-ops`` repository, under the ``openstack-service-setup.yml`` playbook.
de: Ein Beispiel für letzteres befindet sich im Repository ``openstack-ansible-ops`` unter dem Handbuch ``openstack-service-setup.yml``.
id: Contoh untuk yang terakhir adalah di repositori ``openstack-ansible-ops``, di bawah ``openstack-service-setup.yml`` playbook.

source: An image represents the operating system, software, and any settings that instances may need depending on the project goals. Create images first before creating any instances.
de: Ein Abbild stellt das Betriebssystem, die Software und alle Einstellungen dar, die Instanzen abhängig von den Projektzielen benötigen. Erstellen Sie zuerst Abbilder, bevor Sie Instanzen erstellen.
id: Image mewakili sistem operasi, perangkat lunak, dan pengaturan apa pun yang diperlukan oleh instance, tergantung pada sasaran proyek. Buat image terlebih dahulu sebelum membuat instance apa pun.

source: Analyze OpenStack service logs and RabbitMQ logs
de: Analysieren Sie OpenStack-Dienstprotokolle und RabbitMQ-Protokolle
id: Menganalisis log layanan OpenStack dan log RabbitMQ

source: Analyze RabbitMQ queues
de: Analysieren Sie RabbitMQ-Warteschlangen
id: Menganalisis antrian RabbitMQ

source: Another option would be to use the LXC tools to retrieve information about the utility container. For example:
de: Eine andere Option wäre, die LXC-Tools zum Abrufen von Informationen über den Dienstprogrammcontainer zu verwenden. Beispielsweise:
id: Pilihan lain adalah menggunakan alat LXC untuk mengambil informasi tentang kontainer utilitas. Sebagai contoh:

source: Ansible `forks`_ entry for ansible.cfg
de: Ansible `forks`_ Eintrag für ansible.cfg
id: Ansible `forks`_ entry untuk ansible.cfg

source: Are VXLAN VTEP addresses able to ping each other?
de: Können sich VXLAN VTEP-Adressen gegenseitig pingen?
id: Apakah alamat VXLAN VTEP dapat melakukan ping satu sama lain?

source: As an example, an all-in-one (AIO) build might provide a utility container called `aio1_utility_container-d13b7132`. That container will have two network interfaces: `d13b7132_eth0` and `d13b7132_eth1`.
de: Ein All-in-One-Build (AIO) könnte beispielsweise einen Utility-Container namens `aio1_utility_container-d13b7132` bereitstellen. Dieser Container wird zwei Netzwerkschnittstellen haben: `d13b7132_eth0` und` d13b7132_eth1`.
id: Sebagai contoh, build all-in-one (AIO) mungkin menyediakan kontainer utilitas yang disebut `aio1_utility_container-d13b7132`. Kontainer itu akan memiliki dua antarmuka jaringan: `d13b7132_eth0` dan `d13b7132_eth1`.

source: At the beginning of a playbook run, information about each host is gathered, such as:
de: Zu Beginn eines Playbook-Laufs werden Informationen zu jedem Host gesammelt, wie zum Beispiel:
id: Pada awal menjalankan playbook, informasi tentang setiap host dikumpulkan, seperti:

source: At the completion of this operation the inventory will be restored to the earlier version.
de: Nach Abschluss dieser Operation wird das Inventar auf die frühere Version zurückgesetzt.
id: Pada penyelesaian operasi ini inventaris akan dikembalikan ke versi sebelumnya.

source: Authenticate using the username ``admin`` and password defined by the ``keystone_auth_admin_password`` option in the ``/etc/openstack_deploy/user_secrets.yml`` file.
de: Authentifizieren Sie sich mit dem Benutzernamen ``admin`` und dem Passwort, das durch die ``keystone_auth_admin_password`` Option in der ``/etc/openstack_deploy/user_secrets.yml`` Datei definiert ist.
id: Otentikasi menggunakan username ``admin`` dan kata sandi yang ditentukan oleh opsi ``keystone_auth_admin_password`` dalam file ``/etc/openstack_deploy/user_secrets.yml``.

source: Back up and restore the ``/etc/openstack_deploy/`` directory
de: Sichern und Wiederherstellen des Verzeichnisses ``/etc/openstack_deploy/``
id: Cadangkan dan pulihkan direktori ``/etc/openstack_deploy/``.

source: Back up and restore your cloud
de: Sichern und Wiederherstellen Ihrer Cloud
id: Cadangkan dan pulihkan cloud Anda

source: Backup the existing OpenStack-Ansible configuration
de: Backup der existierenden OpenStack-Ansible Konfiguration
id: Cadangkan konfigurasi OpenStack-Ansible yang ada

source: Before installing the infrastructure and OpenStack, update the host machines.
de: Aktualisieren Sie die Host-Computer, bevor Sie die Infrastruktur und OpenStack installieren.
id: Sebelum memasang infrastruktur dan OpenStack, perbarui mesin host.

source: Besides the live migration, Nova offers the option to migrate entire hosts in a online (live) or offline (cold) migration.
de: Neben der Live-Migration bietet Nova die Möglichkeit, ganze Hosts in einer Online- (Live) oder Offline- (Cold-) Migration zu migrieren.
id: Selain migrasi langsung, Nova menawarkan opsi untuk memigrasikan seluruh host dalam migrasi online (langsung) atau offline (dingin).

source: Block Storage service
de: Blockspeicherdienst
id: Layanan Block Storage

source: Bootstrap Ansible again to ensure that all OpenStack-Ansible role dependencies are in place before you run playbooks from the |current_release_formal_name| release.
de: Ansible erneut boostrappen, um sicherzustellen, dass alle OpenStack-Ansible-Rollenabhängigkeiten vorhanden sind, bevor Sie Playbooks von |current_release_formal_name| ausführen.
id: Bootstrap Ansible dilakukan lagi untuk memastikan bahwa semua dependensi peran OpenStack-Ansible sudah ada sebelum Anda menjalankan playbook dari pelepasan|current_release_formal_name|.

source: Bootstrap the new Ansible and OSA roles
de: Bootstrappen der neuen Ansible und OSA Rollen
id: Bootstrap peran Ansible dan OSA yang baru

source: Bulk pruning
de: Massenschnitt
id: Pemangkasan massal

source: By default, OpenStack-Ansible relies on Ansible SSH connections, and needs the TCP port 22 to be opened on all hosts internally.
de: Standardmäßig stützt sich OpenStack-Ansible auf Ansible-SSH-Verbindungen und benötigt den TCP-Port 22, um intern auf allen Hosts geöffnet zu werden.
id: Secara default, OpenStack-Ansible bergantung pada koneksi SSH Ansible, dan membutuhkan port TCP 22 untuk dibuka pada semua host secara internal.

source: By default, live migration assumes that your Nova instances are stored on shared storage and KVM/Libvirt only need to synchronize the memory and base image of the Nova instance to the new host. Live migrations on local storage will fail as a result of that assumption. Migrations with local storage can be accomplished by allowing instance disk migrations with the ``--block-migrate`` option.
de: Live-Migration setzt standardmäßig voraus, dass Ihre Nova-Instanzen auf gemeinsam genutztem Speicher gespeichert sind und KVM/Libvirt nur den Speicher und das Basis-Image der Nova-Instanz mit dem neuen Host synchronisieren müssen. Live-Migrationen auf lokalem Speicher werden als Ergebnis dieser Annahme fehlschlagen. Migrationen mit lokalem Speicher können durchgeführt werden, indem Sie Plattenmigrationen mit der Option ``block-migrate`` zulassen.
id: Secara default, migrasi langsung mengasumsikan bahwa instance Nova Anda disimpan di penyimpanan bersama dan KVM/Libvirt hanya perlu menyinkronkan memori dan image dasar instance Nova ke host baru. Migrasi langsung di penyimpanan lokal akan gagal sebagai hasil dari asumsi tersebut. Migrasi dengan penyimpanan lokal dapat diselesaikan dengan mengizinkan migrasi disk instance dengan opsi ``--block-migrate``.

source: By doing this, the cluster can continue to run effectively and you can repair the failing node.
de: Dadurch kann der Cluster weiterhin effektiv ausgeführt werden, und Sie können den fehlerhaften Knoten reparieren.
id: Dengan melakukan ini, cluster dapat terus berjalan dengan efektif dan Anda dapat memperbaiki node yang gagal.

source: Cached Ansible facts issues
de: Gespeicherte Ansible-Fakten
id: Isu fakta cached Ansible

source: Cached facts may be incorrect if the host receives a kernel upgrade or new network interfaces. Newly created bridges also disrupt cache facts.
de: Cache-Fakten sind möglicherweise falsch, wenn der Host ein Kernel-Upgrade oder neue Netzwerkschnittstellen erhält. Neu erstellte Bridges stören auch Cache-Fakten.
id: Fakta yang di-cache mungkin salah jika host menerima upgrade kernel atau antarmuka jaringan baru. Jembatan yang baru dibuat dapat juga mengacaukan fakta cache.

source: Can the hardware replacement be done without the host going down? For example, a single disk in a RAID-10.
de: Kann der Hardware-Austausch durchgeführt werden, ohne dass der Host ausfällt? Zum Beispiel eine einzelne Festplatte in einem RAID-10.
id: Bisakah penggantian perangkat keras dilakukan tanpa host turun (down) ? Misalnya, satu disk dalam RAID-10.

source: Change directory to the cloned repository's root directory:
de: Ändern Sie das Verzeichnis in das Stammverzeichnis des geklonten Repositorys:
id: Ubah direktori ke direktori root repositori kloning:

source: Change directory to the repository clone playbooks directory:
de: Wechseln Sie in das Repository-Klon-Playbooks-Verzeichnis:
id: Ubah direktori ke direktori playbook clone repositori:

source: Change directory to the repository clone root directory:
de: Wechseln Sie in das Stammverzeichnis des Repository-Klons:
id: Ubah direktori ke direktori root clone repositori:

source: Change to playbook folder on the deployment host.
de: Wechseln Sie in den Playbook-Ordner auf dem Bereitstellungshost.
id: Ubah ke folder playbook di host penyebaran (deployment).

source: Change to the ``playbooks`` directory and run the following Ansible command to determine the failed node:
de: Wechseln Sie in das Verzeichnis ``playbooks`` und führen Sie den folgenden Ansible-Befehl aus, um den ausgefallenen Knoten zu bestimmen:
id: Ubah ke direktori ``playbooks`` dan jalankan perintah Ansible berikut untuk menentukan node gagal:

source: Change to the playbooks directory
de: Wechseln Sie in das Verzeichnis der Playbooks
id: Ubah ke direktori playbook

source: Change to the playbooks directory:
de: Wechseln Sie in das Verzeichnis der Playbooks:
id: Ubah ke direktori playbook:

source: Changes the flavor of an Nova instance (increase) while rebooting and also migrates (cold) the instance to a new host to accommodate the new resource requirements. This operation can take considerate amount of time, depending disk image sizes.
de: Ändert der Variante einer Nova-Instanz (erhöhen) während des Neustarts und migriert (kalt) die Instanz auf einen neuen Host, um den neuen Ressourcenanforderungen gerecht zu werden. Dieser Vorgang kann je nach Größe des Disk-Images sehr viel Zeit in Anspruch nehmen.
id: Mengubah (peningkatan) flavor instance Nova saat melakukan boot ulang dan juga memigrasikan (cold) instance ke host baru untuk mengakomodasi persyaratan sumber daya baru. Operasi ini dapat mempertimbangkan waktu, tergantung ukuran image disk.

source: Check "gateway" or host routes on the Neutron subnet.
de: Überprüfen Sie ``gateway`` oder Host-Routen auf dem Neutron-Subnetz.
id: Periksa "gateway" atau host me-rute pada subnet Neutron.

source: Check Neutron DHCP agent logs.
de: Überprüfen Sie die Protokolle des Neutronen-DHCP-Agenten.
id: Periksa log agen DHCP Neutron.

source: Check Neutron FloatingIP associations (if applicable).
de: Überprüfen Sie die Neutron FloatingIP-Verbindungen (falls zutreffend).
id: Periksa asosiasi Neutron FloatingIP (jika ada).

source: Check Neutron L3 agent logs (if applicable).
de: Überprüfen Sie die Protokolle des Neutronen L3-Agenten (falls zutreffend).
id: Periksa log agen Neutron L3 (jika ada).

source: Check Neutron Router external gateway information (if applicable).
de: Überprüfen Sie die Informationen zum externen Gateway des Neutron Routers (falls zutreffend).
id: Periksa informasi gateway eksternal Router Neutron (jika ada).

source: Check Neutron Router ports (if applicable).
de: Überprüfen Sie die Neutron Router-Ports (falls zutreffend).
id: Periksa port Neutron Router (jika ada).

source: Check Neutron ``security-group-rules``, consider adding ICMP rule for testing.
de: Überprüfen Sie Neutron ``security-group-rules``, überlegen Sie, ICMP-Regeln zum Testen hinzuzufügen.
id: Periksa Neutron ``security-group-rules``, pertimbangkan untuk menambahkan aturan ICMP untuk pengujian.

source: Check Neutron ``security-group-rules``, consider adding allow ICMP rule for testing.
de: Prüfe Neutron ``security-group-rules``, denken Sie darüber nach, eine ICMP-Regel zum Testen hinzuzufügen.
id: Periksa Neutron ``security-group-rules``, pertimbangkan menambahkan izinkan aturan ICMP untuk pengujian.

source: Check Neutron linux bridge logs.
de: Überprüfen Sie die Protokolle der Neutron-Linux-Bridge.
id: Periksa Neutron linux bridge logs.

source: Check Neutron linuxbridge logs.
de: Überprüfen Sie die Protokolle von Neutron linuxbridge.
id: Periksanlog Neutron linuxbridge.

source: Check Neutron router ports (if applicable).
de: Überprüfen Sie die Neutron-Router-Ports (falls zutreffend).
id: Periksa port router Neutron (jika ada).

source: Check Nova console logs to see if the instance ever received its IP address initially.
de: Überprüfen Sie die Nova-Konsolenprotokolle, um festzustellen, ob die Instanz ihre IP-Adresse zu Beginn erhalten hat.
id: Periksa log konsol Nova untuk melihat apakah instance pernah menerima alamat IP pada awalnya.

source: Check VLAN configurations and any necessary trunking to edge ports on physical switch
de: Überprüfen Sie die VLAN-Konfigurationen und alle erforderlichen Trunking-Verbindungen zu den Edge-Ports des physischen Switches
id: Periksa konfigurasi VLAN dan semua trunking yang diperlukan ke edge port pada switch fisik
