Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-user.po
Languages: de, id, ru

source: (see: https://docs.openstack.org/os-traits/latest/reference/traits.html)
ru: (см.: https://docs.openstack.org/os-traits/latest/reference/traits.html)

source: 1. Persistent proxy configuration is a standard practice and network clients on the target hosts will be able to access external resources after deployment.
ru: 1. Постоянная конфигурация прокси-сервера является стандартной практикой, и сетевые клиенты на целевых хостах смогут получать доступ к внешним ресурсам после развертывания.

source: 1. The default configuration file suggests setting a persistent proxy configuration on all target hosts and defines a persistent ``no_proxy`` environment variable which lists all hosts/containers' management addresses as well as the load balancer internal/external addresses.
ru: 1. Файл конфигурации по умолчанию предлагает установить постоянную конфигурацию прокси-сервера на всех целевых хостах и ​​определяет постоянную переменную среды ``no_proxy``, в которой перечислены все адреса управления хостами/контейнерами, а также внутренние/внешние адреса балансировщика нагрузки.

source: 16GB RAM
ru: 16 ГБ оперативной памяти

source: 2. An alternative method applies proxy configuration in a transient manner during the execution of Ansible playbooks and defines a minimum set of management network IP addresses for ``no_proxy`` that are required for the playbooks to succeed. These proxy settings do not persist after an Ansible playbook run and the completed deployment does not require them in order to be functional.
ru: 2. Альтернативный метод применяет конфигурацию прокси-сервера временно во время выполнения плейбуков Ansible и определяет минимальный набор IP-адресов сети управления для ``no_proxy``, которые требуются для успешного выполнения плейбуков. Эти настройки прокси-сервера не сохраняются после запуска плейбука Ansible, и завершенное развертывание не требует их для функционирования.

source: 2. The deployer must ensure that a persistent proxy configuration has complete coverage of all OpenStack management network host/containers' IP addresses in the ``no_proxy`` environment variable. It is necessary to use a list of IP addresses, CIDR notation is not valid for ``no_proxy``.
ru: 2. Оператор должен убедиться, что постоянная конфигурация прокси имеет полное покрытие всех IP-адресов хостов/контейнеров сети управления OpenStack в переменной среды ``no_proxy``. Необходимо использовать список IP-адресов, нотация CIDR недопустима для ``no_proxy``.

source: 3. Transient proxy configuration guarantees that proxy environment variables will not persist, ensuring direct communication between services on the OpenStack management network after deployment. Target host network clients such as ``wget`` will not be able to access external resources after deployment.
ru: 3. Временная конфигурация прокси гарантирует, что переменные среды прокси не будут сохраняться, обеспечивая прямую связь между службами в сети управления OpenStack после развертывания. Клиенты целевой хост-сети, такие как ``wget``, не смогут получить доступ к внешним ресурсам после развертывания.

source: 4. The maximum length of ``no_proxy`` should not exceed 1024 characters due to a fixed size buffer in the ``pam_env`` PAM module. Longer environment variables will be truncated during deployment operations and this will lead to unpredictable errors during or after deployment.
ru: 4. Максимальная длина ``no_proxy`` не должна превышать 1024 символов из-за фиксированного размера буфера в модуле PAM ``pam_env``. Более длинные переменные среды будут усечены во время операций развертывания, и это приведет к непредсказуемым ошибкам во время или после развертывания.

source: 50GB free disk space on the root partition
de: 50 GB freier Speicherplatz auf der Root-Partition
id: Ruang disk kosong 50GB pada partisi root
ru: 50 Гб свободного дискового пространства на root разделе

source: 8 CPU Cores
de: 8 CPU-Kerne
ru: 8 ядер CPU

source: 8 vCPU's
ru: 8 vCPU

source: 80GB free disk space on the root partition, or 60GB+ on a blank secondary disk. Using a secondary disk requires the use of the ``bootstrap_host_data_disk_device`` parameter. Please see `Building an AIO`_ for more details.
de: 80 GB freier Speicherplatz auf der Root-Partition oder 60 GB auf einer leeren sekundären Festplatte. Die Verwendung eines sekundären Laufwerks erfordert die Verwendung des Parameters `` bootstrap_host_data_disk_device``. Weitere Informationen finden Sie unter `Erstellen eines AIO`_.
id: 80GB ruang kosong pada partisi root, atau 60GB + pada disk sekunder kosong. Menggunakan disk sekunder membutuhkan penggunaan parameter ``bootstrap_host_data_disk_device``. Silakan lihat `Building an AIO`_ untuk detail lebih lanjut.
ru: 80 Гб свободного дискового пространства, или 60 Гб+ на чистом дополнительном диске. Использование дополнительного диска требует использования параметра ``bootstrap_host_data_disk_device``. Пожалуйста, обратитесь к разделу `Установка AIO`_ для деталей.

source: 8GB RAM
ru: 8 ГБ оперативной памяти

source: :dev_docs:`Configuring a homogeneous production environment <user/prod/example.html>`
ru: :dev_docs:`Настройка однородного рабочего окружения <user/prod/example.html>`

source: :dev_docs:`Configuring a test environment <user/test/example.html>`
ru: :dev_docs:`Настройка тестового окружения <user/test/example.html>`

source: :dev_docs:`Configuring the inventory <reference/inventory/configure-inventory.html>`
ru: :dev_docs:`Настройка inventory <reference/inventory/configure-inventory.html>`

source: :dev_docs:`Container networking architecture <reference/architecture/container-networking.html>`
ru: :dev_docs:`Сетевая архитектура контейнеров <reference/architecture/container-networking.html>`

source: :dev_docs:`Production environment <user/prod/example.html>`
ru: :dev_docs:`Рабочее окружение <user/prod/example.html>`

source: :dev_docs:`Using provider network groups for a heterogeneous environment <user/prod/provnet_groups.html>`
ru: :dev_docs:`Использование сетей провайдера для разнородного окружения <user/prod/provnet_groups.html>`

source: A Load Balancer (HAProxy) is usually deployed on infrastructure hosts. With infrastructure hosts being spread across Availability Zones we need to come up with a more complex design which is aimed at solving the following issues:
ru: Балансировщик нагрузки (HAProxy) обычно развертывается на хостах инфраструктуры. Поскольку хосты инфраструктуры распределены по зонам доступности, нам необходимо разработать более сложную конструкцию, направленную на решение следующих проблем:

source: A ``compute_hosts`` group consisting of two compute hosts
id: Grup ``compute_hosts`` yang terdiri dari dua host komputasi
ru: Группа ``compute_hosts`` состоит из двух вычислительных хостов

source: A ``network_hosts`` group consisting of three collapsed infrastructure/network (control plane) hosts
id: Grup ``network_hosts`` yang terdiri dari tiga host infrastructure/network (control plane) yang diciutkan
ru: Группа ``network_hosts`` состоит из трех инфраструктурных/сетевых (управляющих) хостов

source: A basic compute kit environment, with the Image (glance) and Compute (nova) services set to use file-backed storage.
de: Eine grundlegende Compute-Kit-Umgebung mit den Diensten Image (glance) und Compute (nova) zur Verwendung von dateiunterstütztem Speicher.
id: Lingkungan kit komputasi dasar, dengan layanan Image (glance) dan Compute (nova) diatur untuk menggunakan penyimpanan file-backed.
ru: Базовая вычислительная среда со службами образов (glance) и вычислительной службой (nova), настроенными на использование файлового хранилища.

source: A deployment with a mixture of architectures, or adding a new architecture to an existing single architecure deployment requires some additional steps to be taken by both the deployer and end users to ensure that the behaviour is as desired.
ru: Окружения с различающимися архитектурами, или добавление новой архитектуры в существующие однородное окружение требуют выполнение некоторых дополнительных шагов как для оператора, так и для конечного пользователя, чтобы убедиться в корректности поведения окружения.

source: A list of service ports can be found in the `OpenStack Install Guide`__.
ru: Список портов служб можно найти в `Руководстве по установке OpenStack`__.

source: A selection of network configuration example files are given in the ``etc/network`` and ``etc/netplan`` for ubuntu systems, and it is expected that these will need adjustment for the specific requirements of each deployment.
ru: Выборка файлов примеров конфигурации сети приведена в ``etc/network`` и ``etc/netplan`` для систем Ubuntu, и ожидается, что их потребуется настроить в соответствии с конкретными требованиями каждого развертывания.

source: A self-signed certificate authority is generated on the deploy host during the first run of the playbook.
ru: Самоподписанный центр сертификации создается на хосте развертывания во время первого запуска сценария.

source: A single RabbitMQ server backend (e.g. server or cluster) is the default deployment for OpenStack-Ansible (OSA). This broker messaging backend provides the queue services for both RPC and Notification communications through its integration with the oslo.messaging rabbit driver. The `oslo-messaging.yml`_ file provides the default configuration to associate the oslo.messaging RPC and Notify services to the RabbitMQ server backend.
ru: Единый бекэнд RabbitMQ сервера (сервер или кластер серверов) это стандартная конфигурация развертывания OpenStack-Ansible (OSA). Данный брокер обмена сообщениями предоставляет сервисы очередей как для RPC, так и для обмена уведомлениями при помощи интеграции с rabbit драйвером oslo.messaging. Файл `oslo-messaging.yml`_ предоставляет стандартную настройку для связи oslo.messaging сервисов RPC и уведомлений с RabbitMQ сервером.

source: A word of caution: the name of the Ceph alternative lib implementation (ceph_alternative_lib) varies between Gnocchi versions.
id: Kata hati-hati: nama implementasi lib alternatif Ceph (ceph_alternative_lib) bervariasi antara versi Gnocchi.
ru: Небольшое предупреждение: имя альтернативной библиотеки Ceph (ceph_alternative_lib) отличается для различных версий Gnocchi.

source: AZ1 Storage Network
ru: Сеть хранения данных AZ1

source: AZ1 Tunnel (Geneve) Network
ru: Туннелированная сеть AZ1 (Geneve)

source: AZ2 Storage Network
ru: Сеть хранения данных AZ2

source: AZ2 Tunnel (Geneve) Network
ru: Туннелированная сеть AZ2 (Geneve)

source: AZ3 Storage Network
ru: Сеть хранения данных AZ3

source: AZ3 Tunnel (Geneve) Network
ru: Туннелированная сеть AZ3 (Geneve)

source: Above example will create following groups:
ru: Пример выше создаст следующие группы:

source: Absolute minimum server resources (currently used for gate checks):
de: Absolute minimale Serverressourcen (derzeit für Gate-Checks verwendet):
id: Sumber daya server minimum absolut (saat ini digunakan untuk pemeriksaan gate):
ru: Минимальные системные требования (используются для регулярного тестирования):

source: Add HW_ARCH_XXXX Trait to Every Compute Host in OpenStack.
ru: Добавьте признак HW_ARCH_XXXX к каждому вычислительному узлу в OpenStack.

source: Add the new compute nodes to ``openstack_user_config.yml``.
ru: Добавьте новые вычислительные ноды в ``openstack_user_config.yml``.

source: Add them also to your pipeline:
id: Tambahkan juga ke pipeline Anda:
ru: Добавьте их также для обработки в pipeline.yaml:

source: Adding S3 API support
id: Menambahkan dukungan S3 API
ru: Добавление поддержки S3 API

source: Additional VLANs may be required for the following purposes:
id: VLAN tambahan mungkin diperlukan untuk tujuan berikut:
ru: Дополнительные VLAN-ы могут потребоваться для следующих целей:

source: Additional options may be implemented by simply concatenating them with a space between each set of options, for example:
de: Zusätzliche Optionen können implementiert werden, indem sie einfach mit einem Leerzeichen zwischen den einzelnen Optionen verknüpft werden, z. B .:
id: Opsi tambahan dapat diimplementasikan hanya dengan menggabungkannya dengan spasi di antara setiap rangkaian opsi, misalnya:
ru: Дополнительные параметры можно указать просто разделив их пробелом, например:

source: Additional resources
id: Sumber daya tambahan
ru: Дополнительные ресурсы

source: Advanced security.txt ACL
ru: Расширенный security.txt ACL

source: All public endpoints reside behind HAProxy, resulting in the only certificate management for externally visible https services are those for HAProxy. Certain internal services such as RabbitMQ also require proper SSL configuration.
ru: Все публичные точки доступа находятся за HAProxy, в результате чего единственными управляющими сертификатами для внешне видимых https-сервисов являются те сертификаты, которые используются для HAProxy. Некоторые внутренние сервисы, такие как RabbitMQ, также требуют надлежащей конфигурации SSL.

source: All the upstream repositories used are defined in the ``openstack-ansible`` integrated repository, in the ``inventory/group_vars/<service_group>/source_git.yml`` file.
ru: Все используемые upstream репозитории определены в интегрированном репозиторие ``openstack-ansible``, в файле ``inventory/group_vars/<service_group>/source_git.yml``.

source: All-in-one (AIO) builds are a great way to perform an OpenStack-Ansible build for:
de: All-in-One-Builds (AIO-Builds) sind eine hervorragende Möglichkeit, OpenStack-Ansible-Builds für Folgendes auszuführen:
id: Pembuatan All-in-one (AIO) adalah cara yang bagus untuk melakukan pembangunan OpenStack-Ansible untuk:
ru: Все-в-одном (AIO) - это отличный способ выполнить установку OpenStack-Ansible для:

source: Along with HAProxy configuration we also need to ensure that the endpoint catalog will be populated with correct URIs. Each service has a set of variables that needs to be overridden. Usually such variables have the following format:
ru: Наряду с конфигурацией HAProxy нам также необходимо убедиться, что каталог точек доступа будет заполнен правильными URI. У каждой службы есть набор переменных, которые необходимо переопределить. Обычно такие переменные имеют следующий формат:

source: Alternatively, if the AIO was deployed using the ``metal`` scenario, these files will be available on the host itself.
ru: В ином случае, если AIO было развернуто используя ``metal`` сценарий, эти файлы будут доступны непосредственно на хосте.

source: Alternatively, you can detect IPs used inside your containers to configure HAProxy binds. This can be done by reffering to ``container_networks`` mapping:
ru: В качестве альтернативы вы можете обнаружить IP-адреса, используемые внутри ваших контейнеров для настройки привязок HAProxy. Это можно сделать, обратившись к сопоставлению ``container_networks``:

source: Alternatively, you can simply ignore SSL issues by setting ``verify: false`` in the definition for your cloud in ``clouds.yaml``. This will disable SSL verification entirely for this cloud. For example:
ru: В качестве альтернативы вы можете просто игнорировать проблемы SSL, установив ``verify: false`` для вашего облака в ``clouds.yaml``. Это полностью отключит проверку SSL для этого облака. Например:

source: Although AIO builds aren't recommended for large production deployments, they're great for smaller proof-of-concept deployments.
de: Obwohl AIO-Builds nicht für große Produktionsbereitstellungen empfohlen werden, eignen sie sich hervorragend für kleinere Proof-of-Concept-Bereitstellungen.
id: Meskipun build AIO tidak direkomendasikan untuk penyebaran produksi besar, mereka sangat bagus untuk penyebaran konsep-konsep yang lebih kecil.
ru: Хоть AIO и не рекомендуется для больших рабочих окружений, он отлично подходит для небольших установок для проверки концепта.

source: Although most CPU hardware traits such as instruction set extensions are detected and handled automatically in OpenStack, CPU architecture is not. It is necessary to manually add an architecture trait to the resource provider corresponding to every compute host. The required traits are:
ru: Хотя большинство аппаратных спецификаций, таких как набор инструкций и расширений, определяются автоматически в OpenStack, то архитектура процессора не определяется. Необходимо вручную добавить спецификацию архитектуры в провайдер ресурсов, который соответствует каждому вычислительному хосту. Следующие спецификации необходимы:

source: An additional provider interface definition named ``physnet2`` using different interfaces between hosts may resemble the following:
id: Definisi antarmuka penyedia tambahan bernama ``physnet2`` menggunakan antarmuka yang berbeda antar host dapat menyerupai yang berikut:
ru: Дополнительный интерфейс провайдера с именем ``physnet2`` использующий различные интерфейсы между хостами может быть настроен следующим образом:

source: Another challenge is to organize shared storage for Glance Images, as ``rbd`` can't be used consistently anymore. While Glance Interoperable Import interface could be leveraged for syncing images between ``rbd`` backends, in fact not all clients and services can work with Glances `import API <https://docs.openstack.org/api-ref/image/v2/#interoperable-image-import>`_. One of the most obvious solutions here can be usage of Swift API, while configuring Ceph RadosGW policy to replicate the bucket between independent instances located in their Availability Zones.
ru: Еще одна проблема заключается в организации общего хранилища для образов Glance, поскольку ``rbd`` больше не может использоваться согласованно. Хотя интерфейс Glance Interoperable Import можно использовать для синхронизации образов между ``rbd`` бекэндами, на самом деле не все клиенты и службы могут работать с `import API <https://docs.openstack.org/api-ref/image/v2/#interoperable-image-import>`_ Glance. Одним из наиболее очевидных решений здесь может быть использование Swift API при настройке политики Ceph RadosGW для репликации контейнера между независимыми инстансами, расположенными в их зонах доступности.

source: Apply ansible-hardening
de: Aufhärtbar auftragen
id: Menerapkan ansible-hardening
ru: Применение ansible-hardening

source: Architectural decisions by the deployer to isolate the OpenStack networks
de: Architekturentscheidungen des Deployers zur Isolierung der OpenStack-Netzwerke
id: Keputusan arsitektur oleh penggelar untuk mengisolasi jaringan OpenStack
ru: Архитектурные решения оператора изолировать сети OpenStack

source: Architecture emulation by Nova
ru: Эмуляция архитектуры при помощи Nova

source: As IP provisioning is quite random inside containers, it may not always be handy to bind HAProxy to a specific IP address. If that's the case, you can bind HAProxy to an interface instead, since we always know the interface names inside containers. With that keepalived public/internal VIPs are supposed to be added in ``used_ips``, so you still can define them freely.
ru: Поскольку предоставление IP-адресов внутри контейнеров довольно случайно, не всегда может быть удобно привязывать HAProxy к определенному IP-адресу. Если это так, вы можете привязать HAProxy к интерфейсу, поскольку мы всегда знаем имена интерфейсов внутри контейнеров. При этом предполагается, что публичные/внутренние VIP-адреса keepalived будут добавлены в ``used_ips``, поэтому вы по-прежнему можете свободно их определять.

source: As a prerequisite for this type of setup you need to ensure that corresponding `A` or `CNAME` records are present for your domain. Also, you need to ensure having a valid wildcard or SAN certificates for public/internal endpoints.
ru: В качестве предварительного условия для этого типа настройки вам необходимо убедиться, что соответствующие записи `A` или `CNAME` присутствуют для вашего домена. Также вам необходимо убедиться, что у вас есть действительные wildcard или сертификаты SAN для публичных/внутренних точек доступа.

source: As for this environment, the load balancer is created in the LXC containers on the infrastructure hosts, we need to ensure absence of the default route on ``eth0`` interface. To prevent that from happening, we override ``lxc_container_networks`` in ``/etc/openstack_deploy/group_vars/haproxy/lxc_network.yml`` file:
ru: Что касается этой среды, то балансировщик нагрузки создается в контейнерах LXC на хостах инфраструктуры, где нам нужно обеспечить отсутствие маршрута по умолчанию на интерфейсе ``eth0``. Чтобы этого не произошло, мы переопределяем ``lxc_container_networks`` в файле ``/etc/openstack_deploy/group_vars/haproxy/lxc_network.yml``:

source: As the AIO includes all three cluster members of MariaDB/Galera, the cluster has to be re-initialized after the host is rebooted.
de: Da die AIO alle drei Cluster-Mitglieder von MariaDB / Galera umfasst, muss der Cluster nach dem Neustart des Hosts neu initialisiert werden.
id: Karena AIO mencakup ketiga anggota cluster MariaDB/Galera, cluster harus diinisialisasi ulang setelah host di-reboot.
ru: Так как на AIO расположены все три участника кластера MariaDB/Galera, кластер должен быть повторно инициализирован после перезагрузки сервера.

source: As we are using Ceph for this environment, so the ``cinder-volume`` runs in a container on the Ceph Monitor hosts. To achieve this, implement ``/etc/openstack_deploy/env.d/cinder.yml`` with the following content:
ru: Поскольку мы используем Ceph для этой среды, ``cinder-volume`` запускается в контейнере на хостах Ceph Monitor. Чтобы добиться этого, реализуйте ``/etc/openstack_deploy/env.d/cinder.yml`` со следующим содержимым:

source: As well as load balancing public endpoints, HAProxy is also used to load balance internal connections.
ru: Помимо балансировки нагрузки публичных точек доступа, HAProxy также используется для балансировки нагрузки внутренних соединений.

source: As you might have spotted, we are defining a default route for the container through eth20. However, by default all containers have their default route through eth0, which is a local LXC bridge where address is recieved through DHCP. In order to avoid a conflict, you need to ensure that the default route will not be set for eth0 inside the container. For that, create a file `/etc/openstack_deploy/group_vars/haproxy` with the following content:
ru: Как вы могли заметить, мы определяем маршрут по умолчанию для контейнера через eth20. Однако по умолчанию все контейнеры имеют свой маршрут по умолчанию через eth0, который является локальным мостом LXC, где адрес получается через DHCP. Чтобы избежать конфликта, вам нужно убедиться, что маршрут по умолчанию не будет установлен для eth0 внутри контейнера. Для этого создайте файл `/etc/openstack_deploy/group_vars/haproxy` со следующим содержимым:

source: As you might see, `href` is pointing not to the expected location. While some clients may not refer to href link provided by service, others might use it as source of truth and which will result in failures.
ru: Как вы могли заметить, `href` указывает не на ожидаемое местоположение. Хотя некоторые клиенты могут не ссылаться на ссылку href, предоставленную сервисом, другие могут использовать ее как источник истины, что приведет к сбоям.

source: Bare metal systems with SSD storage: ~ 30-50 minutes
de: Bare-Metal-Systeme mit SSD-Speicher: ~ 30-50 Minuten
id: Sistem bare metal dengan penyimpanan SSD: ~ 30-50 menit
ru: Физические серверы с SSD накопителем: ~30-50 минут

source: Before creating custom groups, please review the following:
id: Sebelum membuat grup kustom, harap tinjau yang berikut:
ru: Перед созданием пользовательских групп, пожалуйста, ознакомьтесь со следующим:

source: Before reading this document, please review the following scenario:
id: Sebelum membaca dokumen ini, silakan tinjau skenario berikut:
ru: Перед прочтением данного документа, пожалуйста, ознакомьтесь со следующим сценарием:
