Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: de, id

source: Assign the ``db_containers`` container group (from the preceding step) to a host group by providing a ``physical_skel`` section for the host group in a new or existing file, such as ``env.d/galera.yml``. For example:
de: Ordnen Sie die Containergruppe ``db_containers`` (aus dem vorherigen Schritt) einer Hostgruppe zu, indem Sie einen ``physical_skel``-Abschnitt für die Hostgruppe in einer neuen oder vorhandenen Datei wie ``env.d/galera.yml`` bereitstellen. Beispielsweise:
id: Tetapkan grup container ``db_containers`` (dari langkah sebelumnya) ke grup host dengan memberikan bagian ``physical_skel`` untuk grup host dalam file baru atau yang sudah ada, seperti ``env.d/galera.yml``. Sebagai contoh:

source: Assigns containers to physical hosts
de: Weist den physischen Hosts Container zu
id: Tetapkan containers untuk host fisik

source: At least one load balancer is required for a deployment. OSA provides a deployment of `HAProxy`_, but we recommend using a physical load balancing appliance for production environments.
id: Setidaknya satu penyeimbang beban diperlukan untuk penerapan. OSA menyediakan penyebaran `HAProxy`_, tetapi kami menyarankan untuk menggunakan alat penyeimbang beban fisik untuk lingkungan produksi.

source: Attach to a container:
de: An einem Container anhängen:
id: Hubungkan ke container:

source: Balance security with OpenStack performance and functionality
de: Balance Sicherheit mit OpenStack Leistung und Funktionalität
id: Seimbangkan keamanan dengan kinerja dan fungsionalitas OpenStack

source: Because of a `limitation with container iSCSI connectivity`_, you must deploy the ``cinder-volume`` service directly on a physical host (not into a container) when using storage back ends that connect via iSCSI. This includes the `LVMVolumeDriver`_ and many of the drivers for commercial storage devices.
de: Wegen `limitation with container iSCSI connectivity`_ müssen Sie den Dienst ``cinder-volume`` direkt auf einem physischen Host (nicht in einem Container) bereitstellen, wenn Speicherbackends verwendet werden, die über iSCSI verbunden sind. Dazu gehören der `LVMVolumeDriver`_ und viele der Treiber für kommerzielle Speichergeräte.
id: Karena `limitation with container iSCSI connectivity`_, Anda harus menggunakan layanan ``cinder-volume`` secara langsung pada host fisik (bukan ke dalam container) saat menggunakan back end penyimpanan yang terhubung melalui iSCSI. Ini termasuk `LVMVolumeDriver`_ dan banyak driver untuk perangkat penyimpanan komersial.

source: Bridges provide layer 2 connectivity (similar to switches) among physical, logical, and virtual network interfaces within a host. After a bridge is created, the network interfaces are virtually plugged in to it.
id: Bridge menyediakan konektivitas layer 2 (serupa dengan switch) di antara fisik, logis, dan antarmuka jaringan virtual dalam host. Setelah bridge dibuat, antarmuka jaringan tersambung ke sana secara virtual.

source: By default OpenStack-Ansible uses its `ansible-role-requirements`_ file to fetch the roles it requires for the installation process.
de: Standardmäßig verwendet OpenStack-Ansible die `ansible-role-requirements`_ Datei, um die Rollen zu holen, die für den Installationsprozess benötigt werden.
id: Secara default, OpenStack-Ansible menggunakan file `ansible-role-requirement`_ untuk mengambil peran yang diperlukan untuk proses instalasi.

source: By default, OpenStack-Ansible automatically applies the ansible-hardening role to all deployments. The role has been carefully designed to perform as follows:
de: Standardmäßig wendet OpenStack-Ansible die Rolle ``ansible-hardening`` automatisch auf alle Bereitstellungen an. Die Rolle wurde sorgfältig entworfen, um wie folgt zu funktionieren:
id: Secara default, OpenStack-Ansible secara otomatis menerapkan peran ansible-hardening untuk semua penyebaran. Peran telah dirancang dengan cermat untuk melakukan sebagai berikut:

source: By default, OpenStack-Ansible provides isolation by default between the containers that run the OpenStack infrastructure (control plane) services and also between the virtual machines that end users spawn within the deployment. This isolation is critical because it can prevent container or virtual machine breakouts, or at least reduce the damage that breakouts might cause.
de: OpenStack-Ansible bietet standardmäßig die Isolation zwischen den Containern, auf denen die OpenStack-Infrastruktur (Steuerungsebene) ausgeführt wird, und zwischen den virtuellen Computern, die von Endbenutzern innerhalb der Bereitstellung generiert werden. Diese Isolierung ist entscheidend, da sie das Ausbrechen von Containern oder virtuellen Maschinen verhindern oder zumindest den Schaden reduzieren kann, den Breakouts verursachen könnten.
id: Secara default, OpenStack-Ansible menyediakan isolasi secara default antara kontainer yang menjalankan layanan infrastruktur OpenStack (control plane) dan juga antara mesin virtual yang membuat pengguna pembiakan (spawn) dalam penyebaran (deployment). Isolasi ini sangat penting karena dapat mencegah penumpukan kontainer atau mesin virtual, atau setidaknya mengurangi kerusakan yang mungkin ditimbulkan oleh kebocoran (breakout).

source: Changing the base environment directory
de: Ändern des Basisumgebungsverzeichnisses
id: Mengubah direktori lingkungan basis

source: Checking inventory configuration for errors
de: Überprüfen der Bestandskonfiguration auf Fehler
id: Memeriksa kesalahan konfigurasi inventory

source: Clearing existing container IP addresses
de: Löschen vorhandener Container-IP-Adressen
id: Membersihkan alamat IP kontainer yang ada

source: Command Line Reference
de: Befehlszeilenreferenz
id: Command Line Reference (referensi baris perintah)

source: Common OpenStack services and their configuration are defined by OpenStack-Ansible in the ``/etc/openstack_deploy/openstack_user_config.yml`` settings file.
de: Gängige OpenStack-Dienste und ihre Konfiguration werden von OpenStack-Ansible in der Einstellungsdatei ``/etc/openstack_deploy/openstack_user_config.yml`` definiert.
id: Layanan OpenStack umum dan konfigurasinya ditentukan oleh OpenStack-Ansible di file pengaturan ``/etc/openstack_deploy/openstack_user_config.yml``.

source: Compute service (nova):
id: Layanan Compute (nova):

source: Configuration constraints
de: Konfigurationsbeschränkungen
id: Kendala konfigurasi

source: Configuring the inventory
de: Konfigurieren des Inventars
id: Mengkonfigurasi inventory

source: Consider this directory structure::
id: Pertimbangkan struktur direktori ini ::

source: Container networking
de: Containervernetzung
id: Jaringan kontainer

source: Containerized deployments
de: Containerisierte Bereitstellungen
id: Pengaplikasian kontainer (containerized deployment)

source: Containers running an `Unbound DNS`_ caching service can optionally be deployed to cache DNS lookups and to handle internal DNS name resolution. We recommend using this service for large-scale production environments because the deployment will be significantly faster. If this service is not used, OSA modifies ``/etc/hosts`` entries for all hosts in the environment.
id: Kontainer yang menjalankan layanan caching `Unbound DNS`_ secara opsional dapat digunakan untuk melakukan cache pencarian DNS dan untuk menangani resolusi nama DNS internal. Kami merekomendasikan penggunaan layanan ini untuk lingkungan produksi skala besar karena penyebarannya akan jauh lebih cepat. Jika layanan ini tidak digunakan, OSA memodifikasi entri ``/etc/hosts`` untuk semua host di lingkungan.

source: Contents of this directory are populated into the environment *before* the ``env.d`` found in the directory specified by ``--config``.
de: Der Inhalt dieses Verzeichnisses wird in die Umgebung *vor* der Datei ``env.d`` eingetragen, die in dem mit ``--config`` angegebenen Verzeichnis gefunden wird.
id: Isi direktori ini diisi ke dalam lingkungan *before* the ``env.d`` yang ditemukan dalam direktori yang ditentukan oleh ``--config``.

source: Conventions
de: Konventionen
id: Konvensi

source: Creates container and IP address mappings
de: Erstellt Container- und IP-Adresszuordnungen
id: Membuat pemetaan kontainer dan alamat IP

source: Default folders locations
de: Standardmäßige Ordnerspeicherorte
id: Lokasi folder default

source: Define the host group (``db_hosts``) in a ``conf.d/`` file (such as ``galera.yml``). For example:
de: Definieren Sie die Host-Gruppe (``db_hosts``) in einer ``conf.d/`` Datei (z.B.``galera.yml``). Beispielsweise:
id: Tentukan grup host (``db_hosts``) dalam file ``conf.d/`` (seperti ``galera.yml``). Sebagai contoh:

source: Deploying 0 (or more than one) of component type per host
id: Menyebarkan 0 (atau lebih dari satu) tipe komponen per host

source: Deploying directly on hosts
de: Bereitstellung direkt auf Hosts
id: Deploying langsung pada host

source: Deploying using a different container technology
id: Menyebarkan menggunakan teknologi container yang berbeda

source: Discovering available overrides
de: Ermitteln der verfügbaren Überschreibungen
id: Menemukan penggantian yang tersedia

source: Do not run the playbook that installs the component. Unless you specify the component to run directly on a host by using the ``is_metal`` property, a container is created for this component.
de: Führe das Playbook, das die Komponente installiert, nicht aus. Wenn Sie die Komponente nicht direkt über die Eigenschaft ``is_metal`` auf einem Host ausführen, wird ein Container für diese Komponente erstellt.
id: Jangan jalankan playbook yang menginstal komponen. Kecuali Anda menentukan komponen untuk dijalankan secara langsung pada host dengan menggunakan properti ``is_metal``, sebuah kontainer dibuat untuk komponen ini.

source: Dynamic Inventory API documentation
de: Dynamische Inventar-API-Dokumentation
id: Dokumentasi API inventory Dinamis

source: Each container has a namespace that connects to the host namespace with one or more ``veth`` pairs. Unless specified, the system generates random names for ``veth`` pairs.
de: Jeder Container verfügt über einen Namespace, der eine Verbindung mit dem Hostnamespace mit einem oder mehreren ``veth`` -Paaren herstellt. Sofern nicht anders angegeben, generiert das System zufällige Namen für `` veth``-Paare.
id: Setiap kontainer memiliki namespace yang terhubung ke host namespace dengan satu atau lebih pasangan ``veth ``. Kecuali ditentukan, sistem menghasilkan nama acak untuk pasangan ``veth``.

source: Each of the custom group names in this example (``db_containers`` and ``db_hosts``) are arbitrary. Choose your own group names, but ensure the references are consistent among all relevant files.
de: Jeder der benutzerdefinierten Gruppennamen in diesem Beispiel (``db_containers`` und ``db_hosts``) ist willkürlich. Wählen Sie Ihre eigenen Gruppennamen, aber stellen Sie sicher, dass die Referenzen in allen relevanten Dateien konsistent sind.
id: Setiap nama grup kustom dalam contoh ini (``db_containers`` dan ``db_hosts``) adalah arbitrer. Pilih nama grup Anda sendiri, tetapi pastikan referensi konsisten di antara semua file yang relevan.

source: Encrypted communication
de: Verschlüsselte Kommunikation
id: Komunikasi terenkripsi

source: Every deployer has different security requirements. The `OpenStack Security Guide`_ has instructions and advice on how to operate and consume an OpenStack cloud by using the most secure methods.
de: Jeder Deployer hat unterschiedliche Sicherheitsanforderungen. Der `OpenStack Security Guide`_ enthält Anweisungen und Ratschläge zum Betrieb und zur Nutzung einer OpenStack-Cloud unter Verwendung der sichersten Methoden.
id: Setiap deployer memiliki persyaratan keamanan yang berbeda. The `OpenStack Security Guide`_ memiliki petunjuk dan saran tentang cara mengoperasikan dan mengkonsumsi cloud OpenStack dengan menggunakan metode yang paling aman.

source: Every role has a file, ``defaults/main.yml`` which holds the usual variables overridable by a deployer, like a regular Ansible role. This defaults are the closest possible to OpenStack standards.
de: Jede Rolle hat eine Datei ``defaults/main.yml``, die die üblichen Variablen enthält, die von einem Deployer überschrieben werden können, wie eine reguläre Ansible-Rolle. Diese Standardwerte entsprechen den OpenStack-Standards.
id: Setiap peran memiliki file, ``defaults/main.yml`` yang menyimpan variabel biasa yang bisa ditimpa oleh seorang deployer, seperti peran Ansible reguler. Default ini adalah yang paling dekat dengan standar OpenStack.

source: Every role makes use of additional variables in ``vars/`` which take precedence over group vars.
de: Jede Rolle verwendet zusätzliche Variablen in ``vars/``, die Vorrang vor Gruppenvariablen haben.
id: Setiap peran memanfaatkan variabel tambahan dalam ``vars/`` yang diutamakan daripada vars grup.

source: Example of un-containerized services:
de: Beispiel für nicht containerisierte Dienste:
id: Contoh layanan yang tidak memiliki kontainer (un-containerized services):

source: Example task using the config_template module
de: Beispielaufgabe, die das Modul config_template verwendet
id: Contoh tugas menggunakan modul config_template

source: Example: Running galera on dedicated hosts
de: Beispiel: Ausführen von galera auf dedizierten Hosts
id: Contoh: Menjalankan galera pada host khusus (dedicated host)

source: Executing the dynamic_inventory.py script manually
de: Das Skript dynamic_inventory.py manuell ausführen
id: Menjalankan skrip dynamic_inventory.py secara manual

source: Exporting host information
de: Host-Informationen exportieren
id: Mengekspor informasi host

source: Files in ``/etc/openstack_deploy`` beginning with ``user_`` will be automatically sourced in any ``openstack-ansible`` command. Alternatively, the files can be sourced with the ``-e`` parameter of the ``ansible-playbook`` command.
de: Dateien in ``/etc/openstack_deploy``, beginnend mit ``user_``, werden automatisch in jedem ``openstack-ansible``-Befehl gespeichert. Alternativ können die Dateien mit dem Parameter ``-e`` des Befehls ``ansible-playbook`` bezogen werden.
id: File dalam ``/etc/openstack_deploy`` beginning with ``user_`` akan secara otomatis bersumber dari perintah ``openstack-ansible`` apa pun. Atau, file dapat bersumber dengan parameter ``-e`` dari perintah ``ansible-playbook``.

source: For details on the configuration of networking for your environment, please have a look at :ref:`openstack-user-config-reference`.
de: Details zur Konfiguration von Netzwerken für Ihre Umgebung finden Sie unter :ref:`openstack-user-config-reference`.
id: Untuk detail tentang konfigurasi jaringan untuk lingkungan Anda, silakan lihat :ref:`openstack-user-config-reference`.

source: For each OSA release, the Ansible roles that form that release are set to a specific `git SHA-1 hash_` (SHA). These are updated after every OSA release.
id: Untuk setiap rilis OSA, peran Ansible yang membentuk rilis tersebut diatur ke `git SHA-1 hash_` (SHA) tertentu. Ini diperbarui setelah setiap rilis OSA.

source: For each OSA release, the OpenStack version that is deployed is set to a specific OpenStack `git SHA-1 hash_` (SHA). These are updated after every OSA release. The intent is to ensure that OSA users are able to enjoy an updated OpenStack environment with smaller increments of change than the typical upstream service releases allow for as they are usually very infrequent.
id: Untuk setiap rilis OSA, versi OpenStack yang digunakan diatur ke OpenStack specific `git SHA-1 hash_` (SHA). Ini diperbarui setelah setiap rilis OSA. Tujuannya adalah untuk memastikan bahwa pengguna OSA dapat menikmati lingkungan OpenStack yang diperbarui dengan peningkatan perubahan yang lebih kecil daripada yang diizinkan oleh rilis layanan hulu karena mereka biasanya sangat jarang.

source: For example, the ``shared-infra.yml`` file defines a container group, ``shared-infra_containers``, as a subset of the ``all_containers`` inventory group. The ``shared- infra_containers`` container group is mapped to the ``shared-infra_hosts`` host group. All of the service components in the ``shared-infra_containers`` container group are deployed to each target host in the ``shared-infra_hosts host`` group.
de: Zum Beispiel definiert die Datei ``shared-infra.yml`` eine Containergruppe ``shared-infra_containers`` als eine Teilmenge der Bestandsgruppe ``all_containers``. Die Container-Gruppe ``shared-infra_containers`` wird der Host-Gruppe ``shared-infra_hosts`` zugeordnet. Alle Dienstkomponenten in der Containergruppe ``shared-infra_containers`` werden auf jedem Zielhost in der Gruppe shared-infra_hosts-Host bereitgestellt.
id: Sebagai contoh, file ``shared-infra.yml`` mendefinisikan grup kontainer, ``shared-infra_containers``, sebagai bagian dari grup inventory ``all_containers``. Grup container ``shared-infra_containers`` dipetakan ke grup host ``shared-infra_hosts``. Semua komponen layanan dalam grup kontainer ``shared-infra_containers`` dikerahkan ke setiap host target dalam grup ``shared-infra_hosts host``.

source: For example, to run Galera directly on dedicated hosts, you would perform the following steps:
de: Um beispielsweise Galera direkt auf dedizierten Hosts auszuführen, führen Sie die folgenden Schritte aus:
id: Misalnya, untuk menjalankan Galera langsung pada host khusus, Anda akan melakukan langkah-langkah berikut:

source: For example, you might want to add the following parameters to the ``nova.conf`` file:
de: Zum Beispiel möchten Sie vielleicht die folgenden Parameter zur ``nova.conf`` Datei hinzufügen:
id: Misalnya, Anda mungkin ingin menambahkan parameter berikut ke file ``nova.conf``:

source: For example, you might want to add the following policy in the ``policy.json`` file for the Identity service (keystone):
de: Beispielsweise möchten Sie möglicherweise die folgende Richtlinie in der Datei ``policy.json`` für den Identitätsdienst (Keystone) hinzufügen:
id: Misalnya, Anda mungkin ingin menambahkan kebijakan berikut di file ``policy.json`` untuk layanan Identity (keystone):

source: For example, you might want to define a meter exclusion for all hardware items in the default content of the ``pipeline.yml`` file for the Telemetry service (ceilometer):
de: Beispielsweise möchten Sie möglicherweise einen Zählerausschluss für alle Hardwareelemente im Standardinhalt der ``pipeline.yml``-Datei für den Telemetriedienst (Ceilometer) definieren:
id: Misalnya, Anda mungkin ingin menentukan pengecualian meter untuk semua item perangkat keras dalam konten default file ``pipeline.yml`` untuk layanan Telemetry (ceilometer):

source: For information on how to contribute, extend or develop OpenStack-Ansible, see the :dev_docs:`Contributors Guide <contributor/index.html>`.
de: Informationen zum Beitragen, Erweitern oder Entwickeln von OpenStack-Ansible finden Sie im :dev_docs:`Contributors Guide <contributor/index.html>`.
id: Untuk informasi tentang cara berkontribusi, perluas atau kembangkan OpenStack-Ansible, lihat :dev_docs:`Contributors Guide <contributor/index.html>`.

source: For information on how to deploy your OpenStack-Ansible cloud, refer to the :deploy_guide:`Deployment Guide <index.html>` for step-by-step instructions on how to deploy the OpenStack packages and dependencies on your cloud using OpenStack-Ansible.
de: Informationen zur Bereitstellung Ihrer OpenStack-Ansible-Cloud finden Sie im Implementierungshandbuch :deploy_guide:`Deployment Guide <index.html>` für eine Schritt-für-Schritt-Anleitung zur Bereitstellung der OpenStack-Pakete und Abhängigkeiten in Ihrer Cloud mit OpenStack-Ansible.
id: Untuk informasi tentang cara menggunakan cloud OpenStack-Ansible Anda, lihat :deploy_guide: `Deployment Guide <index.html>` untuk petunjuk langkah-demi-langkah tentang cara menggunakan paket OpenStack dan dependensi pada cloud Anda menggunakan OpenStack-Ansible .

source: For information on how to manage and operate OpenStack-Ansible, see the see the :dev_docs:`Operations Guide <admin/index.html>`.
de: Informationen zum Verwalten und Betreiben von OpenStack-Ansible finden Sie im :dev_docs:`Operations Guide <admin/index.html>`.
id: Untuk informasi tentang cara mengelola dan mengoperasikan OpenStack-Ansible, lihat lihat :dev_docs:`Operations Guide <admin/index.html>`.

source: For more details, see :ref:`configuring-inventory`.
de: Weitere Informationen finden Sie unter :ref:`configuring-inventory`.
id: Untuk lebih jelasnya, lihat :ref:`configuring-inventory`.

source: For more information about how the OpenStack Networking service (neutron) uses the interfaces for instance traffic, please see the `OpenStack Networking Guide`_.
id: Untuk informasi lebih lanjut tentang bagaimana layanan OpenStack Networking (neutron) menggunakan interfaces untuk lalu lintas instance, silakan lihat `OpenStack Networking Guide`_.

source: For more information about recommended network policies for OpenStack clouds, see the `API endpoint process isolation and policy`_ section of the `OpenStack Security Guide`_
de: Weitere Informationen zu empfohlenen Netzwerkrichtlinien für OpenStack-Clouds finden Sie im Abschnitt `API endpoint process isolation and policy`_ im Abschnitt `OpenStack Security Guide`_
id: Untuk informasi lebih lanjut tentang kebijakan jaringan yang disarankan untuk cloud OpenStack, lihat bagian `API proses isolasi titik akhir dan kebijakan`_ pada `OpenStack Security Guide`_

source: For more information about the security configurations, see the `security hardening role`_ documentation.
de: Weitere Informationen zu den Sicherheitskonfigurationen finden Sie in der Dokumentation `security hardening role`_.
id: Untuk informasi lebih lanjut tentang konfigurasi keamanan, lihat dokumentasi `security hardening role`_ .

source: For user guides, see the :dev_docs:`User Guide <user/index.html>`.
de: Benutzerhandbücher finden Sie im :dev_docs:`User Guide <user/index.html>`.
id: Untuk panduan pengguna, lihat :dev_docs:`User Guide <user/index.html>`.

source: Generates the names of each container that runs a service
de: Erzeugt die Namen jedes Containers, der einen Service ausführt
id: Menghasilkan nama setiap container yang menjalankan layanan

source: Generating the Inventory
de: Inventar erstellen
id: Menghasilkan Inventory

source: Group memberships
de: Gruppenmitgliedschaften
id: Keanggotaan grup

source: Group vars and host vars
de: Group-Vars und Host-Vars
id: Group vars dan host vars

source: Here is an example override dictionary (hash)
de: Hier ist ein Beispiel Override Dictionary (Hash)
id: Berikut ini adalah contoh override kamus (dictionary) (hash)

source: Host security hardening
de: Host-Sicherheit Hardening
id: Pengerasan keamanan host

source: Host security hardening is required by several compliance and regulatory programs, such as the `Payment Card Industry Data Security Standard`_ (PCI DSS) (Requirement 2.2).
de: Host-Security-Hardening wird von mehreren Compliance- und Regulierungsprogrammen gefordert, beispielsweise dem `Payment Card Industry Data Security Standard`_ (PCI DSS) (Anforderung 2.2).
id: Pengerasan keamanan host diperlukan oleh beberapa program kepatuhan dan peraturan, seperti `Payment Card Industry Data Security Standard`_ (PCI DSS) (Requirement 2.2).

source: Hosts with services running in containers
de: Hosts mit Diensten, die in Containern ausgeführt werden
id: Menghosting dengan layanan yang berjalan dalam kontainer

source: How are release tags decided?
de: Wie werden Release-Tags festgelegt?
id: Bagaimana tag rilis diputuskan?

source: How frequently does OSA release?
id: Seberapa sering OSA rilis?

source: However, groups cannot contain child groups and hosts.
de: Gruppen können jedoch keine untergeordneten Gruppen und Hosts enthalten.
id: Namun, grup tidak dapat berisi grup anak dan host.
