Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-user.po
Languages: de, id, ru

source: Enabling TLS on the internal VIP for existing deployments will cause some downtime, this is because HAProxy only listens on a single well known port for each OpenStack service and OpenStack services are configured to use http or https. This means once HAProxy is updated to only accept HTTPS connections, the OpenStack services will stop working until they are updated to use HTTPS.
ru: Включение TLS на внутреннем VIP для существующих развертываний приведет к некоторому простою, это связано с тем, что HAProxy прослушивает только один известный порт для каждой службы OpenStack, а службы OpenStack настроены на использование http или https. Это означает, что после обновления HAProxy для приема только HTTPS-соединений службы OpenStack перестанут работать, пока они не будут обновлены для использования HTTPS.

source: Enabling security.txt
ru: Включение security.txt

source: Ensure HAProxy to prioritize a backend from own Availability Zone over "remote" ones
ru: Проверка того, что HAProxy отдает приоритет бекэнду из собственной зоны доступности над "удалёнными"

source: Ensure a host of each compute architecture is present in ``repo-infra_hosts`` in ``openstack_user_config.yml``.
ru: Убедитесь, что как минимум один хост каждой архитектуры присутвует в группе ``repo-infra_hosts`` в ``openstack_user_config.yml``.

source: Environment customizations
de: Umgebungsanpassungen
id: Kustomisasi lingkungan
ru: Индивидуальная настройка окружения

source: Environment layout
de: Umgebungslayout
id: Tata letak lingkungan
ru: Настройка окружения

source: Example
ru: Пример

source: Example - adding ``aarch64`` nodes to an ``x86_64`` deployment
ru: Пример - добавление ``aarch64`` серверов в ``x86_64`` окружение

source: Example assumes that default gateway is set through ``bond0`` interface, which aggregates ``eth0`` and ``eth1`` links. If your environment does not have ``eth0``, but instead has ``p1p1`` or some other interface name, ensure that references to ``eth0`` are replaced with the appropriate name. The same applies to additional network interfaces
ru: В примере предполагается, что шлюз по умолчанию установлен через интерфейс ``bond0``, который объединяет ссылки ``eth0`` и ``eth1``. Если в вашей среде нет ``eth0``, но вместо этого есть ``p1p1`` или какое-либо другое имя интерфейса, убедитесь, что ссылки на ``eth0`` заменены соответствующим именем. То же самое относится к дополнительным сетевым интерфейсам

source: Example bellow shows a possible content in ``user_variables.yml``:
ru: В примере ниже показано возможное содержимое ``user_variables.yml``:

source: Example below does not represent a correct approach on how to configure path-based endpoint for most services
ru: Пример ниже не отображает правильный подход к настройке точки доступа на основе пути для большинства служб

source: Example internet dependencies
de: Beispiel Internetabhängigkeiten
id: Contoh ketergantungan internet
ru: Примеры зависимостей

source: Example of multi-AZ environment configuration
ru: Пример конфигурации среды с несколькими зонами AZ

source: Example repositories to mirror (Ubuntu target hosts):
de: Beispielrepositorys zum Spiegeln (Ubuntu-Zielhosts):
id: Contoh repositori ke mirror (host target Ubuntu):
ru: Пример репозиториев для зеркалирования (Ubuntu на целевых хостах):

source: Execute the following commands and scripts as the root user.
de: Führen Sie die folgenden Befehle und Skripts als Root-Benutzer aus.
id: Jalankan perintah dan skrip berikut sebagai pengguna root.
ru: Выполните следующие команды от имени root пользователя.

source: External connectivity required to be via HTTP or SOCKS proxies
de: Externe Konnektivität muss über HTTP- oder SOCKS-Proxies erfolgen
id: Konektivitas eksternal diperlukan melalui proxy HTTP atau SOCKS
ru: Внешнее соединение осуществляется через HTTP или SOCKS прокси

source: External provider networks for Floating IPs and instances
id: Jaringan penyedia eksternal untuk Floating IP and instance
ru: Внешние сети провайдера для плавающих IP и инстансов

source: Federated Login
ru: Федеративный вход

source: File (default)
ru: Файл (по умолчанию)

source: Finally, run the playbooks by executing:
de: Führen Sie abschließend die Playbooks aus, indem Sie Folgendes ausführen:
id: Akhirnya, jalankan playbook dengan mengeksekusi:
ru: Наконец, запустите плейбуки выполнив:

source: Finally, you can also opt to disable SSL certificate configuration during initial deployment or opt to use an external certificate authority for signing, such as Let's Encrypt. Both topics are outside the scope of this document.
ru: Наконец, вы также можете отключить конфигурацию сертификата SSL во время первоначального развертывания или использовать внешний центр сертификации для подписи, например Let's Encrypt. Обе темы выходят за рамки этого документа.

source: Firewall rules which block external connectivity
de: Firewall-Regeln, die externe Konnektivität blockieren
id: Aturan firewall yang memblokir konektivitas eksternal
ru: Правила брандмауэра, которые блокируют внешнее соединение

source: First, there is only a single controller in any given Availability Zone, while multiple copies of ``cinder_volume`` needs to be run for each storage provider for High Availability. As ``cinder_volume`` needs access to storage network, one of the best places for it are ``ceph-mon`` hosts.
ru: Во-первых, в любой зоне доступности есть только один контроллер, в то время как для высокой доступности необходимо запустить несколько копий ``cinder_volume`` для каждого провайдера хранилища. Поскольку ``cinder_volume`` нужен доступ к сети хранения, одним из лучших мест для него являются хосты ``ceph-mon``.

source: For a ceph environment, you can run the ``cinder-volume`` in a container. To do this you will need to create a ``/etc/openstack_deploy/env.d/cinder.yml`` file with the following content:
de: Für eine Ceph-Umgebung können Sie das ``Cinder-Volume`` in einem Container ausführen. Dazu müssen Sie eine Datei ``/etc/openstack_deploy/env.d/cinder.yml`` mit folgendem Inhalt erstellen:
id: Untuk lingkungan ceph, Anda dapat menjalankan ``cinder-volume`` dalam sebuah container. Untuk melakukan ini, Anda perlu membuat file ``/etc/openstack_deploy/env.d/cinder.yml`` dengan konten berikut:
ru: Для ceph окружения, вы можете запускать ``cinder-volume`` в контейнере. Что бы сделать это, вам нужно создать файл ``/etc/openstack_deploy/env.d/cinder.yml`` со следующим содержанием:

source: For added trust in highly secure environments, you can provide your own SSL certificates, keys, and CA certificates. Acquiring certificates from a trusted certificate authority is outside the scope of this document, but the `Certificate Management`_ section of the Linux Documentation Project explains how to create your own certificate authority and sign certificates.
de: Für zusätzliches Vertrauen in hochsichere Umgebungen können Sie Ihre eigenen SSL-Zertifikate, Schlüssel und CA-Zertifikate bereitstellen. Das Abrufen von Zertifikaten von einer vertrauenswürdigen Zertifizierungsstelle liegt außerhalb des Geltungsbereichs dieses Dokuments. Im Abschnitt &quot;Zertifikatsverwaltung&quot; des Linux-Dokumentationsprojekts wird jedoch erläutert, wie Sie Ihre eigene Zertifizierungsstelle erstellen und Zertifikate signieren.
id: Untuk kepercayaan tambahan di lingkungan yang sangat aman, Anda dapat memberikan sertifikat SSL, kunci, dan sertifikat CA Anda sendiri. Memperoleh sertifikat dari otoritas sertifikat tepercaya berada di luar ruang lingkup dokumen ini, tetapi bagian `Certificate Management`_ dari Linux Documentation Project menjelaskan cara membuat otoritas sertifikat Anda sendiri dan menandatangani sertifikat.
ru: Для большего доверия в высоконадежных окружениях, вы можете предоставить собственный SSL сертификат, ключи и промежуточные сертификаты. Получение сертификатов из доверенного центра сертификации находится за пределами данного документа, но раздел `Управление Сертификатами`_ Linux Documentation Project объясняет как создать свой собственный центр сертификации и подписывать сертификаты.

source: For each AZ, a group will need to be defined containing all hosts within that AZ.
ru: Для каждой AZ необходимо будет определить группу, содержащую все хосты в этой AZ.

source: For each pod, a group will need to be defined containing all hosts within that pod.
de: Für jeden Pod muss eine Gruppe definiert werden, die alle Hosts innerhalb dieses Pods enthält.
id: Untuk setiap pod, sebuah grup harus didefinisikan berisi semua host dalam pod itu.
ru: Для каждого блока должна быть задана группа, содержащая все хосты для данного блока.

source: For example to install ansible version 2.5.0:
de: Zum Beispiel um ansible Version 2.5.0 zu installieren:
id: Misalnya untuk menginstal ansible version 2.5.0:
ru: Например, для установки версии ansible 2.5.0:

source: For example, Keystone can be configured as ``https://domain.com/identity/v3`` while Nova as ``https://domain.com/compute/v2.1``
ru: Например, Keystone можно настроить как ``https://domain.com/identity/v3``, а Nova как ``https://domain.com/compute/v2.1``

source: For example, if you want to override ``glance`` repository with your own, you need to define the following:
de: Wenn Sie beispielsweise das Repository &quot;glance&quot; mit Ihren eigenen überschreiben möchten, müssen Sie Folgendes definieren:
id: Misalnya, jika Anda ingin mengganti repositori ``glance`` dengan milik Anda sendiri, Anda perlu mendefinisikan yang berikut:
ru: Например, если вы хотите переопределить репозиторий ``glance`` своим собственным, вам необходимо определить следующее:

source: For in-depth technical information, see the :dev_docs:`OpenStack-Ansible Reference <reference/index.html>`.
de: Ausführliche technische Informationen finden Sie unter: dev_docs: `OpenStack-Ansible Reference <reference/index.html> `.
id: Untuk informasi teknis mendalam, lihat :dev_docs:`OpenStack-Ansible Reference <reference/index.html>`.
ru: Для более глубокой технической информации, см. :dev_docs:`Примечания по OpenStack-Ansible <reference/index.html>`.

source: For information on how to contribute, extend or develop OpenStack-Ansible, see the :dev_docs:`Contributors Guide <contributor/index.html>`.
de: Informationen zum Beitragen, Erweitern oder Entwickeln von OpenStack-Ansible finden Sie im: dev_docs: `Contributors Guide <contributor/index.html> `.
id: Untuk informasi tentang cara berkontribusi, perluas atau kembangkan OpenStack-Ansible, lihat :dev_docs:`Contributors Guide <contributor/index.html>`.
ru: Для информации, как поучаствовать в развитии проекта или стать разработчиком OpenStack-Ansible, см. :dev_docs:`Руководство разработчика <contributor/index.html>`.

source: For information on how to deploy your OpenStack-Ansible cloud, refer to the :deploy_guide:`Deployment Guide <index.html>` for step-by-step instructions on how to deploy the OpenStack packages and dependencies on your cloud using OpenStack-Ansible.
de: Informationen zur Bereitstellung Ihrer OpenStack-Ansible-Cloud finden Sie im Implementierungshandbuch: deploy_guide: `Deployment Guide <index.html> `für eine Schritt-für-Schritt-Anleitung zur Bereitstellung der OpenStack-Pakete und Abhängigkeiten in Ihrer Cloud mit OpenStack-Ansible.
id: Untuk informasi tentang cara menggunakan cloud OpenStack-Ansible Anda, lihat :deploy_guide: `Deployment Guide <index.html>` untuk petunjuk langkah-demi-langkah tentang cara menggunakan paket OpenStack dan dependensi pada cloud Anda menggunakan OpenStack-Ansible .
ru: Для информации по развертыванию Вашего облака OpenStack-Ansible, см. :deploy_guide:`Руководство по развертыванию <index.html>` для пошаговых инструкций по развертыванию пакетов OpenStack и зависимостей для вашего облака, использующего OpenStack-Ansible.

source: For information on how to manage and operate OpenStack-Ansible, see the see the :dev_docs:`Operations Guide <admin/index.html>`.
de: Informationen zum Verwalten und Betreiben von OpenStack-Ansible finden Sie im Operations Guide zu dev_docs: ` <admin/index.html> `.
id: Untuk informasi tentang cara mengelola dan mengoperasikan OpenStack-Ansible, lihat lihat :dev_docs:`Operations Guide <admin/index.html>`.
ru: Для информации по управлению и обслуживанию OpenStack-Ansible, см. :dev_docs:`Руководство оператора <admin/index.html>`.

source: For larger or complex environments a dedicated deployment host allows the most suitable proxy configuration to be applied to both deployment and target hosts.
de: In größeren oder komplexen Umgebungen ermöglicht ein dedizierter Bereitstellungshost die Verwendung der am besten geeigneten Proxykonfiguration für Implementierungs- und Zielhosts.
id: Untuk lingkungan yang lebih besar atau kompleks, host deployment khusus (dedicated) memungkinkan konfigurasi proxy yang paling cocok untuk diterapkan pada host deployment maupun host target.
ru: Для больших или сложных окружений, выделенный хост развертывания позволит применить наиболее подходящую настройку прокси как для хоста развертывания, так и для целевых хостов.

source: For more ideas how to tune your Gnocchi stack, take a look at these presentations:
id: Untuk lebih banyak ide bagaimana menyetel tumpukan (stack) Gnocchi Anda, lihat presentasi ini:
ru: Для лучшего понимания тонкой настройки стека Gnocchi, просмотрите данные презентации:

source: For more information about the security configurations, see the `security hardening role`_ documentation.
de: Weitere Informationen zu den Sicherheitskonfigurationen finden Sie in der Dokumentation `security hardening role`_.
id: Untuk informasi lebih lanjut tentang konfigurasi keamanan, lihat dokumentasi `security hardening role`_ .
ru: Дополнительную информацию о конфигурациях безопасности см. в документации `Роль усиления безопасности`_.

source: For more information on how to properly configure network interface files and OpenStack-Ansible configuration files for different deployment scenarios, please refer to the following:
id: Untuk informasi lebih lanjut tentang cara mengkonfigurasi dengan benar file antarmuka jaringan dan file konfigurasi OpenStack-Ansible untuk berbagai skenario penggunaan, silakan merujuk ke yang berikut:
ru: Больше информации как правильно настроить сетевые интерфейсы и файлы конфигурации OpenStack-Ansible для различных сценариев развертывания вы можете найти по ссылкам:

source: For network agent and container networking toplogies, please refer to the following:
id: Untuk agen jaringan dan toplogi jaringan kontainer, silakan merujuk ke yang berikut:
ru: Для сетевого агента и сетевой топологии контейнеров, пожалуйста, см.:

source: For other services applying ``api-paste.ini`` can be done with variables, but each service have quite a unique content there, so approach can't be easily generalized. Below you can find overrides made for some services as an example:
ru: Для других служб применение ``api-paste.ini`` можно сделать с переменными, но у каждой службы там довольно уникальный контент, поэтому подход нельзя легко обобщить. Ниже вы можете найти переопределения, сделанные для некоторых служб в качестве примера:

source: For that create ``/etc/openstack_deploy/env.d/pod.yml`` with the following content:
ru: Для этого создайте файл ``/etc/openstack_deploy/env.d/pod.yml`` со следующим содержанием:

source: For that we need to do the following series of changes in the ``openstack_user_config.yml`` file.
ru: Для этого нам необходимо выполнить следующие изменения в файле ``openstack_user_config.yml``.

source: For that, create a file ``/etc/openstack_deploy/env.d/ceph.yml`` with the following content:
ru: Для этого создайте файл ``/etc/openstack_deploy/env.d/ceph.yml`` с следующим содержанием:

source: For the default AIO scenario, the AIO configuration preparation is completed by executing:
id: Untuk skenario AIO default, persiapan konfigurasi AIO akan selesai dengan mengeksekusi:
ru: Для стандартного сценария AIO, начальная подготовка выполняется при помощи команды:

source: For the example below, let's name our bridge ``br-public-api`` and public vlan with ID ``40``. In your ``user_variables.yml`` define the following variables:
ru: Для примера ниже давайте назовем наш мост ``br-public-api`` и публичный vlan с идентификатором ``40``. В вашем ``user_variables.yml`` определите следующие переменные:

source: For this environment you do not need the ``/etc/openstack_deploy/env.d`` folder as the defaults set by OpenStack-Ansible are suitable.
de: Für diese Umgebung benötigen Sie den Ordner ``/etc/openstack_deploy/env.d`` nicht, da die von OpenStack-Ansible vorgegebenen Voreinstellungen dafür geeignet sind.
id: Untuk lingkungan ini Anda tidak perlu folder ``/etc/openstack_deploy/env.d`` karena standar yang ditetapkan oleh OpenStack-Ansible cocok.
ru: Для данного окружения вам не понадобится директория ``/etc/openstack_deploy/env.d`` так как стандартные параметры OpenStack-Ansible подходят.

source: For this environment, if you want to use the same IP address for the internal and external endpoints, you will need to ensure that the internal and public OpenStack endpoints are served with the same protocol. This is done with the following content:
de: Wenn Sie für diese Umgebung dieselbe IP-Adresse für die internen und externen Endpunkte verwenden möchten, müssen Sie sicherstellen, dass die internen und öffentlichen OpenStack-Endpunkte mit demselben Protokoll bedient werden. Dies geschieht mit folgendem Inhalt:
id: Untuk lingkungan ini, jika Anda ingin menggunakan alamat IP yang sama untuk endpoint internal dan eksternal, Anda harus memastikan bahwa endpoint OpenStack internal dan publik dilayani dengan protokol yang sama. Ini dilakukan dengan konten berikut:
ru: Если вы хотите использовать один и тот же IP адрес для внутренних и публичных точек доступа в данном окружении, вам необходимо убедиться, что внутренние и внешние точки доступа OpenStack обслуживаются по одному и тому же протоколу. Для этого разместите следующие параметры:

source: For this environment, implement the load balancer on the infrastructure hosts. Ensure that keepalived is also configured with HAProxy in ``/etc/openstack_deploy/user_variables.yml`` with the following content.
de: Implementieren Sie für diese Umgebung den Lastenausgleich auf den Infrastrukturhosts. Stellen Sie sicher, dass keepalived auch mit HAProxy in ``/etc/ openstack_deploy/user_variables.yml`` mit folgendem Inhalt konfiguriert ist.
id: Untuk lingkungan ini, terapkan penyeimbang beban pada host infrastruktur. Pastikan keepalived juga dikonfigurasi dengan HAProxy di ``/etc/openstack_deploy/user_variables.yml`` dengan konten berikut.
ru: В данном окружении распределитель нагрузки размещен на инфраструктурных хостах. Убедитесь, что keepalived также настроен совместно с HAProxy, разместив следующее содержание в файле ``/etc/openstack_deploy/user_variables.yml``.

source: For this environment, the ``cinder-volume`` runs in a container on the infrastructure hosts. To achieve this, implement ``/etc/openstack_deploy/env.d/cinder.yml`` with the following content:
de: Für diese Umgebung wird das ``cinder-volume`` in einem Container auf den Infrastrukturhosts ausgeführt. Um dies zu erreichen, implementieren Sie ``/etc/openstack_deploy/env.d/cinder.yml`` mit folgendem Inhalt:
id: Untuk lingkungan ini, ``cinder-volume`` berjalan dalam container di host infrastruktur. Untuk mencapainya, terapkan ``/etc/openstack_deploy/env.d/cinder.yml`` dengan konten berikut:
ru: Для данного окружения, ``cinder-volume`` работает в контейнере на инфраструктурных хостах. Что бы сделать это, создайте файл ``/etc/openstack_deploy/env.d/cinder.yml`` со следующим содержанием:

source: For this example environment, we configure a HA load balancer. We implement the load balancer (HAProxy) with an HA layer (Keepalived) on the infrastructure hosts. Your ``/etc/openstack_deploy/user_variables.yml`` must have the following content to configure HAProxy, Keepalived and Ceph:
ru: Для этого примера среды мы настраиваем балансировщик нагрузки HA. Мы реализуем балансировщик нагрузки (HAProxy) с уровнем HA (Keepalived) на хостах инфраструктуры. Ваш ``/etc/openstack_deploy/user_variables.yml`` должен иметь следующее содержимое для настройки HAProxy, Keepalived и Ceph:

source: For understanding security design, please see :ref:`security-design`.
de: Zum Verständnis des Sicherheitsdesigns siehe: ref: `security-design`.
id: Untuk memahami desain keamanan, silakan lihat :ref:`security-design`.
ru: Для понимания принципов безопасности обратитесь к :ref:`security-design`.

source: Full compute kit with the Telemetry service (ceilometer) included, with Ceph configured as a storage back end for the Image (glance), and Block Storage (cinder) services
de: Komplettes Compute-Kit mit dem Telemetrie-Service (Ceilometer) im Lieferumfang enthalten, wobei Ceph als Speicher-Back-End für die Image (glance) und Block Storage (Cinder) -Dienste konfiguriert ist
id: Kit komputasi lengkap dengan layanan Telemetri (ceilometer) disertakan, dengan Ceph dikonfigurasi sebagai storage back end untuk layanan Image (glance), dan Block Storage (cinder)
ru: Полный набор вычислительных служб с сервисом Telemetry (ceilometer), с настроенным Ceph, как хранилище для службы образов (glance) и блочного хранилища (cinder)

source: Full compute kit with the Telemetry service (ceilometer) included, with NFS configured as a storage back end for the Image (glance), and Block Storage (cinder) services
de: Komplettes Compute-Kit mit dem Telemetrie-Service (Ceilometer) im Lieferumfang enthalten, mit NFS als Speicher-Back-End für die Image (Glance) und Block Storage (Cinder) -Dienste konfiguriert
id: Kit komputasi lengkap dengan layanan Telemetry (ceilometer) disertakan, dengan NFS dikonfigurasikan sebagai ujung belakang penyimpanan (storage back end) untuk layanan Image (glance), dan Block Storage (cinder)
ru: Полный вычислительный набор с сервисом телеметрии (ceilometer), с настроенным NFS в качестве хранилища данных для сервисов образов (glance) и блочного хранилища (cinder)

source: Full compute kit with the Telemetry service (ceilometer) included, with NFS configured as a storage backend for the Image (glance), and Block Storage (cinder) services
de: Komplettes Compute-Kit mit dem Telemetrie-Service (Ceilometer) im Lieferumfang enthalten, wobei NFS als Speicher-Backend für die Dienste Image (Glance) und Block Storage (Cinder) konfiguriert ist
id: Compute kit lengkap dengan layanan Telemetri (ceilometer) disertakan, dengan NFS dikonfigurasikan sebagai backend penyimpanan untuk layanan Image (glance), dan Block Storage (cinder)
ru: Полный набор вычислительных служб с сервисом Telemetry (ceilometer), с настроенным NFS как хранилищем для службы образов (glance), так и блочным хранилищем (cinder)

source: GPG keys for package validation
de: GPG-Schlüssel für die Paketvalidierung
id: Kunci GPG untuk validasi paket
ru: GPG ключи для валидации пакетов

source: Generate the certificate with the following command:
ru: Сгенерируйте сертификат с помощью следующей команды:

source: Generating and regenerating self-signed certificate authorities
ru: Создание и восстановление самоподписанных центров сертификации

source: Generating and regenerating self-signed certificates
de: Generieren und Regenerieren von selbstsignierten Zertifikaten
id: Membuat dan membuat ulang sertifikat yang ditandatangani sendiri (self-signed certificate)
ru: Генерация и регенерация самоподписанных сертификатов

source: Generating and regenerating self-signed user certificates
ru: Генерация и повторная генерация самоподписанных сертификатов пользователей

source: Generic design
ru: Общая схема
