Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-contributor.po
Languages: de, id

source: Every backport commit must still only solve one problem, as per the guidelines in :ref:`codeguidelines`.
de: Jedes Backport-Commit muss immer noch nur ein Problem lösen, wie in den Richtlinien in :ref:`codeguidelines`.
id: Setiap backport commit harus tetap hanya menyelesaikan satu masalah, sesuai panduan dalam :ref:`codeguidelines`.

source: Example YAML dictionary format:
de: Beispiel für ein YAML-Wörterbuchformat:
id: Contoh format kamus YAML:

source: Example process for adding a feature to an existing role
de: Beispielprozess zum Hinzufügen eines Features zu einer vorhandenen Rolle
id: Contoh proses untuk menambahkan fitur ke peran yang ada

source: Example process to develop a new role
de: Beispielprozess zum Entwickeln einer neuen Rolle
id: Contoh proses untuk mengembangkan peran baru

source: Example process to incubate a new "ops" project
de: Beispielprozess zum Inkubieren eines neuen ``ops`` -Projekts
id: Contoh proses untuk menginkubasi proyek "ops" baru

source: Example what **NOT** to do:
de: Beispiel was **NICHT** zu tun ist:
id: Contoh apa yang **NOT** harus dilakukan:

source: Existing and new distributions are expected to meet the following requirements in order for them to be accepted in the individual OpenStack-Ansible roles:
de: Bestehende und neue Distributionen müssen die folgenden Anforderungen erfüllen, damit sie in den einzelnen OpenStack-Ansible-Rollen akzeptiert werden:
id: Distribusi yang ada dan yang baru diharapkan untuk memenuhi persyaratan berikut agar dapat diterima dalam peran yang dimungkinkan OpenStack individu:

source: Extending tests of an existing role
de: Tests einer bestehenden Rolle erweitern
id: Memperluas tes peran yang ada

source: External repositories
de: Externe Repositories
id: Repositori eksternal

source: Feature additions must include documentation which provides reference to OpenStack documentation about what the feature is and how it works. The documentation should then describe how it is implemented in OpenStack-Ansible and what configuration options there are. See also the :ref:`documentation` section.
de: Feature-Ergänzungen müssen eine Dokumentation enthalten, die einen Verweis auf die OpenStack-Dokumentation über das Feature und seine Funktionsweise enthält. Die Dokumentation sollte dann beschreiben, wie es in OpenStack-Ansible implementiert ist und welche Konfigurationsoptionen es gibt. Siehe auch den Abschnitt :ref:`documentation`.
id: Penambahan fitur harus menyertakan dokumentasi yang menyediakan referensi ke dokumentasi OpenStack tentang apa fitur itu dan bagaimana cara kerjanya. Dokumentasi kemudian harus menjelaskan bagaimana ini diterapkan di OpenStack-Ansible dan opsi konfigurasi apa yang ada. Lihat juga bagian :ref:`documentation`.

source: Feature freeze, bug fixes, and testing improvements.
de: Einfrieren von Funktionen, Bugfixes und Testen von Verbesserungen.
id: Membekukan fitur, perbaikan bug, dan peningkatan pengujian.

source: Fill in variable defaults, libraries, and prerequisites as you discover a need for them. You can also develop documentation for your role at the same time.
de: Füllen Sie die Standardwerte, Bibliotheken und Voraussetzungen für Variablen aus, wenn Sie diese benötigen. Sie können auch gleichzeitig Dokumentation für Ihre Rolle entwickeln.
id: Isi default variabel, perpustakaan, dan prasyarat saat Anda menemukan kebutuhan untuknya. Anda juga dapat mengembangkan dokumentasi untuk peran Anda secara bersamaan.

source: Fixing bugs and increasing test coverage have priority to new features. See also the section :ref:`bugfixing`.
de: Das Beheben von Fehlern und das Erhöhen der Testabdeckung haben Vorrang vor neuen Funktionen. Siehe auch den Abschnitt :ref:`bugfixing`.
id: Memperbaiki bug dan meningkatkan jangkauan pengujian memiliki prioritas pada fitur-fitur baru. Lihat juga bagian :ref:`bugfixing`.

source: For a distribution to be considered supported by the OpenStack-Ansible project, it has to meet the following minimum requirements:
de: Damit eine Distribution vom OpenStack-Ansible-Projekt unterstützt wird, muss sie folgende Mindestanforderungen erfüllen:
id: Agar distribusi dianggap didukung oleh proyek OpenStack-Ansible, ia harus memenuhi persyaratan minimum berikut:

source: For all the repos, update the eventual static files refering to master/previous branch name. The main documentation should be updated to add the new branch. The #openstack-docs team should also be updated, for linking the newly created deployment-guide.
id: Untuk semua repo, perbarui file statis akhirnya merujuk ke nama branch master/sebelumnya. Dokumentasi utama harus diperbarui untuk menambahkan branch baru. Tim #openstack-docs juga harus diperbarui, untuk menghubungkan panduan penyebaran yang baru dibuat.

source: For contributing code and documentation, you must follow the OpenStack practices. Nothing special is required for OpenStack-Ansible.
de: Zum Beitragen von Code und Dokumentation müssen Sie die OpenStack-Verfahren befolgen. Nichts Besonderes ist für OpenStack-Ansible erforderlich.
id: Untuk berkontribusi kode dan dokumentasi, Anda harus mengikuti praktik OpenStack. Tidak ada yang khusus diperlukan untuk OpenStack-Ansible.

source: For general information on contributing to OpenStack, please check out the `contributor guide <https://docs.openstack.org/contributors/>`_ to get started. It covers all the basics that are common to all OpenStack projects: the accounts you need, the basics of interacting with our Gerrit review system, how we communicate as a community, etc.
id: Untuk informasi umum tentang kontribusi ke OpenStack, silakan periksa `panduan kontributor <https://docs.openstack.org/contributors/>` _ untuk memulai. Ini mencakup semua dasar-dasar yang umum untuk semua proyek OpenStack: akun yang Anda butuhkan, dasar-dasar berinteraksi dengan sistem ulasan Gerrit kami, cara kami berkomunikasi sebagai komunitas, dll.

source: For helping on or submitting bugs, you must have an account on ubuntu Launchpad. All our repositories share the same `Launchpad project`_.
de: Um Fehler zu beheben oder Fehler zu melden, müssen Sie einen Account auf ubuntu Launchpad haben. Alle unsere Repositories teilen sich das gleiche `Launchpad-Projekt`_.
id: Untuk membantu atau mengirimkan bug, Anda harus memiliki akun di Launchpad ubuntu. Semua repositori kami berbagi hal yang sama `Launchpad project`_.

source: For in-depth technical information, see the :dev_docs:`OpenStack-Ansible Reference <reference/index.html>`.
de: Ausführliche technische Informationen finden Sie unter :dev_docs:`OpenStack-Ansible Reference <reference/index.html>`.
id: Untuk informasi teknis mendalam, lihat :dev_docs:`OpenStack-Ansible Reference <reference/index.html>`.

source: For information on how to deploy your OpenStack-Ansible cloud, refer to the :deploy_guide:`Deployment Guide <index.html>` for step-by-step instructions on how to deploy the OpenStack packages and dependencies on your cloud using OpenStack-Ansible.
de: Informationen zur Bereitstellung Ihrer OpenStack-Ansible-Cloud finden Sie im Implementierungshandbuch :deploy_guide:`Deployment Guide <index.html>` für eine Schritt-für-Schritt-Anleitung zur Bereitstellung der OpenStack-Pakete und Abhängigkeiten in Ihrer Cloud mit OpenStack-Ansible.
id: Untuk informasi tentang cara menggunakan cloud OpenStack-Ansible Anda, lihat :deploy_guide: `Deployment Guide <index.html>` untuk petunjuk langkah-demi-langkah tentang cara menggunakan paket OpenStack dan dependensi pada cloud Anda menggunakan OpenStack-Ansible .

source: For information on how to manage and operate OpenStack-Ansible, see the see the :dev_docs:`Operations Guide <admin/index.html>`.
de: Informationen zum Verwalten und Betreiben von OpenStack-Ansible finden Sie im :dev_docs:`Operations Guide <admin/index.html>`.
id: Untuk informasi tentang cara mengelola dan mengoperasikan OpenStack-Ansible, lihat lihat :dev_docs:`Operations Guide <admin/index.html>`.

source: For sharing your user experience, stories, and helping other users, please join us in our :ref:`IRC channel<irc>`.
de: Um unsere User Experience, Stories und andere Benutzer zu teilen, besuchen Sie uns bitte unter :ref:`IRC channel <irc>`.
id: Untuk berbagi pengalaman pengguna, cerita, dan membantu pengguna lain, silakan bergabung dengan kami di :ref:`IRC channel<irc>`.

source: For user guides, see the :dev_docs:`User Guide <user/index.html>`.
de: Benutzerhandbücher finden Sie in :dev_docs:`Benutzerhandbuch <user/index.html>`.
id: Untuk panduan pengguna, lihat :dev_docs:`User Guide <user/index.html>`.

source: Freeze ansible-role-requirements to their latest SHAs for the branch they are tracking.
id: Bekukan ansible-role-requirements untuk SHA terbaru mereka untuk branch yang mereka lacak.

source: General Guidelines for Submitting Code
de: Allgemeine Richtlinien für die Einreichung von Code
id: Pedoman Umum untuk Mengirimkan Kode

source: General Responsibilities
de: Allgemeine Verantwortlichkeiten
id: Tanggung jawab umum

source: Generate a meta/main.yml right away. This file is important to Ansible to ensure your dependent roles are installed and available and provides others with the information they will need to understand the purpose of your role.
de: Erzeugen Sie sofort eine meta/main.yml. Diese Datei ist für Ansible wichtig, um sicherzustellen, dass Ihre abhängigen Rollen installiert und verfügbar sind, und bietet anderen die Informationen, die sie benötigen, um den Zweck Ihrer Rolle zu verstehen.
id: Hasilkan meta/main.yml segera. File ini penting bagi Ansible untuk memastikan peran dependen Anda diinstal dan tersedia dan memberi orang lain informasi yang mereka perlukan untuk memahami tujuan peran Anda.

source: Generate files to include your service in the Ansible inventory using ``env.d`` and ``conf.d`` files for use on your deploy host.
de: Generieren Sie Dateien, um Ihren Dienst in das Ansible-Inventar aufzunehmen, indem Sie Dateien ``env.d`` und ``conf.d`` zur Verwendung auf Ihrem Bereitstellungs-Host verwenden.
id: Buat file untuk memasukkan layanan Anda dalam inventaris yang dimungkinkan menggunakan file ``env.d`` dan ``conf.d`` untuk digunakan pada host penyebaran Anda.

source: Generate secrets, if any, as described in the :deploy_guide:`Configure Service Credentials <configure.html#configuring-service-credentials>`. You can append your keys to an existing ``user_secrets.yml`` file or add a new file to the ``openstack_deploy`` directory to contain them. Provide overrides for any other variables you will need at this time as well, either in ``user_variables.yml`` or another file.
de: Erstellen Sie ggf. geheime Schlüssel, wie im folgenden Abschnitt beschrieben :deploy_guide:`Configure Service Credentials <configure.html#configuring-service-credentials>`. Sie können Ihre Schlüssel an eine vorhandene ``user_secrets.yml``-Datei anhängen oder eine neue Datei zum ``openstack_deploy``-Verzeichnis hinzufügen, um sie zu enthalten. Geben Sie Überschreibungen für alle anderen Variablen an, die Sie zu diesem Zeitpunkt benötigen, entweder in ``user_variables.yml`` oder in einer anderen Datei.
id: Hasilkan rahasia, jika ada, seperti yang dijelaskan dalam :deploy_guide:`Configure Service Credentials <configure.html#configuring-service-credentials>`. Anda dapat menambahkan kunci Anda ke file yang sudah ada ``user_secrets.yml`` atau menambahkan file baru ke file ``openstack_deploy`` direktori untuk memuatnya. Berikan override untuk variabel lain yang Anda perlukan saat ini juga, baik di ``user_variables.yml`` atau file lain.

source: Generate the reference directory structure for an Ansible role which is the necessary subset of the documented `Best Practice`_. You might use Ansible Galaxy tools to do this for you (e.g. ``ansible-galaxy init``). You may additionally want to include directories such as ``docs`` and ``examples`` and ``tests`` for your role.
de: Generieren Sie die Referenzverzeichnisstruktur für eine Ansible-Rolle, die die erforderliche Teilmenge der dokumentierten `Best Practice`_ ist. Sie können Ansible Galaxy Tools verwenden, um dies für Sie zu tun (z.B. ``ansible-galaxy init``). Sie können zusätzlich Verzeichnisse wie ``docs`` und ``examples`` und ``tests`` für Ihre Rolle hinzufügen.
id: Hasilkan struktur direktori referensi untuk peran Ansible yang merupakan subset yang diperlukan dari `Best Practice`_ yang didokumentasikan. Anda mungkin menggunakan alat Ansible Galaxy untuk melakukan ini untuk Anda (misal ``Ansible-galaxy init``). Anda juga mungkin ingin memasukkan direktori seperti ``docs`` dan ` examples`` dan ``tests`` untuk peran Anda.

source: Getting Your Patch Merged
id: Mendapatkan Patch Anda Digabung (Getting Your Patch Merged)

source: Graduation
de: Abschluss
id: Wisuda

source: Handle OpenStack-Ansible roles deprecations from the previous cycle.
de: Behandle OpenStack-Ansible-Rollen, die vom vorherigen Zyklus abweichen.
id: Menangani penghentian peran yang dimungkinkan oleh OpenStack dari siklus sebelumnya.

source: Handle deprecations from upstream project's previous cycle.
de: Abwertungen aus dem vorherigen Zyklus des vorgelagerten Projekts behandeln
id: Menangani penolakan dari siklus sebelumnya proyek hulu.

source: Have you checked if your issue/feature request hasn't been solved in another branch?
de: Haben Sie überprüft, ob Ihre Anfrage/Funktion in einer anderen Branch nicht gelöst wurde?
id: Sudahkah Anda memeriksa jika issue/feature permintaan Anda belum diselesaikan di branch lain?

source: Here are a few rules to get started:
de: Hier sind ein paar Regeln um loszulegen:
id: Berikut adalah beberapa aturan untuk memulai:

source: Here are a series of rules that define maturity levels:
de: Hier sind eine Reihe von Regeln, die Reifegrade definieren:
id: Berikut adalah serangkaian aturan yang menentukan tingkat kematangan:

source: Here are the steps to write the role:
de: Hier sind die Schritte zum Schreiben der Rolle:
id: Berikut langkah-langkah untuk menulis peran:

source: Here is a dashboard of the current status of the roles:
de: Hier ist ein Dashboard des aktuellen Status der Rollen:
id: Berikut adalah dasbor dari status peran saat ini:

source: How do I handle dependencies to other bugs or TBD features in other projects? For example, I can fix a bug in OpenStack-Ansible but I need that a feature in Compute (nova) gets implemented before.
de: Wie gehe ich mit Abhängigkeiten zu anderen Fehlern oder TBD-Funktionen in anderen Projekten um? Zum Beispiel kann ich einen Fehler in OpenStack-Ansible beheben, aber ich brauche, dass eine Funktion in Compute (Nova) zuvor implementiert wird.
id: Bagaimana cara saya menangani ketergantungan pada bug lain atau fitur TBD di proyek lain? Sebagai contoh, saya dapat memperbaiki bug di OpenStack-Ansible tetapi saya membutuhkan fitur di Compute (nova) diimplementasikan sebelumnya.

source: How do I handle open bug reports which are Incomplete for too long?
de: Wie gehe ich mit offenen Fehlerberichten um, die zu lange unvollständig sind?
id: Bagaimana cara menangani laporan bug terbuka yang tidak lengkap terlalu lama?

source: How to contribute on code or issues
de: Wie kann ich zu Code oder Problemen beitragen?
id: Bagaimana cara berkontribusi pada kode atau masalah

source: How to implement the right configuration to meet the needs of their specific use-case.
de: Wie man die richtige Konfiguration implementiert, um die Anforderungen ihres spezifischen Anwendungsfalles zu erfüllen.
id: Bagaimana menerapkan konfigurasi yang tepat untuk memenuhi kebutuhan kasus penggunaan khusus mereka.

source: How to use the project's tooling effectively to deploy OpenStack.
de: So verwenden Sie die Tools des Projekts effektiv zum Bereitstellen von OpenStack.
id: Cara menggunakan perkakas proyek secara efektif untuk menyebarkan OpenStack.

source: However, for reliability purposes, a few variables are defined to point to the OpenStack infra pypi and packages mirrors.
de: Aus Zuverlässigkeitsgründen sind jedoch einige Variablen definiert, die auf die OpenStack-Infra-Pypi- und Paketspiegel verweisen.
id: Namun, untuk tujuan keandalan, beberapa variabel didefinisikan untuk menunjuk ke OpenStack infra pypi dan paket mirror.

source: However, to help you in the writing of the specification, we have a `specification template`_ that can be copied into the latest release name folder. Rename and edit it for your needs.
de: Um Ihnen beim Schreiben der Spezifikation zu helfen, haben wir jedoch eine `Spezifikationsvorlage`_, die in den neuesten Versionsnamenordner kopiert werden kann. Benennen Sie es um und bearbeiten Sie es für Ihre Bedürfnisse.
id: Namun, untuk membantu Anda dalam penulisan spesifikasi, kami memiliki `template spesifikasi`_ yang dapat disalin ke folder nama rilis terbaru. Ganti nama dan edit untuk kebutuhan Anda.

source: IRC channel
de: IRC-Kanal
id: Saluran IRC

source: Ideally, the functional tests for an OpenStack role should make use of Tempest to execute the functional tests. The ideal tests to execute are scenario tests as they test the functions that the service is expected to do in a production deployment. In the absence of any scenario tests for the service a fallback option is to implement the smoke tests instead.
de: Idealerweise sollten die Funktionstests für eine OpenStack-Rolle Tempest zum Ausführen der Funktionstests verwenden. Die idealen Tests, die ausgeführt werden müssen, sind Szenariotests, da sie die Funktionen testen, die der Service in einer Produktionsbereitstellung ausführen soll. In Ermangelung irgendwelcher Szenariotests für den Service besteht eine Fallback-Option darin, stattdessen die Smoketests zu implementieren.
id: Idealnya, tes fungsional untuk peran OpenStack harus menggunakan Tempest untuk menjalankan tes fungsional. Tes yang ideal untuk dieksekusi adalah tes skenario karena mereka menguji fungsi yang diharapkan dilakukan oleh layanan dalam penyebaran produksi. Dengan tidak adanya tes skenario untuk layanan, pilihan mundur (fallback) adalah untuk menerapkan tes asap (smoke test) sebagai gantinya.

source: If a backport is a squashed set of cherry-picked commits, the original SHAs should be referenced in the commit message and the reason for squashing the commits should be clearly explained.
de: Wenn ein Backport ein gesquaschtes Set von cherry-picked Commits ist, sollten die ursprünglichen SHAs in der Commit-Nachricht referenziert werden und der Grund für das Quetschen der Commits sollte klar erklärt werden.
id: Jika backport adalah set squat dari komit pilihan, SHA asli harus dirujuk dalam pesan komit dan alasan untuk squat komit harus dijelaskan dengan jelas.

source: If a role has failed periodics or gate test for two weeks, a bug should be filed, and a message to the mailing list will be sent, referencing the bug.
de: Wenn eine Rolle zwei Wochen lang keine Periodik oder einen Gate-Test ausgeführt hat, sollte ein Fehler gemeldet werden und eine Nachricht an die Mailing-Liste gesendet werden, die auf den Fehler verweist.
id: Jika sebuah peran gagal dalam uji periodik atau gerbang (periodics or gate test) selama dua minggu, bug harus diajukan, dan pesan ke milis akan dikirim, merujuk bug.

source: If developing a new role, please follow the conventions set by existing roles.
de: Wenn Sie eine neue Rolle entwickeln, beachten Sie bitte die Konventionen der bestehenden Rollen.
id: Jika mengembangkan peran baru, harap ikuti konvensi yang ditetapkan oleh peran yang ada.

source: If it is in this state for more than 30 days and no answers to the open questions are given, close it with Won't Fix.
de: Wenn es länger als 30 Tage in diesem Zustand ist und keine Antworten auf die offenen Fragen gegeben werden, schließen Sie es mit Won't Fix.
id: Jika berada dalam kondisi ini selama lebih dari 30 hari dan tidak ada jawaban untuk pertanyaan terbuka yang diberikan, tutuplah Won't Fix.

source: If necessary, work on the integration within the openstack-ansible integrated repository, and deploy the role on an AIO. See also :ref:`integrate-new-role-with-aio`.
de: Arbeiten Sie bei Bedarf an der Integration in das integrierte Repository von openstack-ansible und stellen Sie die Rolle auf einem AIO bereit. Siehe auch :ref:`integrate-new-role-with-aio`.
id: Jika perlu, bekerja pada integrasi dalam repositori terintegrasi openstack-ansible, dan menyebarkan peran pada AIO. Lihat juga :ref:`integrate-new-role-with-aio`.

source: If no "Wishlist" item exist in Launchpad for your feature, create a bug for it. Don't hesitate to ask if a spec is required in the bug.
de: Wenn im Launchpad für Ihre Funktion kein ``Wunschzettel``-Eintrag vorhanden ist, erstellen Sie einen Fehler dafür. Zögern Sie nicht zu fragen, ob eine Spezifikation in dem Fehler benötigt wird.
id: Jika tidak ada item "Wishlist" di Launchpad untuk fitur Anda, buat bug untuknya. Jangan ragu untuk bertanya apakah spesifikasi diperlukan dalam bug.

source: If no tempest is provided, some other functional testing should be done. For APIs, you can probably check the HTTP response codes, with specially crafted requests.
de: Wenn kein Tempest vorhanden ist, sollten einige andere Funktionstests durchgeführt werden. Für APIs können Sie wahrscheinlich die HTTP-Antwortcodes mit speziell gestalteten Anfragen überprüfen.
id: Jika tidak ada tempest disediakan, beberapa pengujian fungsional lainnya harus dilakukan. Untuk API, Anda mungkin dapat memeriksa kode respons HTTP, dengan permintaan yang dibuat khusus.

source: If required, ask the OpenStack-Ansible PTL to import the github role into the openstack-ansible namespace (This can only be done early in the development cycle, and may be postponed to next cycle).
de: Fordern Sie ggf. die OpenStack-Ansible-PTL auf, die Github-Rolle in den Openstack-ansible-Namespace zu importieren (Dies kann nur zu einem frühen Zeitpunkt im Entwicklungszyklus erfolgen und kann auf den nächsten Zyklus verschoben werden).
id: Jika diperlukan, mintalah PTL OpenStack-Ansible untuk mengimpor peran github ke namespace openstack-ansible (Ini hanya dapat dilakukan di awal siklus pengembangan, dan dapat ditunda ke siklus berikutnya).

source: If the bug affects a specific area covered by an official tag, you should set the tag. For example, if the bug is likely to be quite easy to solve, add the `low-hanging-fruit` tag.
de: Wenn der Fehler einen bestimmten Bereich betrifft, der von einem offiziellen Tag abgedeckt wird, sollten Sie das Tag festlegen. Wenn der Fehler zum Beispiel leicht zu lösen ist, fügen Sie das Tag ``low-hanging-fruit`` hinzu.
id: Jika bug mempengaruhi area tertentu yang dicakup oleh tag resmi, Anda harus mengatur tag. Misalnya, jika bug tersebut kemungkinan cukup mudah untuk dipecahkan, tambahkan tag `low-hanging-fruit`.

source: If the bug description is incomplete, or the report is lacking the information necessary to reproduce the issue, ask the reporter to provide missing information, and set the bug status to *Incomplete*
de: Wenn die Fehlerbeschreibung unvollständig ist oder der Bericht nicht über die erforderlichen Informationen verfügt, um das Problem zu reproduzieren, bitten Sie den Reporter, fehlende Informationen anzugeben und den Fehlerstatus auf *Unvollständig* festzulegen.
id: Jika deskripsi bug tidak lengkap, atau laporan kekurangan informasi yang diperlukan untuk mereproduksi masalah, minta reporter untuk memberikan informasi yang hilang, dan atur status bug ke *Incomplete*

source: If the bug has security implications, set the security flag (under "This report is public" on the top right)
de: Wenn der Fehler Auswirkungen auf die Sicherheit hat, setzen Sie das Sicherheitszeichen (unter "Dieser Bericht ist öffentlich" oben rechts)
id: Jika bug memiliki implikasi keamanan, atur tanda keamanan (di bawah "This report is public" di kanan atas)
