Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-user.po
Languages: de, id, ru

source: You may want to enable the default radosgw S3 API, in addition to the Swift API. In order to do so, you need to override the ``ceph_conf_overrides_rgw`` variable in ``user_variables.yml``. Below is an example configuration snippet:
id: Anda mungkin ingin mengaktifkan radosgw S3 API default, selain Swift API. Untuk melakukannya, Anda perlu mengganti variabel ``ceph_conf_overrides_rgw`` dalam ``user_variables.yml``. Berikut ini cuplikan contoh konfigurasi:
ru: Вы можете захотеть подключить стандартный для radosgw S3 API, в дополнение к Swift API. Что бы сделать это, вам необходимо переопределить переменную ``ceph_conf_overrides_rgw`` в ``user_variables.yml``. Ниже вы можете найти фрагмент конфигурации в качестве примера:

source: You might encounter an error while running the Ansible bootstrap script when building some of the Python extensions (like pycrypto) which says:
de: Möglicherweise tritt beim Ausführen des Ansible-Bootstrap-Skripts beim Erstellen einiger Python-Erweiterungen (wie pycrypto) ein Fehler auf, der besagt:
id: Anda mungkin mengalami kesalahan saat menjalankan skrip bootstrap Ansible saat membuat beberapa ekstensi Python (seperti pycrypto) yang mengatakan:
ru: Вы можете столкнуться с ошибками во время выполнения скрипта начальной подготовки Ansible, во время установки некоторых модулей Python (таких как pycrypto), например:

source: Zookeeper for coordination
id: Zookeeper untuk koordinasi
ru: Zookeeper для координации

source: ``apt-get`` proxy configuration
de: `` apt-get`` Proxy-Konfiguration
id: konfigurasi proxy ``apt-get``
ru: Настройка прокси для ``apt-get``

source: ``azN_all`` that will contain `azN_hosts` and `azN_containers` members
ru: ``azN_all``, который содержит членов групп `azN_hosts` и `azN_containers`

source: ``azN_containers`` that will contain all containers that are spawned on
ru: ``azN_containers``, которые будут содержать все контейнеры, которые создаются на

source: ``azN_hosts`` which will contain only bare metal nodes
ru: ``azN_hosts``, которые будет содержать только физические узлы

source: ``podN_all`` that will contain `podN_hosts` and `podN_containers` members
ru: ``podN_all`` который содержит членов групп `podN_hosts` и `podN_containers`

source: ``podN_containers`` that will contain all containers that are spawned on
ru: ``podN_hosts`` будет содержать все контейнеры, которые запущенны на физических нодах

source: ``podN_hosts`` which will contain only bare metal nodes
ru: ``podN_hosts`` будет содержать только физические узлы

source: a development environment
de: eine Entwicklungsumgebung
id: lingkungan pengembangan
ru: окружения для разработки

source: a simple lab deployment
de: eine einfache Laborbereitstellung
id: penyebaran laboratorium sederhana
ru: простое лабораторное развертывание

source: an overview of how all of the OpenStack services fit together
de: ein Überblick darüber, wie alle OpenStack-Services zusammenpassen
id: gambaran umum tentang bagaimana semua layanan OpenStack cocok bersama
ru: обзор того, как все службы OpenStack взаимодействую друг с другом

source: bare metal nodes, that are part of the pod.
ru: физические серверы, которые являются частью pod-а.

source: connecting to your own pre-deployed ceph cluster by pointing to its information in ``user_variables.yml`` and allowing OpenStack-Ansible to ssh to the ceph monitors to retrieve the contents of ceph.conf and the keyrings.
ru: подключение к вашему собственному предварительно развернутому кластеру ceph путем указания его информации в ``user_variables.yml`` и разрешение OpenStack-Ansible подключиться по ssh к мониторам ceph для получения содержимого ceph.conf и связок ключей.

source: connecting to your own pre-deployed ceph cluster by pointing to its monitors in ``user_variables.yml`` as above and providing data to populate ceph.conf and ceph keyring files on the deploy host. This is described `here <https://docs.openstack.org/openstack-ansible-ceph_client/latest/config-from-file.html>`_. No ssh access by OpenStack-Ansible is required to the ceph cluster.
ru: подключение к вашему собственному предварительно развернутому кластеру ceph путем указания его мониторов в ``user_variables.yml``, как указано выше, и предоставление данных для заполнения файлов ceph.conf и ceph keyring на хосте развертывания. Это описано `здесь <https://docs.openstack.org/openstack-ansible-ceph_client/latest/config-from-file.html>`_. Доступ OpenStack-Ansible по ssh к кластеру ceph не требуется.

source: deploying a ceph cluster as part of the OpenStack-Ansible deployment by using the roles maintained by the `Ceph-Ansible`_ project. Deployers can enable the ``ceph-install.yml`` playbook by adding hosts to the ``ceph-mon_hosts`` and ``ceph-osd_hosts`` groups in ``openstack_user_config.yml``. In order to enable ``ceph-rgw-install.yml`` playbook you need to add ``ceph-rgw_hosts`` in ``openstack_user_config.yml``.
ru: развертывание кластера ceph как части развертывания OpenStack-Ansible с использованием ролей, поддерживаемых проектом `Ceph-Ansible`_. Операторы могут включить ``ceph-install.yml``, добавив хосты в группы ``ceph-mon_hosts`` и ``ceph-osd_hosts`` в ``openstack_user_config.yml``. Чтобы включить ``ceph-rgw-install.yml``, вам нужно добавить ``ceph-rgw_hosts`` в ``openstack_user_config.yml``.

source: oslo.messaging library
ru: Библиотека oslo.messaging

source: security.txt is a proposed `IETF standard`_ to allow independent security researchers to easily report vulnerabilities. The standard defines that a text file called ``security.txt`` should be found at "/.well-known/security.txt". For legacy compatibility reasons the file might also be placed at "/security.txt".
ru: security.txt — это предложенный `стандарт IETF`_, позволяющий независимым исследователям безопасности легко сообщать об уязвимостях. Стандарт определяет, что текстовый файл с именем ``security.txt`` должен находиться по адресу "/.well-known/security.txt". Для совместимости с устаревшими версиями файл также может находиться по адресу "/security.txt".

source: A single rabbitmq server backend (e.g. server or cluster) is the default deployment for OSA. This broker messaging backend provides the queue services for both RPC and Notification communications through its integration with the oslo.messaging rabbit driver. The `oslo-messaging.yml`_ file provides the default configuration to associate the oslo.messaging RPC and Notify services to the rabbitmq server backend.
id: Backend server rabbitmq tunggal (misal server atau cluster) adalah penyebaran default untuk OSA. Backend perpesanan broker ini menyediakan layanan antrian untuk komunikasi RPC dan Notification melalui integrasinya dengan oslo.messaging rabbit driver. File `oslo-messaging.yml`_ menyediakan konfigurasi default untuk mengaitkan oslo.messaging RPC dan layanan Notify ke backend server rabbitmq.

source: All public endpoints reside behind haproxy, resulting in the only certificate management most environments need are those for haproxy.
de: Alle öffentlichen Endpoints befinden sich hinter haproxy, was zur Folge hat, dass die einzige Umgebung, die die meisten Umgebungen benötigen, die Zertifikate für haproxy sind.
id: Semua endpoint publik berada di belakang haproxy, sehingga satu-satunya manajemen sertifikat yang paling dibutuhkan lingkungan adalah haproxy.

source: All the upstream repositories used are defined in the ``openstack-ansible`` integrated repository, in the ``playbooks/defaults/repo_packages`` folder.
de: Alle verwendeten Upstream-Repositories sind im integrierten Repository &quot;openstack-ansible&quot; im Ordner &quot;playbooks / defaults / repo_packages`&quot; definiert.
id: Semua repositori hulu yang digunakan didefinisikan dalam repositori terintegrasi ``openstack-ansible``, dalam folder ``playbooks/defaults/repo_packages``.

source: Before rebooting, in ``/etc/sysconfig/selinux``, make sure that ``SELINUX=enforcing``is changed to ``SELINUX=disabled``. SELinux enabled is not currently supported in OpenStack-Ansible for CentOS/RHEL due to a lack of maintainers for the feature.
id: Sebelum mem-boot ulang, di ``/etc/sysconfig/selinux``, pastikan bahwa ``SELINUX=enforcing``is changed to ``SELINUX=disabled``. SELinux yang diaktifkan saat ini tidak didukung di OpenStack-Ansible untuk CentOS/RHEL karena kurangnya pengelola untuk fitur ini.

source: Change the subject data of any self-signed certificate by using configuration variables. The configuration variable for each service is formatted as ``<servicename>_ssl_self_signed_subject``. For example, to change the SSL certificate subject data for HAProxy, adjust the ``/etc/openstack_deploy/user_variables.yml`` file as follows:
de: Ändern Sie die Betreffdaten jedes selbstsignierten Zertifikats mithilfe von Konfigurationsvariablen. Die Konfigurationsvariable für jeden Dienst ist als `` formatiert <servicename> _ssl_self_signed_subject``. Um beispielsweise die Betreffdaten des SSL-Zertifikats für HAProxy zu ändern, passen Sie die Datei &quot;/ etc / openstack_deploy / user_variables.yml&quot; wie folgt an:
id: Ubah data subjek dari sertifikat yang ditandatangani sendiri dengan menggunakan variabel konfigurasi. Variabel konfigurasi untuk setiap layanan diformat sebagai ``<servicename>_ssl_self_signed_subject``. Misalnya, untuk mengubah data subjek sertifikat SSL untuk HAProxy, sesuaikan file ``/etc/openstack_deploy/user_variables.yml`` sebagai berikut:

source: Deployers can configure the script to source Ansible from an alternate Git repository by setting the environment variable ``ANSIBLE_GIT_REPO``.
de: Deployer können das Skript so konfigurieren, dass es Ansible aus einem alternativen Git-Repository bezieht, indem es die Umgebungsvariable `` ANSIBLE_GIT_REPO`` festlegt.
id: Deployer dapat mengkonfigurasi skrip ke sumber Ansible dari repositori Git alternatif dengan mengatur variabel lingkungan ``ANSIBLE_GIT_REPO``.

source: For more information about the available fields in the certificate subject, see the OpenSSL documentation for the `req subcommand`_.
de: Weitere Informationen zu den verfügbaren Feldern im Zertifikatsbetreff finden Sie in der OpenSSL-Dokumentation für den Unterbefehl `req`_.
id: Untuk informasi lebih lanjut tentang bidang yang tersedia dalam subjek sertifikat, lihat dokumentasi OpenSSL untuk `req subcommand`_.

source: For this example environment, we configure a HA load balancer. We implement the load balancer (HAProxy) with an HA layer (keepalived) on the infrastructure hosts. Your ``/etc/openstack_deploy/user_variables.yml`` must have the following content to configure haproxy, keepalived and ceph:
de: Für diese Beispielumgebung konfigurieren wir einen HA-Lastenausgleich. Wir implementieren den Load Balancer (HAProxy) mit einer HA-Schicht (keepalived) auf den Infrastrukturhosts. Ihr ``/etc/openstack_deploy/user_variables.yml`` muss den folgenden Inhalt haben, um haproxy, keepalived und ceph zu konfigurieren:
id: Untuk contoh lingkungan ini, kami mengonfigurasi penyeimbang beban HA. Kami menerapkan load balancer (HAProxy) dengan layer HA (keepalived) pada host infrastruktur. ``/etc/openstack_deploy/user_variables.yml`` Anda harus memiliki konten berikut untuk mengonfigurasi haproxy, keepalived, dan ceph:

source: Hybrid messaging deployment with qdrouterd server
id: Deployment perpesanan hibrid dengan server qdrouterd

source: Hybrid messaging example
id: Contoh perpesanan hibrid

source: If the 'metal' and 'aio' key words are used together, horizon will not be deployed because haproxy and horizon will conflict on the same listening ports.
id: Jika kata kunci 'metal' dan 'aio' digunakan bersama-sama, horizon tidak akan digunakan karena haproxy dan horizon akan konflik pada port mendengarkan yang sama.

source: If this fails to get the database cluster back into a running state, then please make use of the `Galera Cluster Recovery </admin/maintenance-tasks.html#galera-cluster-recovery>` section in the operations guide.
id: Jika ini gagal untuk mendapatkan kembali cluster database ke keadaan berjalan, maka silakan gunakan bagian `Galera Cluster Recovery </admin/maintenance-tasks.html#galera-cluster-recovery>` di panduan operasi.

source: If you are installing with limited connectivity, please review the *Installing with limited connectivity* appendix in the :deploy_guide:`Deployment Guide <index.html>` before proceeding.
de: Wenn Sie mit eingeschränkter Konnektivität arbeiten, lesen Sie den Anhang * Installieren mit eingeschränkter Konnektivität * im Bereitstellungshandbuch: deploy_guide: `Deployment Guide <index.html> bevor wir fortfahren.
id: Jika Anda menginstal dengan konektivitas terbatas, silakan tinjau lampiran *Installing with limited connectivity* dalam :deploy_guide:`Deployment Guide <index.html>` sebelum melanjutkan.

source: In OSA, the deployment of disparate messaging backends is completely transparent to the OpenStack services. By managing the inventories for the messaging servers, a hybrid messaging configuration will be created. The instantiation of the qdrouterd server role in the qdrouterd_host_group will automatically setup the oslomsg_rpc* variables to use this messaging backend. No additional configuration is required. The result is that RPC services will communicate via the amqp (V1.0 protocol) driver and the Notify services will communicate via the rabbit driver. The separation and use of different messaging backends can provide increased scale and resiliency.
id: Di OSA, penyebaran backend perpesanan yang berbeda sepenuhnya transparan untuk layanan OpenStack. Dengan mengelola inventaris untuk server perpesanan, konfigurasi perpesanan hibrid akan dibuat. Instansiasi peran server qdrouterd di qdrouterd_host_group akan secara otomatis mengatur variabel oslomsg_rpc * untuk menggunakan backend perpesanan ini. Tidak diperlukan konfigurasi tambahan. Hasilnya adalah bahwa layanan RPC akan berkomunikasi melalui driver amqp (V1.0 protocol) dan layanan Notify akan berkomunikasi melalui rabbit driver. Pemisahan dan penggunaan berbagai backend perpesanan dapat memberikan peningkatan skala dan ketahanan.

source: It is possible to also do this (and change other defaults) during the bootstrap script initial execution by changing the SCENARIO environment variable before running the script. The key word 'aio' will ensure that a basic set of OpenStack services (cinder, glance, horizon, neutron, nova) will be deployed. The key words 'lxc' and 'nspawn' can be used to set the container back-end, while the key word 'metal' will deploy all services without containers. In order to implement any other services, add the name of the conf.d file name without the `.yml.aio` extension into the SCENARIO environment variable. Each key word should be delimited by an underscore. For example, the following will implement an AIO with barbican, cinder, glance, horizon, neutron, and nova. It will set the cinder storage back-end to ceph and will make use of LXC as the container back-end.
id: Dimungkinkan juga untuk melakukan ini (dan mengubah default lainnya) selama eksekusi awal skrip bootstrap dengan mengubah variabel lingkungan SCENARIO sebelum menjalankan skrip. Kata kunci 'aio' akan memastikan bahwa serangkaian dasar layanan OpenStack (cinder, glance, horizon, neutron, nova) akan digunakan. Kata-kata kunci 'lxc' dan 'nspawn' dapat digunakan untuk mengatur back-end container, sedangkan kata kunci 'metal' akan menyebarkan semua layanan tanpa container. Untuk menerapkan layanan lain, tambahkan nama nama file conf.d tanpa ekstensi `.yml.aio` ke dalam variabel lingkungan SCENARIO. Setiap kata kunci harus dibatasi oleh garis bawah. Sebagai contoh, berikut ini akan menerapkan AIO dengan barbican, cinder, glance, horizon, neutron, dan nova. Ini akan mengatur back-end penyimpanan cinder ke ceph dan akan menggunakan LXC sebagai back-end container.

source: OpenStack-Ansible allows `Ceph storage <https://ceph.io>`_ cluster integration in two ways:
id: OpenStack-Ansible memungkinkan `Ceph storage <https://ceph.io>`_ cluster integration in two ways:

source: OpenStack-Ansible relies upon community built LXC images when building containers for OpenStack services. Deployers may choose to create, maintain, and host their own container images. Consult the ``openstack-ansible-lxc_container_create`` role for details on configuration overrides for this scenario.
de: OpenStack-Ansible basiert auf von der Community erstellten LXC-Images, wenn Container für OpenStack-Services erstellt werden. Bereitsteller können ihre eigenen Container-Images erstellen, verwalten und hosten. Weitere Informationen zu Konfigurationsüberschreibungen für dieses Szenario finden Sie in der Rolle &quot;openstack-ansible-lxc_container_create&quot;.
id: OpenStack-Ansible bergantung pada image LXC buatan komunitas saat membuat container untuk layanan OpenStack. Deployer dapat memilih untuk membuat, memelihara, dan meng-host image kontainer mereka sendiri. Konsultasikan role ``openstack-ansible-lxc_container_create`` untuk detail konfigurasi override untuk skenario ini.

source: Please note, for this glance example, that you do not need to edit the ``playbooks/defaults/repo_packages/openstack_services.yml`` file.
de: Bitte beachten Sie, dass Sie für dieses Beispiel nicht die Datei `` playbooks/defaults/repo_packages/openstack_services.yml`` bearbeiten müssen.
id: Harap perhatikan, untuk contoh glance ini, bahwa Anda tidak perlu mengedit file ``playbooks/defaults/repo_packages/openstack_services.yml``.

source: Proxying TLS traffic often interferes with the clients ability to perform successful validation of the certificate chain. Various configuration variables exist within the OpenStack-Ansible playbooks and roles that allow a deployer to ignore these validation failures. Find an example ``/etc/openstack_deploy/user_variables.yml`` configuration below:
de: Das Proxying von TLS-Datenverkehr beeinträchtigt häufig die Fähigkeit des Clients, eine erfolgreiche Validierung der Zertifikatskette durchzuführen. In den OpenStack-Ansible-Playbooks und Rollen gibt es verschiedene Konfigurationsvariablen, die es einem Implementierer ermöglichen, diese Validierungsfehler zu ignorieren. Finden Sie ein Beispiel ``/etc/openstack_deploy/user_variables.yml`` Konfiguration unten:
id: Proxy traffic TLS seringkali mengganggu kemampuan klien untuk melakukan validasi rantai sertifikat secara sukses. Berbagai variabel konfigurasi ada di dalam playbook dan role OpenStack-Ansible yang memungkinkan deployer untuk mengabaikan kegagalan validasi ini. Temukan contoh konfigurasi ``/etc/openstack_deploy/user_variables.yml`` di bawah:

source: Recent changes to OSA enables deployers to define provider networks that apply to particular inventory groups and allows for a heterogeneous network configuration within a cloud environment. New groups can be created or existing inventory groups, such as ``network_hosts`` or ``compute_hosts``, can be used to ensure certain configurations are applied only to hosts that meet the given parameters.
id: Perubahan terbaru pada OSA memungkinkan pengerahkan untuk menentukan jaringan penyedia yang berlaku untuk kelompok inventaris tertentu dan memungkinkan untuk konfigurasi jaringan yang heterogen dalam lingkungan cloud. Grup baru dapat dibuat atau grup inventaris yang ada, seperti ``network_hosts`` atau `` compute_hosts``, dapat digunakan untuk memastikan konfigurasi tertentu hanya diterapkan pada host yang memenuhi parameter yang diberikan.

source: Regenerating self-signed certificates replaces the existing certificates whether they are self-signed or user-provided.
de: Das erneute Generieren selbstsignierter Zertifikate ersetzt die vorhandenen Zertifikate unabhängig davon, ob sie selbstsigniert oder vom Benutzer bereitgestellt werden.
id: Regenerasi sertifikat yang ditandatangani sendiri menggantikan sertifikat yang ada apakah ditandatangani sendiri atau disediakan oleh pengguna.

source: Self-signed certificates enable you to start quickly and encrypt data in transit. However, they do not provide a high level of trust for highly secure environments. By default, self-signed certificates are used in OpenStack-Ansible. When self-signed certificates are used, certificate verification is automatically disabled.
de: Mit selbstsignierten Zertifikaten können Sie Daten schnell starten und verschlüsseln. Sie bieten jedoch kein hohes Maß an Vertrauen für hochsichere Umgebungen. Standardmäßig werden selbstsignierte Zertifikate in OpenStack-Ansible verwendet. Wenn selbstsignierte Zertifikate verwendet werden, wird die Zertifikatsprüfung automatisch deaktiviert.
id: Sertifikat yang ditandatangani sendiri memungkinkan Anda untuk memulai dengan cepat dan mengenkripsi data dalam perjalanan. Namun, mereka tidak memberikan tingkat kepercayaan yang tinggi untuk lingkungan yang sangat aman. Secara default, sertifikat yang ditandatangani sendiri digunakan di OpenStack-Ansible. Ketika sertifikat yang ditandatangani sendiri digunakan, verifikasi sertifikat dinonaktifkan secara otomatis.

source: Setting subject data for self-signed certificates
de: Subjektdaten für selbstsignierte Zertifikate einstellen
id: Menyetel data subjek untuk sertifikat yang ditandatangani sendiri

source: Standard deployment of rabbitmq server
id: Penerapan standar server rabbitmq

source: The ``Overlay Network``, also referred to as the ``tunnel network``, provides connectivity between hosts for the purpose of tunnelling encapsulated traffic using VXLAN, GENEVE, or other protocols. The ``overlay network`` uses a dedicated VLAN typically connected to the ``br-vxlan`` bridge.
id: ``Overlay Network``, juga disebut sebagai ``tunnel network``, menyediakan konektivitas antar host untuk tujuan tunneling lalu lintas terenkapsulasi menggunakan VXLAN, GENEVE, atau protokol lainnya. ``Overlay network`` menggunakan VLAN khusus yang biasanya terhubung ke jembatan ``br-vxlan``.

source: The default openstack-ansible installation configures gnocchi to use a file as storage backend. When you already have a pre-installed ceph, you can use this as backend for gnocchi. This documentation will guide you how to set up gnocchi to use your ceph as storage backend.
id: Instalasi openstack-ansible default mengkonfigurasi gnocchi untuk menggunakan file sebagai backend penyimpanan. Ketika Anda sudah memiliki ceph pra-instal, Anda dapat menggunakan ini sebagai backend untuk gnocchi. Dokumentasi ini akan memandu Anda cara mengatur gnocchi untuk menggunakan ceph sebagai backend penyimpanan.

source: The following diagram demonstrates hosts using a single interface:
id: Diagram berikut menunjukkan host menggunakan antarmuka tunggal:

source: The following diagram demonstrates hosts using multiple interfaces:
id: Diagram berikut menunjukkan host menggunakan beberapa antarmuka:

source: The list above is intentionally not exhaustive. Additional variables may exist within the project and will be named using the `*_validate_certs` pattern. Disable certificate chain validation on a case by case basis and only after encountering failures that are known to only be caused by the proxy server(s).
de: Die obige Liste ist absichtlich nicht erschöpfend. Zusätzliche Variablen können innerhalb des Projekts existieren und werden unter Verwendung des `* _validate_cert`-Musters benannt. Deaktivieren Sie die Zertifikatkettenüberprüfung von Fall zu Fall und nur nach dem Auftreten von Fehlern, von denen bekannt ist, dass sie nur von den Proxyservern verursacht werden.
id: Daftar di atas sengaja tidak lengkap. Variabel tambahan mungkin ada dalam proyek dan akan dinamai menggunakan pola `* _validate_certs`. Nonaktifkan validasi rantai sertifikat berdasarkan kasus per kasus dan hanya setelah mengalami kegagalan yang diketahui hanya disebabkan oleh server proxy.
