Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-user.po
Languages: de, id, ru

source: The |current_release_formal_name| release is only compatible with Debian 9 (stretch), Debian 10 (buster), Ubuntu 18.04 (Bionic Beaver), CentOS 7 and openSUSE Leap 15.X.
id: The | current_release_formal_name | rilis hanya kompatibel dengan Debian 9 (stretch), Debian 10 (buster), Ubuntu 18.04 (Bionic Beaver), CentOS 7 dan openSUSE Leap 15.X.

source: This section provides an overview of hybrid messaging deployment concepts and describes the necessary steps for a working OpenStack-Ansible (OSA) deployment where RPC and Notify communications are separated and integrated with different messaging server backends (e.g. rabbitmq and qdrouterd).
id: Bagian ini memberikan gambaran umum tentang konsep penyebaran perpesanan hibrida dan menjelaskan langkah-langkah yang diperlukan untuk penerapan OpenStack-Ansible (OSA) yang berfungsi di mana komunikasi RPC dan Notify dipisahkan dan diintegrasikan dengan berbagai server backend perpesanan (misal rabbitmq dan qdrouterd)

source: To force a self-signed certificate to regenerate with every playbook run, set the appropriate regeneration option to ``true``. For example, if you have already run the ``haproxy`` playbook, but you want to regenerate the self-signed certificate, set the ``haproxy_ssl_self_signed_regen`` variable to ``true`` in the ``/etc/openstack_deploy/user_variables.yml`` file:
de: Um zu erzwingen, dass sich ein selbstsigniertes Zertifikat bei jedem Playbook-Lauf neu generiert, setzen Sie die entsprechende Regenerierungsoption auf ``True``. Wenn Sie beispielsweise das Playbook &quot;haproxy&quot; bereits ausgeführt haben, aber das selbstsignierte Zertifikat neu generieren möchten, setzen Sie die Variable `` haproxy_ssl_self_signed_regen`` auf `` true`` im `` /etc/openstack_deploy/user_variables.yml`` Datei:
id: Untuk memaksa sertifikat yang ditandatangani sendiri untuk dibuat ulang dengan setiap kali playbook dijalankan, setel opsi regenerasi yang sesuai ke ``true``. Misalnya, jika Anda sudah menjalankan playbook ``haproxy``, tetapi Anda ingin membuat ulang sertifikat yang ditandatangani sendiri, setel variabel ``haproxy_ssl_self_signed_regen`` ke ``true`` di file ``/etc/openstack_deploy/user_variables.yml``:

source: To generate a new self-signed certificate for a service, you must set the ``<servicename>_ssl_self_signed_regen`` variable to true in one of the following ways:
de: Um ein neues selbstsigniertes Zertifikat für einen Service zu generieren, müssen Sie das `` &#39;festlegen <servicename> _ssl_self_signed_regen`` Variable auf eine der folgenden Weisen auf true:
id: Untuk menghasilkan sertifikat yang ditandatangani sendiri untuk layanan, Anda harus mengatur variabel ``<servicename>_ssl_self_signed_regen`` menjadi true dengan salah satu cara berikut:

source: Upstream Ubuntu repositories to mirror for Ubuntu 18.04 LTS:
id: Repositori Ubuntu upstream untuk mirror untuk Ubuntu 18.04 LTS:

source: When your Swift installation uses Ceph as backend, the only one left for this setup is Redis.
id: Ketika instalasi Swift Anda menggunakan Ceph sebagai backend, satu-satunya yang tersisa untuk pengaturan ini adalah Redis.

source: connecting to your own ceph cluster by pointing to its information in ``user_variables.yml``
de: Verbinden Sie sich mit Ihrem eigenen Ceph-Cluster, indem Sie auf seine Informationen in `` user_variables.yml`` zeigen
id: menghubungkan ke ceph cluster Anda sendiri dengan menunjuk ke informasinya di ``user_variables.yml``

source: deploying a ceph cluster by using the roles maintained by the `Ceph-Ansible`_ project. Deployers can enable the ``ceph-install`` playbook by adding hosts to the ``ceph-mon_hosts``, ``ceph-osd_hosts`` and ``ceph-rgw_hosts`` groups in ``openstack_user_config.yml``, and then configuring `Ceph-Ansible specific vars <https://github.com/ceph/ceph-ansible/blob/master/group_vars/all.yml.sample>`_ in the OpenStack-Ansible ``user_variables.yml`` file.
de: Bereitstellen eines Ceph-Clusters unter Verwendung der vom `Ceph-Ansible`_-Projekt verwalteten Rollen. Deployer können das `` ceph-install``-Playbook aktivieren, indem Hosts zu den Gruppen `` ceph-mon_hosts` `,` `ceph-osd_hosts`` und` `ceph-rgw_hosts`` in` `openstack_user_config.yml`` hinzugefügt werden. und dann konfigurieren Sie Ceph-Ansible spezifische vars <https://github.com/ceph/ceph-ansible/blob/master/group_vars/all.yml.sample> `_ in der OpenStack-Ansible ``user_variables.yml`` Datei.
id: menyebarkan klaster ceph dengan menggunakan peran yang dikelola oleh proyek `Ceph-Ansible`_. Deployers dapat mengaktifkan playbook ``ceph-install` `dengan menambahkan host ke grup ``ceph-mon_hosts``, ``ceph-osd_hosts`` dan ``ceph-rgw_hosts`` dalam ``openstack_user_config.yml``, dan kemudian mengkonfigurasi `Ceph-Ansible specific vars <https://github.com/ceph/ceph-ansible/blob/master/group_vars/all.yml.sample>`_ di OpenStack-Ansible ``user_variables.yml`` file.

source: #. An alternative method applies proxy configuration in a transient manner during the execution of Ansible playbooks and defines a minimum set of management network IP addresses for ``no_proxy`` that are required for the playbooks to succeed. These proxy settings do not persist after an Ansible playbook run and the completed deployment does not require them in order to be functional.
de: #. Eine alternative Methode wendet die Proxy-Konfiguration während der Ausführung von Ansible-Playbooks vorübergehend an und definiert einen Mindestsatz von Management-Netzwerk-IP-Adressen für ``no_proxy``, die für den Erfolg der Playbooks erforderlich sind. Diese Proxy-Einstellungen bleiben nach einem Ansible-Playbook-Lauf nicht bestehen und die abgeschlossene Bereitstellung erfordert sie nicht, um funktionsfähig zu sein.

source: #. Persistent proxy configuration is a standard practice and network clients on the target hosts will be able to access external resources after deployment.
de: #. Die persistente Proxy-Konfiguration ist eine Standardmethode, und Netzwerkclients auf den Zielhosts können nach der Bereitstellung auf externe Ressourcen zugreifen.

source: #. The default configuration file suggests setting a persistent proxy configuration on all target hosts and defines a persistent ``no_proxy`` environment variable which lists all hosts/containers' management addresses as well as the load balancer internal/external addresses.
de: #. Die Standardkonfigurationsdatei schlägt vor, auf allen Zielhosts eine persistente Proxykonfiguration festzulegen und definiert eine persistente Umgebungsvariable ``no_proxy``, in der die Verwaltungsadressen aller Hosts / Container sowie die internen / externen Adressen des Lastenausgleichs aufgeführt sind.

source: #. The deployer must ensure that a persistent proxy configuration has complete coverage of all OpenStack management network host/containers' IP addresses in the ``no_proxy`` environment variable. It is necessary to use a list of IP addresses, CIDR notation is not valid for ``no_proxy``.
de: #. Der Deployer muss sicherstellen, dass eine permanente Proxy-Konfiguration alle IP-Adressen des OpenStack-Management-Netzwerk-Hosts / Containers in der Umgebungsvariablen `` no_proxy`` vollständig abdeckt. Es ist notwendig, eine Liste von IP-Adressen zu verwenden, die CIDR-Notation gilt nicht für `` no_proxy``.

source: #. The maximum length of ``no_proxy`` should not exceed 1024 characters due to a fixed size buffer in the ``pam_env`` PAM module. Longer environment variables will be truncated during deployment operations and this will lead to unpredictable errors during or after deployment.
de: #. Die maximale Länge von `` no_proxy`` sollte 1024 Zeichen nicht überschreiten, da im PAM-Modul `` pam_env`` ein Puffer fester Größe vorhanden ist. Längere Umgebungsvariablen werden während der Bereitstellungsvorgänge abgeschnitten, was zu unvorhersehbaren Fehlern während oder nach der Bereitstellung führt.

source: #. Transient proxy configuration guarantees that proxy environment variables will not persist, ensuring direct communication between services on the OpenStack management network after deployment. Target host network clients such as ``wget`` will not be able to access external resources after deployment.
de: #. Die transiente Proxy-Konfiguration garantiert, dass die Proxy-Umgebungsvariablen nicht bestehen bleiben und stellt nach der Bereitstellung eine direkte Kommunikation zwischen den Diensten im OpenStack-Management-Netzwerk sicher. Zielhostnetzwerk-Clients wie ``wget`` können nach der Bereitstellung nicht auf externe Ressourcen zugreifen.

source: **Tested Scenarios**
de: ** getestete Szenarien **

source: By default the filesystem type will be set to ext4, if you want another type of filesystem to be used, just use something similar to the following:
de: Standardmäßig wird der Dateisystemtyp auf ext4 gesetzt, wenn Sie einen anderen Typ von Dateisystem verwenden möchten, verwenden Sie etwas ähnliches wie folgt:

source: By default the scripts deploy all OpenStack services with sensible defaults for the purpose of a gate check, development or testing system.
de: Standardmäßig stellen die Skripte alle OpenStack-Dienste mit sinnvollen Vorgaben für ein Gate-Check-, Entwicklungs- oder Testsystem bereit.

source: Clone all of the role dependencies using native git
de: Klonen Sie alle Rollenabhängigkeiten mit nativem Git

source: Configuration *(this step is optional)*
de: Konfiguration * (dieser Schritt ist optional) *

source: Configuration can be applied to target and deployment hosts to reach public internet resources via HTTP or SOCKS proxy server(s). OpenStack-Ansible may be used to configure target hosts to use the proxy server(s). OpenStack-Ansible does not provide automation for creating the proxy server(s).
de: Die Konfiguration kann auf Ziel- und Deployment-Hosts angewendet werden, um öffentliche Internet-Ressourcen über HTTP- oder SOCKS-Proxy-Server zu erreichen. OpenStack-Ansible kann verwendet werden, um Zielhosts für die Verwendung des / der Proxy-Server zu konfigurieren. OpenStack-Ansible bietet keine Automatisierung zum Erstellen des / der Proxy-Server.

source: Example OpenStack-Ansible configuration for specifying a local pip mirror or proxy:
de: Beispiel für eine OpenStack-Ansible-Konfiguration zum Angeben eines lokalen Pip-Spiegels oder -Proxy:

source: For the default AIO scenario, this preparation is completed by executing:
de: Für das Standard-AIO-Szenario wird diese Vorbereitung abgeschlossen, indem Folgendes ausgeführt wird:

source: Further to this basic configuration, there are other network clients on the target hosts which may be configured to connect via a proxy. For example:
de: Zusätzlich zu dieser grundlegenden Konfiguration befinden sich auf den Zielhosts weitere Netzwerkclients, die für die Verbindung über einen Proxy konfiguriert werden können. Beispielsweise:

source: If this fails to get the database cluster back into a running state, then please make use of the :dev_docs:`Galera Cluster Recovery <admin/maintenance-tasks/galera.html>` section in the operations guide.
de: Wenn dies den Datenbank-Cluster nicht in einen aktiven Zustand versetzt, verwenden Sie bitte den folgenden Befehl: dev_docs: `Galera Cluster Recovery <admin/maintenance-tasks/galera.html> `Abschnitt im Betriebshandbuch.

source: If you wish to use a different scenario, for example, the Ceph scenario, execute the following:
de: Wenn Sie ein anderes Szenario, z. B. das Ceph-Szenario, verwenden möchten, führen Sie Folgendes aus:

source: Initial host bootstrap
de: Initialer Host-Bootstrap

source: Install and bootstrap Ansible
de: Installieren und Bootstrap Ansible

source: It is important to note that the proxy server should only be used to access external resources, and communication between the internal components of the OpenStack deployment should be direct, without going through the proxy. The ``no_proxy`` environment variable is used to specify hosts that should be reached directly without going through the proxy. These often are the hosts in the management network.
de: Es ist wichtig zu beachten, dass der Proxy-Server nur für den Zugriff auf externe Ressourcen verwendet werden sollte und dass die Kommunikation zwischen den internen Komponenten der OpenStack-Bereitstellung direkt erfolgen sollte, ohne den Proxy zu durchlaufen. Die Umgebungsvariable `` no_proxy`` wird verwendet, um Hosts anzugeben, die direkt erreicht werden sollen, ohne den Proxy zu durchlaufen. Diese sind oft die Hosts im Management-Netzwerk.

source: It's `possible` to perform AIO builds within a virtual machine for demonstration and evaluation, but your virtual machines will perform poorly. For production workloads, multiple nodes for specific roles are recommended.
de: Es ist möglich, AIO-Builds innerhalb einer virtuellen Maschine zur Demonstration und Auswertung auszuführen, aber Ihre virtuellen Maschinen werden schlecht arbeiten. Für Produktionsarbeitsauslastungen werden mehrere Knoten für bestimmte Rollen empfohlen.

source: Many packages used to run OpenStack are installed using `pip`. We advise mirroring the PyPi package index used by `pip`. A deployer can choose to actively mirror the entire upstream PyPi repository but this may require a significant amount of storage. Alternatively a caching pip proxy can be used to retain local copies of only those packages which are required.
de: Viele Pakete, die OpenStack ausführen, werden mit `pip` installiert. Wir empfehlen, den PyPi-Paket-Index, der von `pip` verwendet wird, zu spiegeln. Ein Deployer kann wählen, ob er das gesamte vorgelagerte PyPi-Repository aktiv spiegeln soll, aber dies kann eine erhebliche Menge an Speicher erfordern. Alternativ kann ein Caching-Pip-Proxy verwendet werden, um lokale Kopien nur der Pakete beizubehalten, die benötigt werden.

source: Many playbooks and roles in OpenStack-Ansible retrieve dependencies from the public Internet by default. The example configurations assume that the deployer provides good quality Internet connectivity via a router on the OpenStack management network.
de: Viele Playbooks und Rollen in OpenStack-Ansible rufen standardmäßig Abhängigkeiten vom öffentlichen Internet ab. Bei den Beispielkonfigurationen wird davon ausgegangen, dass der Deployer über einen Router im OpenStack-Verwaltungsnetzwerk eine Internetverbindung mit guter Qualität bereitstellt.

source: Notes:
de: Anmerkungen:

source: Once the number of hosts/containers in a deployment reaches a certain size the length of ``no_proxy`` will exceed 1024 characters. It is then mandatory to use the transient proxy settings which only requires a subset of the management network IP addresses to be present in ``no_proxy`` at deployment time.
de: Sobald die Anzahl der Hosts / Container in einer Bereitstellung eine bestimmte Größe erreicht, überschreitet die Länge von ``no_proxy`` 1024 Zeichen. Es ist dann zwingend erforderlich, die transienten Proxy-Einstellungen zu verwenden, die nur eine Teilmenge der IP-Adressen des Verwaltungsnetzwerks benötigen, um zum Zeitpunkt der Bereitstellung in `` no_proxy`` vorhanden zu sein.

source: OpenStack-Ansible allows `Ceph storage <https://ceph.com>`_ cluster integration in two ways:
de: OpenStack-Ansible erlaubt `Ceph storage <https://ceph.com> `_ Cluster-Integration auf zwei Arten:

source: Resolve all role dependencies using the ``ansible-galaxy`` resolver
de: Lösen Sie alle Rollenabhängigkeiten mit dem Resolver ``;ansible-galaxy`` auf

source: See `Setting up apt-get to use a http-proxy`_
de: Siehe `Einrichten von apt-get für die Verwendung eines http-proxy`_

source: The next step is to bootstrap Ansible and the Ansible roles for the development environment. Deployers can customize roles by adding variables to override the defaults in each role (see :ref:`user-overrides`). Run the following to bootstrap Ansible:
de: Der nächste Schritt besteht darin, Ansible und die Ansible-Rollen für die Entwicklungsumgebung zu starten. Deployer können Rollen anpassen, indem sie Variablen hinzufügen, um die Standardwerte in jeder Rolle zu überschreiben (siehe: ref: `user-overrides`). Führen Sie Folgendes zum Bootstrap Ansible aus:

source: To add OpenStack Services over and above the `bootstrap-aio default services`_ for the applicable scenario, copy the ``conf.d`` files with the ``.aio`` file extension into ``/etc/openstack_deploy`` and rename then to ``.yml`` files. For example, in order to enable the OpenStack Telemetry services, execute the following:
de: Um OpenStack Services über die `bootstrap-aio default services`_ für das entsprechende Szenario hinzuzufügen, kopieren Sie die` `conf.d``-Dateien mit der Dateierweiterung` `aio`` nach` `/etc/openstack_deploy`` und benenne sie dann in ``.yml`` -Dateien um. Um beispielsweise die OpenStack Telemetrie-Dienste zu aktivieren, führen Sie Folgendes aus:

source: To add any global overrides, over and above the defaults for the applicable scenario, edit ``/etc/openstack_deploy/user_variables.yml``. See the :deploy_guide:`Deployment Guide <index.html>` for more details.
de: Um globale Überschreibungen hinzuzufügen, die über die Standardwerte für das entsprechende Szenario hinausgehen, bearbeiten Sie ``/etc/openstack_deploy/user_variables.yml``. Siehe: deploy_guide: `Bereitstellungshandbuch <index.html> `für mehr Details.

source: We recommend a set of practices and configuration overrides deployers can use when running OpenStack-Ansible in network environments that block Internet connectivity.
de: Wir empfehlen eine Reihe von Vorgehensweisen und Konfigurations-Overrides, die von den Deployern bei der Ausführung von OpenStack-Ansible in Netzwerkumgebungen verwendet werden können, die die Internetverbindung blockieren.

source: When doing role development it may be useful to set ``ANSIBLE_ROLE_FETCH_MODE`` to ``git-clone``. This will provide you the ability to develop roles within the environment by modifying, patching, or committing changes using an intact git tree while the ``galaxy`` option scrubs the ``.git`` directory when it resolves a dependency.
de: Bei der Rollenentwicklung kann es sinnvoll sein, `` ANSIBLE_ROLE_FETCH_MODE`` auf `` git-clone`` zu setzen. Dies gibt Ihnen die Möglichkeit, Rollen in der Umgebung zu entwickeln, indem Sie Änderungen modifizieren, patchen oder committieren, indem Sie einen intakten Git-Baum verwenden, während die `` galaxy``-Option das `.git``-Verzeichnis scrubbelt, wenn eine Abhängigkeit aufgelöst wird.

source: You may wish to change the role fetch mode. Options are ``galaxy`` and ``git-clone``. The default for this option is ``galaxy``.
de: Möglicherweise möchten Sie den Rollenabrufmodus ändern. Optionen sind `` galaxy`` und `` git-clone``. Der Standardwert für diese Option ist `` galaxy``.

source: lb_vip_address
de: lb_vip_adresse

source: options:
de: Optionen:

source: storage1
de: Speicher1
