Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-contributor.po
Languages: de, id

source: If the bug report contains enough information and you can reproduce it (or it looks valid), then you should set its status to *Confirmed*.
de: Wenn der Fehlerbericht genügend Informationen enthält und Sie ihn reproduzieren können (oder er als gültig erscheint), sollten Sie seinen Status auf *Confirmed* setzen.
id: Jika laporan bug berisi cukup informasi dan Anda dapat memperbanyaknya (atau terlihat valid), maka Anda harus mengatur statusnya *Confirmed*.

source: If the issue is a bug that needs fixing in a branch other than master, please note the associated branch within the launchpad issue.
de: Wenn das Problem ein Fehler ist, der in einem anderen Zweig als Master behoben werden muss, beachten Sie bitte die zugehörige Verzweigung innerhalb des Launchpad-Problems.
id: Jika masalahnya adalah bug yang harus diperbaiki di cabang selain master, harap perhatikan cabang terkait dalam masalah luncur.

source: If the reported needs fixing in a branch in addition to master, add a '\<release\>-backport-potential' tag (e.g. ``liberty-backport-potential``). There are predefined tags that will auto-complete.
de: Wenn das gemeldete Problem in einem Zweig neben dem Master behoben werden muss, fügen Sie ein '\<release\> -backport-potential' hinzu (z.B. ``liberty-backport-potential``). Es gibt vordefinierte Tags, die automatisch vervollständigt werden.
id: Jika kebutuhan yang dilaporkan diperbaiki di cabang selain master, tambahkan tag '<release\>-backport-potential' (misal ``liberty-backport-potential``). Ada tag yang telah ditentukan yang akan otomatis selesai.

source: If you adhere to the pattern of isolating your role's extra deployment requirements (secrets and var files, HAProxy yml fragments, repo_package files, etc.) in their own files it makes it easy for you to automate these additional steps when testing your role.
de: Wenn Sie sich daran halten, die zusätzlichen Bereitstellungsanforderungen Ihrer Rolle (geheime und var-Dateien, HAProxy-XML-Fragmente, Repo-Paketdateien usw.) in ihren eigenen Dateien zu isolieren, können Sie diese zusätzlichen Schritte beim Testen Ihrer Rolle einfach automatisieren.
id: Jika Anda mematuhi pola mengisolasi persyaratan penempatan tambahan peran Anda (rahasia dan file var, fragmen HAProxy yml, file repo_package, dll.) Dalam file mereka sendiri, itu memudahkan Anda untuk mengotomatisasi langkah-langkah tambahan ini saat menguji peran Anda.

source: If you would like to contribute towards a role to introduce an OpenStack or infrastructure service, or to improve an existing role, the OpenStack-Ansible project would welcome that contribution and your assistance in maintaining it.
de: Wenn Sie zu einer Rolle bei der Einführung eines OpenStack- oder Infrastrukturdienstes beitragen oder eine bestehende Rolle verbessern möchten, würde das OpenStack-Ansible-Projekt diesen Beitrag und Ihre Unterstützung bei der Wartung begrüßen.
id: Jika Anda ingin berkontribusi pada peran untuk memperkenalkan OpenStack atau layanan infrastruktur, atau untuk meningkatkan peran yang ada, proyek OpenStack-Ansible akan menyambut kontribusi itu dan bantuan Anda dalam mempertahankannya.

source: If you're looking for some smaller, easier work item to pick up and get started on, search for the 'low-hanging-fruit' tag.
id: Jika Anda mencari item pekerjaan yang lebih kecil dan lebih mudah untuk diambil dan memulai, cari tag 'low-hanging-fruit'.

source: If you're willing to submit code, please remember the following rules:
de: Wenn Sie Code einreichen möchten, beachten Sie bitte die folgenden Regeln:
id: Jika Anda ingin mengirimkan kode, harap ingat aturan berikut:

source: If your service is installed from source or relies on python packages which need to be installed from source, specify a repository for the source code of each requirement by adding a file to your deploy host under ``playbooks/defaults/repo_packages`` in the OpenStack-Ansible source repository and following the pattern of files currently in that directory. You could also simply add an entry to an existing file there. Be sure to run the ``repo-build.yml`` play later so that wheels for your packages will be included in the repository infrastructure.
id: Jika layanan Anda diinstal dari sumber atau bergantung pada paket python yang perlu diinstal dari sumber, tentukan repositori untuk kode sumber dari setiap persyaratan dengan menambahkan file ke host deploy Anda di bawah ``playbooks/defaults/repo_packages`` di OpenStack-Ansible repositori sumber yang dimungkinkan dan mengikuti pola file yang saat ini ada di direktori itu. Anda juga bisa menambahkan entri ke file yang ada di sana. Pastikan untuk menjalankan pemutaran ``repo-build.yml`` nanti sehingga roda (wheel) untuk paket Anda akan dimasukkan dalam infrastruktur repositori.

source: Immediately after official OpenStack-Ansible release:
de: Unmittelbar nach der offiziellen OpenStack-Ansible-Veröffentlichung:
id: Segera setelah rilis resmi OpenStack-Ansible:

source: Implement **developer_mode** to build from a git source into a Python virtual environment.
de: Implementiere **developer_mode**, um von einer Git-Quelle in eine virtuelle Python-Umgebung zu wechseln.
id: Menjalankan **developer_mode** untuk membangun dari sumber git ke lingkungan virtual Python.

source: Implement features
de: Funktionen implementieren
id: Menerapkan fitur

source: Improve testing with tempest
de: Verbessere das Testen mit tempest
id: Tingkatkan pengujian dengan tempest

source: In essence, core reviewers share the following common ideals:
de: Im Wesentlichen teilen die Core Reviewer die folgenden gemeinsamen Ideale:
id: Intinya, pengulas inti berbagi cita-cita umum berikut:

source: In most cases only the following sections should be used for new release notes submitted with patches:
de: In den meisten Fällen sollten nur die folgenden Abschnitte für neue Release Notes verwendet werden, die mit Patches eingereicht wurden:
id: Dalam kebanyakan kasus hanya bagian berikut yang harus digunakan untuk catatan rilis baru yang dikirimkan dengan patch:

source: In other words, `defaults/main.yml` contains variables that are meant to be overridable by a deployer or a continuous integration system. These variables should be limited as much as possible, to avoid increasing the test matrix.
de: Mit anderen Worten, `defaults/main.yml` enthält Variablen, die von einem Deployer oder einem Continuous Integration System überschrieben werden können. Diese Variablen sollten so weit wie möglich begrenzt werden, um eine Erhöhung der Testmatrix zu vermeiden.
id: Dengan kata lain, `defaults/main.yml` berisi variabel-variabel yang dimaksudkan untuk dapat ditimpa oleh seorang deployer atau sistem integrasi berkelanjutan. Variabel-variabel ini harus dibatasi sebanyak mungkin, untuk menghindari peningkatan matriks tes.

source: In this section, you will find documentation relevant to developing OpenStack-Ansible.
de: In diesem Abschnitt finden Sie Dokumentation, die für die Entwicklung von OpenStack-Ansible relevant ist.
id: Di bagian ini, Anda akan menemukan dokumentasi yang relevan dengan pengembangan OpenStack-Ansible.

source: Include historical information on how the problem was identified.
de: Fügen Sie historische Informationen zur Identifizierung des Problems hinzu.
id: Sertakan informasi historis tentang bagaimana masalah itu diidentifikasi.

source: Include your role on the deploy host. See also :ref:`extend_osa_roles`.
de: Schließen Sie Ihre Rolle auf dem Bereitstellungshost ein. Siehe auch :ref:`extend_osa_roles`.
id: Sertakan peran Anda di host penyebaran. Lihat juga :ref:`extend_osa_roles`.

source: Instead, the new code has to be isolated on a separate folder of the `openstack-ansible-ops repo`_.
de: Stattdessen muss der neue Code in einem separaten Ordner des `openstack-ansible-ops repo`_ isoliert werden.
id: Sebaliknya, kode baru harus diisolasi pada folder yang terpisah dari `openstack-ansible-ops repo`_.

source: Integrated repo functional or scenario testing
de: Integriertes Repo-Funktions- oder Szenariotest
id: Repo fungsional atau pengujian skenario terintegrasi

source: Interfacing with other OpenStack teams
de: Schnittstellen zu anderen OpenStack-Teams
id: Berinteraksi dengan tim OpenStack lainnya

source: Is there a bug for it? Can your track if someone else has seen the same bug?
de: Gibt es einen Bug dafür? Kann man Ihren Track verfolgen, wenn jemand anders den gleichen Bug gesehen hat?
id: Apakah ada bug untuk itu? Bisakah Anda melacak jika orang lain melihat bug yang sama?

source: It allows us to not repeat ourselves: it is the location of common playbooks, common tasks and scripts.
de: Es erlaubt uns, uns nicht zu wiederholen: Es ist der Ort von gemeinsamen Playbooks, gemeinsamen Aufgaben und Skripten.
id: Ini memungkinkan kita untuk tidak mengulangi diri kita sendiri: itu adalah lokasi dari buku pedoman umum, tugas umum dan skrip.

source: It must be possible to execute a functional, integrated test which executes a deployment in the same way as a production environment. The test must execute a set of functional tests using Tempest. This is the required last step before a service can remove the experimental warning from the documentation.
de: Es muss möglich sein, einen funktionalen, integrierten Test auszuführen, der eine Bereitstellung auf die gleiche Weise wie eine Produktionsumgebung ausführt. Der Test muss eine Reihe von Funktionstests mit Tempest ausführen. Dies ist der letzte erforderliche Schritt, bevor ein Service die experimentelle Warnung aus der Dokumentation entfernen kann.
id: Harus dimungkinkan untuk melakukan tes fungsional dan terintegrasi yang mengeksekusi penyebaran dengan cara yang sama seperti lingkungan produksi. Tes harus menjalankan serangkaian tes fungsional menggunakan Tempest. Ini adalah langkah terakhir yang diperlukan sebelum layanan dapat menghapus peringatan eksperimental dari dokumentasi.

source: Leave a comment in the OpenStack-Ansible bug report which explains this dependency and leave a link to the blueprint or bug report of the other project you depend on.
de: Hinterlassen Sie einen Kommentar im OpenStack-Ansible-Fehlerbericht, der diese Abhängigkeit erklärt und einen Link zum Blueprint- oder Fehlerbericht des anderen Projekts, auf das Sie angewiesen sind.
id: Tinggalkan komentar di laporan bug OpenStack-Ansible yang menjelaskan ketergantungan ini dan tinggalkan tautan ke cetak biru atau laporan bug dari proyek lain yang Anda andalkan.

source: Mailing lists
de: Mailinglisten
id: Mailing lists (milis)

source: Maintaining accurate, complete, and relevant documentation
de: Pflege einer genauen, vollständigen und relevanten Dokumentation
id: Menjaga dokumentasi yang akurat, lengkap, dan relevan

source: Make any required adjustments to the load balancer configuration (e.g. modify ``inventory/group_vars/all/haproxy.yml`` in the OpenStack-Ansible source repository on your deploy host) so that your service can be reached through a load balancer, if appropriate, and be sure to run the ``haproxy-install.yml`` play later so your changes will be applied. Please note, you can also use ``haproxy_extra_services`` variable if you don't want to provide your service as default for everyone.
de: Nehmen Sie alle erforderlichen Anpassungen an der Load-Balancer-Konfiguration vor (z.B. ändern Sie ``inventory/group_vars/all/haproxy.yml`` im OpenStack-Ansible-Quellenrepository auf Ihrem Bereitstellungshost), damit Ihr Dienst über einen Load Balancer erreicht werden kann Wählen Sie die Option ``haproxy-install.yml``, um die Änderungen zu übernehmen. Bitte beachten Sie, dass Sie auch die Variable ``haproxy_extra_services`` verwenden können, wenn Sie Ihren Service nicht als Standard für alle Benutzer bereitstellen möchten.
id: Buat penyesuaian yang diperlukan untuk konfigurasi penyeimbang beban (misal ubah ``inventory/group_vars/all/haproxy.yml`` di repositori sumber OpenStack-Ansible pada host penyebaran Anda) sehingga layanan Anda dapat dijangkau melalui penyeimbang beban, jika sesuai, dan pastikan untuk menjalankan play ``haproxy-install.yml`` nanti agar perubahan Anda akan diterapkan. Harap dicatat, Anda juga dapat menggunakan variabel `haproxy_extra_services`` jika Anda tidak ingin memberikan layanan Anda sebagai standar untuk semua orang.

source: Master doesn't get frozen, unless explicitly asked for it for release milestones, using the command ``osa releases freeze_roles_for_milestone``
id: Master tidak membeku, kecuali secara eksplisit meminta tonggak rilis, menggunakan perintah ``osa releases freeze_roles_for_milestone``

source: Maturity Matrix
de: Reife-Matrix
id: Maturity Matrix (matriks kematangan)

source: Maturity downgrade procedure
de: Maturity-Downgrade-Verfahren
id: Prosedur penurunan peringkat jatuh tempo

source: Members of the OpenStack-Ansible community should monitor the **OpenStack-discuss** `mailing lists`_.
id: Anggota komunitas OpenStack-Ansible harus memantau **OpenStack-discuss** `mailing lists`_.

source: Members of the core reviewer team are expected to:
de: Von Mitgliedern des Core-Reviewer-Teams wird erwartet:
id: Anggota tim peninjau inti diharapkan untuk:

source: Mentor community contributors in solution design, testing, and the review process
de: Beiträge der Mentor-Community zum Lösungsdesign, Testen und Review-Prozess
id: Kontributor komunitas mentor dalam desain solusi, pengujian, dan proses peninjauan

source: Minimum requirements for OpenStack-Ansible roles
de: Mindestanforderungen für OpenStack-Ansible-Rollen
id: Persyaratan minimum untuk peran yang dimungkinkan OpenStack

source: Minimum supported distributions
de: Minimal unterstützte Distributionen
id: Distribusi minimum yang didukung

source: Modify the tox.ini to add your new scenario. If required, you can override the inventory, and/or the variable files.
de: Ändern Sie die tox.ini, um Ihr neues Szenario hinzuzufügen. Bei Bedarf können Sie das Inventar und/oder die Variablendateien überschreiben.
id: Ubah tox.ini untuk menambahkan skenario baru Anda. Jika diperlukan, Anda dapat mengganti inventaris, dan/atau file variabel.

source: Monitor and participate in OpenStack-Ansible discussions on the mailing list
de: Überwachen und beteiligen Sie sich an OpenStack-Ansible-Diskussionen auf der Mailing-Liste
id: Pantau dan berpartisipasi dalam diskusi OpenStack-Ansible di milis

source: Monitor and participate in-channel at #openstack-ansible
de: Überwachen und beteiligen Sie sich im Channel unter #openstack-ansible
id: Pantau dan berpartisipasi dalam saluran di #openstack-ansible

source: Most OpenStack services will follow a common series of stages to install, configure, or update a service deployment. This is apparent when you review `tasks/main.yml` for existing roles.
de: Die meisten OpenStack-Dienste folgen einer Reihe von Schritten, um eine Servicebereitstellung zu installieren, zu konfigurieren oder zu aktualisieren. Dies wird offensichtlich, wenn Sie `tasks/main.yml` für vorhandene Rollen überprüfen.
id: Sebagian besar layanan OpenStack akan mengikuti serangkaian tahapan umum untuk menginstal, mengkonfigurasi, atau memperbarui penyebaran layanan. Ini terlihat ketika Anda meninjau `tasks/main.yml` untuk peran yang ada.

source: Move bugs that can not be reproduced to an invalid state if they are unmodified for more than a month.
de: Verschieben Sie Fehler, die nicht reproduziert werden können, in einen ungültigen Zustand, wenn sie länger als einen Monat nicht geändert wurden.
id: Pindahkan bug yang tidak dapat direproduksi ke keadaan tidak valid jika tidak dimodifikasi lebih dari sebulan.

source: Move year old `wishlist bugs`_ to Opinion/Wishlist to remove clutter. You can use the following message:
de: Verschieben Sie uralte `wishlist bugs`_ zu Opinion/Wishlist, um Unordnung zu entfernen. Sie können die folgende Nachricht verwenden:
id: Pindahkan `wishlist bugs`_ tahun lalu ke Opinion/Wishlist untuk menghapus kekacauan. Anda dapat menggunakan pesan berikut:

source: New Feature Planning
id: Perencanaan Fitur Baru

source: New features are following a process, explained in the section :ref:`newfeatures`. New features are less likely to be :ref:`backported<backport>` to previous branches.
de: Neue Funktionen folgen einem Prozess, der im Abschnitt :ref:`newfeatures` erläutert wird. Neue Features sind weniger wahrscheinlich :ref:`backported<backport>` zu vorherigen Branches.
id: Fitur baru mengikuti proses, dijelaskan di bagian :ref:`newfeatures`. Fitur baru cenderung menjadi :ref:`backported <backport>` ke branch sebelumnya.

source: New features, breaking changes and other patches of note must include a release note generated using `the reno tool`_. Please see the :ref:`Documentation and Release Note Guidelines<documentation>` for more information.
de: Neue Features, brechende Änderungen und andere Notizfelder müssen eine Release-Note enthalten, die mit dem `the reno tool`_ erzeugt wurde. Bitte beachten Sie die :ref:`Documentation and Release Note Guideline<documentation>` für mehr Informationen.
id: Fitur-fitur baru, memecah perubahan dan tambalan lain dari catatan harus menyertakan catatan rilis yang dihasilkan menggunakan `the reno tool`_. Silakan lihat :ref:`Documentation and Release Note Guidelines<documentation>` untuk informasi lebih lanjut.

source: No. Sometimes it is not even possible because you do not have the resources. Looking at the code and tests often enables you to make an educated guess. Citing your sources in a comment helps the discussion.
de: Nein. Manchmal ist es nicht einmal möglich, weil Sie nicht über die Ressourcen verfügen. Wenn Sie sich den Code und die Tests ansehen, können Sie häufig eine fundierte Vermutung abgeben. Wenn Sie Ihre Quellen in einem Kommentar zitieren, hilft das der Diskussion.
id: Tidak. Terkadang bahkan tidak mungkin karena Anda tidak memiliki sumber daya. Melihat kode dan tes sering memungkinkan Anda untuk membuat dugaan yang berpendidikan (educated guess). Mengutip sumber Anda dalam komentar membantu diskusi.

source: Now, all the functions are separated, and included into a branch independent tooling, `osa_cli_releases`.
id: Sekarang, semua fungsi dipisahkan, dan dimasukkan ke dalam branch independent tooling, `osa_cli_releases`.

source: On top of the normal cycle goals, a contributor can help the OpenStack-Ansible development team by performing one of the following recurring tasks:
de: Zusätzlich zu den normalen Zykluszielen kann ein Mitwirkender dem OpenStack-Ansible-Entwicklungsteam helfen, indem er eine der folgenden wiederkehrenden Aufgaben ausführt:
id: Di atas sasaran siklus normal, kontributor dapat membantu tim pengembangan OpenStack-Ansible dengan melakukan salah satu dari tugas berulang berikut:

source: Once the blueprint work is completed the author(s) can request a backport of the blueprint work into a stable branch. Each backport will be evaluated on a case by case basis with cautious consideration based on how the backport affects any existing deployments. See the :ref:`backport` section for more information.
de: Sobald die Blueprint-Arbeit abgeschlossen ist, können die Autoren einen Backport der Blueprint-Arbeit in einen stabilen Branch anfordern. Jeder Backport wird von Fall zu Fall mit vorsichtiger Abwägung beurteilt, basierend darauf, wie sich der Backport auf vorhandene Bereitstellungen auswirkt. Weitere Informationen finden Sie im Abschnitt :ref:`backport`.
id: Setelah pekerjaan cetak biru (blueprint) selesai penulis dapat meminta backport pekerjaan cetak biru ke branch stabil. Setiap backport akan dievaluasi berdasarkan kasus per kasus dengan pertimbangan yang hati-hati berdasarkan pada bagaimana backport mempengaruhi setiap penyebaran yang ada. Lihat bagian :ref:`backport` untuk informasi lebih lanjut.

source: Once the initial convergence is working and the services are running, the role development should focus on implementing some level of functional testing.
de: Sobald die anfängliche Konvergenz funktioniert und die Dienste ausgeführt werden, sollte sich die Rollenentwicklung auf die Implementierung einiger Funktionstests konzentrieren.
id: Setelah konvergensi awal bekerja dan layanan berjalan, pengembangan peran harus fokus pada penerapan beberapa tingkat pengujian fungsional.

source: Once the initial convergence is working and the services are running, the role development should focus on implementing some level of functional testing. See also :ref:`tempest-testing`.
de: Sobald die anfängliche Konvergenz funktioniert und die Dienste ausgeführt werden, sollte sich die Rollenentwicklung auf die Implementierung einiger Funktionstests konzentrieren. Siehe auch :ref:`tempest-testing`.
id: Setelah konvergensi awal bekerja dan layanan berjalan, pengembangan peran harus fokus pada penerapan beberapa tingkat pengujian fungsional. Lihat juga :ref:`tempest-testing`.

source: Only add a ``zuul.d`` folder when your role is imported into the openstack-ansible namespace.
de: Fügen Sie nur einen ``zuul.d``-Ordner hinzu, wenn Ihre Rolle in den openstack-ansible-Namespace importiert wird.
id: Hanya tambahkan folder ``zuul.d`` ketika peran Anda diimpor ke namespace yang dimungkinkan openstack.

source: OpenStack-Ansible has multiple forms of documentation with different intent.
de: OpenStack-Ansible verfügt über verschiedene Formen der Dokumentation mit unterschiedlichen Absichten.
id: OpenStack-Ansible memiliki berbagai bentuk dokumentasi dengan maksud berbeda.

source: OpenStack-Ansible is not re-inventing the wheel, and tries to reuse as much as possible existing roles. A bugfix for one of those repositories must be handled to these repositories' maintainers.
de: OpenStack-Ansible erfindet das Rad nicht neu und versucht so viele existierende Rollen wie möglich wiederzuverwenden. Ein Bugfix für eines dieser Repositories muss von Betreuern dieser Repositories bearbeitet werden.
id: OpenStack-Ansible tidak menciptakan kembali roda, dan mencoba menggunakan kembali sebanyak mungkin peran yang ada. Perbaikan bug untuk salah satu dari repositori tersebut harus ditangani oleh pengelola repositori ini.

source: OpenStack-Ansible used to bump everything in a single script, which made it hard to maintain, and was very branch specific. It made it hard for users to consume either an update of the upstream shas, or to bump roles with their own pace.
id: OpenStack-Ansible digunakan untuk menabrak (bump) semuanya dalam satu skrip, yang membuatnya sulit untuk dipelihara, dan sangat spesifik untuk branch. Itu membuat sulit bagi pengguna untuk menggunakan update upstream shas, atau untuk menabrak peran dengan kecepatan mereka sendiri.

source: Other OpenStack-Ansible conventions
de: Andere OpenStack-Ansible-Konventionen
id: Konvensi OpenStack-Ansible lainnya

source: Our main repository, used by deployers. Uses the other repositories.
de: Unser Haupt-Repository, das von den Bereitstellern verwendet wird. Verwendet die anderen Repositories.
id: Repositori utama kami, digunakan oleh deployer. Menggunakan repositori lainnya.

source: Our release frequency is discussed in :ref:`reference_release`.
de: Unsere Freigabehäufigkeit wird diskutiert in :ref:`reference_release`.
id: Frekuensi rilis kami dibahas dalam :ref:`reference_release`.

source: Our specifications repository follows the usual OpenStack and OpenStack-Ansible guidelines for submitting code.
de: Unser Spezifikations-Repository folgt den üblichen OpenStack- und OpenStack-Ansible-Richtlinien für die Übermittlung von Code.
id: Repository spesifikasi kami mengikuti pedoman OpenStack dan OpenStack-Ansible yang biasa untuk mengirim kode.

source: Participate in Forum sessions at the OpenStack Summits
de: Teilnahme an Forumveranstaltung auf den OpenStack Summits
id: Berpartisipasi dalam sesi Forum di OpenStack Summits
