Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: de, id

source: Live migrate all instances of the specified host to other hosts if resource utilzation allows. It is best to use shared storage like Ceph or NFS for host evacuation.
de: Live migriert alle Instanzen des angegebenen Hosts auf andere Hosts, wenn die Ressourcennutzung dies zulässt. Es empfiehlt sich, gemeinsam genutzten Speicher wie Ceph oder NFS für die Host-Evakuierung zu verwenden.
id: Live bermigrasi semua instance dari host yang ditentukan ke host lain jika pemanfaatan sumber daya memungkinkan. Cara terbaik adalah menggunakan penyimpanan bersama seperti Ceph atau ZFS untuk evakuasi host.

source: Local versus shared storage
de: Lokaler oder gemeinsam genutzter Speicher
id: Penyimpanan lokal versus bersama

source: Locate the image that will act as the instance base from the **Images** table.
de: Suchen Sie das Abbild, das als Instanzbasis dienen soll, aus der Tabelle **Abbilder**.
id: Cari image yang akan bertindak sebagai basis instance dari tabel **Images**.

source: Log in to any utility container or install the openstack client on your machine, and run the following commands:
de: Melden Sie sich bei einem beliebigen Dienstprogrammcontainer an oder installieren Sie den Openstack-Client auf Ihrem Computer und führen Sie die folgenden Befehle aus:
id: Masuk ke kotak utilitas apa pun atau instal klien openstack di komputer Anda, dan jalankan perintah berikut:

source: Log in to any utility container.
de: Melden Sie sich bei einem beliebigen Dienstprogrammcontainer an.
id: Masuk ke kontainer utilitas apa pun.

source: Log in to the Dashboard.
de: Melden Sie sich am Dashboard an.
id: Log in ke Dasbor.

source: Log in to the Dashboard. Select one of the projects, and click **Instances**.
de: Melden Sie sich am Dashboard an. Wählen Sie eines der Projekte und klicken Sie auf **Instanzen**.
id: Masuk ke Dasbor. Pilih salah satu proyek, dan klik **Instances**.

source: Log into the Dashboard, and select the **Compute** project from the drop down list.
de: Melden Sie sich am Dashboard an und wählen Sie das Projekt **Compute** aus der Dropdown-Liste aus.
id: Log in ke Dasbor, dan pilih proyek **Compute** dari daftar tarik-turun.

source: Login to the 2nd and 3rd node and stop the rabbitmq application.
de: Melden Sie sich am 2. und 3. Knoten an und stoppen Sie die Anwendung rabbitmq.
id: Login ke node ke-2 dan ke-3 dan hentikan aplikasi rabbitmq.

source: Maintenance tasks
de: Wartungsaufgaben
id: Tugas pemeliharaan

source: Major upgrades
de: Wichtige Upgrades
id: Pemutakhiran besar

source: Make a backup of the configuration of the environment:
de: Machen Sie ein Backup der Konfiguration der Umgebung:
id: Buat cadangan dari konfigurasi lingkungan:

source: Make sure you back up your current OpenStack environment before adding any new nodes. See :ref:`backup-restore` for more information.
de: Stellen Sie sicher, dass Sie Ihre aktuelle OpenStack-Umgebung sichern, bevor Sie neue Knoten hinzufügen. Siehe :ref:`backup-restore` für weitere Informationen.
id: Pastikan Anda mencadangkan lingkungan OpenStack Anda saat ini sebelum menambahkan node baru apa pun. Lihat :ref:`backup-restore` untuk informasi lebih lanjut.

source: Managing an instance
de: Verwalten einer Instanz
id: Mengelola sebuah instance

source: Managing images
de: Abbilder verwalten
id: Mengelola images

source: Managing instances
de: Instanzen verwalten
id: Mengelola instance

source: Managing networks
de: Netzwerke verwalten
id: Mengelola jaringan

source: Managing your cloud
de: Verwalten Sie Ihre Cloud
id: Mengelola cloud Anda

source: Manual upgrades are useful for scoping the changes in the upgrade process (for example, in very large deployments with strict SLA requirements), or performing other upgrade automation beyond that provided by OpenStack-Ansible.
de: Manuelle Aktualisierungen sind nützlich, wenn die Änderungen des Aktualisierungsprozesses im Fokus stehen (z.B. in sehr grossen Bereitstellungen mit strikten SLA Anforderungen) oder andere durchgeführte Aktualisierungsautomatisierungen hinter OpenStack-Ansible.
id: Upgrade secara manual berguna untuk membatasi perubahan dalam proses upgrade (misalnya, dalam deployments yang sangat besar dengan persyaratan SLA yang ketat), atau melakukan otomatisasi upgrade lain di luar yang disediakan oleh OpenStack-Ansible.

source: Manually with ``rabbitmqctl``
de: Manuell mit ``rabbitmqctl``
id: Secara manual dengan ``rabbitmqctl``

source: Minor version upgrade
de: Nebenversionsupgrade
id: Pemutakhirkan versi minor

source: Mnesia is a distributed database that RabbitMQ uses to store information about users, exchanges, queues, and bindings. Messages, however are not stored in the database.
de: Mnesia ist eine verteilte Datenbank, in der RabbitMQ Informationen zu Benutzern, Austauschknoten, Warteschlangen und Bindungen speichert. Nachrichten werden jedoch nicht in der Datenbank gespeichert.
id: Mnesia adalah database terdistribusi yang digunakan RabbitMQ untuk menyimpan informasi tentang pengguna, pertukaran, antrian, dan binding. Pesan, namun tidak disimpan dalam database.

source: Modify security groups
de: Ändern Sie Sicherheitsgruppen
id: Ubah grup keamanan

source: Monitoring the status
de: Überwachung des Status
id: Memantau status

source: Monitoring your environment
de: Überwachen Sie Ihre Umgebung
id: Memantau lingkungan Anda

source: MySQL data is available on the infrastructure nodes. You can recover databases, and rebuild the galera cluster. For more information, see :ref:`galera-cluster-recovery`.
de: MySQL-Daten sind auf den Infrastrukturknoten verfügbar. Sie können Datenbanken wiederherstellen und den Galera-Cluster neu erstellen. Weitere Informationen finden Sie unter :ref:`galera-cluster-recovery`.
id: Data MySQL tersedia di node infrastruktur. Anda dapat memulihkan basis data, dan membangun kembali gugus galera. Untuk informasi lebih lanjut, lihat :ref:`galera-cluster-recovery`.

source: MySQL instances are restarted when creating a cluster, when adding a node, when the service is not running, or when changes are made to the ``/etc/mysql/my.cnf`` configuration file.
de: MySQL-Instanzen werden beim Erstellen eines Clusters neu gestartet, wenn ein Knoten hinzugefügt wird, wenn der Dienst nicht ausgeführt wird oder wenn Änderungen an der Konfigurationsdatei ``/etc/mysql/my.cnf`` vorgenommen werden.
id: Instance MySQL di-restart ketika membuat cluster, ketika menambahkan node, ketika layanan tidak berjalan, atau ketika perubahan dilakukan ke file konfigurasi ``/etc/mysql/my.cnf``.

source: Navigate into the ``/etc/openstack_deploy/openstack_user_config.yml`` file.
de: Navigieren Sie in die Datei ``/etc/openstack_deploy/openstack_user_config.yml``.
id: Arahkan ke file ``/etc/openstack_deploy/openstack_user_config.yml``.

source: Navigate to the ``openstack-ansible`` directory.
de: Navigieren Sie zum Verzeichnis ``openstack-ansible``.
id: Arahkan ke direktori ``openstack-ansible``.

source: Network List
de: Netzwerkliste
id: Daftar Jaringan

source: Network interfaces
de: Netzwerk Schnittstellen
id: Antarmuka jaringan

source: Networking
de: Vernetzung
id: Jaringan

source: Networking service
de: Netzwerkdienst
id: Layanan Networking

source: Networking service (compute node)
de: Netzwerkdienst (Rechenknoten)
id: Layanan Networking (node komputasi)

source: New facts will be gathered and cached during the next playbook run.
de: Beim nächsten Playbook-Lauf werden neue Fakten gesammelt und zwischengespeichert.
id: Fakta baru akan dikumpulkan dan di-cache selama menjalankan playbook berikutnya.

source: No:
de: Nein:

source: Note that more than 10 forks will cause issues for any playbooks which use ``delegate_to`` or ``local_action`` in the tasks. It is recommended that the number of forks are not raised when executing against the control plane, as this is where delegation is most often used.
de: Beachten Sie, dass mehr als 10 Forks Probleme bei allen Playbooks verursachen, die ``delegate_to`` oder ``local_action`` in den Aufgaben verwenden. Es wird empfohlen, die Anzahl der Forks bei der Ausführung in der Steuerungsebene nicht zu erhöhen, da hier die Delegierung am häufigsten verwendet wird.
id: Perhatikan bahwa lebih dari 10 fork akan menyebabkan masalah untuk setiap playbook yang menggunakan ``delegate_to`` atau ``local_action`` dalam tugas. Disarankan bahwa jumlah fork tidak dinaikkan saat mengeksekusi terhadap control plane, karena ini adalah tempat delegasi paling sering digunakan.

source: Nova configuration drive implication
de: Nova Konfigurations-Laufwerk Implikation
id: Implikasi drive konfigurasi Nova

source: Nova instances live migration
de: Nova-Instanzen Live-Migration
id: Instance Nova migrasi langsung

source: Nova is capable of live migration instances from one host to a different host to support various operational tasks including:
de: Nova ist in der Lage, Live-Migrationsinstanzen von einem Host zu einem anderen Host zu unterstützen, um verschiedene operative Aufgaben zu unterstützen, darunter:
id: Nova mampu melakukan migrasi langsung dari satu host ke host yang berbeda untuk mendukung berbagai tugas operasional termasuk:

source: Now delete the targeted inventory archive.
de: Löschen Sie jetzt das Zielinventararchiv.
id: Sekarang hapus arsip inventaris yang ditargetkan.

source: Object Storage service
de: Objektspeicherdienst
id: Layanan Object Storage

source: On the Rabbit2 node, execute:
de: Führen Sie auf dem Rabbit2-Knoten Folgendes aus:
id: Pada node Rabbit2, jalankan:

source: On the command line, instance creation is managed with the **openstack server create** command. Before launching an instance, determine what images and flavors are available to create a new instance using the **openstack image list** and **openstack flavor list** commands.
de: In der Befehlszeile wird die Instanzerstellung mit dem Befehl **openstack server create** verwaltet. Bevor Sie eine Instanz starten, bestimmen Sie mithilfe der Befehle **openstack image list** und **openstack flavour list**, welche Abbilder und Varianten verfügbar sind, um eine neue Instanz zu erstellen.
id: Pada command line, pembuatan instance dikelola dengan perintah **openstack server create**. Sebelum meluncurkan sebuah instance, tentukan image dan flavor apa yang tersedia untuk membuat instance baru menggunakan perintah **openstack image list** dan **openstack flavor list**.

source: On the host, all virtual Ethernet devices are named based on their container as well as the name of the interface inside the container:
de: Auf dem Host werden alle virtuellen Ethernet-Geräte anhand ihres Containers sowie des Namens der Schnittstelle im Container benannt:
id: Pada host, semua perangkat Ethernet virtual diberi nama berdasarkan kontainer mereka serta nama antarmuka di dalam kontainer:

source: Once the Compute host comes back online, confirm everything is in working order and start the instances on the host. For example:
de: Sobald der Compute-Host wieder online ist, bestätigen Sie, dass alles in Ordnung ist und starten Sie die Instanzen auf dem Host. Beispielsweise:
id: Setelah Compute hos kembali online, konfirmasi semuanya sudah berfungsi dan mulai instance pada host. Sebagai contoh:

source: Once the live migration request has been accepted, the status can be monitored with the nova client:
de: Sobald die Live-Migrationsanfrage angenommen wurde, kann der Status mit dem Novaclient überwacht werden:
id: Setelah permintaan migrasi langsung diterima, status dapat dipantau dengan klien nova:

source: OpenStack service
de: OpenStack-Dienst
id: Layanan OpenStack

source: OpenStack-Ansible changes the default setting and used a encrypted SSH connection to transfer the instance data.
de: OpenStack-Ansible ändert die Standardeinstellung und verwendet eine verschlüsselte SSH-Verbindung, um die Instanzdaten zu übertragen.
id: OpenStack-Ansible mengubah pengaturan default dan menggunakan koneksi SSH terenkripsi untuk mentransfer data instance.

source: OpenStack-Ansible configuration
de: OpenStack-Ansible-Konfiguration
id: Konfigurasi OpenStack-Ansible

source: OpenStack-Ansible enables fact caching by default. The facts are cached in JSON files within ``/etc/openstack_deploy/ansible_facts``.
de: OpenStack-Ansible aktiviert standardmäßig das Faktcachen. Die Fakten werden in JSON-Dateien in ``/etc/openstack_deploy/ansible_facts`` zwischengespeichert.
id: OpenStack-Ansible memungkinkan caching fakta secara default. Fakta di-cache dalam file JSON di dalam ``/etc/openstack_deploy/ansible_facts``.

source: OpenStack-Ansible maintains a running archive of inventory. If a change has been introduced into the system that has broken inventory or otherwise has caused an unforseen issue, the inventory can be reverted to an early version. The backup file ``/etc/openstack_deploy/backup_openstack_inventory.tar`` contains a set of timestamped inventories that can be restored as needed.
de: OpenStack-Ansible verwaltet ein laufendes Inventararchiv. Wenn eine Änderung in das System eingeführt wurde, die das Inventar beschädigt hat oder auf andere Weise ein unvorhergesehenes Problem verursacht hat, kann das Inventar auf eine frühere Version zurückgesetzt werden. Die Sicherungsdatei ``/etc/openstack_deploy/backup_openstack_inventory.tar`` enthält eine Reihe von zeitgestempelten Inventaren, die bei Bedarf wiederhergestellt werden können.
id: OpenStack-Ansible mengelola arsip inventaris yang berjalan. Jika perubahan telah dimasukkan ke dalam sistem yang telah merusak inventaris atau sebaliknya telah menyebabkan masalah yang tidak terduga, inventaris dapat dikembalikan ke versi awal. File backup ``/etc/openstack_deploy/backup_openstack_inventory.tar`` berisi serangkaian inventaris timestamp yang dapat dipulihkan sesuai kebutuhan.

source: OpenStack-Ansible's group vars conveniently expose the vars outside of the `role scope <https://opendev.org/openstack/openstack-ansible/src/inventory/group_vars/all/all.yml>`_ in case you are relying on the OpenStack-Ansible groups to configure your firewall.
de: Die OpenStack-Ansible Group Vars stellt die Variablen außerhalb von `Rollenziel <https://opendev.org/openstack/openstack-ansible/src/inventory/group_vars/all/all.yml>`_ für den Fall, dass Sie auf die OpenStack-Ansible-Gruppen angewiesen sind, um Ihre Firewall zu konfigurieren.
id: Kelompok vars OpenStack-Ansible dengan mudah mengekspos vars di luar `role scope <https://opendev.org/openstack/openstack-ansible/src/inventory/group_vars/all/all.yml>` _ jika Anda mengandalkan kelompok OpenStack-Ansible untuk mengkonfigurasi firewall Anda.

source: Operational considerations, like compliance, can make it necessary to manage networks. For example, adding new provider networks to the OpenStack-Ansible managed cloud. The following sections are the most common administrative tasks outlined to complete those tasks.
de: Betriebsüberlegungen wie Compliance können die Verwaltung von Netzwerken erforderlich machen. Zum Beispiel das Hinzufügen neuer Provider-Netzwerke zur OpenStack-Ansible Managed Cloud. Die folgenden Abschnitte sind die häufigsten administrativen Aufgaben, die zum Ausführen dieser Aufgaben beschrieben werden.
id: Pertimbangan operasional, seperti kepatuhan, dapat membuatnya perlu untuk mengelola jaringan. Misalnya, menambahkan jaringan penyedia baru ke cloud yang dikelola OpenStack-Ansible. Bagian berikut adalah tugas administratif paling umum yang digariskan untuk menyelesaikan tugas itu.

source: Operations Guide
de: Betriebshandbuch
id: Panduan Operasi

source: Optional
de: Wahlweise

source: Other configurations can be configured inside the ``/etc/openstack_deploy/user_variables.yml`` file:
de: Andere Konfigurationen können in der ``/etc/openstack_deploy/user_variables.yml`` Datei konfiguriert werden:
id: Konfigurasi lain dapat dikonfigurasi di dalam ke ``/etc/openstack_deploy/user_variables.yml``:

source: Other forms of instance migration
de: Andere Formen der Instanzmigration
id: Bentuk lain dari migrasi instance

source: Pause, resume, or suspend the instance
de: Die Instanz pausieren, fortsetzen oder anhalten
id: Jeda, lanjutkan, atau tangguhkan instance

source: Perform the following checks:
de: Führen Sie die folgenden Prüfungen durch:
id: Lakukan pemeriksaan berikut:

source: Please also have a look at `upstream starting a cluster page <https://galeracluster.com/documentation-webpages/startingcluster.html>`_
de: Bitte sehen Sie sich auch `Upstream Starten einer Clusterseite <https://galeracluster.com/documentation-webpages/startingcluster.html>`_
id: Silakan juga melihatnya `upstream starting a cluster page <https://galeracluster.com/documentation-webpages/startingcluster.html>`_

source: Predictable interface naming
de: Vorhersagbare Schnittstellenbenennung
id: Penamaan antarmuka yang dapat diprediksi

source: Preflight checks
de: Preflight Prüfung
id: Pemeriksaan preflight

source: Preliminary troubleshooting questions to answer:
de: Vorläufige Fragen zur Fehlerbehebung:
id: Pertanyaan pemecahan masalah awal untuk dijawab:

source: Prepare the shell variables
de: Bereiten Sie die Shell-Variablen vor
id: Mempersiapkan variabel shell

source: Prerequisites
de: Voraussetzungen
id: Prasyarat

source: Prune Inventory Backup Archive
de: Inventar-Backup-Archiv bereinigen
id: Memangkas Arsip Cadangan Inventaris

source: RabbitMQ and mnesia
de: RabbitMQ und Mnesia
id: RabbitMQ dan mnesia

source: RabbitMQ brokers can tolerate the failure of individual nodes within the cluster. These nodes can start and stop at will as long as they have the ability to reach previously known members at the time of shutdown.
de: RabbitMQ-Broker können den Ausfall einzelner Knoten innerhalb des Clusters tolerieren. Diese Knoten können beliebig starten und stoppen, solange sie zum Zeitpunkt des Herunterfahrens bereits bekannte Elemente erreichen können.
id: Broker RabbitMQ dapat mentoleransi kegagalan node individu dalam cluster. Node ini dapat mulai dan berhenti sesuka hati selama mereka memiliki kemampuan untuk menjangkau anggota yang diketahui sebelumnya pada saat shutdown.

source: RabbitMQ cluster maintenance
de: RabbitMQ-Cluster-Wartung
id: Pemeliharaan klaster RabbitMQ

source: RabbitMQ clusters can be formed in two ways:
de: RabbitMQ-Cluster können auf zwei Arten gebildet werden:
id: Kluster RabbitMQ dapat dibentuk dengan dua cara:

source: RabbitMQ issues
de: RabbitMQ Probleme
id: Isu RabbitMQ

source: RabbitMQ nodes and the CLI tools use an ``erlang cookie`` to determine whether or not they have permission to communicate. The cookie is a string of alphanumeric characters and can be as short or as long as you would like.
de: RabbitMQ-Knoten und die CLI-Tools verwenden einen ``erlang cookie``, um zu bestimmen, ob sie die Erlaubnis zur Kommunikation haben oder nicht. Der Cookie ist eine Zeichenfolge aus alphanumerischen Zeichen und kann so kurz oder so lang sein, wie Sie möchten.
id: Node RabbitMQ dan alat CLI menggunakan ``erlang cookie`` untuk menentukan apakah mereka memiliki izin untuk berkomunikasi atau tidak. Cookie adalah serangkaian karakter alfanumerik dan bisa sesingkat atau selama yang Anda inginkan.

source: Re-launch all instances on the failed node.
de: Starten Sie alle Instanzen auf dem ausgefallenen Knoten neu.
id: Luncurkan ulang semua instance pada node yang gagal.

source: Reboot each instance on the failed node listed in the previous query to regenerate the XML files:
de: Starten Sie jede Instanz für den fehlgeschlagenen Knoten neu, der in der vorherigen Abfrage aufgelistet wurde, um die XML-Dateien neu zu generieren:
id: Reboot setiap instance pada node gagal yang tercantum dalam kueri sebelumnya untuk membuat ulang file XML:

source: Rebuild a container
de: Erstellen Sie einen Container neu
id: Buat kembali sebuah kontainer

source: Rebuild or replace the failed node as described in add-compute-host_.
de: Erneutes Erstellen oder Ersetzen des ausgefallenen Knotens wie in add-compute-host_ beschrieben.
id: Bangun kembali atau ganti node yang gagal seperti yang dijelaskan dalam add-compute-host_.

source: Record the Primary Region output of the ``default_project_id`` for the specified user from the user table in the keystone database:
de: Zeichnen Sie die primäre Region-Ausgabe der ``default_project_id`` für den angegebenen Benutzer aus der Benutzertabelle in der Keystone-Datenbank auf:
id: Rekam output Primary Region dari ``default_project_id`` untuk pengguna yang ditentukan dari tabel pengguna di database keystone:

source: Record the Secondary Region output of the ``default_project_id`` for the specified user from the user table in the keystone database:
de: Zeichnen Sie die Ausgabe der sekundären Region der ``default_project_id`` für den angegebenen Benutzer aus der Benutzertabelle in der Keystone-Datenbank auf:
id: Rekam output Secondary Region dari ``default_project_id`` untuk pengguna yang ditentukan dari tabel pengguna di database keystone:

source: Recover a complete environment failure
de: Wiederherstellen eines vollständigen Umgebungsfehlers
id: Memulihkan kegagalan environment yang lengkap

source: Recover a compute host failure
de: Recover einen Computer-Host-Fehler
id: Memulihkan kegagalan host komputasi

source: Recover a multi-node failure
de: Stellen Sie einen Fehler mit mehreren Knoten wieder her
id: Memulihkan kegagalan multi-node

source: Recover a single-node failure
de: Wiederherstellen eines Einzelknotenfehlers
id: Pulihkan kegagalan single-node

source: Recovering from certain failures require rebuilding one or more containers.
de: Das Wiederherstellen bestimmter Fehler erfordert die Neuerstellung eines oder mehrerer Container.
id: Memulihkan dari kegagalan tertentu memerlukan pembangunan kembali satu atau lebih kontainer.

source: Remove Neutron router ports and DHCP agents:
de: Entfernen Sie die Router-Ports und DHCP-Agenten von Neutron:
id: Hapus port router Neutron dan agen DHCP:

source: Remove a compute host
de: Entfernen Sie einen Computer-Host
id: Hapus host komputasi

source: Remove all Neutron ports from the instances:
de: Entfernen Sie alle Neutron-Ports von den Instanzen:
id: Hapus semua port Neutron dari instance:

source: Remove provider bridges from OpenStack
de: Entfernen Sie Anbieterbrücken von OpenStack
id: Hapus jembatan penyedia (provider bridge) dari OpenStack

source: Remove the Neutron network:
de: Entferne das Neutron-Netzwerk:
id: Hapus jaringan Neutron:

source: Remove the provider network from the ``provider_networks`` configuration of the OpenStack-Ansible configuration ``/etc/openstack_deploy/openstack_user_config.yml`` and re-run the following playbooks:
de: Entfernen Sie das Provider-Netzwerk aus der Konfiguration ``provider_networks`` der OpenStack-Ansible-Konfiguration ``/etc/openstack_deploy/openstack_user_config.yml`` und führen Sie die folgenden Playbooks erneut aus:
id: Hapus jaringan penyedia dari konfigurasi ``provider_networks`` dari konfigurasi OpenStack-Ansible ``/etc/openstack_deploy/openstack_user_config.yml`` dan jalankan kembali playbook berikut:

source: Repair a partitioned RabbitMQ cluster for a multi-node cluster
de: Reparieren Sie einen partitionierten RabbitMQ-Cluster für einen Cluster mit mehreren Knoten
id: Memperbaiki cluster RabbitMQ yang dipartisi untuk cluster multi-node

source: Repair a partitioned RabbitMQ cluster for a single-node
de: Reparieren Sie einen partitionierten RabbitMQ-Cluster für einen einzelnen Knoten
id: Perbaiki klaster RabbitMQ yang dipartisi untuk satu node

source: Replace *``CONTAINER_NAME``* with the target container.
de: Ersetzen Sie *``CONTAINER_NAME``* mit dem Zielcontainer.
id: Ganti *``CONTAINER_NAME``* dengan kontainer target.
