Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-user.po
Languages: de, id, ru

source: Next, we want to secure HAProxy pointing always to the backend which is considered as "local" to the HAProxy. For that we switch balancing algorithm to ``first`` and order re-backends so that the one from current Availability Zone appears to be the first in the list. This can be done by creating file ``/etc/openstack_deploy/group_vars/haproxy/backend_overrides.yml`` with content:
ru: Далее мы хотим обеспечить, чтобы HAProxy всегда указывал на бэкенд, который считается "локальным" для HAProxy. Для этого мы переключаем алгоритм балансировки на ``первый`` и упорядочиваем ре-бэкенды так, чтобы первым в списке оказался тот, который находится в текущей зоне доступности. Это можно сделать, создав файл ``/etc/openstack_deploy/group_vars/haproxy/backend_overrides.yml`` с содержимым:

source: Note however, that this policy will only apply if it is in place before any stream queues are created. If these already exist, they will need to be manually deleted and re-created by the relevant OpenStack service.
ru: Однако следует отметить, что эта политика будет применяться только в том случае, если она установлена ​​до создания очередей потоков. Если они уже существуют, их необходимо вручную удалить и заново создать с помощью соответствующей службы OpenStack.

source: Note that the image metadata prefilter and ImagePropertiesFilter are different and unrelated steps in the process Nova scheduler uses to determine candidate compute hosts. This section explains how to use them together.
ru: Обратите внимание, что image_metadata_prefilter и ImagePropertiesFilter — это разные и не связанные между собой шаги в процессе, который планировщик Nova использует для определения потенциальных вычислительных хостов. В этом разделе объясняется, как использовать их вместе.

source: Notifications
id: Notifikasi
ru: Уведомления

source: Notify communications are an asynchronous exchange from notifier to listener. The messages transferred typically correspond to information updates or event occurrences that are published by an OpenStack service. The listener need not be present when the notification is sent as notify communications are temporally decoupled. This decoupling between notifier and listener requires that the messaging backend deployed for notifications provide message persistence such as a broker queue or log store. It is noteworthy that the message transfer is unidirectional from notifier to listener and there is no message flow back to the notifier.
id: Memberitahu komunikasi adalah pertukaran asinkron dari notifier ke listener. Pesan yang ditransfer biasanya berkaitan dengan pembaruan informasi atau kejadian acara yang diterbitkan oleh layanan OpenStack. Pendengar tidak perlu hadir ketika pemberitahuan dikirim karena pemberitahuan komunikasi dipisahkan sementara. Decoupling antara notifier dan listener ini mensyaratkan bahwa backend perpesanan yang digunakan untuk notifikasi memberikan ketekunan pesan seperti broker queue atau log store. Perlu dicatat bahwa transfer pesan adalah searah dari notifier ke listener dan tidak ada pesan yang mengalir kembali ke notifier.
ru: Уведомления это асинхронный обмен сообщениями от уведомителя к получателю. Передаваемые сообщения обычно содержат информацию об обновлениях или возникновении событий, которые публикуются сервисом OpenStack. Получатель не должен присутствовать, когда сообщение отправляется так как сообщения уведомлений временно отделены. Такое отделение между уведомителем и получателем требует от сервиса обмена хранения сообщений, такого как очередь брокера или хранилище логов. Стоит упомянуть, что передача сообщения от уведомителя получателю однонаправленная и направление сообщений обратно к уведомителю отсутствует.

source: Nova has the capability to allow emulation of one CPU architecture on a host with a different native CPU architecure, see https://docs.openstack.org/nova/latest/admin/hw-emulation-architecture.html for more details.
ru: Nova позволяет эмулировать одну процессорную архитектуру на хосте с другой собственной процессорной архитектурой. Более подробную информацию см. https://docs.openstack.org/nova/latest/admin/hw-emulation-architecture.html

source: Now you can set up Zookeeper as coordination backend for Gnocchi:
id: Sekarang Anda dapat mengatur Zookeeper sebagai backend koordinasi untuk Gnocchi:
ru: Теперь вы можете установить Zookeeper как координирующий сервис для Gnocchi:

source: On this page, we will provide an example configuration that can be used in production environments with multiple Availability Zones.
ru: На этой странице мы предоставим пример конфигурации, которую можно использовать в рабочих окружениях с несколькими зонами доступности.

source: Once all steps above are accomplished, it's time to create our new HAProxy containers. For that run the following command:
ru: После того, как все шаги выше выполнены, пришло время создать наши новые контейнеры HAProxy. Для этого выполните следующую команду:

source: Once an AIO has been deployed, you most likely want to interact with it. You can do this via the web interface or one of the many clients or libraries that exist for OpenStack.
ru: Как только AIO будет развернут, вы наверняка захотите взаимодействовать с ним. Вы всегда можете сделать это с помощью веб интерфейса или одного из доступных клиентов или библиотек, которые существуют для OpenStack.

source: Once groups are defined, you can proceed with configuring `Ceph-Ansible specific vars <https://github.com/ceph/ceph-ansible/blob/master/group_vars/all.yml.sample>`_ in the OpenStack-Ansible ``user_variables.yml`` file.
ru: После определения групп можно приступить к настройке `специфичных для Ceph-Ansible переменных <https://github.com/ceph/ceph-ansible/blob/master/group_vars/all.yml.sample>`_ в файле OpenStack-Ansible ``user_variables.yml``.

source: Once one of these files have been created, you can use it to interact with your deployment using most standard clients and libraries. For example, to list available projects using *openstackclient*:
ru: После создания одного из этих файлов вы можете использовать его для взаимодействия с вашим развертыванием с использованием большинства стандартных клиентов и библиотек. Например, чтобы вывести список доступных проектов с помощью *openstackclient*:

source: Once the number of hosts/containers in a deployment reaches a certain size, the length of ``no_proxy`` will exceed 1024 characters at which point it is mandatory to use the transient proxy settings which only requires a subset of the management network IP addresses to be present in ``no_proxy`` at deployment time.
ru: Как только количество хостов/контейнеров в окружении достигнет определенного размера и длина ``no_proxy`` превысит 1024 символа, в этот момент будет необходимо использовать сквозной прокси, настройки которого требуют только наличия ряда IP адресов управляющей сети в ``no_proxy`` во время развертывания.

source: Once the playbooks have fully executed, it is possible to experiment with various settings changes in ``/etc/openstack_deploy/user_variables.yml`` and only run individual playbooks. For example, to run the playbook for the Keystone service, execute:
de: Sobald die Playbooks vollständig ausgeführt wurden, ist es möglich, mit verschiedenen Einstellungsänderungen in `` /etc/openstack_deploy/user_variables.yml`` zu experimentieren und nur einzelne Playbooks auszuführen. Um beispielsweise das Playbook für den Keystone-Service auszuführen, führen Sie Folgendes aus:
id: Setelah playbook sepenuhnya dieksekusi, adalah mungkin untuk bereksperimen dengan berbagai perubahan pengaturan di ``/etc/openstack_deploy/user_variables.yml`` dan hanya menjalankan playbook individu. Misalnya, untuk menjalankan pedoman untuk layanan Keystone, laksanakan:
ru: Как только выполнение плейбуков завершилось, вы можете экспериментировать с изменением различных настроек в ``/etc/openstack_deploy/user_variables.yml`` и запускать только отдельные плейбуки. Например, для запуска плейбука для сервиса Keystone выполните:

source: Once this is done, configure the ``cacert`` value in the the definition for your cloud in ``clouds.yaml``. For example:
ru: После этого настройте значение ``cacert`` для вашего облака в ``clouds.yaml``. Например:

source: One NFS storage device
de: Ein NFS-Speichergerät
id: Satu perangkat penyimpanan NFS
ru: Одно NFS устройство для данных

source: One Network Interface Card (NIC) for each host
de: Eine Netzwerkkarte (NIC) für jeden Host
id: Satu Network Interface Card (NIC) untuk setiap host
ru: Одна сетевая карта (NIC) для каждого хоста

source: One compute host (8 vCPU, 8 GB RAM, 60 GB HDD)
de: Ein Rechner (8 vCPU, 8 GB RAM, 60 GB HDD)
id: Satu host komputasi (8 vCPU, 8 GB RAM, 60 GB HDD)
ru: Один вычислительный хост (8 vCPU, 8 ГБ оперативной памяти, 60 ГБ HDD)

source: One infrastructure (control plane) host (8 vCPU, 8 GB RAM, 60 GB HDD)
de: Ein Host der Infrastruktur (Kontrollebene) (8 vCPU, 8 GB RAM, 60 GB HDD)
id: Satu host infrastruktur (control plane) (8 vCPU, 8 GB RAM, 60 GB HDD)
ru: Один инфраструктурный (управляющий) хост (8 vCPU, 8 ГБ оперативной памяти, 60 ГБ HDD)

source: One log aggregation host
de: Ein Protokollaggregationshost
id: Satu host agregasi log
ru: Один хост для сбора логов

source: One solution to possible performance problems is to use an incoming measure storage for your gnocchi installation. The `supported storage systems`_ are:
id: Salah satu solusi untuk masalah kinerja yang mungkin terjadi adalah dengan menggunakan penyimpanan ukuran masuk untuk instalasi gnocchi Anda. The `supported storage systems`_ adalah:
ru: Одним из решений возможных проблем с производительностью, является использование хранилища входящих метрик для gnocchi. `Поддерживаемые системы хранилищ`_:

source: Open vSwitch and Linux Bridge
ru: Open vSwitch и Linux Bridge

source: OpenStack-Ansible allows `Ceph storage <https://ceph.io>`_ cluster integration in three ways:
ru: OpenStack-Ansible позволяет интегрировать кластер `Ceph <https://ceph.io>`_ 3-мя различными способами:

source: OpenStack-Ansible builds LXC images using debootstrap or dnf depending on the distribution. In order to override the package repository you might need to adjust some variables, like ``lxc_apt_mirror`` or completely override build command with ``lxc_hosts_container_build_command`` Consult the ``openstack-ansible-lxc_hosts`` role for details on configuration overrides for this scenario.
ru: OpenStack-Ansible собирает образы LXC с помощью debootstrap или dnf в зависимости от дистрибутива. Чтобы переопределить репозиторий пакетов, вам может потребоваться настроить некоторые переменные, например ``lxc_apt_mirror`` или полностью переопределить команду сборки с помощью ``lxc_hosts_container_build_command``. Ознакомьтесь с ролью ``openstack-ansible-lxc_hosts`` для получения подробной информации о переопределении конфигурации для этого сценария.

source: OpenStack-Ansible does not mandate any specific method of configuring network interfaces on the host. You may choose any tool, such as ifupdown, netplan, systemd-networkd, networkmanager or another operating-system specific tool. The only requirement is that a set of functioning network bridges and interfaces are created which match those expected by OpenStack-Ansible, plus any that you choose to specify for neutron physical interfaces.
ru: OpenStack-Ansible не предписывает какой-либо конкретный метод настройки сетевых интерфейсов на хосте. Вы можете выбрать любой инструмент, например ifupdown, netplan, systemd-networkd, networkmanager или другой инструмент, специфичный для операционной системы. Единственное требование — создание набора функционирующих сетевых мостов и интерфейсов, соответствующих ожидаемым OpenStack-Ansible, а также любых, которые вы укажете для физических интерфейсов neutron.

source: OpenStack-Ansible gives you the option of deploying radosgw as a drop-in replacement for native OpenStack Swift.
id: OpenStack-Ansible memberi Anda opsi untuk menyebarkan radosgw sebagai pengganti drop-in untuk OpenStack Swift asli.
ru: OpenStack-Ansible дает вам возможность развертывания radosgw как замены стандартного OpenStack Swift.

source: OpenStack-Ansible provides the ``openstack_openrc`` role for creating these configuration files as well as a number of utilities such as *openstackclient*. If the AIO deployment using the ``lxc`` scenario (the default), these will be availably in the utility container.
ru: OpenStack-Ansible предоставляет роль ``openstack_openrc`` для создания таких конфигурационных файлов для различных утилит, таких как *openstackclient*. Если AIO развертывание использует ``lxc`` сценарий (по умолчанию), они будут доступны в utility контейнере.

source: OpenStack-Ansible provides two distinct mechanisms for configuring proxy server settings:
de: OpenStack-Ansible bietet zwei verschiedene Mechanismen zum Konfigurieren von Proxyservereinstellungen:
id: OpenStack-Ansible menyediakan dua mekanisme berbeda untuk mengonfigurasi pengaturan server proxy:
ru: OpenStack-Ansible предоставляет два различных механизма для настройки прокси сервера:

source: OpenStack-Ansible releases including 2023.1 and later will only install the native architecture `qemu-system-*`` binary so this step should not be required on newer releases.
ru: Выпуски OpenStack-Ansible, включая 2023.1 и более поздние, устанавливают только бинарный файл собственной архитектуры `qemu-system-*``, поэтому этот шаг не требуется в более новых выпусках.

source: OpenStack-Ansible relies upon Ansible Galaxy to download Ansible roles when bootstrapping a deployment host. Deployers may wish to mirror the dependencies that are downloaded by the ``bootstrap-ansible.sh`` script.
de: OpenStack-Ansible basiert darauf, dass Ansible Galaxy Ansible-Rollen beim Bootstrapping eines Bereitstellungshosts herunterlädt. Deployer möchten möglicherweise die Abhängigkeiten spiegeln, die vom `` bootstrap-ansible.sh``-Skript heruntergeladen werden.
id: OpenStack-Ansible mengandalkan Ansible Galaxy untuk mengunduh role Ansible saat bootstrapping a deployment host. Penyebar mungkin ingin mencerminkan dependensi yang diunduh oleh skrip ``bootstrap-ansible.sh``.
ru: OpenStack-Ansible использует Ansible Galaxy для загрузки ролей Ansible при начальной подготовке хоста развертывания. Операторы могут зеркалировать зависимости, которые загружаются при помощи скрипта ``bootstrap-ansible.sh``.

source: OpenStack-Ansible requires several other repositories to install specific components such as Galera and Ceph.
de: OpenStack-Ansible benötigt mehrere andere Repositories, um bestimmte Komponenten wie Galera und Ceph zu installieren.
id: OpenStack-Ansible membutuhkan beberapa repositori lain untuk menginstal komponen tertentu seperti Galera dan Ceph.
ru: OpenStack-Ansible требует несколько дополнительных репозиториев для установки специфичных компонентов, таких как Galera и Ceph.

source: OpenStack-Ansible supports a number of different network architectures, and can be deployed using a single network interface for non-production workloads or using multiple network interfaces or bonded interfaces for production workloads.
id: OpenStack-Ansible mendukung sejumlah arsitektur jaringan yang berbeda, dan dapat digunakan menggunakan antarmuka jaringan tunggal untuk beban kerja non-produksi atau menggunakan beberapa antarmuka jaringan atau antarmuka terikat untuk beban kerja produksi.
ru: OpenStack-Ansible поддерживает несколько различных сетевых архитектур и может произвести развертывание используя один сетевой интерфейс для тестовых окружений, или использовать несколько сетевых интерфейсов, или агрегированные интерфейсы для рабочих окружений.

source: OpenStack-Ansible supports deployments where either the control plane or compute nodes may comprise of several different CPU architectures.
ru: OpenStack-Ansible поддерживает развертывания, в которых либо узлы управления, либо вычислительные узлы могут состоять из нескольких различных архитектур процессора.

source: OpenStack-Ansible supports having compute nodes of multiple architectures deployed in the same environment.
ru: OpenStack-Ansible поддерживает наличие вычислительных серверов различных архитектур в одном окружении.

source: OpenStack-Ansible supports the use of a multiple interfaces or sets of bonded interfaces that carry traffic for OpenStack services and instances.
id: OpenStack-Ansible mendukung penggunaan beberapa antarmuka atau set antarmuka terikat yang membawa lalu lintas untuk layanan dan instance OpenStack.
ru: OpenStack-Ansible поддерживает использование как нескольких интерфейсов так и набора агрегированных интерфейсов для обслуживания трафика сервисов OpenStack и инстансов.

source: OpenStack-Ansible supports the use of a single interface or set of bonded interfaces that carry traffic for OpenStack services as well as instances.
id: OpenStack-Ansible mendukung penggunaan antarmuka tunggal atau serangkaian antarmuka terikat yang membawa lalu lintas untuk layanan OpenStack dan juga instance.
ru: OpenStack-Ansible поддерживает использование как и одиночных интерфейсов так и набора агрегированных интерфейсов для обслуживания трафика сервисов OpenStack также как и инстансов.

source: OpenStack-Ansible uses an ansible role `ansible_role_pki`_ as a general tool to manage and install self-signed and user provided certificates.
ru: OpenStack-Ansible использует роль ansible `ansible_role_pki`_ в качестве общего инструмента для управления и установки самоподписанных и предоставленных пользователями сертификатов.

source: Other OpenStack services
id: Layanan OpenStack lainnya
ru: Другие сервисы OpenStack

source: Other proxy configuration
de: Andere Proxy-Konfiguration
id: Konfigurasi proxy lainnya
ru: Другие настройки прокси

source: Overlay Network
id: Jaringan overlay
ru: Overlay сеть

source: Override Ansible temporary path if LXC containers are used. The ansible connection from the physical host to the LXC container passes environment variables from the host. This means that Ansible attempts to use the same temporary folder in the LXC container as it would on the host, relative to the non-root user ${HOME} directory. This will not exist inside the container and another path must be used instead.
ru: Переопределите временный путь Ansible, если используются контейнеры LXC. Соединение Ansible от физического хоста к контейнеру LXC передает переменные среды с хоста. Это означает, что Ansible пытается использовать ту же временную папку в контейнере LXC, что и на хосте, относительно каталога пользователя без прав root ${HOME}. Он не будет существовать внутри контейнера, и вместо него должен быть использован другой путь.

source: Overriding Ansible version
de: Override Ansible-Version
id: Mengganti versi Ansible
ru: Переопределение версии Ansible

source: Overriding ceph_mons is required only when you are using external cluster which does not present in the OpenStack-Ansible's inventory (ie group ``mon_group_name`` is not defined).
ru: Переопределение ceph_mons требуется только в том случае, если вы используете внешний кластер, которого нет в inventory OpenStack-Ansible (т. е. группа ``mon_group_name`` не определена).

source: Overriding other upstream projects source code
de: Überschreibt den Quellcode anderer Upstream-Projekte
id: Mengganti kode sumber proyek hulu (upstream) lainnya
ru: Переопределение других источников исходного кода проектов

source: Overriding the default Ansible version is not recommended, as each branch of OpenStack-Ansible has been built with the a specific Ansible version in mind, and many Ansible changes are neither backwards nor forward compatible.
de: Das Überschreiben der Standard-Ansible-Version wird nicht empfohlen, da jeder Zweig von OpenStack-Ansible mit der spezifischen Ansible-Version erstellt wurde und viele Änderungen von Ansible weder rückwärts noch vorwärts kompatibel sind.
id: Meng-override versi Ansible default tidak disarankan, karena setiap branch dari OpenStack-Ansible telah dibangun dengan mempertimbangkan versi Ansible yang spesifik, dan banyak perubahan Ansible tidak kompatibel maju ataupun mundur (backwards nor forward)
ru: Переопределение версии Ansible не рекомендуется, так как каждая ветка OpenStack-Ansible создавалась под конкретную версию Ansible, и многие изменения Ansible не имеют ни обратной, ни восходящей совместимости.

source: Overriding the role file has been explained in the reference guide, on the :ref:`extend_osa_roles` section.
de: Das Überschreiben der Rollendatei wurde im Referenzhandbuch im Abschnitt: ref: `extend_osa_roles` erläutert.
id: Mengganti file role telah dijelaskan dalam panduan referensi, pada bagian :ref:`extend_osa_roles`.
ru: Переопределение файла ролей было описано в руководстве по применению, в секции :ref:`extend_osa_roles`.

source: Overriding the roles
de: Überschreiben der Rollen
id: Mengesampingkan role
ru: Переопределение ролей

source: Overview
id: Ikhtisar
ru: Обзор

source: POD 1 Management Network
de: POD 1 Verwaltungsnetzwerk
ru: Управляющая сеть блока 1

source: POD 1 Storage Network
de: POD 1 Speichernetzwerk
ru: Сеть хранилища данных блока 1

source: POD 1 Tunnel (VXLAN) Network
de: POD 1 Tunnel (VXLAN) Netzwerk
ru: Туннелированная (VXLAN) сеть блока 1

source: POD 2 Management Network
de: POD 2 Verwaltungsnetzwerk
ru: Управляющая сеть блока 2

source: POD 2 Storage Network
de: POD 2-Speichernetzwerk
ru: Сеть хранилища данных блока 2

source: POD 2 Tunnel (VXLAN) Network
de: POD 2 Tunnel (VXLAN) Netzwerk
ru: Туннелированная (VXLAN) сеть блока 2

source: POD 3 Management Network
de: POD 3 Verwaltungsnetzwerk
ru: Управляющая сеть блока 3

source: POD 3 Storage Network
de: POD 3 Speichernetzwerk
ru: Сеть хранилища данных блока 3

source: POD 3 Tunnel (VXLAN) Network
de: POD 3 Tunnel (VXLAN) Netzwerk
ru: Туннелированная (VXLAN) сеть блока 3

source: POD 4 Management Network
de: POD 4 Verwaltungsnetzwerk
ru: Управляющая сеть блока 4

source: POD 4 Storage Network
de: POD 4 Speichernetzwerk
ru: Сеть хранилища данных блока 4

source: POD 4 Tunnel (VXLAN) Network
de: POD 4 Tunnel (VXLAN) Netzwerk
ru: Туннелированная (VXLAN) сеть блока 4

source: Path-based endpoints imply serving services on the same FQDN but differentiating them based on URI.
ru: Точки доступа на основе пути подразумевают обслуживание служб на одном и том же полном доменном имени, но дифференциацию их на основе URI.

source: Perform all SSL certificate configuration in ``/etc/openstack_deploy/user_variables.yml`` file. Do not edit the playbooks or roles themselves.
de: Führen Sie die Konfiguration des SSL-Zertifikats in der Datei `` / etc / openstack_deploy / user_variables.yml`` durch. Bearbeiten Sie die Playbooks oder Rollen nicht selbst.
id: Lakukan semua konfigurasi sertifikat SSL dalam file ``/etc/openstack_deploy/user_variables.yml``. Jangan mengedit playbook atau role itu sendiri.
ru: Выполните все настройки SSL сертификатов в файле ``/etc/openstack_deploy/user_variables.yml``. Не редактируйте роли или плейбуки самостоятельно для этого.

source: Performance Tests for Gnocchi
id: Tes Kinerja untuk Gnocchi
ru: Тесты производительности для Gnocchi

source: Permission Policy
ru: Политика предоставления разрешений

source: Please mention, that Internal FQDNs are still going to be covered with self-signed certificates as in most use-cases Let's Encrypt should not be able to verify domain ownership for internal VIPs, unless dns-01 auth is used.
ru: Обратите внимание, что внутренние полные доменные имена по-прежнему будут защищены самоподписанными сертификатами, поскольку в большинстве случаев Let's Encrypt не сможет проверить право собственности на домен для внутренних VIP-адресов, если только не используется аутентификация dns-01.
