Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-user.po
Languages: de, id, ru

source: Static routes are added to allow communication between the Management, Tunnel, and Storage Networks of each pod. The gateway address is the first usable address within each network's subnet.
de: Statische Routen werden hinzugefügt, um die Kommunikation zwischen den Verwaltungs-, Tunnel- und Speichernetzwerken jedes Pods zu ermöglichen. Die Gateway-Adresse ist die erste verwendbare Adresse innerhalb des Subnetzes jedes Netzwerks.
id: Rute statis ditambahkan untuk memungkinkan komunikasi antara Management, Tunnel, dan Storage Network setiap pod. Alamat gateway adalah alamat yang dapat digunakan pertama dalam setiap subnet jaringan.
ru: Добавлены статические маршруты для связи между управляющей сетью, туннелированной сетью и сетью хранилища данных для каждого блока. Адрес шлюза это первый используемый адрес в каждой подсети.

source: Static routes are added to allow communication of provider networks between pods.
de: Statische Routen werden hinzugefügt, um die Kommunikation von Provider-Netzwerken zwischen Pods zu ermöglichen.
id: Rute statis ditambahkan untuk memungkinkan komunikasi jaringan penyedia antar pod.
ru: Статические маршруты добавлены для коммуникации сетей провайдера между блоками.

source: Storage IP
de: Speicher-IP
ru: IP хранилища данных

source: Storage Network
de: Speichernetzwerk
id: Storage Network (jaringan penyimpanan)
ru: Сеть хранилища данных

source: Storage design complications
ru: Сложности проектирования систем хранения

source: Switch port configuration
de: Wechseln Sie die Portkonfiguration
id: Konfigurasi port switch
ru: Настройка порта сетевого коммутатора

source: Switch port configuration example
ru: Пример настройки портов сетевых коммутаторов

source: Systems with traditional hard disks: ~ 90-120 minutes
de: Systeme mit traditionellen Festplatten: ~ 90-120 Minuten
id: Sistem dengan hard disk tradisional: ~ 90-120 menit
ru: Системы с традиционными жесткими дисками: ~90-120 минут

source: TLS for HAProxy Backends
ru: TLS для бекэндов HAProxy

source: TLS for HAProxy Internal VIP
ru: TLS для внутреннего VIP HAProxy

source: TLS for Live Migrations
ru: TLS для живых миграций

source: TLS for VNC
ru: TLS для VNC

source: Take particular care not to regenerate Root or Intermediate certificate authorities in a way that may invalidate existing server certificates in the deployment. It may be preferable to create new Intermediate CA certificates rather than regenerate existing ones in order to maintain existing chains of trust.
ru: Будьте особенно осторожны, чтобы не перегенерировать корневые или промежуточные центры сертификации таким образом, что это может сделать недействительными существующие сертификаты сервера в развертывании. Может быть предпочтительнее создать новые промежуточные сертификаты CA, чем перегенерировать существующие, чтобы сохранить существующие цепочки доверия.

source: Target and deployment hosts can be configured to reach public internet resources via HTTP or SOCKS proxy server(s). OpenStack-Ansible may be used to configure target hosts to use the proxy server(s). OpenStack-Ansible does not provide automation for creating the proxy server(s).
ru: Настройка может быть применена к целевым серверам и хосту развертывания для получения доступа к публичным интернет ресурсам через HTTP или SOCKS прокси сервер(ы). OpenStack-Ansible может быть использован для настройки целевых хостов использовать прокси сервер(ы). OpenStack-Ansible не предоставляет автоматизацию по созданию прокси сервера(ов).

source: Telemetry with Gnocchi, Ceph and Redis example
id: Telemetry dengan contoh Gnocchi, Ceph dan Redis
ru: Пример Telemetry с Gnocchi, Ceph и Redis

source: Test environment example
de: Beispiel für eine Testumgebung
id: Contoh lingkungan uji
ru: Пример тестового окружения

source: Test environment host layout
ru: Схема хоста тестовой среды

source: The CIDRs and VLANs listed for each network are examples and may be different in your environment.
id: CIDR dan VLAN yang terdaftar untuk setiap jaringan adalah contoh dan mungkin berbeda di lingkungan Anda.
ru: Указанные для каждой сети CIDR и VLAN приведены в качестве примера и могут отличаться в вашем окружении.

source: The HAProxy ACL is updated by overriding the variable ``haproxy_map_entries`` inside ``haproxy_security_txt_service``.
ru: Список контроля доступа HAProxy обновляется путем переопределения переменной ``haproxy_map_entries`` внутри ``haproxy_security_txt_service``.

source: The HAProxy ansible role supports using certbot to automatically deploy trusted SSL certificates for the public endpoint. Each HAProxy server will individually request a SSL certificate using certbot.
ru: Роль HAProxy ansible поддерживает использование certbot для автоматического развертывания доверенных сертификатов SSL для публичной точки доступа. Каждый сервер HAProxy будет индивидуально запрашивать сертификат SSL с помощью certbot.

source: The Horizon web interface provides a graphical interface for interacting with the AIO deployment. By default, the Horizon API is available on port 443 of the host (or port 80, if SSL certificate configuration was disabled). As such, to interact with Horizon, simply browse to the IP of the host.
ru: Веб-интерфейс Horizon предоставляет графический интерфейс для взаимодействия с развертыванием AIO. По умолчанию API Horizon доступен на порту 443 хоста (или порту 80, если конфигурация сертификата SSL отключена). Таким образом, для взаимодействия с Horizon просто перейдите на IP-адрес хоста.

source: The OpenStack-Ansible example configurations are designed to be minimal examples and in test or development use-cases will set ``external_lb_vip_address`` to the IP address of the HAProxy external endpoint. For a production deployment it is advised to set ``external_lb_vip_address`` to be the FQDN which resolves via DNS to the IP of the external endpoint.
ru: Примеры конфигураций OpenStack-Ansible разработаны как минимальные примеры и в тестовых или разрабатываемых сценариях использования установят ``external_lb_vip_address`` на IP-адрес внешней точки доступа HAProxy. Для рабочего развертывания рекомендуется установить ``external_lb_vip_address`` на полное доменное имя, которое разрешается через DNS в IP внешней точки доступа.

source: The OpenStack-Ansible reference architecture segments traffic using VLANs across multiple network interfaces or bonds. Common networks used in an OpenStack-Ansible deployment can be observed in the following table:
id: Referensi arsitektur OpenStack-Ansible mengelompokkan lalu lintas menggunakan VLAN di beberapa antarmuka jaringan atau obligasi. Jaringan umum yang digunakan dalam penyebaran OpenStack-Ansible dapat diamati pada tabel berikut:
ru: Эталонная архитектура OpenStack-Ansible разделяет трафик используя VLAN-ы на нескольких сетевых интерфейсах или агрегациях. Стандартные сети, используемые при развертывании OpenStack-Ansible описаны в следующей таблице:

source: The RPC is intended as a synchronous exchange between a client and server that is temporally bracketed. The information transferred typically corresponds to a request-response pattern for service command invocation. If the server is not present at the time the command is invoked, the call should fail. The temporal coupling requires that the messaging backend deployed support the bi-directional transfer of the request from caller to server and the associated reply sent from the server back to the caller. This requirement can be satisfied by a broker queue or a direct messaging backend server.
id: RPC dimaksudkan sebagai pertukaran sinkron antara klien dan server yang sementara diberi tanda kurung. Informasi yang ditransfer biasanya sesuai dengan pola request-response untuk permintaan perintah layanan. Jika server tidak ada pada saat perintah dipanggil, panggilan akan gagal. Penggabungan temporal mensyaratkan bahwa backend pesan yang digunakan mendukung transfer dua arah permintaan dari pemanggil ke server dan balasan terkait yang dikirim dari server kembali ke pemanggil. Persyaratan ini dapat dipenuhi oleh antrian broker atau server backend perpesanan langsung.
ru: RPC предназначался для синхронного обмена между клиентом и сервером, который временно ограничен. Передаваемая информация обычно отвечает паттерну запроса-ответа для вызова команд сервиса. Если сервер отсутствует в момент выполнения команды, вызов должен завершиться ошибкой. Временная связь требует, что бы сервер обмена сообщениями имел поддержку двунаправленной передачи запроса от вызывающего к серверу и связного ответа от сервера обратно к вызывающему. Это требование может быть удовлетворено очередью брокера или прямым обменом сообщениями сервера.

source: The `OpenStack Security Guide`_ recommends providing secure communication between various services in an OpenStack deployment. The OpenStack-Ansible project currently offers the ability to configure SSL certificates for secure communication between services:
de: Das `OpenStack Security Guide`_ empfiehlt die sichere Kommunikation zwischen verschiedenen Diensten in einer OpenStack-Bereitstellung. Das OpenStack-Ansible-Projekt bietet derzeit die Möglichkeit, SSL-Zertifikate für die sichere Kommunikation zwischen Diensten zu konfigurieren:
id: `OpenStack Security Guide`_ merekomendasikan untuk menyediakan komunikasi yang aman antara berbagai layanan dalam penyebaran OpenStack. Proyek OpenStack-Ansible saat ini menawarkan kemampuan untuk mengonfigurasi sertifikat SSL untuk komunikasi aman antara layanan:
ru: `Инструкция по безопасности OpenStack`_ рекомендует использовать защищенное соединение между различными сервисами в окружении OpenStack. Проект OpenStack-Ansible в данный момент предоставляет возможность настройки SSL сертификатов для безопасного взаимодействия между сервисами:

source: The `OpenStack TLS Security Guide`_ recommends that all production deployments use HTTP strict transport security (HSTS).
ru: ` Гид по безопасности OpenStack TLS`_ советует всем окружениям в промышленном использовании использовать HTTP Strict Transport Security (HSTS).

source: The ``/etc/openstack_deploy/openstack_user_config.yml`` file defines the environment layout.
de: Die Datei ``/etc/openstack_deploy/openstack_user_config.yml`` definiert das Umgebungslayout.
id: File ``/etc/openstack_deploy/openstack_user_config.yml`` mendefinisikan tata letak lingkungan.
ru: Файл ``/etc/openstack_deploy/openstack_user_config.yml`` определяет, как будет выглядеть окружение.

source: The ``/etc/openstack_deploy/user_variables.yml`` file defines the global overrides for the default variables.
de: Die Datei ``/etc/openstack_deploy/user_variables.yml`` definiert die globalen Überschreibungen für die Standardvariablen.
id: File ``/etc/openstack_deploy/user_variables.yml`` mendefinisikan global override untuk variabel default.
ru: В файле ``/etc/openstack_deploy/user_variables.yml`` расположены глобальные переопределения стандартных переменных.

source: The ``Content-Security-Policy`` header allows you to control what resources a browser is allowed to load for a given page, which helps to mitigate the risks from Cross-Site Scripting (XSS) and data injection attacks.
ru: Заголовок ``Content-Security-Policy`` позволяет контролировать, какие ресурсы браузеру разрешено загружать для определенной страницы, что помогает снизить риски, связанные с межсайтовым скриптингом (XSS) и атаками с внедрением данных.

source: The ``Management Network``, also referred to as the ``container network``, provides management of and communication between the infrastructure and OpenStack services running in containers or on metal. The ``management network`` uses a dedicated VLAN typically connected to the ``br-mgmt`` bridge, and may also be used as the primary interface used to interact with the server via SSH.
id: ``Management Network``, juga disebut sebagai ``container network``, menyediakan manajemen dan komunikasi antara infrastruktur dan layanan OpenStack yang berjalan dalam container atau pada metal. ``Management network`` menggunakan VLAN khusus yang biasanya terhubung ke jembatan ``br-mgmt``, dan juga dapat digunakan sebagai antarmuka utama yang digunakan untuk berinteraksi dengan server melalui SSH.
ru: ``Сеть управления``, также упоминающаяся как ``сеть контейнеров`` служит для управления и общения между инфраструктурой и сервисами OpenStack, которые запущены как в контейнерах так и без них. ``Сеть управления`` использует выделенный VLAN, обычно подключенный к мосту ``br-mgmt`` и может быть использован как основной интерфейс для взаимодействия с сервером по SSH.

source: The ``Overlay Network``, also referred to as the ``tunnel network``, provides connectivity between hosts for the purpose of tunnelling encapsulated traffic using VXLAN, Geneve, or other protocols. The ``overlay network`` uses a dedicated VLAN typically connected to the ``br-vxlan`` bridge.
ru: ``Overlay сеть``, также называемая ``туннелированная сеть``, обеспечивает связь между хостами с целью туннелирования инкапсулированного трафика с использованием VXLAN, Geneve или других протоколов. ``Overlay сеть`` использует выделенный VLAN, обычно подключенный к мосту ``br-vxlan``.

source: The ``Permissions-Policy`` header allows you to selectively enable, disable or modify the use of browser features and APIs, previously known as Feature Policy.
ru: Заголовок ``Permissions-Policy`` позволяет выборочно включать, отключать или изменять использование функций браузера и API, ранее известный как Feature Policy.

source: The ``Referrer-Policy`` header controls how much referrer information is sent with requests. It defaults to ``same-origin``, which does not send the origin path for cross-origin requests.
ru: Заголовок ``Referrer-Policy`` контролирует, сколько информации о реферере отправляется с запросами. По умолчанию он равен ``same-origin``, что не отправляет путь источника для запросов кросс-источника.

source: The ``Storage Network`` provides segregated access to Block Storage from OpenStack services such as Cinder and Glance. The ``storage network`` uses a dedicated VLAN typically connected to the ``br-storage`` bridge.
id: ``Storage Network`` menyediakan akses terpisah ke Block Storage dari layanan OpenStack seperti Cinder dan Glance. ``Storage network`` menggunakan VLAN khusus yang biasanya terhubung ke jembatan ``br-storage``.
ru: ``Сеть хранилища данных`` предоставляет разделенный доступ к блочному хранилищу с таких сервисов OpenStack, как Cinder и Glance. ``Сеть хранилища данных`` использует выделенный VLAN, обычно подключенный к мосту ``br-storage``.

source: The ``X-Content-Type-Options`` header prevents MIME type sniffing.
ru: Заголовок ``X-Content-Type-Options`` предотвращает перехват типа MIME.

source: The ``ansible-hardening`` role is applicable to physical hosts within an OpenStack-Ansible deployment that are operating as any type of node, infrastructure or compute. By default, the role is enabled. You can disable it by changing the value of the ``apply_security_hardening`` variable in the ``user_variables.yml`` file to ``false``:
de: Die ``ansible-hardening`` -Rolle gilt für physische Hosts innerhalb einer OpenStack-Ansible-Bereitstellung, die als ein beliebiger Typ von Knoten, Infrastruktur oder Computer ausgeführt werden. Standardmäßig ist die Rolle aktiviert. Sie können es deaktivieren, indem Sie den Wert der Variablen `` apply_security_hardening`` in der `` user_variables.yml`` Datei auf `` false`` setzen:
id: Role ``ansible-hardening`` berlaku untuk host fisik dalam penyebaran OpenStack-Ansible yang beroperasi sebagai semua jenis node, infrastruktur, atau komputasi. Secara default, role diaktifkan. Anda dapat menonaktifkannya dengan mengubah nilai variabel ``apply_security_hardening`` dalam file ``user_variables.yml`` menjadi ``false``:
ru: Роль ``ansible-hardening`` применима к физическим хостам любого типа внутри развертывания OpenStack-Ansible - как инфраструктурного, так и вычислительного. По умолчанию роль включена. Вы можете выключить ее установив значение переменной ``apply_security_hardening`` в файле ``user_variables.yml`` в ``false``:

source: The ``bootstrap-ansible.sh`` script installs Ansible, and uses a variable ``ANSIBLE_PACKAGE`` to describe which version to install.
de: Das `` bootstrap-ansible.sh``-Skript installiert Ansible und verwendet eine Variable `` ANSIBLE_PACKAGE``, um zu beschreiben, welche Version installiert werden soll.
id: Skrip ``bootstrap-ansible.sh`` menginstal Ansible, dan menggunakan variabel ``ANSIBLE_PACKAGE`` untuk menjelaskan versi mana yang akan diinstal.
ru: Скрипт ``bootstrap-ansible.sh`` производит установку Ansible и использует переменную ``ANSIBLE_PACKAGE`` для описания версии для установки.

source: The ``container_interface`` parameter is only necessary when Neutron agents are run in containers, and can be excluded in many cases. The ``container_bridge`` and ``container_type`` parameters also relate to infrastructure containers, but should remain defined for legacy purposes.
id: Parameter ``container_interface`` hanya diperlukan ketika agen Neutron dijalankan dalam kontainer, dan dapat dikecualikan dalam banyak kasus. Parameter ``container_bridge`` dan ``container_type`` juga terkait dengan kontainer infrastruktur, tetapi harus tetap ditentukan untuk tujuan legacy.
ru: Параметр ``container_interface`` необходим только когда агенты Neutron запущены в контейнерах и может не указываться в многих случаях. Параметры ``container_bridge`` и ``container_type`` также относятся к инфраструктуре контейнеров, но должны оставаться определенными для обратной совместимости.

source: The ``image_metadata_prefilter`` only looks at the HW_ARCH_XXX traits on compute hosts and finds hardware that matches the required architecture. This only happens when the ``hw_architecture`` property is present on an image, and only if the required traits are manually added to compute hosts.
ru: ``image_metadata_prefilter`` просматривает только признаки HW_ARCH_XXX на вычислительных хостах и ​​находит оборудование, которое соответствует требуемой архитектуре. Это происходит только тогда, когда свойство ``hw_architecture`` присутствует на изображении, и только если требуемые признаки вручную добавлены на вычислительные хосты.

source: The ``image_metadata_prefilter`` setting forces the Nova scheduler to match the ``hw_architecture`` property on Glance images with the corresponding HW_ARCH_XXX trait on compute host resource providers. This ensures that images explicitly tagged with a target architecture get scheduled hosts with a matching architecture.
ru: Настройка ``image_metadata_prefilter`` заставляет планировщик Nova сопоставлять ``hw_architecture`` параметр в образах Glance с соответствующей HW_ARCH_XXX спецификацией для вычислительного хоста в списке провайдеров ресурсов. Это удостоверяет, что образы которые были маркированы целевой архитектурой будут созданы на серверах с совпадающей архитектурой.

source: The ``image_properties_default_architecture`` is used by the ImagePropertiesFilter which examines all the architectures supported by QEMU on each compute host; this includes software emulations of non-native architectures.
ru: ``image_properties_default_architecture`` используется ImagePropertiesFilter, который проверяет все архитектуры, поддерживаемые QEMU на каждом вычислительном хосте; это включает программные эмуляции неродных архитектур.

source: The ``image_properties_default_architecture`` setting would apply in an existing ``x86_64`` architecture cloud where previously ``hw_architecture`` was not set on all Glance images. This avoids the need to retrospectively apply the property for all existing images which may be difficult as users may have their own tooling to create and upload images without applying the required property.
ru: Настройка ``image_properties_default_architecture`` применит существующую ``x86_64`` архитектуру ко всем образам Glance, где архитектура ранее не была задана. Это предотвратит необходимость ретроспективно применять параметры ко всем существующим образам, что может быть трудозатратно для пользователей которые имеют различные инструменты автоматизации без применения данного параметра.

source: The ``py_pkgs lookup`` will ignore all _git_ variables unless the ``_git_repo`` variable is present.
de: Das `` py_pkgs lookup`` ignoriert alle _git_ Variablen, außer die `` git_repo`` Variable ist vorhanden.
id: The ``py_pkgs lookup`` akan mengabaikan variabel all _git_ kecuali variabel ``_git_repo`` ada.
ru: ``py_pkgs lookup`` будет игнорировать все переменные _git_ до тех пор, пока переменная ``_git_repo`` присутствует.

source: The bootstrap script is pre-set to pass the environment variable ``BOOTSTRAP_OPTS`` as an additional option to the bootstrap process. For example, if you wish to set the bootstrap to re-partition a specific secondary storage device (``/dev/sdb``), which will erase all of the data on the device, then execute:
de: Das Bootstrap-Skript ist voreingestellt, um die Umgebungsvariable `` BOOTSTRAP_OPTS`` als zusätzliche Option an den Bootstrap-Prozess zu übergeben. Wenn Sie beispielsweise festlegen möchten, dass der Bootstrap ein bestimmtes sekundäres Speichergerät (``/dev /sdb``) neu partitioniert, wodurch alle Daten auf dem Gerät gelöscht werden, führen Sie Folgendes aus:
id: Skrip bootstrap telah ditetapkan sebelumnya untuk meneruskan variabel lingkungan ``BOOTSTRAP_OPTS`` sebagai opsi tambahan untuk proses bootstrap. Misalnya, jika Anda ingin mengatur bootstrap untuk mempartisi ulang perangkat penyimpanan sekunder khusus (``/dev/sdb``), yang akan menghapus semua data pada perangkat, kemudian jalankan:
ru: Скрипт начальной подготовки настроен на передачу переменной окружения ``BOOTSTRAP_OPTS`` как дополнительного параметра для процесса подготовки. Например, если вы хотите, задать второй диск (``/dev/sdb``) для переразметки при подготовке, которая удалит все данные на данном устройстве, выполните:

source: The custom group can then be specifed when creating a provider network, as shown here:
id: Grup kustom kemudian dapat ditentukan saat membuat jaringan penyedia, seperti yang ditunjukkan di sini:
ru: Пользовательская группа может быть позже определена при создании сети провайдера, как показано ниже:

source: The default OpenStack-Ansible installation configures gnocchi to use a file as storage backend. When you already have a pre-installed ceph, you can use this as backend for gnocchi. This documentation will guide you how to set up gnocchi to use your ceph as storage backend.
ru: Установка OpenStack-Ansible по умолчанию настраивает gnocchi на использование файла в качестве бекэнда хранилища. Если у вас уже есть предустановленный ceph, вы можете использовать его в качестве бекэнда для gnocchi. Эта документация поможет вам настроить gnocchi для использования ceph в качестве бекэнда хранилища.

source: The deployer must decide which of these approaches is more suitable for the target hosts, taking into account the following guidance:
de: Der Deployer muss entscheiden, welcher dieser Ansätze für die Zielhosts besser geeignet ist, wobei folgende Hinweise zu berücksichtigen sind:
id: Penyebar harus memutuskan pendekatan mana yang lebih cocok untuk host target, dengan mempertimbangkan panduan berikut:
ru: Оператор должен решить какой из данных подходов больше подходит для целевых хостов, учитывая следующие рекомендации:

source: The example also deploys HAProxy with Keepalived in their own LXC containers on the contrary to a more conventional bare metal deployment. You can check a :ref:`haproxy-in-lxc` for more details on how to do that.
ru: В примере также развертывается HAProxy с Keepalived в их собственных контейнерах LXC в отличие от более традиционного развертывания на bare metal. Вы можете проверить :ref:`haproxy-in-lxc` для получения более подробной информации о том, как это сделать.
