Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: de, id

source: The affinity value for each container is set at one by default. Adjust the affinity value to zero for situations where the OpenStack services housed within a specific container will not be needed when scaling out other required services.
de: Der Affinitätswert für jeden Container ist standardmäßig auf eins festgelegt. Passen Sie den Affinitätswert für Situationen auf Null an, in denen die OpenStack-Dienste in einem bestimmten Container beim Skalieren anderer erforderlicher Dienste nicht benötigt werden.
id: Nilai afinitas untuk setiap kontainer ditetapkan secara default. Sesuaikan nilai afinitas ke nol untuk situasi di mana layanan OpenStack yang disimpan dalam kontainer tertentu tidak akan diperlukan ketika mengukur layanan lain yang diperlukan.

source: The availability zone in which the image service creates the instance. If no availability zones is defined, no instances will be found. The cloud provider sets the availability zone to a specific value.
de: Die Verfügbarkeitszone, in der der Abbild-Dienst die Instanz erstellt. Wenn keine Verfügbarkeitszonen definiert sind, werden keine Instanzen gefunden. Der Cloud-Anbieter legt die Verfügbarkeitszone auf einen bestimmten Wert fest.
id: Zona ketersediaan tempat layanan image membuat instance. Jika tidak ada zona ketersediaan yang ditentukan, tidak akan ada instance yang ditemukan. Penyedia awan menetapkan zona ketersediaan ke nilai tertentu.

source: The cluster comes back online after completion of this command. If this fails, please review `restarting the cluster`_ and `recovering the primary component`_ in the galera documentation as they're invaluable for a full cluster recovery.
de: Der Cluster kommt zurück nach Ausführung dieses Kommandos. Wenn es fehlschlägt, schauen Sie `restarting the cluster`_ und `recovering the primary component`_ in der Galera Dokumentation, denn sie ist zur Wiederherstellung eines Clusters von unschätzbarem Wert.
id: Cluster kembali online setelah menyelesaikan perintah ini. Jika ini gagal, silakan tinjau `restarting the cluster`_ and `recovering the primary component`_ dalam dokumentasi galera karena mereka tidak ternilai untuk pemulihan cluster penuh.

source: The cookie value is a shared secret and should be protected and kept private.
de: Der Cookie-Wert ist ein gemeinsames Geheimnis und sollte geschützt und privat gehalten werden.
id: Nilai cookie adalah rahasia bersama dan harus dilindungi dan dijaga kerahasiaannya.

source: The default ``MaxSessions`` setting for the OpenSSH Daemon is 10. Each Ansible fork makes use of a session. By default, Ansible sets the number of forks to 5. However, you can increase the number of forks used in order to improve deployment performance in large environments.
de: Die Standardeinstellung für ``MaxSessions`` für den OpenSSH-Daemon ist 10. Jeder Ansible-Fork verwendet eine Sitzung. Standardmäßig legt Ansible die Anzahl der Forks auf 5 fest. Sie können jedoch die Anzahl der verwendeten Forks erhöhen, um die Bereitstellungsleistung in großen Umgebungen zu verbessern.
id: Pengaturan ``MaxSessions`` default untuk OpenSSH Daemon adalah 10. Setiap fork Ansible memanfaatkan sesi. Secara default, Ansible menetapkan jumlah fork menjadi 5. Namun, Anda dapat meningkatkan jumlah fork yang digunakan untuk meningkatkan kinerja penerapan di lingkungan yang besar.

source: The default location of the cookie on ``*nix`` environments is ``/var/lib/rabbitmq/.erlang.cookie`` or in ``$HOME/.erlang.cookie``.
de: Der Standardspeicherort des Cookies in ``*nix`` Umgebungen ist ``/var/lib/rabbitmq/.erlang.cookie`` oder in ``HOME/.erlang.cookie``.
id: Lokasi default dari cookie pada lingkungan ``/var/lib/rabbitmq/.erlang.cookie`` atau di ``$HOME/.erlang.cookie``.

source: The difference is that the cluster status section of the output, both nodes are now grouped together:
de: Der Unterschied besteht darin, dass der Clusterstatusabschnitt der Ausgabe beide Knoten jetzt zusammen gruppiert:
id: Perbedaannya adalah bahwa bagian status klaster dari output, kedua node sekarang dikelompokkan bersama:

source: The first will just remove the container but leave the data in the bind mounts and logs. The second will remove the data in the bind mounts and logs too.
de: Die erste wird nur den Container entfernen, aber die Daten in den Bind-Mounts und -Logs belassen. Die zweite wird die Daten in den Bind-Mounts und -Logs ebenfalls entfernen.
id: Yang pertama hanya akan menghapus kontainer tetapi meninggalkan data di bind mounts dan log. Yang kedua akan menghapus data di bind mounts dan juga log.

source: The following example shows how to move a file from your deployment host to the ``/tmp`` directory on a set of remote machines:
de: Das folgende Beispiel zeigt, wie Sie eine Datei von Ihrem Deployment-Host in das Verzeichnis ``/tmp`` auf einer Gruppe entfernter Maschinen verschieben:
id: Contoh berikut menunjukkan cara memindahkan file dari host penyebaran Anda ke direktori ``/tmp`` pada satu set mesin remote:

source: The following examples shows the :file:`nova-compute.log` file being pulled from a single Compute host:
de: Die folgenden Beispiele zeigen die Datei :file:`nova-compute.log`, die von einem einzelnen Compute-Host abgerufen wird:
id: Contoh berikut menunjukkan file :file:`nova-compute.log` ditarik dari satu host Compute:

source: The following nova client commands are provided:
de: Die folgenden nova-Client-Befehle werden bereitgestellt:
id: Perintah klien nova berikut disediakan:

source: The following procedure addresses Compute node failure if shared storage is used.
de: Die folgende Prozedur behandelt Compute-Knotenfehler, wenn gemeinsam genutzter Speicher verwendet wird.
id: Prosedur berikut membahas kegagalan simpul Node jika penyimpanan bersama digunakan.

source: The following table lists the commands to restart an OpenStack service.
de: In der folgenden Tabelle sind die Befehle zum Neustart eines OpenStack-Dienstes aufgeführt.
id: Tabel berikut mencantumkan perintah untuk memulai kembali (restart) layanan OpenStack.

source: The instance will boot from the selected image. This option will be pre-populated with the instance selected from the table. However, choose ``Boot from Snapshot`` in **Instance Boot Source**, and it will default to ``Snapshot`` instead.
de: Die Instanz startet von dem ausgewählten Abbild. Diese Option wird mit der aus der Tabelle ausgewählten Instanz vorbelegt. Wählen Sie jedoch ``Boot from Snapshot`` in **Instance Boot Source** und stattdessen ``Snapshot``.
id: Instance akan boot dari image yang dipilih. Opsi ini akan terisi sebelumnya dengan instance yang dipilih dari tabel. Namun, pilih ``Boot from Snapshot`` di **Instance Boot Source**, dan itu akan menjadi default untuk ``Snapshot`` sebagai gantinya.

source: The inventory backup archive will require maintenance over a long enough period of time.
de: Das Inventar-Backup-Archiv muss über einen ausreichend langen Zeitraum gewartet werden.
id: Arsip cadangan inventaris akan membutuhkan perawatan selama jangka waktu yang cukup lama.

source: The live migration is accessible via the nova client.
de: Die Livemigration ist über den nova-Client zugänglich.
id: Migrasi langsung dapat diakses melalui klien nova.

source: The lxc_hosts host group must be included as the playbook and roles executed require the use of facts from the hosts.
de: Die Hostgruppe lxc_hosts muss als Playbook enthalten sein, und die ausgeführten Rollen erfordern die Verwendung von Fakten von den Hosts.
id: Grup host lxc_hosts harus dimasukkan karena playbook dan peran yang dijalankan memerlukan penggunaan fakta dari host.

source: The name of the new instance, which becomes the initial host name of the server. If the server name is changed in the API or directly changed, the Dashboard names remain unchanged
de: Der Name der neuen Instanz, die zum anfänglichen Hostnamen des Servers wird. Wenn der Servername in der API geändert oder direkt geändert wird, bleiben die Dashboard-Namen unverändert
id: Nama instance baru, yang menjadi nama host awal server. Jika nama server diubah dalam API atau langsung diubah, nama Dasbor tetap tidak berubah

source: The new container runs a single-node Galera cluster, which is a dangerous state because the environment contains more than one active database with potentially different data.
de: Der neue Container führt einen Galera-Cluster mit einem einzelnen Knoten aus. Dies ist ein gefährlicher Zustand, da die Umgebung mehr als eine aktive Datenbank mit möglicherweise unterschiedlichen Daten enthält.
id: Kontainer baru menjalankan kluster single-node Galera, yang merupakan keadaan berbahaya karena environment berisi lebih dari satu database aktif dengan data yang berpotensi berbeda.

source: The number of forks used may be changed on a permanent basis by including the appropriate change to the ``ANSIBLE_FORKS`` in your ``.bashrc`` file. Alternatively it can be changed for a particular playbook execution by using the ``--forks`` CLI parameter. For example, the following executes the nova playbook against the control plane with 10 forks, then against the compute nodes with 50 forks.
de: Die Anzahl der verwendeten Forks kann permanent geändert werden, indem die entsprechende Änderung an den ``ANSIBLE_FORKS`` in Ihrer Datei ``.bashrc`` vorgenommen wird. Alternativ kann es für eine bestimmte Playbook-Ausführung geändert werden, indem der CLI-Parameter ``--forks`` verwendet wird. Das folgende Beispiel führt das Nova-Playbook gegen die Kontrollebene mit 10 Forks und dann gegen die Rechenknoten mit 50 Forks aus.
id: Jumlah fork yang digunakan dapat diubah secara permanen dengan memasukkan perubahan yang sesuai ke ``ANSIBLE_FORKS`` dalam file ``.bashrc`` Anda. Alternatifnya dapat diubah untuk eksekusi playbook tertentu dengan menggunakan parameter CLI ``--forks``. Sebagai contoh, berikut ini mengeksekusi nova playbook terhadap control plane dengan 10 fork, kemudian terhadap node komputasi dengan 50 fork.

source: The playbook restarts all other containers on the node.
de: Das Playbook startet alle anderen Container auf dem Knoten neu.
id: Playbook ini me-restart semua kontainer lain di node.

source: The process will take less than a minute to complete. Instance creation is complete when the status is listed as active. Refresh the page to see the new active instance.
de: Der Vorgang dauert weniger als eine Minute. Die Instanzerstellung ist abgeschlossen, wenn der Status als aktiv aufgeführt ist. Aktualisieren Sie die Seite, um die neue aktive Instanz zu sehen.
id: Prosesnya akan memakan waktu kurang dari satu menit untuk selesai. Pembuatan instance selesai ketika status terdaftar sebagai aktif. Segarkan halaman untuk melihat instance aktif baru.

source: The remaining operational node becomes the primary node and begins processing SQL requests.
de: Der verbleibende operative Knoten wird zum primären Knoten und beginnt mit der Verarbeitung von SQL-Anfragen.
id: Node operasi yang tersisa menjadi simpul utama dan mulai memproses permintaan SQL.

source: The same concepts apply to a multi-node cluster that exist in a single-node cluster. The only difference is that the various nodes will actually be running on different hosts. The key things to keep in mind when dealing with a multi-node cluster are:
de: Die gleichen Konzepte gelten für einen Cluster mit mehreren Knoten, der in einem Cluster mit einem einzelnen Knoten vorhanden ist. Der einzige Unterschied besteht darin, dass die verschiedenen Knoten tatsächlich auf verschiedenen Hosts ausgeführt werden. Die wichtigsten Punkte, die Sie bei einem Multi-Node-Cluster beachten sollten, sind:
id: Konsep yang sama berlaku untuk cluster multi-node yang ada di cluster node tunggal. Satu-satunya perbedaan adalah bahwa berbagai node sebenarnya akan berjalan pada host yang berbeda. Hal utama yang perlu diingat ketika berhadapan dengan multi-node cluster adalah:

source: The steps detailed here match those performed by the ``run-upgrade.sh`` script. You can safely run these steps multiple times.
de: Die hier aufgeführten Schritte stimmen mit denen überein, die das Skript `` run-upgrade.sh`` ausführt. Sie können diese Schritte mehrmals sicher ausführen.
id: Langkah-langkah yang dijelaskan di sini cocok dengan yang dilakukan oleh skrip ``run-upgrade.sh``. Anda dapat dengan aman menjalankan langkah-langkah ini beberapa kali.

source: The two most common modules used are the ``shell`` and ``copy`` modules. The ``shell`` module takes the command name followed by a list of space delimited arguments. It is almost like the command module, but runs the command through a shell (``/bin/sh``) on the remote node.
de: Die zwei am häufigsten verwendeten Module sind die ``shell`` und ``copy``-Module. Das ``shell``-Modul übernimmt den Befehlsnamen, gefolgt von einer Liste von durch Leerzeichen getrennten Argumenten. Es ist fast wie das Befehlsmodul, aber führt den Befehl durch eine Shell (``/bin/sh``) auf dem Remote-Knoten.
id: Dua modul yang paling umum digunakan adalah modul ``shell`` dan ``copy``. Modul ``shell`` akan mengambil nama perintah diikuti dengan daftar space delimited argument. Ini hampir seperti modul perintah, tetapi menjalankan perintah melalui shell (``/bin/sh``) pada node remote.

source: The type of container format, one of ``ami``, ``ari``, ``aki``, ``bare``, or ``ovf``
de: Die Art des Containerformats, eines von ``ami``, ``ari``, ``aki``, ``blank`` oder ``ovf``
id: Jenis format kontainer, salah satunya ``ami``, ``ari``, ``aki``, ``bare``, atau ``ovf``

source: The user in the Secondary Region now has access to objects PUT in the Primary Region. The Secondary Region can PUT objects accessible by the user in the Primary Region.
de: Der Benutzer in der sekundären Region hat nun Zugriff auf Objekte PUT in der primären Region. Die sekundäre Region kann Objekte, auf die der Benutzer in der primären Region zugreifen kann, auf PUT stellen.
id: Pengguna di Secondary Region sekarang memiliki akses ke objek PUT di Primary Region. Secondary Region dapat PUT objek yang dapat diakses oleh pengguna di Primary Region.

source: The user is ``admin`` in this example.
de: Der Benutzer ist in diesem Beispiel ``admin``.
id: Pengguna adalah ``admin`` dalam contoh ini.

source: The utility container provides a CLI environment for additional configuration and management.
de: Der Dienstprogrammcontainer stellt eine CLI-Umgebung für zusätzliche Konfiguration und Verwaltung bereit.
id: Kontainer utilitas menyediakan lingkungan CLI untuk konfigurasi dan manajemen tambahan.

source: The utility container provides a CLI environment for additional configuration and testing.
de: Der Dienstprogrammcontainer stellt eine CLI-Umgebung für zusätzliche Konfiguration und Tests bereit.
id: Kontainer utilitas menyediakan lingkungan CLI untuk konfigurasi dan pengujian tambahan.

source: The vCPU, Memory, and Disk configuration. Note that larger flavors can take a long time to create. If creating an instance for the first time and want something small with which to test, select ``m1.small``.
de: Die vCPU-, Speicher- und Festplattenkonfiguration. Beachten Sie, dass die Erstellung größerer Varianten lange dauern kann. Wenn Sie eine Instanz zum ersten Mal erstellen und etwas Kleines zum Testen möchten, wählen Sie ``m1.small``.
id: Konfigurasi vCPU, Memory, dan Disk. Perhatikan bahwa flavor yang lebih besar dapat membutuhkan waktu lama untuk dibuat. Jika membuat instance untuk pertama kalinya dan menginginkan sesuatu yang kecil untuk diuji, pilih ``m1.small``.

source: The |current_release_formal_name| release series of OpenStack-Ansible contains the code for migrating from |previous_release_formal_name| to |current_release_formal_name|.
de: Der |current_release_formal_name| Release-Reihe von OpenStack-Ansible enthält den Code für die Migration von |previous_release_formal_name| zu |current_release_formal_name|.
id: The |current_release_formal_name| seri rilis OpenStack-Ansible berisi kode untuk bermigrasi dari |previous_release_formal_name| ke |current_release_formal_name|.

source: Then update the neutron configuration.
de: Aktualisieren Sie dann die Neutron-Konfiguration.
id: Kemudian perbarui konfigurasi neutron.

source: Then update your compute nodes if necessary.
de: Aktualisieren Sie dann ggf. Ihre Compute-Knoten.
id: Kemudian perbarui node komputasi Anda jika perlu.

source: There are two types of nodes you can configure: disk and RAM nodes. Most commonly, you will use your nodes as disk nodes (preferred). Whereas RAM nodes are more of a special configuration used in performance clusters.
de: Es gibt zwei Arten von Knoten, die Sie konfigurieren können: Festplatten- und RAM-Knoten. In den meisten Fällen werden Sie Ihre Knoten als Festplattenknoten verwenden (bevorzugt). Während RAM-Knoten eher eine spezielle Konfiguration in Performance-Clustern sind.
id: Ada dua jenis node yang dapat Anda konfigurasi: node disk dan RAM. Paling umum, Anda akan menggunakan node Anda sebagai node disk (lebih disukai). Sedangkan node RAM lebih dari konfigurasi khusus yang digunakan dalam kelompok kinerja.

source: There is currently an Ansible bug in regards to ``HOSTNAME``. If the host ``.bashrc`` holds a var named ``HOSTNAME``, the container where the ``lxc_container`` module attaches will inherit this var and potentially set the wrong ``$HOSTNAME``. See `the Ansible fix <https://github.com/ansible/ansible/pull/22246>`_ which will be released in Ansible version 2.3.
de: Zur Zeit gibt es einen Ansible Bug in Bezug auf ``HOSTNAME``. Wenn die Host ``.bashrc`` eine Variable mit dem Namen ``HOSTNAME`` enthält, erbt der Container, an den das ``lxc_container``- Modul angehängt wird, diese Variable und setzt möglicherweise den falschen ``$HOSTNAME``. Siehe `the Ansible fix <https://github.com/ansible/ansible/pull/22246>`_ wird in Ansible Version 2.3 veröffentlicht.
id: Saat ini ada bug Ansible dalam hal ``HOSTNAME``. Jika host ``.bashrc`` menyimpan var bernama ``HOSTNAME``, penampung dimana modul `lxc_container` 'menempel akan mewarisi var ini dan berpotensi menyetel ``$HOSTNAME`` yang salah. Lihat `the Ansible fix <https://github.com/ansible/ansible/pull/22246>`_ yang akan dirilis dalam Ansible versi 2.3.

source: These instructions assume an OpenStack-Ansible installation using LXC containers, VXLAN overlay, and the Linuxbridge ml2 driver.
de: Diese Anweisungen gehen von einer OpenStack-Ansible-Installation mit LXC-Containern, VXLAN-Overlay und dem Linuxbridge ml2-Treiber aus.
id: Instruksi ini mengasumsikan instalasi OpenStack-Ansible menggunakan kontainer LXC, overlay VXLAN, dan driver Linuxbridge ml2.

source: This can also be done with the help of ansible using the shell module:
de: Dies kann auch mit Hilfe von ansible mit dem Shell-Modul erfolgen:
id: Ini juga bisa dilakukan dengan bantuan ansible menggunakan modul shell:

source: This can be accomplished with multiple commands:
de: Dies kann mit mehreren Befehlen erreicht werden:
id: Ini dapat diselesaikan dengan beberapa perintah:

source: This can lead to unexpected errors while running playbooks, and require cached facts to be regenerated.
de: Dies kann zu unerwarteten Fehlern beim Ausführen von Playbooks führen und erfordert, dass zwischengespeicherte Fakten neu generiert werden.
id: Ini dapat menyebabkan kesalahan yang tidak terduga saat menjalankan playbooks, dan membutuhkan fakta cache untuk diregenerasi.

source: This chapter describes how to create and access instances.
de: In diesem Kapitel wird beschrieben, wie Sie Instanzen erstellen und darauf zugreifen.
id: Bab ini menjelaskan cara membuat dan mengakses instance.

source: This chapter goes through the verification steps for a basic operation of the OpenStack API and dashboard, as an administrator.
de: In diesem Kapitel werden die Verifizierungsschritte für eine grundlegende Operation der OpenStack-API und des Dashboards als Administrator erläutert.
id: Bab ini membahas langkah-langkah verifikasi untuk operasi dasar OpenStack API dan dasbor, sebagai administrator.

source: This chapter is intended for OpenStack-Ansible specific maintenance tasks.
de: Dieses Kapitel ist für OpenStack-spezifische Wartungsaufgaben gedacht.
id: Bab ini ditujukan untuk tugas pemeliharaan khusus OpenStack-Ansible.

source: This chapter is intended to document OpenStack operations tasks that are integral to the operations support in an OpenStack-Ansible deployment.
de: In diesem Kapitel werden OpenStack-Vorgangsaufgaben dokumentiert, die für die Operationsunterstützung in einer OpenStack-Ansible-Bereitstellung von wesentlicher Bedeutung sind.
id: Bab ini dimaksudkan untuk mendokumentasikan tugas operasi OpenStack yang merupakan bagian integral dari dukungan operasi dalam penyebaran OpenStack-Ansible.

source: This chapter is intended to document basic OpenStack operations to verify your OpenStack-Ansible deployment.
de: In diesem Kapitel werden grundlegende OpenStack-Vorgänge zur Überprüfung der OpenStack-Ansible-Bereitstellung dokumentiert.
id: Bab ini dimaksudkan untuk mendokumentasikan operasi OpenStack dasar untuk memverifikasi penerapan OpenStack-Ansible Anda.

source: This chapter is intended to help troubleshoot and resolve operational issues in an OpenStack-Ansible deployment.
de: Dieses Kapitel soll zur Untersuchung und Behebung von Betriebsproblemen in einer OpenStack-Ansible-Bereitstellung beitragen.
id: Bab ini dimaksudkan untuk membantu memecahkan masalah dan menyelesaikan masalah operasional dalam penerapan OpenStack-Ansible.

source: This command is similar to host evacuation but migrates all instances off the specified host while they are shutdown.
de: Dieser Befehl ähnelt der Host-Evakuierung, migriert jedoch alle Instanzen vom angegebenen Host, während sie heruntergefahren werden.
id: Perintah ini mirip dengan meng-host evakuasi tetapi memindahkan semua instance dari host yang ditentukan saat mereka shutdown.

source: This command results in a cluster containing a single node. The ``wsrep_cluster_size`` value shows the number of nodes in the cluster.
de: Dieser Befehl führt zu einem Cluster, das einen einzelnen Knoten enthält. Der Wert ``wsrep_cluster_size`` gibt die Anzahl der Knoten im Cluster an.
id: Perintah ini menghasilkan kluster yang berisi single node. Nilai ``wsrep_cluster_size`` menunjukkan jumlah node dalam kluster.

source: This does not cover any networking related to instance connectivity.
de: Dies gilt nicht für die Vernetzung von Instanzkonnektivität.
id: Ini tidak mencakup jaringan apa pun yang terkait dengan konektivitas instance.

source: This example will issue a reboot to the container named with ``neutron_agents_container_hostname_name`` from inside:
de: In diesem Beispiel wird der Container mit dem Namen ``neutron_agents_container_hostname_name`` von innen gestartet:
id: Contoh ini akan mengeluarkan reboot ke kontainer yang bernama dengan ``neutron_agents_container_hostname_name`` dari dalam:
