Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-user.po
Languages: de, id, ru

source: In particular, the ``ceph-rgw-install.yml`` playbook (which includes ``ceph-rgw-keystone-setup.yml``) will deploy radosgw to any ``ceph-rgw`` hosts, and create a corresponding Keystone ``object-store`` service catalog entry. The service endpoints do contain the ``AUTH_%(tenant_id)s`` prefix just like in native Swift, so public read ACLs and temp URLs will work just like they do in Swift.
id: Secara khusus, playbook ``ceph-rgw-install.yml`` (yang mencakup ``ceph-rgw-keystone-setup.yml``) akan menyebarkan radosgw ke host ``ceph-rgw`` apa pun, dan membuat entri katalog layanan Keystone ``object-store`` yang sesuai. Endpoint layanan memang berisi awalan ``AUTH_%(tenant_id)s`` seperti di Swift asli, jadi ACL yang dibaca publik dan URL temp akan berfungsi sama seperti yang ada di Swift.
ru: В частности, плейбук ``ceph-rgw-install.yml`` (который включает в себя ``ceph-rgw-keystone-setup.yml``) произведет развертывание radosgw на каждый ``ceph-rgw`` хост, и создаст соответствующую ``object-store`` запись в каталог сервисов Keystone. Точки входа сервиса будут содержать префикс ``AUTH_%(tenant_id)s``, как и в стандартном Swift, так что ACL для публичного чтения и временные URL будут работать точно также, как они работали и со Swift.

source: In some cases you may need to change the HAProxy ACL used to redirect requests to the ``security.txt`` file, such as adding extra domains.
ru: В некоторых случаях вам может потребоваться изменить ACL HAProxy, используемый для перенаправления запросов в файл ``security.txt``, например, добавить дополнительные домены.

source: In the scenario below only Network node is connected to external network and computes do not have external connectivity, so routers are needed for external connectivity:
ru: В приведенном ниже сценарии к внешней сети подключен только сетевой узел, а вычислительные устройства не имеют внешнего подключения, поэтому для внешнего подключения необходимы маршрутизаторы:

source: In this example environment, infrastructure/network nodes hosting L2/L3/DHCP agents will utilize an interface named ``ens1f0`` for the provider network ``physnet1``. Compute nodes, on the other hand, will utilize an interface named ``ens2f0`` for the same ``physnet1`` provider network.
id: Dalam contoh lingkungan ini, infrastructure/network node hosting agen L2/L3/DHCP akan menggunakan antarmuka bernama ``ens1f0`` untuk jaringan penyedia ``physnet1``. Compute nodes, di sisi lain, akan menggunakan antarmuka bernama ``ens2f0`` untuk jaringan penyedia ``physnet1`` yang sama.
ru: В данном примере инфраструктурные/сетевые ноды, на которых размещены L2/L3/DHCP агенты будут использовать интерфейс ``ens1f0``, а для сети провайдера интерфейс ``physnet1``. Вычислительные ноды, с другой стороны, будут использовать интерфейс ``ens2f0`` для той же сети провайдера ``physnet1``.

source: In this section, you will find user stories and examples relevant to deploying OpenStack-Ansible.
de: In diesem Abschnitt finden Sie Benutzerberichte und Beispiele, die für die Bereitstellung von OpenStack-Ansible relevant sind.
id: Di bagian ini, Anda akan menemukan kisah pengguna dan contoh yang relevan dengan penggunaan OpenStack-Ansible.
ru: В данном разделе вы найдете пользовательские примеры использования, а также примеры, относящиеся к развертыванию OpenStack-Ansible.

source: Initial bootstrap of OpenStack-Ansible using ./scripts/bootstrap-ansible.sh script still should be done either as the ``root`` user or escalate privileges using ``sudo`` or ``su``.
ru: Первоначальную загрузку OpenStack-Ansible с использованием скрипта ./scripts/bootstrap-ansible.sh по-прежнему следует выполнять либо от имени пользователя ``root``, либо повысить привилегии с помощью ``sudo`` или ``su``.

source: Initial host deployment is outside the scope of OpenStack-Ansible and the deployer must ensure a minimum set of proxy configuration is in place, in particular for the system package manager.
de: Die anfängliche Host-Bereitstellung liegt außerhalb des Geltungsbereichs von OpenStack-Ansible, und der Deployer muss sicherstellen, dass eine Mindestanzahl von Proxy-Konfigurationen vorhanden ist, insbesondere für den System-Paket-Manager.
id: Deployment host awal berada di luar ruang lingkup OpenStack-Ansible dan deployer harus memastikan set minimum konfigurasi proxy sudah ada, khususnya untuk manajer paket sistem.
ru: Начальное развертывание хоста выходит за рамки OpenStack-Ansible, и оператор должен обеспечить наличие минимального набора конфигураций прокси-сервера, в частности для системного менеджера пакетов.

source: Install the operating system onto all the new compute nodes.
ru: Установите операционную систему на все новые вычислительные серверы.

source: Installing directly from git is also supported. For example, from the tip of Ansible development branch:
de: Die Installation direkt von Git wird ebenfalls unterstützt. Zum Beispiel von der Spitze des Ansible-Entwicklungszweiges:
id: Menginstal langsung dari git juga didukung. Misalnya, dari ujung branch pengembangan Ansible:
ru: Установка непосредственно из git также поддерживается. Например, для установки последней версии с ветки для разработки:

source: Installing with limited connectivity
de: Installation mit eingeschränkter Konnektivität
id: Menginstal dengan konektivitas terbatas
ru: Установка с ограниченным соединением

source: Instead, the usual overrides mechanism can take place, and you can define these 3 variables in a ``user_*.yml`` file. See also the :ref:`user-overrides` page.
de: Stattdessen kann der übliche Überschreibungsmechanismus stattfinden, und Sie können diese 3 Variablen in einer `` user _ *. Yml`` Datei definieren. Siehe auch die Seite ref: `user-overrides`.
id: Sebagai gantinya, mekanisme penggantian yang biasa dapat terjadi, dan Anda dapat mendefinisikan 3 variabel ini dalam file ``user_*.yml``. Lihat juga halaman :ref:`user-overrides`.
ru: Вместо этого можно использовать обычный механизм переопределений, и можете определить эти 3 переменные в файле ``user_*.yml``. Просмотрите также страницу :ref:`user-overrides`.

source: Integrate radosgw into your Telemetry
id: Integrasikan radosgw ke dalam Telemetri Anda
ru: Интеграция radosgw с Telemetry

source: Integration with Ceph
de: Integration mit Ceph
id: Integrasi dengan Ceph
ru: Интеграция с Ceph

source: Interacting with an AIO
ru: Взаимодействие с AIO

source: Internet access via the router address 172.29.236.1 on the Management Network
de: Internetzugang über die Router-Adresse 172.29.236.1 im Management-Netzwerk
id: Akses internet melalui alamat router 172.29.236.1 di Management Network
ru: Доступ в Интернет через адрес маршрутизатора 172.29.236.1 в сети управления

source: Inventory overrides
ru: Определение inventory

source: It is `possible` to perform AIO builds within a virtual machine for demonstration and evaluation, but your virtual machines will perform poorly unless nested virtualization is available. For production workloads, multiple nodes for specific roles are recommended.
id: Sangat mungkin untuk melakukan build AIO di dalam mesin virtual untuk demonstrasi dan evaluasi, tetapi mesin virtual Anda akan berkinerja buruk kecuali jika tersedia virtualisasi bersarang. Untuk beban kerja produksi, beberapa node untuk role tertentu direkomendasikan.
ru: Имеется `возможность` выполнить развертывание AIO на виртуальном сервере для обзора и оценки, но ваши виртуальные сервера будут иметь низкую производительность, особенно, если вложенная виртуализация недоступна. Для рабочих окружений рекомендуется использовать несколько нод для отдельных ролей.

source: It is also possible to set specific security headers for Skyline.
ru: Также можно установить специальные заголовки безопасности для Skyline.

source: It is also possible to use non-root user for Ansible authentication on destination hosts. However, this user must be able to escalate privileges using `Ansible privilege escalation`_.
ru: Также возможно использовать пользователя без прав root для аутентификации Ansible на хостах назначения. Однако, этот пользователь должен иметь возможность повышать привилегии с помощью `Ansible privilege escalation`_.

source: It is important to note that the proxy server should only be used to access external resources, and communication between the internal components of the OpenStack deployment should be direct and not through the proxy. The ``no_proxy`` environment variable is used to specify hosts that should be reached directly without going through the proxy. These often are the hosts in the management network.
ru: Важно отметить, что прокси сервер должен использоваться только для доступа ко внешним ресурсам, а связь между внутренними компонентами OpenStack должна быть прямая и без использования прокси. Переменная окружения ``no_proxy`` используется для определения хостов, доступ к которым должен быть осуществлён напрямую, без использования прокси. Обычно, это хосты из управляющей сети.

source: It is not possible to have a mixed state of some compute nodes using SSH and some using TLS for live migrations, as this would prevent live migrations between the compute nodes.
ru: Невозможно иметь смешанное состояние, когда некоторые вычислительные узлы используют SSH, а некоторые — TLS для живых миграций, поскольку это помешает живым миграциям между вычислительными узлами.

source: It is possible to also do this (and change other defaults) during the bootstrap script initial execution by changing the SCENARIO environment variable before running the script. The key word 'aio' will ensure that a basic set of OpenStack services (cinder, glance, horizon, neutron, nova) will be deployed. The key words 'lxc' can be used to set the container back-end, while the key word 'metal' will deploy all services without containers. In order to implement any other services, add the name of the conf.d file name without the `.yml.aio` extension into the SCENARIO environment variable. Each key word should be delimited by an underscore. For example, the following will implement an AIO with barbican, cinder, glance, horizon, neutron, and nova. It will set the cinder storage back-end to ceph and will make use of LXC as the container back-end.
ru: Это также можно сделать (и изменить другие значения по умолчанию) во время начального выполнения скрипта, изменив переменную среды SCENARIO перед запуском скрипта. Ключевое слово 'aio' гарантирует, что будет развернут базовый набор служб OpenStack (cinder, glance, horizon, neutron, nova). Ключевые слова 'lxc' можно использовать для установки бекэнда с контейнерами, в то время как ключевое слово 'metal' развернет все службы без контейнеров. Чтобы реализовать любые другие службы, добавьте имя файла conf.d без расширения `.yml.aio` в переменную среды SCENARIO. Каждое ключевое слово должно быть разделено нижним подчеркиванием. Например, следующий код реализует AIO с barbican, cinder, glance, horizon, neutron и nova. Он установит хранилище cinder на ceph и будет использовать LXC контейнеры в качестве бекэнда.

source: It is recommended that you monitor attempted CSP violations in production, this is achieved by setting the ``report-uri`` and ``report-to`` tokens.
ru: Рекомендуется отслеживать попытки нарушения CSP в рабочей среде. Это достигается путем установки токенов ``report-uri`` и ``report-to``.

source: It is recommended to set the property ``hw_firmware_type='uefi'`` for any images which require UEFI boot, even when this implicit with the ``aarch64`` architecture. This is to avoid issues with NVRAM files in libvirt when deleting an instance.
ru: Рекомендуется задать свойство ``hw_firmware_type='uefi'`` для любых образов, требующих загрузки UEFI, даже если это подразумевается архитектурой ``aarch64``. Это необходимо для избежания проблем с файлами NVRAM в libvirt при удалении инстанса.

source: It will be an extended and more specific version of :ref:`pod-environment-config` so it is expected that you are aware of the concepts and approaches defined there.
ru: Это будет расширенная и более конкретная версия статьи про :ref:`pod-environment-config`, поэтому ожидается, что вы знакомы с определенными там концепциями и подходами.

source: LXC container images
de: LXC-Containerbilder
id: Image kontainer LXC
ru: Образы LXC контейнеров

source: Last, but not the least complication is Nova scheduling when ``cross_az_attach`` is disabled. As Nova will not add an Availability Zone to instances ``request_specs`` when an instance is created from a volume directly, on the contrary to creating volume manually in advance and supplying volume UUID to the instance create API call. The problem with that behavior, is that Nova will attempt to Live Migrate or re-schedule instances without an Availability Zone in ``request_specs`` to other AZs, which will result in failure, as ``cross_az_attach`` is disabled. You can read more about this in a Nova `bug report <https://bugs.launchpad.net/nova/+bug/2047182>`_ In order to work around this Bug you need to set a ``default_schedule_zone`` for Nova and Cinder, which will ensure AZ always being defined in ``request_specs``. You can also go further and define an actual Availability Zone as ``default_schedule_zone``, making each controller to have its own default. As Load Balancer will attempt to send requests only to "local" backends first, this approach does work to distribute new VMs across all AZs when user does not supply AZ explicitly. Otherwise, the "default" AZ will be accepting significantly more new signups.
ru: Последняя, ​​но не самая маленькая сложность — планирование Nova, когда ``cross_az_attach`` отключен. Так как Nova не будет добавлять зону доступности к инстансам ``request_specs``, когда инстанс создается из диска напрямую, в отличие от создания диска вручную заранее и предоставления UUID диска в вызове API создания инстанса. Проблема с таким поведением заключается в том, что Nova попытается выполнить живую миграцию или перепланировать инстансы без зоны доступности в ``request_specs`` в другие AZ, что приведет к сбою, так как ``cross_az_attach`` отключен. Подробнее об этом можно прочитать в отчете об ошибке Nova <https://bugs.launchpad.net/nova/+bug/2047182>`_ Чтобы обойти эту ошибку, вам нужно установить ``default_schedule_zone`` для Nova и Cinder, что гарантирует, что AZ всегда будет определена в ``request_specs``. Вы также можете пойти дальше и определить фактическую зону доступности как ``default_schedule_zone``, сделав каждый контроллер своим собственным значением по умолчанию. Поскольку балансировщик нагрузки сначала попытается отправлять запросы только на "локальные" бекэнды, этот подход работает для распределения новых виртуальных машин по всем AZ, когда пользователь явно не указывает AZ. В противном случае AZ "по умолчанию" будет принимать значительно больше новых регистраций.

source: Leverage DNS Round Robin (an A/AAAA record per AZ) for Public API
ru: Использование DNS Round Robin (запись A/AAAA на каждую зону доступности) для публичного API

source: Live migration of VM's using SSH is deprecated and the `OpenStack Nova Docs`_ recommends using the more secure native TLS method supported by QEMU. The default live migration method used by OpenStack-Ansible has been updated to use TLS migrations.
ru: Живая миграция виртуальных машин с использованием SSH устарела, и `OpenStack Nova Docs`_ рекомендует использовать более безопасный собственный метод TLS, поддерживаемый QEMU. Метод живой миграции по умолчанию, используемый OpenStack-Ansible, был обновлен для использования миграций TLS.

source: Load Balancing
ru: Балансировка нагрузки

source: Management IP
de: Verwaltungs-IP
ru: Управляющий IP

source: Management Network
de: Verwaltungsnetzwerk
ru: Управляющая сеть

source: Managing RabbitMQ stream policy
ru: Управление политикой потока RabbitMQ

source: Many network configuration examples assume a homogenous environment, where each server is configured identically and consistent network interfaces and interface names can be assumed across all hosts.
id: Banyak contoh konfigurasi jaringan mengasumsikan lingkungan yang homogen, di mana setiap server dikonfigurasi secara identik dan nama antarmuka dan antarmuka jaringan yang konsisten dapat diasumsikan di semua host.
ru: Много примеров сетевых конфигураций предполагают однородное окружение, где каждый сервер настроен идентично и постоянные сетевые интерфейсы и сетевые имена могут быть использованы на всех хостах.

source: Many packages used to run OpenStack are installed using `pip`. We advise mirroring the PyPi package index used by `pip`. A deployer can choose to actively mirror the entire upstream PyPi repository, but this may require a significant amount of storage. Alternatively, a caching pip proxy can be used to retain local copies of only those packages which are required.
id: Banyak paket yang digunakan untuk menjalankan OpenStack diinstal menggunakan `pip`. Kami menyarankan untuk mencerminkan indeks paket PyPi yang digunakan oleh `pip`. Deployer dapat memilih untuk secara aktif mencerminkan seluruh repositori PyPi hulu, tetapi ini mungkin memerlukan sejumlah besar penyimpanan. Atau, proxy pip caching dapat digunakan untuk menyimpan salinan lokal hanya dari paket-paket yang diperlukan.
ru: Много пакетов, используемых для запуска OpenStack, устанавливаются при помощи `pip`. Мы рекомендуем зеркалировать список пакетов из PyPi, которые используются pip. Оператор может предпочесть активно зеркалировать весь верхний репозиторий PyPi, но это может потребовать значительный объем дискового пространства. Как вариант, можно использовать кэширующий pip прокси для получения локальных копий только требуемых пакетов.

source: Many playbooks and roles in OpenStack-Ansible retrieve dependencies from the public Internet by default. The example configurations assume that the deployer provides a good quality Internet connection via a router on the OpenStack management network.
id: Banyak buku pedoman dan peran di OpenStack-Ansible mengambil dependensi dari Internet publik secara default. Contoh konfigurasi mengasumsikan bahwa deployer menyediakan koneksi Internet berkualitas baik melalui router pada jaringan manajemen OpenStack.
ru: Многие плейбуки и роли в OpenStack-Ansible по умолчанию извлекают зависимости из Интернета. Примеры конфигураций предполагают, что оператор имеет качественное подключение к Интернету через маршрутизатор в сети управления OpenStack.

source: Many software packages are installed on Ubuntu hosts using `.deb` packages. Similar packaging mechanisms exist for other Linux distributions. We advise mirroring the repositories that host these packages.
de: Viele Softwarepakete werden auf Ubuntu-Hosts mit `.deb`-Paketen installiert. Ähnliche Verpackungsmechanismen existieren für andere Linux-Distributionen. Wir empfehlen, die Repositorys zu spiegeln, die diese Pakete hosten.
id: Banyak paket perangkat lunak yang diinstal pada host Ubuntu menggunakan paket `.deb`. Mekanisme pengemasan serupa ada untuk distribusi Linux lainnya. Kami menyarankan untuk mencerminkan (mirroring) repositori yang meng-host paket-paket ini.
ru: Много программных пакетов установлено на Ubuntu при помощи `.deb` пакетов. Схожие механизмы пакетов существуют и для других дистрибутивов Linux. Мы советуем зеркалировать репозитории, которые содержат данные пакеты.

source: Mentioned below overrides are default ones and will be applied to `ceph-rgw` group
ru: Упомянутые ниже переопределения это значения по умолчанию, которые будут применены к группе `ceph-rgw`

source: Messaging configuration
ru: Конфигурация обмена сообщениями

source: Messaging transport
id: Transportasi pengiriman pesan
ru: Транспорт для обмена сообщениями

source: Mixed CPU architectures for compute nodes
ru: Смешанные архитектуры процессора для вычислительных узлов

source: More information about SSL certificate configuration can be found in the :doc:`security guide </user/security/ssl-certificates>`.
ru: Более подробную информацию о настройке SSL-сертификата можно найти в :doc:`security guide </user/security/ssl-certificates>`.

source: Most Python network modules
de: Die meisten Python-Netzwerkmodule
id: Sebagian besar modul jaringan Python
ru: Большинство Python модулей

source: Multi-Architecture Deployments
ru: Развертывания с различными архитектурами

source: Multiple Network Interface Cards (NIC) configured as bonded pairs for each host
de: Mehrere Netzwerkschnittstellenkarten (Network Interface Cards, NIC), die als verbundene Paare für jeden Host konfiguriert sind
id: Multiple Network Interface Cards (NIC) dikonfigurasikan sebagai pasangan berikat untuk setiap host
ru: Несколько сетевых карт (NIC), настроенных как агрегированные для каждого хоста

source: Multiple Network Interface Cards (NIC) used as provider network interfaces that vary between hosts
id: Multiple Network Interface Cards (NIC) digunakan sebagai antarmuka jaringan penyedia yang bervariasi antar host
ru: Несколько сетевых карт (NIC) используются как интерфейс сети провайдера, которая отличается между хостами

source: Multiple interfaces or bonds
id: Berbagai antarmuka atau ikatan (bond)
ru: Несколько интерфейсов или агрегаций

source: NFS Storage
de: NFS-Speicher
ru: Хранилище NFS

source: Network
de: Netzwerk
ru: Сеть

source: Network CIDR/VLAN assignments
de: Netzwerk CIDR / VLAN Zuweisungen
id: Penetapan CIDR/VLAN jaringan
ru: Распределение сетевых CIDR/VLAN

source: Network Interface Layout - Multiple Bonds
ru: Схема сетевых интерфейсов - несколько агрегаций

source: Network Interface Layout - Multiple Interfaces
ru: Схема сетевых интерфейсов - несколько интерфейсов

source: Network Interface Layout - Single Bond
ru: Схема сетевых интерфейсов - одна агрегация

source: Network Interface Layout - Single Interface
ru: Схема сетевых интерфейсов - один интерфейс

source: Network Interface Layout OVN - Gateway Nodes
ru: Схема сетевого интерфейса OVN - узлы шлюза

source: Network architectures
id: Arsitektur jaringan
ru: Сетевые архитектуры

source: Network configuration
de: Netzwerkkonfiguration
id: Konfigurasi jaringan
ru: Настройка сети

source: Network interfaces
id: Antarmuka jaringan
ru: Сетевые интерфейсы

source: Next switch the applicable branch/tag to be deployed from. Note that deploying from the head of a branch may result in an unstable build due to changes in flight and upstream OpenStack changes. For a test (for example, not a development) build it is usually best to checkout the latest tagged version.
de: Als Nächstes wechseln Sie den zutreffenden Zweig / Tag, von dem die Bereitstellung erfolgen soll. Beachten Sie, dass das Deployment vom Kopf eines Zweiges zu einem instabilen Build aufgrund von Änderungen im Flug und Upstream-Änderungen führen kann. Für einen Test (zum Beispiel keine Entwicklung) ist es normalerweise am besten, die neueste getaggte Version auszuprobieren.
id: Selanjutnya, pindahkan branch/tag yang berlaku untuk dikerahkan. Perhatikan bahwa penerapan dari kepala cabang (head of a branch) dapat mengakibatkan pembangunan yang tidak stabil karena perubahan dalam flight dan perubahan OpenStack di hulu. Untuk tes (misalnya, bukan pengembangan) membangunnya biasanya lebih baik untuk memeriksa versi tag terbaru.
ru: Далее переключитесь на желаемую ветку/тег с которого будет произведена установка. Учтите, что развертывание с определенной ветки может привести к нестабильной сборке из-за изменений, которые находятся в процессе, а также изменений в OpenStack. Для теста (не для разработки), обычно, наилучшим выбором будет переход на последнюю тегированную версию.

source: Next, we need to ensure a HAProxy configuration for each service does contain HAProxy map population with a respective condition, for example:
ru: Далее нам необходимо убедиться, что конфигурация HAProxy для каждой службы содержит наполнение карты HAProxy с соответствующим условием, например:
