Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: de, id

source: Check VLAN configurations and any necessary trunking to uplink ports on physical switches (if applicable)
de: Überprüfen Sie VLAN-Konfigurationen und alle erforderlichen Trunking-Verbindungen für Uplink-Ports auf physischen Switches (falls zutreffend)
id: Periksa konfigurasi VLAN dan semua trunking yang diperlukan untuk menghubungkan (uplink) port pada switch fisik (jika ada)

source: Check VTEP learning method (multicast or l2population):
de: Überprüfen Sie die VTEP Lernmethode (Multicast oder L2Population):
id: Periksa metode pembelajaran VTEP (multicast atau l2population):

source: Check cable, seating, physical switchport configuration, interface/bonding configuration, and general network configuration. See general network troubleshooting documentation.
de: Überprüfen Sie Kabel, Steckplätze, physische Switchport-Konfiguration, Schnittstellen-/Bonding-Konfiguration und allgemeine Netzwerkkonfiguration. Siehe allgemeine Dokumentation zur Fehlerbehebung im Netzwerk.
id: Periksa kabel, seating, konfigurasi switchport fisik, konfigurasi interface/bonding, dan konfigurasi jaringan umum. Lihat dokumentasi pemecahan masalah jaringan umum.

source: Check gateway or host routes on the Neutron subnet.
de: Überprüfen Sie Gateway- oder Host-Routen im Neutron-Subnetz.
id: Periksa rute gateway atau host di subnet Neutron.

source: Check interface bonding (if applicable)
de: Überprüfen Sie die Schnittstellenverbindung (falls zutreffend)
id: Periksa ikatan antarmuka (jika ada)

source: Check ml2 config file for local VXLAN IP and other VXLAN configuration settings.
de: Überprüfen Sie die ml2-Konfigurationsdatei auf lokale VXLAN-IP- und andere VXLAN-Konfigurationseinstellungen.
id: Periksa file konfigurasi ml2 untuk IP VXLAN lokal dan pengaturan konfigurasi VXLAN lainnya.

source: Check nova console logs to see if the instance ever received its IP address initially.
de: Überprüfen Sie die Protokolle der nova-Konsole, um festzustellen, ob die Instanz ihre IP-Adresse zu Beginn erhalten hat.
id: Periksa nova console logs untuk melihat apakah instance pernah menerima alamat IP-nya pada awalnya.

source: Check out the |current_release_formal_name| release
de: Überprüfen Sie die |current_release_formal_name| Freisetzung
id: Lihat |current_release_formal_name| melepaskan

source: Check physical connectivity of hosts to physical network
de: Überprüfen Sie die physische Verbindung von Hosts zum physischen Netzwerk
id: Periksa konektivitas fisik host ke jaringan fisik

source: Check physical interface mappings.
de: Überprüfen Sie die Zuordnung der physischen Schnittstelle.
id: Periksa pemetaan antarmuka fisik.

source: Check syslogs.
de: Überprüfen Sie Syslogs.
id: Periksa syslogs.

source: Check that Bridge Forwarding Database (fdb) contains the proper entries on both the compute and Neutron agent container.
de: Überprüfen Sie, ob die Bridge Forwarding Database (fdb) die richtigen Einträge sowohl im Compute- als auch im Neutron-Agent-Container enthält.
id: Periksa bahwa Bridge Forwarding Database (fdb) berisi entri yang tepat pada kontainer agen Neutron dan komputasi.

source: Check that hosts are in the same IP subnet or have proper routing between them
de: Überprüfen Sie, ob sich die Hosts im selben IP-Subnetz befinden oder ob zwischen ihnen ein ordnungsgemäßes Routing stattfindet
id: Periksa apakah host berada dalam subnet IP yang sama atau miliki routing yang tepat di antara mereka

source: Check that hosts are in the same subnet or have proper routing between them
de: Überprüfen Sie, ob sich die Hosts im selben Subnetz befinden oder ob zwischen ihnen ein ordnungsgemäßes Routing stattfindet
id: Pastikan host berada di subnet yang sama atau memiliki routing yang tepat di antara mereka

source: Check that linux bridges contain the proper interfaces on compute and network nodes.
de: Überprüfen Sie, ob die Linux-Bridges die richtigen Schnittstellen für Rechner- und Netzwerkknoten enthalten.
id: Periksa apakah linux bridges berisi antarmuka yang tepat pada node komputasi dan jaringan.

source: Check that linux bridges contain the proper interfaces. on compute and network nodes.
de: Überprüfen Sie, ob Linux-Bridges die richtigen Schnittstellen enthalten. auf Rechen- und Netzwerkknoten.
id: Periksa apakah linux bridges berisi antarmuka yang tepat. pada komputasi dan node jaringan.

source: Check the **Actions** column, and click on the **More** option. Select the instance state.
de: Überprüfen Sie die Spalte **Aktionen** und klicken Sie auf die Option **Mehr**. Wählen Sie den Instanzstatus aus.
id: Periksa kolom **Actions**, dan klik opsi **More** . Pilih status instance.

source: Check the **Launch Instances** dialog, and find the **details** tab. Enter the appropriate values for the instance.
de: Überprüfen Sie das Dialogfeld **Instanzen starten** und finden Sie die Registerkarte **Details**. Geben Sie die entsprechenden Werte für die Instanz ein.
id: Periksa dialog **Launch Instances**, dan temukan tab **details**. Masukkan nilai yang sesuai untuk instance.

source: Check the RabbitMQ cluster status
de: Überprüfen Sie den RabbitMQ-Clusterstatus
id: Periksa status cluster RabbitMQ

source: Check the backend API health on your load balancer nodes. For example, if using haproxy, ensure no backend is marked as "DOWN":
de: Überprüfen Sie den Back-End-API-Status auf Ihren Load-Balancer-Knoten. Wenn Sie beispielsweise haproxy verwenden, stellen Sie sicher, dass kein Backend als ``DOWN`` markiert ist:
id: Periksa kesehatan API backend pada node penyeimbang beban (load balancer) Anda. Misalnya, jika menggunakan haproxy, pastikan tidak ada backend yang ditandai sebagai "DOWN":

source: Check there are no iptables applied to the hosts that would deny traffic
de: Stellen Sie sicher, dass keine iptables auf die Hosts angewendet werden, die den Datenverkehr verweigern würden
id: Periksa tidak ada iptables yang diterapkan pada host yang akan menolak lalu lintas (traffic)

source: Check to verify that physcial interface is in the bridge
de: Überprüfen Sie, ob sich die physische Schnittstelle in der Bridge befindet
id: Periksa untuk memverifikasi bahwa antarmuka fisik ada di jembatan (bridge)

source: Check to verify that physical interface is in the bridge
de: Überprüfen Sie, ob sich die physische Schnittstelle in der Bridge befindet
id: Periksa untuk memverifikasi bahwa antarmuka fisik ada di jembatan (bridge)

source: Check to verify that veth-pair end from container is in ``br-mgmt``
de: Überprüfen Sie, ob das Veth-Pair-Ende des Containers in ``br-mgmt`` steht
id: Periksa untuk memverifikasi bahwa veth-pair end dari kontainer ada di ``br-mgmt``

source: Check to verify that veth-pair end from container is in ``br-vxlan``
de: Überprüfen Sie, ob das Veth-Pair-Ende des Containers in ``br-vxlan`` steht
id: Periksa untuk memverifikasi bahwa veth-pair end dari kontainer ada di ``br-vxlan``

source: Check upstream routes, NATs or ``access-control-lists``.
de: Überprüfen Sie vorgelagerte Routen, NATs oder ``access-control-list``.
id: Periksa rute hulu, NATs atau ``access-control-lists``.

source: Check upstream routes, NATs or access-control-lists.
de: Überprüfen Sie Upstream-Routen, NATs oder Access-Control-Listen.
id: Periksa rute hulu, NAT atau access-control-lists.

source: Check veth pairs between containers and linux bridges on the host.
de: Überprüfen Sie veth-Paare zwischen Containern und Linux-Bridges auf dem Host.
id: Periksa pasangan veth antara kontainer dan jembatan linux pada host.

source: Check your OpenStack-Ansible cloud
de: Überprüfen Sie Ihre OpenStack-Ansible Cloud
id: Periksa cloud OpenStack-Ansible Anda

source: Checking services
de: Dienste überprüfen
id: Memeriksa layanan

source: Cinder attached volumes also require a Libvirt version larger or equal to 1.2.17.
de: An Cinder angehängte Datenträger erfordern ebenfalls eine Libvirt-Version größer oder gleich 1.2.17.
id: Volume terpasang Cinder juga membutuhkan versi Libvirt yang lebih besar atau sama dengan 1.2.17.

source: Click **Advanced Options**. Specify whether the instance uses a configuration drive to store metadata by selecting a disk partition type.
de: Klicken Sie auf **Erweiterte Optionen**. Geben Sie an, ob die Instanz ein Konfigurationslaufwerk zum Speichern von Metadaten verwendet, indem Sie einen Festplattenpartitionstyp auswählen.
id: Klik **Advanced Options**. Tentukan apakah instance menggunakan drive konfigurasi untuk menyimpan metadata dengan memilih jenis partisi disk.

source: Click **Launch** from the **Actions** column.
de: Klicken Sie in der Spalte **Aktionen** auf **Starten**.
id: Klik **Launch** dari kolom **Actions**.

source: Click **Launch** to create the instance. The instance will start on a compute node. The **Instance** page will open and start creating a new instance. The **Instance** page that opens will list the instance name, size, status, and task. Power state and public and private IP addresses are also listed here.
de: Klicken Sie auf **Starten**, um die Instanz zu erstellen. Die Instanz wird auf einem Rechenknoten gestartet. Die Seite **Instanz** wird geöffnet und beginnt mit dem Erstellen einer neuen Instanz. Die geöffnete Seite **Instance** listet den Instanznamen, die Größe, den Status und die Aufgabe auf. Energiezustand und öffentliche und private IP-Adressen sind hier ebenfalls aufgeführt.
id: Klik **Launch** untuk membuat instance. Instance akan dimulai pada node komputasi. Halaman **Instance** akan terbuka dan mulai membuat instance baru. Halaman **Instance** yang terbuka akan mencantumkan nama, ukuran, status, dan tugas instance. Status daya dan alamat IP publik dan pribadi juga tercantum di sini.

source: Click the **Create Image** button. The **Create an Image** dialog box will appear.
de: Klicken Sie auf die Schaltfläche **Abbild erstellen**. Das Dialogfeld **Abbild erstellen** wird angezeigt.
id: Klik tombol **Create Image**. Kotak dialog **Create Image** akan muncul.

source: Click the **Create Image** button. The newly created image may take some time before it is completely uploaded since the image arrives in an image queue.
de: Klicken Sie auf die Schaltfläche **Abbild erstellen**. Das neu erstellte Abbild kann einige Zeit dauern, bis es vollständig hochgeladen wurde, da das Abbild in einer Abbildwarteschlange eintrifft.
id: Klik tombol **Create Image**. Image yang baru dibuat mungkin memerlukan beberapa waktu sebelum benar-benar diunggah karena image tiba dalam antrean image.

source: Click the **Images** option.
de: Klicken Sie auf die Option **Abbilder**.
id: Klik opsi **Images**.

source: Click the **Networking tab**. This tab will be unavailable if OpenStack networking (neutron) has not been enabled. If networking is enabled, select the networks on which the instance will reside.
de: Klicken Sie auf den Tab **Netzwerk**. Diese Registerkarte ist nicht verfügbar, wenn das OpenStack-Netzwerk (Neutron) nicht aktiviert wurde. Wenn das Netzwerk aktiviert ist, wählen Sie die Netzwerke aus, in denen sich die Instanz befinden soll.
id: Klik **Networking tab**. Tab ini tidak akan tersedia jika jaringan OpenStack (neutron) belum diaktifkan. Jika jaringan diaktifkan, pilih jaringan tempat instance akan berada.

source: Click the **Volume Options tab**. This tab will only be available if a Block Storage volume exists for the instance. Select **Don't boot from a volume** for now.
de: Klicken Sie auf die Registerkarte **Datenträger-Optionen**. Diese Registerkarte ist nur verfügbar, wenn ein Blockspeicherdatenträger für die Instanz vorhanden ist. Wählen Sie jetzt **Nicht von einem Datenträger booten**.
id: Klik **Volume Options tab**. Tab ini hanya akan tersedia jika volume Block Storage ada untuk instance. Pilih **Don't boot from a volume** untuk saat ini.

source: Clone the ``openstack-ansible-ops`` repository to your deployment host:
de: Klonen Sie das Repository ``openstack-ansible-ops`` auf Ihren Bereitstellungshost:
id: Klon repositori ``openstack-ansible-ops`` ke host penyebaran Anda:

source: Commands
de: Befehle
id: Perintah

source: Compare the output of the following command with the following output. It should give you information about the status of your cluster.
de: Vergleichen Sie die Ausgabe des folgenden Befehls mit der folgenden Ausgabe. Es sollte Ihnen Informationen über den Status Ihres Clusters geben.
id: Bandingkan output dari perintah berikut dengan output berikut. Ini seharusnya memberi Anda informasi tentang status kluster Anda.

source: Compute service (compute node)
de: Compute-Service (Rechenknoten)
id: Layanan Compute (node komputasi)

source: Compute service (controller node)
de: Compute Service (Steuerungsknoten)
id: Layanan Compute (node pengontrol)

source: Configure the host as a target host. See the :deploy_guide:`target hosts configuration section <targethosts.html>` of the deploy guide. for more information.
de: Konfigurieren Sie den Host als Zielhost. Siehe den Konfigurationsabschnitt :deploy_guide:`Zielhosts <targethosts.html>` des Bereitstellungsleitfadens für mehr Informationen.
id: Konfigurasikan host sebagai host target. Lihat :deploy_guide:`target hosts configuration section <targethosts.html>` dari panduan penyebaran. untuk informasi lebih lanjut.

source: Configure your first networks
de: Konfigurieren Sie Ihre ersten Netzwerke
id: Konfigurasikan jaringan pertama Anda

source: Confirm all instances are down:
de: Bestätigen Sie, dass alle Instanzen ausgefallen sind:
id: Konfirmasikan semua instance tidak aktif:

source: Consider the following to help establish a hardware replacement plan:
de: Berücksichtigen Sie Folgendes, um einen Hardware-Ersatzplan zu erstellen:
id: Pertimbangkan yang berikut ini untuk membantu menyusun rencana penggantian perangkat keras:

source: Consult the rabbitmqctl manpage for more information.
de: Weitere Informationen finden Sie in der Manpage rabbitmqctl.
id: Lihat halaman manual rabbitmqctl untuk informasi lebih lanjut.

source: Container management
de: Container-Verwaltung
id: Manajemen kontainer

source: Container networking issues
de: Container-Netzwerkprobleme
id: Isu jaringan kontainer

source: Continue!
de: Fortsetzen!

source: Create a RabbitMQ cluster
de: Erstellen Sie einen RabbitMQ-Cluster
id: Buat klaster RabbitMQ

source: Create the ``/root/add_host.limit`` file, which contains all new node host names and their containers. Add **localhost** to the list of hosts to be able to access deployment host facts.
de: Erstellen Sie die Datei ``/root/add_host.limit``, die alle neuen Knoten-Hostnamen und ihre Container enthält. Fügen Sie **localhost** zur Liste der Hosts hinzu, um auf Bereitstellungshostfakten zugreifen zu können.
id: Buat file ``/root/add_host.limit``, yang berisi semua nama host node baru dan kontainernya. Tambahkan **localhost** ke daftar host untuk dapat mengakses fakta host penyebaran.

source: Creating an instance using the Dashboard
de: Erstellen einer Instanz mithilfe des Dashboards
id: Membuat instance menggunakan Dasbor

source: Creating an instance using the command line
de: Erstellen einer Instanz über die Befehlszeile
id: Membuat instance menggunakan command line

source: Database backups and recovery
de: Datenbank-Backups und Wiederherstellung
id: Backup dan pemulihan basis data (database)

source: Declaratively (list of cluster nodes in a config, with ``rabbitmq-autocluster``, or ``rabbitmq-clusterer`` plugins)
de: Deklarativ (Liste der Cluster-Knoten in einer Konfiguration mit ``rabbitmq-autocluster`` oder ``rabbitmq-clusterer`` Plugins)
id: Deklaratif (daftar node kluster dalam konfigurasi, dengan ``rabbitmq-autocluster``, atau ``rabbitmq-clusterer`` plugins)

source: Define these variables to reduce typing when running the remaining upgrade tasks. Because these environments variables are shortcuts, this step is optional. If you prefer, you can reference the files directly during the upgrade.
de: Definieren Sie diese Variablen, um beim Ausführen der verbleibenden Upgrade-Aufgaben die Eingabe zu reduzieren. Da es sich bei diesen Umgebungsvariablen um Verknüpfungen handelt, ist dieser Schritt optional. Wenn Sie möchten, können Sie während des Upgrades direkt auf die Dateien verweisen.
id: Tentukan variabel-variabel ini untuk mengurangi pengetikan saat menjalankan tugas pemutakhiran yang tersisa. Karena variabel lingkungan ini adalah pintasan (shortcut), langkah ini opsional. Jika Anda suka, Anda dapat mereferensikan file secara langsung selama pemutakhiran.

source: Depending on the OpenStack-Ansible version in use, Nova can be configured to force configuration drive attachments to instances. In this case, a ISO9660 CD-ROM image will be made available to the instance via the ``/mnt`` mount point. This can be used by tools, such as cloud-init, to gain access to instance metadata. This is an alternative way of accessing the Nova EC2-style Metadata.
de: Abhängig von der verwendeten OpenStack-Ansible-Version kann Nova so konfiguriert werden, dass Konfigurationslaufwerk-Anhänge für Instanzen erzwungen werden. In diesem Fall wird ein ISO9660-CD-ROM-Image für die Instanz über den Einhängepunkt ``/mnt`` bereitgestellt. Dies kann von Tools wie cloud-init verwendet werden, um auf Instanzmetadaten zuzugreifen. Dies ist eine alternative Möglichkeit, auf die Metadaten im Nova EC2-Stil zuzugreifen.
id: Bergantung pada versi OpenStack-Ansible yang digunakan, Nova dapat dikonfigurasi untuk memaksa attachment drive konfigurasi ke instance. Dalam hal ini, image CD-ROM ISO9660 akan tersedia untuk instance melalui titik mount ``/mnt``. Ini dapat digunakan oleh alat, seperti cloud-init, untuk mendapatkan akses ke metadata instance. Ini adalah cara alternatif untuk mengakses Metadata bergaya Nova EC2.

source: Destroy and recreate containers
de: Zerstören und Neuerstellen von Containern
id: Hancurkan dan buat ulang kontainer

source: Destroy the container and remove MariaDB data stored outside of the container:
de: Zerstören Sie den Container und entfernen Sie MariaDB-Daten, die außerhalb des Containers gespeichert sind:
id: Hancurkan kontainer dan hapus data MariaDB yang disimpan di luar kontainer:

source: Destroying Containers
de: Zerstören von Containern
id: Menghancurkan Kontainer

source: Details
de: Einzelheiten

source: Diagnose Image service issues
de: Diagnose Image-Probleme
id: Diagnosis masalah layanan Image

source: Disable all OpenStack services running on the compute node. This can include, but is not limited to, the ``nova-compute`` service and the neutron agent service.
de: Deaktivieren Sie alle OpenStack-Dienste, die auf dem Rechenknoten ausgeführt werden. Dies kann den ``nova-compute`` -Dienst und den Neutronenagentendienst umfassen, ist aber nicht darauf beschränkt.
id: Nonaktifkan semua layanan OpenStack yang berjalan pada node komputasi. Ini dapat termasuk, tetapi tidak terbatas pada, layanan ``nova-compute`` dan layanan agen neutron.

source: Disable the ``cinder-volume`` service:
de: Deaktivieren Sie den Dienst ``cinder-volume``:
id: Nonaktifkan layanan ``cinder-volume``:

source: Disable the ``nova-compute`` binary:
de: Deaktivieren Sie die ``nova-compute`` Binärdatei:
id: Nonaktifkan biner ``nova-compute``:

source: Disable the failed node on the load balancer.
de: Deaktivieren Sie den ausgefallenen Knoten im Lastenausgleichsmodul.
id: Nonaktifkan node gagal pada load balancer.

source: Do not continue until VXLAN endpoints have reachability to each other.
de: Fahren Sie nicht fort, bis VXLAN-Endpunkte zueinander erreichbar sind.
id: Jangan teruskan sebelum titik akhir VXLAN memiliki jangkauan satu sama lain.

source: Do not continue until instance has an IP address and can reach local network resources like DHCP.
de: Fahren Sie nicht fort, bis die Instanz eine IP-Adresse hat und lokale Netzwerkressourcen wie DHCP erreichen kann.
id: Jangan melanjutkan sampai instance memiliki alamat IP dan dapat mencapai sumber daya jaringan lokal seperti DHCP.

source: Do not continue until instance has an IP address and can reach local network resources.
de: Fahren Sie nicht fort, bis die Instanz eine IP-Adresse hat und lokale Netzwerkressourcen erreichen kann.
id: Jangan melanjutkan sebelum instance memiliki alamat IP dan dapat mencapai sumber daya jaringan lokal.

source: Do not continue until physical network is properly configured.
de: Fahren Sie nicht fort, bis das physische Netzwerk ordnungsgemäß konfiguriert wurde.
id: Jangan melanjutkan sebelum jaringan fisik dikonfigurasi dengan benar.

source: Do not continue until the instance can reach its gateway.
de: Fahren Sie nicht fort, bis die Instanz das Gateway erreichen kann.
id: Jangan melanjutkan sampai instance dapat mencapai gateway-nya.

source: Do not rely on the load balancer health checks to disable the node. If the node is not disabled, the load balancer sends SQL requests to it before it rejoins the cluster and cause data inconsistencies.
de: Verlassen Sie sich nicht auf die Systemüberprüfungen für den Lastenausgleich, um den Knoten zu deaktivieren. Wenn der Knoten nicht inaktiviert ist, sendet der Load Balancer SQL-Anforderungen an ihn, bevor er dem Cluster wieder beitritt und Dateninkonsistenzen verursacht.
id: Jangan mengandalkan pemeriksaan kesehatan penyeimbang beban (load balancer) untuk menonaktifkan node. Jika node tidak dinonaktifkan, load balancer mengirim permintaan SQL ke dalamnya sebelum bergabung kembali dengan cluster dan menyebabkan inkonsistensi data.

source: Does physical interface show link and all VLANs properly trunked across physical network?
de: Zeigt die physische Schnittstelle die Verbindung und alle VLANs ordnungsgemäß über das physische Netzwerk geleitet?
id: Apakah antarmuka fisik menunjukkan tautan dan semua VLAN dengan benar di-trunk di jaringan fisik?

source: Does the instance's IP address ping from network's DHCP namespace or other instances in the same network?
de: Wird die IP-Adresse der Instanz vom DHCP-Namespace des Netzwerks oder anderen Instanzen im selben Netzwerk gepingt?
id: Apakah alamat IP instance ping dari namespace DHCP jaringan atau instance lain dalam jaringan yang sama?

source: Does the instance's IP address ping from the gateway device (Neutron router namespace or another gateway device)?
de: Wird die IP-Adresse der Instanz vom Gateway-Gerät (Neutron-Router-Namespace oder ein anderes Gateway-Gerät) gepingt?
id: Apakah alamat IP instance mem-ping dari perangkat gateway (Neutron router namespace atau perangkat gateway lain)?

source: Download an image to ensure that an image can be read from the store.
de: Laden Sie ein Abbild herunter, um sicherzustellen, dass ein Abbild aus dem Speicher gelesen werden kann.
id: Unduh image untuk memastikan bahwa image dapat dibaca dari store (penyimpanan).

source: Each host is comma-separated with no spaces.
de: Jeder Host ist durch Kommas getrennt ohne Leerzeichen.
id: Setiap host dipisahkan dengan koma tanpa spasi.

source: Edit the ``/etc/openstack_deploy/openstack_user_config.yml`` file and add the host to the ``compute_hosts`` stanza.
de: Bearbeiten Sie die Datei ``/etc/openstack_deploy/openstack_user_config.yml`` und fügen Sie den Host der Zeilengruppe ``compute_hosts`` hinzu.
id: Edit file ``/etc/openstack_deploy/openstack_user_config.yml`` dan tambahkan host ke bait (stanza) ``compute_hosts``.

source: Edit the file ``/etc/openstack_deploy/openstack_user_config.yml`` and add a new block underneath the ``provider_networks`` section:
de: Editieren Sie die Datei ``/etc/openstack_deploy/openstack_user_config.yml`` und fügen Sie einen neuen Block unter dem Abschnitt ``provider_networks`` hinzu:
id: Edit file ``/etc/openstack_deploy/openstack_user_config.yml`` dan tambahkan blok baru di bawahnya bagian ``provider_networks``:

source: Edit the instance
de: Bearbeiten Sie die Instanz
id: Edit instance
