Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-contributor.po
Languages: de, id

source: ``setup.cfg`` and ``setup.py``: Information about the repository used when building artifacts.
de: ``setup.cfg`` und ``setup.py``: Informationen zum verwendeten Repository beim Erstellen von Artefakten.
id: ``setup.cfg`` dan ``setup.py``: Informasi tentang repositori yang digunakan saat membuat artefak.

source: ``test-requirements.txt``: The Python requirements that must be installed when executing the tests.
de: ``test-requirements.txt``: Die Python-Anforderungen, die beim Ausführen der Tests installiert werden müssen.
id: ``test-requirements.txt``: Persyaratan Python yang harus diinstal ketika menjalankan tes.

source: ``test.yml`` ("super" playbook acting as test router to sub-playbooks)
de: ``test.yml`` (``super`` playbook, das als Test-Router für Unter-Playbooks fungiert)
id: ``test.yml`` ("super" playbook bertindak sebagai router uji untuk sub-playbook)

source: ``tox.ini``: The lint testing, documentation build, release note build and functional build execution process for the role's gate tests are all defined in this file.
de: ``tox.ini``: In dieser Datei sind der Lint-Test, der Dokumentations-Build, der Release-Note-Build und der funktionale Build-Ausführungsprozess für die Gate-Tests der Rolle definiert.
id: ``tox.ini``: Pengujian serat, pembuatan dokumentasi, rilis rilis dan proses eksekusi pembangunan fungsional untuk tes gerbang peran semuanya ditentukan dalam file ini.

source: ``upgrade``: This should inform the deployer about changes which may affect them when upgrading from a previous major or minor version. Typically, these notes would describe changes to default variable values or variables that have been removed.
de: ``upgrade``: Dies sollte den Deployer über Änderungen informieren, die sie beim Upgrade von einer früheren Haupt- oder Nebenversion betreffen könnten. Diese Notizen beschreiben normalerweise Änderungen an Standardvariablenwerten oder Variablen, die entfernt wurden.
id: ``upgrade``: Ini harus memberi tahu penyebar tentang perubahan yang dapat memengaruhi mereka saat memutakhirkan dari versi mayor atau minor sebelumnya. Biasanya, catatan ini akan menjelaskan perubahan nilai variabel default atau variabel yang telah dihapus.

source: and use jinja templating, this is very difficult to achieve. It is still considered a preference and should be a goal to improve readability, within reason.
de: und verwenden Sie Jinja Templating, das ist sehr schwer zu erreichen. Es wird immer noch als eine Präferenz betrachtet und sollte ein Ziel sein, die Lesbarkeit im Rahmen des Zumutbaren zu verbessern.
id: dan menggunakan jinja templating, ini sangat sulit untuk dicapai. Itu masih dianggap preferensi dan harus menjadi tujuan untuk meningkatkan keterbacaan, dengan alasan.

source: as templates and use jinja templating, this will often fail. This test is reasonably safely ignored as the syntax error will be identified when executing the resulting script.
de: als Vorlagen und verwenden Sie Jinja Templating, wird dies oft scheitern. Dieser Test wird relativ sicher ignoriert, da der Syntaxfehler beim Ausführen des resultierenden Skripts identifiziert wird.
id: sebagai templat dan menggunakan templat jinja, ini akan sering gagal. Tes ini diabaikan dengan aman karena kesalahan sintaksis akan diidentifikasi ketika menjalankan skrip yang dihasilkan.

source: or
de: oder
id: atau

source: where #bugnumber refers to a Launchpad issue.
de: Dabei steht #bugnumber für ein Launchpad-Problem.
id: di mana #bugnumber merujuk ke masalah Launchpad.

source: Backporting
de: Rückportierung

source: Bug Tags
de: Fehler Tags

source: Bug triage
de: Fehlersuche

source: By milestone 1:
de: Nach Meilenstein 1:

source: By milestone 2:
de: Nach Meilenstein 2:

source: By milestone 3:
de: Nach Meilenstein 3:

source: Closes-Bug: #bugnumber
de: Closes-Bug: #Bugnummer

source: Importance
de: Bedeutung

source: OpenStack-Ansible Bug Handling
de: OpenStack-Ansible Bug-Behandlung

source: Releasing
de: Freigeben

source: Testing
de: Testen

source: The **tests repository**
de: Das **Testrepository**

source: ``Complete``
de: ``Vollständig``

source: ``Incubated``
de: ``Inkubiert``

source: ``Retired``
de: ``Ruhestand``

source: ``Unmaintained``
de: ``Nicht gepflegt``

source: https://github.com/willshersystems/ansible-sshd
de: https://github.com/willershersystems/ansible-sshd
