Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-user.po
Languages: de, id, ru

source: The following CIDR and VLAN assignments are used for this environment.
de: Die folgenden CIDR- und VLAN-Zuweisungen werden für diese Umgebung verwendet.
id: Penetapan CIDR dan VLAN berikut digunakan untuk lingkungan ini.
ru: Следующие CIDR и VLAN назначения используются для данного окружения.

source: The following CIDR assignments are used for this environment.
de: Die folgenden CIDR-Zuweisungen werden für diese Umgebung verwendet.
id: Penugasan CIDR berikut digunakan untuk lingkungan ini.
ru: Следующие CIDR назначения используются для данного окружения.

source: The following configuration describes the layout for this environment.
de: Die folgende Konfiguration beschreibt das Layout für diese Umgebung.
id: Konfigurasi berikut menjelaskan tata letak untuk lingkungan ini.
ru: Следующая настройка описывает устройство данного окружения.

source: The following design decisions were made in the example below:
ru: В приведенном ниже примере были приняты следующие проектные решения:

source: The following diagram demonstates how a custom group can be used to further segment hosts:
id: Diagram berikut menunjukkan bagaimana grup kustom dapat digunakan untuk host segmen lebih lanjut:
ru: Следующая диаграмма демонстрирует как пользовательская группа может быть использована для дальнейшего разделения хостов:

source: The following diagram demonstates servers with different network interface names:
id: Diagram berikut menunjukkan server dengan nama antarmuka jaringan yang berbeda:
ru: Следующая диаграмма демонстрирует серверы с различными именами сетевых интерфейсов:

source: The following diagram demonstrates a compute node serving as an OVN gatway. It is connected to the public network, which enables to connect VMs to public networks not only through routers, but also directly:
ru: На следующей схеме показан вычислительный узел, выполняющий функции шлюза OVN. Он подключен к публичной сети, что позволяет подключать виртуальные машины к публичным сетям не только через маршрутизаторы, но и напрямую:

source: The following diagram demonstrates hosts using a single bond:
id: Diagram berikut menunjukkan host menggunakan ikatan tunggal:
ru: Данная диаграмма демонстрирует использование хостами одного агрегированного интерфейса:

source: The following diagram demonstrates hosts using a single interface for OVS and LinuxBridge Scenario:
ru: Данная диаграмма демонстрирует использование хостами одиночного интерфейса для сценариев OVS и Linux Bridge:

source: The following diagram demonstrates hosts using multiple bonds:
id: Diagram berikut menunjukkan host menggunakan beberapa ikatan:
ru: Данная диаграмма демонстрирует использование хостами нескольких агрегаций:

source: The following diagram demonstrates hosts using multiple interfaces for OVS and LinuxBridge Scenario:
ru: Данная диаграмма демонстрирует использование хостами нескольких интерфейсов для сценариев OVS и Linux Bridge:

source: The following diagrams demonstrate hosts using a single bond with OVN.
ru: Данная диаграмма демонстрирует использование хостами одиночного интерфейса с OVN:

source: The following diagrams demonstrate hosts using multiple bonds with OVN.
ru: Данная диаграмма демонстрирует использование хостами нескольких агрегированных интерфейсов с OVN:

source: The following example provides a good reference for switch configuration and cab layout. This example may be more that what is required for basic setups however it can be adjusted to just about any configuration. Additionally you will need to adjust the VLANS noted within this example to match your environment.
de: Das folgende Beispiel bietet eine gute Referenz für die Schalterkonfiguration und das Kabinenlayout. Dieses Beispiel kann mehr sein als das, was für grundlegende Setups erforderlich ist, es kann jedoch an fast jede Konfiguration angepasst werden. Außerdem müssen Sie die in diesem Beispiel angegebenen VLANs an Ihre Umgebung anpassen.
id: Contoh berikut memberikan referensi yang baik untuk konfigurasi switch dan tata letak cab. Contoh ini mungkin lebih dari apa yang diperlukan untuk pengaturan dasar namun dapat disesuaikan dengan konfigurasi apa pun. Selain itu Anda perlu menyesuaikan VLANS yang tercantum dalam contoh ini agar sesuai dengan lingkungan Anda.
ru: Следующий пример предоставляет хороший шаблон для настройки коммутатора и разводки кабелей. Данный пример может быть несколько избыточным для стандартных установок, но он может быть адаптирован для практически любой конфигурации. Дополнительно вам необходимо будет изменить используемые в данном примере VLAN-ы для соответствия вашему окружению.

source: The following headers are enabled by default on all the HAProxy interfaces that implement TLS, but only for the Horizon service. The security headers can be implemented on other HAProxy services, but only services used by browsers will make use of the headers.
ru: Следующие заголовки включены по умолчанию на всех интерфейсах HAProxy, которые реализуют TLS, но только для службы Horizon. Заголовки безопасности могут быть реализованы на других службах HAProxy, но только службы, используемые браузерами, будут использовать заголовки.

source: The following host name and IP address assignments are used for this environment.
de: Die folgenden Hostnamen und IP-Adresszuweisungen werden für diese Umgebung verwendet.
id: Nama host dan alamat IP berikut digunakan untuk lingkungan ini.
ru: Следующие имена хостов и IP адреса используются для данного окружения.

source: The groups ``network_hosts`` and ``compute_hosts`` are pre-defined groups in an OpenStack-Ansible deployment.
id: Grup ``network_hosts`` dan ``compute_hosts`` adalah grup yang sudah ditentukan sebelumnya dalam penyebaran OpenStack-Ansible.
ru: Группы ``network_hosts`` и ``compute_hosts`` предустановленны в развертываниях OpenStack-Ansible.

source: The http-01 type challenge is used by certbot to deploy certificates so it is required that the public endpoint is accessible directly by the Certificate Authority.
ru: Запрос типа http-01 используется certbot для развертывания сертификатов, поэтому необходимо, чтобы публичная точка доступа была доступна напрямую центру сертификации.

source: The installation process will take a while to complete, but here are some general estimates:
de: Der Installationsvorgang wird einige Zeit in Anspruch nehmen, aber hier einige allgemeine Schätzungen:
id: Proses instalasi akan memakan waktu cukup lama untuk diselesaikan, tetapi berikut adalah beberapa perkiraan umum:
ru: Процесс установки займет некоторое время, но продолжительность, примерно, следующая:

source: The next step is to bootstrap Ansible and the Ansible roles for the development environment.
id: Langkah selanjutnya adalah untuk bootstrap Ansible dan peran Ansible untuk lingkungan pengembangan.
ru: Следующий шаг это выполнение подготовки Ansible и Ansible ролей для среды разработки.

source: The only way to use a different TLS certificates on the internal and external VIP is to use certbot.
ru: Единственный способ использовать разные сертификаты TLS на внутреннем и внешнем VIP — это использовать certbot.

source: The optionally deployed files in ``/etc/openstack_deploy/env.d`` allow the customization of Ansible groups. This allows the deployer to set whether the services will run in a container (the default), or on the host (on metal).
de: Die optional bereitgestellten Dateien in ``/etc/openstack_deploy/env.d`` ermöglichen die Anpassung von Ansible-Gruppen. Dadurch kann der Deployer festlegen, ob die Dienste in einem Container (Standard) oder auf dem Host (auf Metall) ausgeführt werden.
id: File yang disebarkan secara opsional di ``/etc/openstack_deploy/env.d`` memungkinkan kustomisasi grup Ansible. Ini memungkinkan deployer untuk mengatur apakah layanan akan berjalan dalam container (default), atau pada host (on metal).
ru: Опционально размещаемые файлы в ``/etc/openstack_deploy/env.d`` позволяют модифицировать группы Ansible. Это позволяет оператору задать, будут ли сервисы запущены в контейнере (по умолчанию), либо же на сервере (без контейнера).

source: The options below are not mutually exclusive and may be combined if desired.
de: Die folgenden Optionen schließen sich nicht gegenseitig aus und können bei Bedarf kombiniert werden.
id: Opsi di bawah ini tidak eksklusif satu sama lain dan dapat digabungkan jika diinginkan.
ru: Нижеприведенные параметры не исключают друг друга, и могут быть совмещены при необходимости.

source: The oslo.messaging drivers provide the transport integration for the selected protocol and backend server. The following table summarizes the supported oslo.messaging drivers and the communication services they support.
id: Driver oslo.messaging menyediakan integrasi transportasi untuk protokol dan server backend yang dipilih. Tabel berikut merangkum driver oslo.messaging yang didukung dan layanan komunikasi yang didukungnya.
ru: Драйверы oslo.messaging предоставляют интеграцию транспорта для выбранного протокола и сервера. Следующая таблица резюмирует поддерживаемые драйверы oslo.messaging и сервисы взаимодействия, которые они поддерживают.

source: The oslo.messaging library is part of the OpenStack Oslo project that provides intra-service messaging capabilities. The library supports two communication patterns (RPC and Notify) and provides an abstraction that hides the details of the messaging bus operation from the OpenStack services.
id: The oslo.messaging library adalah bagian dari proyek OpenStack Oslo yang menyediakan kemampuan pengiriman pesan intra-service. Library mendukung dua pola komunikasi (RPC dan Notify) dan menyediakan abstraksi yang menyembunyikan detail operasi bus perpesanan dari layanan OpenStack.
ru: Библиотека oslo.messaging является частью проекта OpenStack Oslo, который предоставляет возможности обмена сообщениями между сервисами. Библиотека поддерживает два паттерна взаимодействия (RPC и уведомления) и предоставляет абстракцию, которая прячет детали процесса обмена сообщениями от сервисов OpenStack.

source: The oslo.messaging library supports a messaging `transport plugin`_ capability such that RPC and Notify communications can be separated and different messaging backend servers can be deployed.
id: oslo.messaging library mendukung kemampuan `transport plugin`_ perpesanan sehingga komunikasi RPC dan Notify dapat dipisahkan dan berbagai server backend perpesanan dapat digunakan.
ru: Библиотека oslo.messaging поддерживает возможность `transport plugin`_, так что RPC и уведомления могут быть разъединены и для них могут быть развернуты различные серверы для обмена сообщениями.

source: The playbook deploys your user-provided SSL certificate, key, and CA certificate to each RabbitMQ container.
de: Das Playbook stellt das von Ihnen bereitgestellte SSL-Zertifikat, den Schlüssel und das CA-Zertifikat für jeden RabbitMQ-Container bereit.
id: Playbook menyebarkan sertifikat SSL, kunci, dan sertifikat CA yang disediakan pengguna ke setiap container RabbitMQ.
ru: Плейбук установит предоставленный вами SSL сертификат, ключ и промежуточные сертификаты на каждый контейнер RabbitMQ.

source: The process is identical for the other services. Replace `rabbitmq` in the preceding configuration variables with `horizon`, `haproxy`, or `keystone`, and then run the playbook for that service to deploy user-provided certificates to those services.
de: Der Prozess ist für die anderen Dienste identisch. Ersetzen Sie `rabbitmq` in den vorhergehenden Konfigurationsvariablen durch` horizon`, `haproxy` oder` keystone`. Führen Sie dann das Playbook für diesen Dienst aus, um von Benutzern bereitgestellte Zertifikate für diese Dienste bereitzustellen.
id: Prosesnya identik untuk layanan lain. Ganti `rabbitmq` dalam variabel konfigurasi sebelumnya dengan `horizon`, `haproxy`, atau `keystone`, dan kemudian jalankan playbook untuk layanan itu untuk menggunakan sertifikat yang disediakan pengguna ke layanan tersebut.
ru: Процесс идентичен для остальных сервисов. Замените префикс `rabbitmq` в переменной на `horizon`, `haproxy` или `keystone`, а после запустите плейбук для данного сервиса для разливки предоставленного сертификата на данные сервисы.

source: The reason of this failure might be resulting from a noexec mount flag used for the filesystem associated with /tmp which you can check by running the following command:
de: Der Grund für diesen Fehler liegt möglicherweise in einem noexec-Mount-Flag, das für das Dateisystem verwendet wird, das /tmp zugeordnet ist. Sie können dies überprüfen, indem Sie den folgenden Befehl ausführen:
id: Alasan kegagalan ini mungkin disebabkan oleh flag mount noexec yang digunakan untuk filesystem yang terkait dengan /tmp yang dapat Anda periksa dengan menjalankan perintah berikut:
ru: Причина данной ошибки может быть следствием установленного флага noexec, использованного при монтировании файловой системы для /tmp, который вы можете проверить при помощи следующей команды:

source: The required changes are described in the documentation of Ceilometer. This is just a sum up. In your ceph.conf add:
id: Perubahan yang diperlukan dijelaskan dalam dokumentasi Ceilometer. Ini hanyalah sebuah ringkasan. Di ceph.conf Anda tambahkan:
ru: Данные изменения описаны в документации к Ceilometer. Мы приводим это только чтобы подвести итог. В вашем ceph.conf добавьте:

source: The required user and credentials is created by this command:
id: Pengguna dan kredensial yang diperlukan dibuat oleh perintah ini:
ru: Требуемый пользователь и данные доступа создаются следующей командой:

source: The telemetry (and in consequence accounting) for radosgw as object-storage will not work out of the box. You need to change different parts of your OpenStack and Ceph setup to get it up and running.
id: Telemetri (dan sebagai konsekuensinya akuntansi) untuk radosgw sebagai object-storage tidak akan bekerja di luar kotak. Anda perlu mengubah berbagai macam bagian dari pengaturan OpenStack dan Ceph Anda untuk menjalankannya.
ru: Telemetry (и, как следствие, учет) для radosgw как объектного хранилища не работает сразу после установки. Необходимо отредактировать некоторые части вашей установки OpenStack и Ceph для включения поддержки сбора данных.

source: The trait set command replaces all existing traits with the set provided, so you must specify all existing traits as well as the new trait.
ru: Команда установки спецификаций замещает все существующие в базе спецификации переданным в команду значением, соответсвенно вам необходимо передать все уже существующие спецификации вместе с новыми.

source: The variables to set which provide the path on the deployment node to the certificates for HAProxy configuration are:
de: Die zu setzenden Variablen, die den Zertifikaten für die HAProxy-Konfiguration den Pfad auf dem Implementierungsknoten bereitstellen, sind:
id: Variabel yang akan ditetapkan yang menyediakan jalur pada deployment node ke sertifikat untuk konfigurasi HAProxy adalah:
ru: Переменные к определению, которые содержат путь к сертификатам на ноде развертывания для настройки HAProxy:

source: The |current_release_formal_name| release is only compatible with Debian 12 (bookworm), Ubuntu 22.04 (Jammy Jellyfish), Ubuntu 24.04 (Noble Numbat), CentOS 9 Stream, and derivitives of CentOS Stream/RHEL such as Rocky Linux.
ru: Текущий релиз |current_release_formal_name| совместим только со следующими опреационными системами: Debian 12 (bookworm), Ubuntu 22.04 (Jammy Jellyfish), Ubuntu 24.04 (Noble Numbat), CentOS 9 Stream и производными CentOS Stream/RHEL, такими как Rocky Linux.

source: Then, in `/etc/openstack_deploy/user_variables.yml`, configure the deployment to copy these files from the host into the container cache image.
ru: После, в `/etc/openstack_deploy/user_variables.yml`, настройте развертывание для копирования данных файлов с хоста в кэш образа контейнера.

source: Then, run the playbook to apply the certificates:
de: Führen Sie dann das Playbook aus, um die Zertifikate anzuwenden:
id: Kemudian, jalankan playbook untuk menerapkan sertifikat:
ru: Потом запустите плейбук для применения сертификатов:

source: There are a variety of clients and libraries available for interacting with an OpenStack deployment, including as `openstackclient`__, `openstacksdk`__, or `gophercloud`__. These are typically configured using either environment variables sourced from an ``openrc`` file or the newer ``clouds.yaml`` file.
ru: Существует множество клиентов и библиотек, доступных для взаимодействия с развертыванием OpenStack, включая `openstackclient`__, `openstacksdk`__ или `gophercloud`__. Обычно они настраиваются с использованием переменных среды, полученных из файла ``openrc`` или более нового файла ``clouds.yaml``.

source: There are also couple of additional things which you might want to consider:
ru: Есть еще несколько дополнительных вещей, которые вам, возможно, стоит учесть:

source: There are multiple complications related to organizing storage where the storage is not stretched between Availability Zones.
ru: Существует множество сложностей, связанных с организацией хранения, когда хранилище не распределено между зонами доступности.

source: There are no issues enabling TLS live migration during an OpenStack upgrade, as long as you do not need to live migrate instances during the upgrade. If you you need to live migrate instances during an upgrade, enable TLS live migrations before or after the upgrade.
ru: Нет проблем с включением живой миграции TLS во время обновления OpenStack, пока вам не нужно выполнять ee для инстансов во время обновления. Если же вам нужно ее выполнить во время обновления, включите живую миграцию TLS до или после обновления.

source: There are situations where a deployer want to override sources with its own fork.
de: Es gibt Situationen, in denen ein Deployer Quellen mit einer eigenen Verzweigung überschreiben möchte.
id: Ada situasi di mana seorang deployer ingin menimpa sumber dengan fork sendiri.
ru: Бывают ситуации, когда оператор хочет переопределить источники своей собственной копией.

source: There are three steps to running an AIO build, with an optional first step should you need to customize your build:
de: Es gibt drei Schritte zum Ausführen eines AIO-Builds mit einem optionalen ersten Schritt, falls Sie Ihren Build anpassen müssen:
id: Ada tiga langkah untuk menjalankan build AIO, dengan langkah pertama opsional jika Anda perlu menyesuaikan build Anda:
ru: Имеется три необходимых шага для запуска установки AIO, с опциональным первым шагом, если вам нужно настроить развертывание:

source: There can be a usecase where you might want to run HAProxy and Keepalived inside LXC containers. For instance, running these services on bare metal assumes that a default route for hosts should be set towards a public network. This scenario might be un-preferable for some deployments, especially in cases where you do not have standalone Load-Balancing hosts, but they're co-located with other infra services instead.
ru: Может быть вариант использования, когда вы захотите запустить HAProxy и Keepalived внутри контейнеров LXC. Например, запуск этих служб на физических серверах предполагает, что маршрут по умолчанию для хостов должен быть установлен в направлении публичной сети. Этот сценарий может быть непредпочтительным для некоторых развертываний, особенно в случаях, когда у вас нет отдельных балансировщиков нагрузки, но они размещены вместе с другими инфраструктурными службами.

source: There is also an option to enable it only for individual services:
ru: Также есть возможность включить его только для отдельных служб:

source: These lists are intentionally not exhaustive and equivalents will be required for other Linux distributions. Consult the OpenStack-Ansible playbooks and role documentation for further repositories and the variables that may be used to override the repository location.
de: Diese Listen sind absichtlich nicht erschöpfend und für andere Linux-Distributionen sind Entsprechungen erforderlich. Konsultieren Sie die OpenStack-Ansible-Spielbücher und die Rollendokumentation für weitere Repositorys und die Variablen, die zum Überschreiben des Repository-Speicherorts verwendet werden können.
id: Daftar ini sengaja tidak lengkap dan setara akan diperlukan untuk distribusi Linux lainnya. Konsultasikan playbook OpenStack-Ansible dan dokumentasi role untuk repositori lebih lanjut dan variabel yang dapat digunakan untuk mengganti lokasi repositori.
ru: Эти списки намеренно не являются исчерпывающими, и для других дистрибутивов Linux потребуются эквиваленты. Ознакомьтесь с плейбуками OpenStack-Ansible и документацией по ролям для получения дополнительных репозиториев и переменных, которые могут использоваться для переопределения месторасположения репозитория.

source: These tools and their underlying libraries are used by Ansible itself and the OpenStack-Ansible playbooks, so there must be a proxy configuration in place for the playbooks to successfully access external resources.
de: Diese Tools und ihre zugrunde liegenden Bibliotheken werden von Ansible selbst und den OpenStack-Ansible-Playbooks verwendet. Daher muss eine Proxy-Konfiguration vorhanden sein, damit die Playbooks erfolgreich auf externe Ressourcen zugreifen können.
id: Alat-alat ini dan pustaka-pustaka yang mendasarinya digunakan oleh Ansible sendiri dan playbook OpenStack-Ansible, sehingga harus ada konfigurasi proxy yang ada agar playbook dapat mengakses sumber daya eksternal dengan sukses.
ru: Эти инструменты и положенные в их основу библиотеки используются как непосредственно Ansible-ом, так и плейбуками OpenStack-Ansible. Потому для успешного доступа плейбуков к внешним ресурсам должна быть произведена настройка прокси.

source: These variables behave a little differently than standard ansible precedence, because they are also consumed by a custom lookup plugin.
de: Diese Variablen verhalten sich etwas anders als die Standard-Ansible-Priorität, da sie auch von einem benutzerdefinierten Lookup-Plug-in verwendet werden.
id: Variabel ini berperilaku sedikit berbeda dari presedensi ansible standar, karena mereka juga dikonsumsi oleh plugin pencarian kustom (custom lookup plugin).
ru: Данные переменные ведут себя немного иначе, чем стандартные переменные ansible, так как они также используются нестандартным lookup плагином.

source: This OpenStack-Ansible documentation currently assumes that a deployer wishes to run images on a compute host with a native CPU architecure, and does not give an example configuration involving emulation.
ru: В данной документации OpenStack-Ansible в настоящее время предполагается, что оператор желает запускать образы на вычислительном хосте с собственной архитектурой процессора, и не приводится пример конфигурации, включающий эмуляцию.

source: This chapter contains information to configure specific security settings for your OpenStack-Ansible cloud.
de: Dieses Kapitel enthält Informationen zum Konfigurieren bestimmter Sicherheitseinstellungen für Ihre OpenStack-Ansible-Cloud.
id: Bab ini berisi informasi untuk mengonfigurasi pengaturan keamanan spesifik untuk cloud yang dimungkinkan oleh OpenStack Anda.
ru: Данный раздел содержит информацию о настройке определенных параметров безопасности вашего облака OpenStack-Ansible.

source: This chapter gives case-by-case examples on how to override the default sources.
de: In diesem Kapitel finden Sie fallweise Beispiele zum Überschreiben der Standardquellen.
id: Bab ini memberikan contoh kasus per kasus tentang cara mengganti sumber default.
ru: Данный раздел предоставляет ситуативные примеры переопределения стандартных источников.
