Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-user.po
Languages: de, id, ru

source: This diagram is not to scale and is not even 100% accurate, this diagram was built for informational purposes only and should **ONLY** be used as such.
de: Dieses Diagramm ist nicht maßstabsgetreu und nicht einmal 100% genau. Dieses Diagramm wurde nur zu Informationszwecken erstellt und sollte ** NUR ** als solches verwendet werden.
id: Diagram ini tidak untuk skala dan bahkan tidak 100% akurat, diagram ini dibangun hanya untuk tujuan informasi dan seharusnya **ONLY** digunakan seperti itu.
ru: Данная диаграмма не масштабируется и даже не точна на 100%, она была создана в ознакомительных целях и должна использоваться **ТОЛЬКО** для них.

source: This example environment has the following characteristics:
de: Diese Beispielumgebung weist die folgenden Merkmale auf:
id: Lingkungan contoh ini memiliki karakteristik sebagai berikut:
ru: Данное иллюстративное окружение имеет следующие характеристики:

source: This example will focus on the deployment of both OpenStack-Ansible and its Ceph cluster.
de: Dieses Beispiel konzentriert sich auf die Bereitstellung von OpenStack-Ansible und seines Ceph-Clusters.
id: Contoh ini akan fokus pada penyebaran OpenStack-Ansible dan cluster Ceph-nya.
ru: Данный пример фокусируется на развертывании как OpenStack-Ansible, так и его Ceph кластера.

source: This functionality can be changed by overriding the list of headers in ``haproxy_security_headers`` variable in the ``/etc/openstack_deploy/user_variables.yml`` file.
ru: Эту функциональность можно изменить, переопределив список заголовков в переменной ``haproxy_security_headers`` в файле ``/etc/openstack_deploy/user_variables.yml``.

source: This host will build python wheels for it's own architecture which will speed up the deployment of many hosts. If you do not make a repository server for each architecture, ensure that measures are taken not to overload the opendev.org git servers, such as using local mirrors of all OpenStack service repos.
ru: Этот хост будет использован для сборки python wheels для собственной архитектуры, которые в дальнейшем ускорят развертывание остальных хостов. Если вы не создаете сервер репозитория для каждой архитектуры, убедитесь, что приняты меры против перегрузки серверов git opendev.org. Например, используя локальные зеркала для репозиториев всех служб OpenStack.

source: This is an example production environment for a working OpenStack-Ansible (OSA) deployment with high availability services.
de: Dies ist eine Beispielproduktionsumgebung für eine funktionierende OpenStack-Ansible (OSA) Bereitstellung mit Hochverfügbarkeitsdiensten.
id: Ini adalah contoh lingkungan produksi untuk penyebaran OpenStack-Ansible (OSA) yang berfungsi dengan layanan ketersediaan tinggi.
ru: Это пример рабочего окружения для развертывания OpenStack-Ansible (OSA) с сервисами высокой доступности.

source: This is done by executing the following:
de: Dies geschieht, indem Sie Folgendes ausführen:
id: Ini dilakukan dengan mengeksekusi yang berikut:
ru: Это можно сделать выполнив:

source: This issue is being tracked in an `oslo.messaging bug`_.
ru: Эта проблема отслеживается в `ошибке oslo.messaging`_.

source: This method only requires a very small amount of configuration in ``user_variables.yml`` to point to the external ceph cluster monitors. The whole configuration for ceph-ansible would live outside the OpenStack-Ansible deployment and there is no duplication. The ``ceph_mons`` variable expects a list of IP addresses for the Ceph Monitor servers in the external ceph deployment:
ru: Этот метод требует лишь очень небольшого количества настроек в ``user_variables.yml`` для указания на внешние мониторы кластера ceph. Вся конфигурация для ceph-ansible будет находиться вне развертывания OpenStack-Ansible, и не будет никакого дублирования. Переменная ``ceph_mons`` ожидает список IP-адресов для мониторов ceph во внешнем развертывании:

source: This section describes an example production environment for a working OpenStack-Ansible (OSA) deployment with high availability services and using the Ceph backend for images, volumes, and instances.
de: In diesem Abschnitt wird eine Beispielproduktionsumgebung für eine funktionierende OpenStack-Ansible-Bereitstellung (OSA) mit Hochverfügbarkeitsdiensten und die Verwendung des Ceph-Back-Ends für Abbilder, Datenträger und Instanzen beschrieben.
id: Bagian ini menjelaskan contoh lingkungan produksi untuk penyebaran OpenStack-Ansible (OSA) yang berfungsi dengan layanan ketersediaan tinggi (high availability) dan menggunakan backend Ceph untuk image, volume, dan instance.
ru: В данной секции описывается пример готового к эксплуатации окружения для рабочего развертывания OpenStack-Ansible (OSA) с высокодоступными сервисами и использованием Ceph хранилища для образов, дисков и инстансов.

source: This section describes an example production environment for a working OpenStack-Ansible (OSA) deployment with high availability services where provider networks and connectivity between physical machines are routed (layer 3).
de: In diesem Abschnitt wird eine Beispielproduktionsumgebung für eine funktionierende OpenStack-Ansible-Bereitstellung (OSA) mit Hochverfügbarkeitsdiensten beschrieben, bei der Providernetzwerke und Verbindungen zwischen physischen Maschinen geroutet werden (Layer 3).
id: Bagian ini menjelaskan contoh lingkungan produksi untuk penyebaran OpenStack-Ansible (OSA) yang berfungsi dengan layanan ketersediaan tinggi di mana jaringan penyedia dan konektivitas antara mesin fisik dialihkan (layer 3).
ru: В данной секции описывается пример готового к эксплуатации окружения для рабочего развертывания OpenStack-Ansible (OSA) с высокодоступными сервисами, где сети провайдера и соединение между физическими серверами маршрутизируются (layer 3).

source: This section provides an overview of hybrid messaging deployment concepts and describes the necessary steps for a working OpenStack-Ansible (OSA) deployment where RPC and Notify communications are separated and integrated with different messaging server backends.
ru: В этом разделе представлен обзор концепций развертывания гибридных сообщений и описаны необходимые шаги для рабочего развертывания OpenStack-Ansible (OSA), в котором RPC-коммуникации и сообщения Notify разделены и интегрированы с различными серверными частями обмена сообщениями.

source: This step applies particularly to existing ``x86_64`` environments when new ``aarch64`` compute nodes are added and it cannot be assumed that the ``hw_architecure`` property is applied to all Glance images as the operator may not be in control of all image uploads.
ru: Этот шаг особенно актуален для существующих сред ``x86_64``, когда добавляются новые вычислительные узлы ``aarch64``, и нельзя предполагать, что свойство ``hw_architecure`` применяется ко всем образам Glance, поскольку оператор может не контролировать все загрузки образов.

source: This will present a login page. By default, OpenStack-Ansible create a user called ``admin``. The password will be the value of the ``keystone_auth_admin_password`` variable. If you did not configure this variable, OpenStack-Ansible auto-generates one. You can view the configured password in the ``/etc/openstack_deploy/user_secrets.yml`` file.
ru: Это представит страницу входа. По умолчанию OpenStack-Ansible создает пользователя с именем ``admin``. Паролем будет значение переменной ``keystone_auth_admin_password``. Если вы не настроили эту переменную, OpenStack-Ansible сгенерирует ее автоматически. Вы можете просмотреть настроенный пароль в файле ``/etc/openstack_deploy/user_secrets.yml``.

source: Three Availability Zones (AZs)
ru: Три зоны доступности (AZ)

source: Three Ceph OSD storage hosts
de: Drei Ceph OSD-Speicher-Hosts
id: Tiga host penyimpanan Ceph OSD
ru: Три хоста под хранилище Ceph OSD

source: Three Ceph storage clusters provisioned with Ceph Ansible.
ru: Три кластера хранения Ceph, подготовленные с помощью Ceph Ansible.

source: Three infrastructure (control plane) hosts
de: Drei Infrastruktur (Kontrollebene) Hosts
id: Tiga host infrastruktur (control plane)
ru: Три инфраструктурных (управляющих) хоста

source: Three infrastructure (control plane) hosts with ceph-mon containers
de: Drei Infrastruktur (Kontrollebene) Hosts mit Ceph-Mon-Containern
id: Tiga host infrastruktur (control plane) dengan kontainer ceph-mon
ru: Три инфраструктурных (управляющих) хоста с контейнерами ceph-mon

source: Three infrastructure (control plane) hosts, each host is placed in a different Availability Zone
ru: Три инфраструктурных (управляющих) хоста, каждый хост размещен в отдельной зоне доступности

source: To add OpenStack Services over and above the bootstrap-aio default services for the applicable scenario, copy the ``conf.d`` files with the ``.aio`` file extension into ``/etc/openstack_deploy`` and rename then to ``.yml`` files. For example, in order to enable the OpenStack Telemetry services, execute the following:
id: Untuk menambahkan OpenStack Service di atas dan di atas layanan default bootstrap-aio untuk skenario yang berlaku, salin file ``conf.d`` dengan ekstensi file `` .aio`` ke ``/etc/openstack_deploy`` dan ganti nama kemudian ke file ``.yml``. Misalnya, untuk mengaktifkan layanan Telemetri OpenStack, jalankan yang berikut:
ru: Чтобы добавить сервисы OpenStack в дополнение к сервисам настраивающимся AIO по умолчанию в рамках сценария, скопируйте файлы из директории ``conf.d`` с расширением ``.aio`` в ``/etc/openstack_deploy`` и смените их расширение на ``.yml``. Например, для того, что бы подключить сервисы Telemetry OpenStack, выполните следующее:

source: To add any global overrides, over and above the defaults for the applicable scenario, edit ``/etc/openstack_deploy/user_variables.yml``. In order to understand the various ways that you can override the default behaviour set out in the roles, playbook and group variables, see :ref:`user-overrides`.
id: Untuk menambahkan global override, melebihi dan di atas default untuk skenario yang berlaku, edit ``/etc/openstack_deploy/user_variables.yml``. Untuk memahami berbagai cara agar Anda dapat menimpa perilaku default yang ditetapkan dalam variabel role, playbook, dan grup, lihat :ref:`user-overrides`.
ru: Для того, что бы глобально переопределить значения по умолчанию для сценария, отредактируйте ``/etc/openstack_deploy/user_variables.yml``. Для понимания различных способов переопределения стандартного поведения, заданного в ролях, плейбуках и переменных групп, ознакомьтесь с :ref:`user-overrides`.

source: To address these challenges, the following changes to the basic design were made:
ru: Для решения этих проблем были внесены следующие изменения в базовую конструкцию:

source: To avoid downtime, it is recommended to enable ``openstack_service_accept_both_protocols`` until all services are configured correctly. It allows HAProxy frontends to listen on both HTTP and HTTPS.
ru: Чтобы избежать простоя, рекомендуется включить ``openstack_service_accept_both_protocols``, пока все службы не будут настроены правильно. Это позволяет фронтендам HAProxy прослушивать как HTTP, так и HTTPS.

source: To avoid unwanted QEMU emulation of non native architectures it is necessary to ensure that only the native ``qemu-system-*`` binary is present on all compute nodes. The simplest way to do this for existing deployments is to use the system package manager to ensure that the unwanted binaries are removed.
ru: Чтобы избежать нежелательной эмуляции QEMU неродных архитектур, необходимо убедиться, что на всех вычислительных узлах присутствует только родной бинарный файл ``qemu-system-*``. Самый простой способ сделать это для существующих развертываний — использовать системный менеджер пакетов, чтобы убедиться, что нежелательные бинарные файлы удалены.

source: To better understand why some configuration options were applied in examples it is also recommended to look through :ref:`configuring-inventory`
ru: Чтобы лучше понять, почему некоторые параметры конфигурации были применены в примерах, рекомендуется также просмотреть :ref:`configuring-inventory`

source: To change the default max age to 1 day, override the variable ``haproxy_security_headers_max_age`` in the ``/etc/openstack_deploy/user_variables.yml`` file:
ru: Чтобы изменить максимальный возраст по умолчанию на 1 день, переопределите переменную ``haproxy_security_headers_max_age`` в файле ``/etc/openstack_deploy/user_variables.yml``:

source: To configure easy_install to use an alternative index, create the file `/root/.pydistutils.cfg` with the following content.
id: Untuk mengonfigurasi easy_install agar menggunakan indeks alternatif, buat file `/root/.pydistutils.cfg` dengan konten berikut.
ru: Для настройки easy_install используйте альтернативный индекс, создайте файл `/root/.pydistutils.cfg` со следующим содержанием.

source: To deploy HAProxy in container we need to create a file ``/etc/openstack_deploy/env.d/haproxy.yml`` with the following content:
ru: Для развертывания HAProxy в контейнере нам необходимо создать файл ``/etc/openstack_deploy/env.d/haproxy.yml`` со следующим содержимым:

source: To deploy certificates with certbot, add the following to ``/etc/openstack_deploy/user_variables.yml`` to enable the certbot function in the HAProxy ansible role, and to create a new backend service called ``certbot`` to service http-01 challenge requests.
ru: Чтобы развернуть сертификаты с помощью certbot, добавьте следующее в ``/etc/openstack_deploy/user_variables.yml``, чтобы включить функцию certbot в роли HAProxy ansible, а также создать новую внутреннюю службу с именем ``certbot`` для обслуживания запросов http-01.

source: To deploy user-provided certificates for RabbitMQ, copy the certificates to the deployment host, edit the ``/etc/openstack_deploy/user_variables.yml`` file and set the following three variables:
de: Um von Benutzern bereitgestellte Zertifikate für RabbitMQ bereitzustellen, kopieren Sie die Zertifikate auf den Implementierungshost, bearbeiten Sie die Datei `` / etc / openstack_deploy / user_variables.yml`` und legen Sie die folgenden drei Variablen fest:
id: Untuk menggunakan sertifikat yang disediakan pengguna untuk RabbitMQ, salin sertifikat ke host penyebaran, edit file ``/etc/openstack_deploy/user_variables.yml`` dan tetapkan tiga variabel berikut:
ru: Для установки определенных пользователем сертификатов на RabbitMQ, скопируйте сертификаты на хост развертывания, отредактируйте файл ``/etc/openstack_deploy/user_variables.yml`` и задайте следующие переменные:

source: To force a self-signed certificate to regenerate with every playbook run, set the ``user_pki_regen_cert`` variable to ``true`` in the ``/etc/openstack_deploy/user_variables.yml`` file:
ru: Чтобы принудительно регенерировать самоподписанный сертификат при каждом запуске сценария, установите для переменной ``user_pki_regen_cert`` значение ``true`` в файле ``/etc/openstack_deploy/user_variables.yml``:

source: To force a self-signed certificate to regenerate with every playbook run, set the appropriate regeneration option to ``true``. For example, if you have already run the ``haproxy`` playbook, but you want to regenerate the self-signed certificate, set the ``haproxy_pki_regen_cert`` variable to ``true`` in the ``/etc/openstack_deploy/user_variables.yml`` file:
ru: Чтобы заставить самоподписанный сертификат регенерироваться при каждом запуске playbook, установите соответствующий параметр регенерации в ``true``. Например, если вы уже запустили playbook ``haproxy``, но хотите регенерировать самоподписанный сертификат, установите переменную ``haproxy_pki_regen_cert`` в ``true`` в файле ``/etc/openstack_deploy/user_variables.yml``:

source: To force a self-signed certificate to regenerate, you can pass the variable to ``openstack-ansible`` on the command line:
de: Um zu erzwingen, dass ein selbstsigniertes Zertifikat neu generiert wird, können Sie die Variable in der Befehlszeile an &quot;openstack-ansible&quot; übergeben:
id: Untuk memaksa sertifikat yang ditandatangani sendiri untuk dibuat ulang, Anda bisa meneruskan variabel ke ``openstack-ansible`` pada baris perintah:
ru: Для принудительного обновления самоподписанного сертификата, вы можете передать переменную ``openstack-ansible`` в командной строке:

source: To force the use of SSH instead of TLS for live migrations you must set the ``nova_libvirtd_listen_tls`` variable to ``0`` in the ``/etc/openstack_deploy/user_variables.yml`` file:
ru: Чтобы принудительно использовать SSH вместо TLS для живых миграций, необходимо установить переменную ``nova_libvirtd_listen_tls`` в ``0`` в файле ``/etc/openstack_deploy/user_variables.yml``:

source: To generate user certificates, define a variable with the prefix ``user_pki_certificates_`` in the ``/etc/openstack_deploy/user_variables.yml`` file.
ru: Для генерации пользовательских сертификатов определите переменную с префиксом ``user_pki_certificates_`` в файле ``/etc/openstack_deploy/user_variables.yml``.

source: To get your credentials, execute:
id: Untuk mendapatkan kredensial Anda, laksanakan:
ru: Для того, что бы получить данные доступа, выполните:

source: To help with the transition from unencrypted VNC to VeNCrypt, initially noVNC proxy auth scheme allows for both encrypted and unencrypted sessions using the variable `nova_vencrypt_auth_scheme`. This will be restricted to VeNCrypt only in future versions of OpenStack-Ansible.
ru: Чтобы помочь с переходом от незашифрованного VNC к VeNCrypt, изначально схема аутентификации прокси noVNC допускает как зашифрованные, так и незашифрованные сеансы с использованием переменной `nova_vencrypt_auth_scheme`. Это будет ограничено VeNCrypt только в будущих версиях OpenStack-Ansible.

source: To not encrypt data from noVNC proxy to Compute nodes you must set the ``nova_qemu_vnc_tls`` variable to ``0`` in the ``/etc/openstack_deploy/user_variables.yml`` file:
ru: Чтобы не шифровать данные из прокси-сервера noVNC на вычислительные узлы, необходимо установить переменную ``nova_qemu_vnc_tls`` в ``0`` в файле ``/etc/openstack_deploy/user_variables.yml``:

source: To regenerate a new self-signed certificate for a service, you must set the ``<servicename>_pki_regen_cert`` variable to true in one of the following ways:
ru: Чтобы повторно создать новый самоподписанный сертификат для службы, необходимо установить переменную ``<servicename>_pki_regen_cert`` в значение true одним из следующих способов:

source: To regenerate a new self-signed certificate for a service, you must set the ``user_pki_regen_cert`` variable to true in one of the following ways:
ru: Чтобы повторно создать новый самоподписанный сертификат для службы, необходимо установить переменную ``user_pki_regen_cert`` в значение true одним из следующих способов:

source: To regenerate the certificate authority you must set the ``openstack_pki_regen_ca`` variable to either the name of the root CA or intermediate CA you wish or regenerate, or to ``true`` to regenerate all self-signed certificate authorities.
ru: Чтобы повторно сгенерировать центр сертификации, необходимо установить переменную ``openstack_pki_regen_ca``либо на имя корневого центра сертификации или промежуточного центра сертификации, который вы хотите повторно сгенерировать, либо на ``true``, чтобы повторно сгенерировать все самоподписанные центры сертификации.

source: To set the CSP policy to report only by overriding the ``haproxy_security_headers_csp_report_only`` variable to ``True`` in the ``/etc/openstack_deploy/user_variables.yml`` file:
ru: Чтобы настроить политику CSP на создание отчетов только путем переопределения переменной ``haproxy_security_headers_csp_report_only`` на ``True`` в файле ``/etc/openstack_deploy/user_variables.yml``:

source: Tunnel (Geneve) IP
ru: IP туннеля (Geneve)

source: Tunnel (VXLAN) IP
ru: Туннелированный (VXLAN) IP

source: Tunnel (VXLAN) Network
de: Tunnel (VXLAN) Netzwerk
ru: Туннелированная (VXLAN) сеть

source: Tunnel networks which are reachable between Availability Zones
ru: Туннелированные сети, доступные между зонами доступности

source: Two additional settings in /etc/nova/nova.conf in all Nova API instances:
ru: Две дополнительные настройки в /etc/nova/nova.conf для всех Nova API сервисов:

source: Two compute hosts
de: Zwei Rechnerhosts
id: Dua host komputasi
ru: Два хоста под вычислительные ресурсы

source: Typically these tools read environment variables containing proxy server settings. These environment variables can be configured in ``/etc/environment`` if required.
de: In der Regel lesen diese Tools Umgebungsvariablen mit Proxy-Server-Einstellungen. Diese Umgebungsvariablen können bei Bedarf in ``/etc/environment`` konfiguriert werden.
id: Biasanya alat ini membaca variabel lingkungan yang berisi pengaturan server proxy. Variabel lingkungan ini dapat dikonfigurasi dalam ``/etc/environment`` jika diperlukan.
ru: Обычно эти инструменты считывают переменные окружения, содержащие настройки прокси сервера. Эти переменные окружения, при необходимости, можно задать в ``/etc/environment``.

source: Undocumented Behaviour Alert!
ru: Предупреждение о недокументированом поведении!

source: Unreliable or low bandwidth external connectivity
de: Unzuverlässige oder niedrige Bandbreite externe Konnektivität
id: Konektivitas eksternal bandwidth rendah atau tidak dapat diandalkan
ru: Ненадежное или медленное внешнее соединение

source: Update HAProxy
ru: Обновите HAProxy

source: Upload images to Glance.
ru: Загрузите образы в Glance.

source: Upstream Ubuntu repositories to mirror for Ubuntu 22.04 LTS:
ru: Репозитории Ubuntu для зеркалирования на примере Ubuntu 22.04 LTS:

source: Use custom path for ``/etc/openstack_deploy`` directory. You can place OpenStack-Ansible configuration directory inside user home directory. For that you will need to define the following environment variable:
ru: Используйте произвольный путь для каталога ``/etc/openstack_deploy``. Вы можете разместить каталог конфигурации OpenStack-Ansible внутри домашнего каталога пользователя. Для этого вам нужно будет определить следующую переменную среды:

source: Use the following process to add a ``security.txt`` file to your deployment using OpenStack-Ansible:
ru: Используйте следующий процесс для добавления файла ``security.txt`` в ваше развертывание с помощью OpenStack-Ansible:

source: Use the following process to deploy user-provided SSL certificates in OpenStack-Ansible:
de: Verwenden Sie den folgenden Prozess, um von Benutzern bereitgestellte SSL-Zertifikate in OpenStack-Ansible bereitzustellen:
id: Gunakan proses berikut untuk menggunakan sertifikat SSL yang disediakan pengguna di OpenStack-Ansible:
ru: Используйте следующий подход для установки собственных SSL сертификатов в OpenStack-Ansible:

source: User Guide
de: Benutzerhandbuch
id: Panduan pengguna
ru: Руководство пользователя

source: User variables
de: Benutzervariablen
id: User variables (variabel pengguna)
ru: Пользовательские переменные

source: User-provided certificates
de: Vom Benutzer bereitgestellte Zertifikate
id: User-provided certificate (sertifikat yang disediakan pengguna)
ru: Сертификаты, предоставленные пользователем

source: Using Let's Encrypt
ru: Использование Let's Encrypt

source: Using a GUI
ru: Использование графического интерфейса

source: Using a client or library
ru: Использование клиента или библиотеки

source: Using domain (or path) based endpoints instead of port-based
ru: Использование точек доступа на основе домена (или пути) вместо точек входа на основе порта

source: Using radosgw as a drop-in replacement for Swift
id: Menggunakan radosgw sebagai pengganti (drop-in replacement) untuk Swift
ru: Использование radosgw, как замены Swift

source: Using this username and password combination, log in to Horizon.
ru: Используя эту комбинацию имени пользователя и пароля, войдите в Horizon.
