Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: de, id

source: The default layout does not rely exclusively on groups being subsets of other groups. The ``memcache`` component group is part of the ``memcache_container`` group, as well as the ``memcache_all`` group and also contains a ``memcached`` component group. If you review the ``playbooks/memcached-install.yml`` playbook, you see that the playbook applies to hosts in the ``memcached`` group. Other services might have more complex deployment needs. They define and consume inventory container groups differently. Mapping components to several groups in this way allows flexible targeting of roles and tasks.
de: Das Standardlayout basiert nicht ausschließlich auf Gruppen, die Teilmengen anderer Gruppen sind. Die ``memcache``-Komponentengruppe ist Teil der ``memcache_container``-Gruppe, sowie der ``memcache_all``-Gruppe und enthält auch eine ``memcached``-Komponentengruppe. Wenn Sie das Playbook ``playbooks/memcached-install.yml`` ansehen, sehen Sie, dass das Playbook für Hosts in der Gruppe ``memcached`` gilt. Andere Dienste benötigen möglicherweise komplexere Bereitstellungsanforderungen. Sie definieren und konsumieren Inventarbehältergruppen unterschiedlich. Durch die Zuordnung von Komponenten zu mehreren Gruppen auf diese Weise können Rollen und Aufgaben flexibel ausgerichtet werden.
id: Tata letak default tidak hanya bergantung pada grup yang merupakan himpunan bagian dari grup lain. Grup komponen ``memcache`` adalah bagian dari grup ``memcache_container``, serta grup ``memcache_all`` dan juga berisi grup komponen ``memcached``. Jika Anda meninjau playbook ``playbooks/memcached-install.yml``, Anda melihat bahwa playbook tersebut berlaku untuk host di grup ``memcached``. Layanan lain mungkin memiliki kebutuhan penyebaran yang lebih kompleks. Mereka mendefinisikan dan mengkonsumsi kelompok container inventaris secara berbeda. Memetakan komponen ke beberapa grup dengan cara ini memungkinkan penargetan peran dan tugas yang fleksibel.

source: The default layout of containers and services in OpenStack-Ansible (OSA) is determined by the ``/etc/openstack_deploy/openstack_user_config.yml`` file and the contents of both the ``/etc/openstack_deploy/conf.d/`` and ``/etc/openstack_deploy/env.d/`` directories. You use these sources to define the *group* mappings that the playbooks use to target hosts and containers for roles used in the deploy.
de: Das Standardlayout von Containern und Diensten in OpenStack-Ansible (OSA) wird durch die Datei ``/etc/openstack_deploy/openstack_user_config.yml`` und den Inhalt der Verzeichnisse ``/etc/openstack_deploy/conf.d/`` und ``/etc/openstack_deploy/env.d/`` bestimmt. Sie verwenden diese Quellen zum Definieren der *group* -Mappings, die von den Playbooks verwendet werden, um Hosts und Container für Rollen zu referenzieren, die in der Bereitstellung verwendet werden.
id: Tata letak kontainer dan layanan default di OpenStack-Ansible (OSA) ditentukan oleh file ``/etc/openstack_deploy/openstack_user_config.yml`` dan isi dari kedua direktori ``/etc/openstack_deploy/conf.d/`` dan ``/etc/openstack_deploy/env.d/``. Anda menggunakan sumber-sumber ini untuk menentukan pemetaan *group* yang digunakan playbook untuk menargetkan host dan container untuk peran yang digunakan dalam deploy.

source: The diagram shows a basic overview of the manila service.
id: Diagram menunjukkan gambaran umum (basic overview) dasar layanan manila.

source: The diagram shows the following steps.
de: Das Diagramm zeigt die folgenden Schritte.
id: Diagram menunjukkan langkah-langkah berikut.

source: The dynamic inventory script does the following:
de: Das dynamische Inventarscript führt Folgendes aus:
id: Skrip inventory dinamis melakukan hal berikut:

source: The environment variables set would use ``../openstack-ansible/playbooks/<directory>``.
de: Die Umgebungsvariablen würden ``../openstack-ansible/playbooks/<directory>`` benutzen.
id: Variabel lingkungan yang ditetapkan akan digunakan ``../openstack-ansible/playbooks/<directory>``.

source: The file ``scripts/inventory-manage.py`` is used to produce human readable output based on the ``/etc/openstack_deploy/openstack_inventory.json`` file.
de: Die Datei ``scripts/inventory-manage.py`` wird verwendet, um eine lesbare Ausgabe basierend auf der ``/etc/openstack_deploy/openstack_inventory.json`` Datei zu erzeugen.
id: File ``scripts/inventory-manage.py`` digunakan untuk menghasilkan output yang dapat dibaca manusia berdasarkan pada file ``/etc/openstack_deploy/openstack_inventory.json``.

source: The following are some useful commands to manage LXC:
de: Im Folgenden finden Sie einige nützliche Befehle zum Verwalten von LXC:
id: Berikut ini adalah beberapa perintah yang berguna untuk mengelola LXC:

source: The following diagram illustrates how Block Storage is connected to instances.
de: Das folgende Diagramm zeigt, wie der Blockspeicher mit Instanzen verbunden ist.
id: Diagram berikut menggambarkan bagaimana Block Storage terhubung ke instance.

source: The following diagram illustrates how data is accessed and replicated.
de: Das folgende Diagramm zeigt, wie auf Daten zugegriffen wird und wie sie repliziert werden.
id: Diagram berikut menggambarkan bagaimana data diakses dan direplikasi.

source: The following diagram illustrates the interactions between the Image service, the storage device, and the ``nova-compute`` service when an instance is created.
de: Das folgende Diagramm veranschaulicht die Interaktionen zwischen dem Abbild-Dienst, dem Speichergerät und dem Dienst ``nova-compute``, wenn eine Instanz erstellt wird.
id: Diagram berikut menggambarkan interaksi antara layanan Image, perangkat penyimpanan, dan layanan ``nova-compute`` ketika sebuah instance dibuat.

source: The following diagram shows how all of the interfaces and bridges interconnect to provide network connectivity to the OpenStack deployment:
de: Das folgende Diagramm zeigt, wie alle Schnittstellen und Bridges miteinander verbunden sind, um eine Netzwerkverbindung zur OpenStack-Bereitstellung bereitzustellen:
id: Diagram berikut menunjukkan bagaimana semua antarmuka dan jembatan saling terhubung untuk menyediakan konektivitas jaringan ke penyebaran OpenStack:

source: The following diagram shows how the Networking service (neutron) agents work with the ``br-vlan`` and ``br-vxlan`` bridges. Neutron is configured to use a DHCP agent, an L3 agent, and a Linux Bridge agent within a networking-agents container. The diagram shows how DHCP agents provide information (IP addresses and DNS servers) to the instances, and how routing works on the image.
id: Diagram berikut menunjukkan bagaimana layanan Networking (neutron) bekerja dengan jembatan ``br-vlan`` dan ``br-vxlan``. Neutron dikonfigurasi untuk menggunakan agen DHCP, agen L3, dan agen Linux Bridge dalam kontainer networking-agent. Diagram menunjukkan bagaimana agen DHCP memberikan informasi (alamat IP dan server DNS) ke instance, dan bagaimana routing bekerja pada image.

source: The following diagram shows how virtual machines connect to the ``br-vlan`` and ``br-vxlan`` bridges and send traffic to the network outside the host:
id: Diagram berikut menunjukkan bagaimana mesin virtual terhubung ke jembatan ``br-vlan`` dan ``br-vxlan`` dan mengirim lalu lintas ke jaringan di luar host:

source: The following file must be present in the configuration directory:
de: Die folgende Datei muss im Konfigurationsverzeichnis vorhanden sein:
id: File berikut harus ada di direktori konfigurasi:

source: The following image demonstrates how the container network interfaces are connected to the host's bridges and physical network interfaces:
de: Das folgende Abbild zeigt, wie die Containernetzwerkschnittstellen mit den Bridges und physischen Netzwerkschnittstellen des Hosts verbunden sind:
id: Image berikut menunjukkan bagaimana antarmuka jaringan kontainer terhubung ke jembatan host (host's bridge) dan antarmuka jaringan fisik:

source: The following override variables are currently available:
id: Variabel override berikut saat ini tersedia:

source: The following sections describe the services that OpenStack-Ansible deploys.
de: In den folgenden Abschnitten werden die Dienste beschrieben, die von OpenStack-Ansible bereitgestellt werden.
id: Bagian berikut menjelaskan layanan yang digunakan OpenStack-Ansible.

source: The general format for the variable names used for overrides is ``<service>_<filename>_<file extension>_overrides``. For example, the variable name used in these examples to add parameters to the ``nova.conf`` file is ``nova_nova_conf_overrides``.
de: Das allgemeine Format für die Variablennamen, die für Überschreibungen verwendet werden, ist ``<service>_<filename>_<file extension>_overrides``. Der Variablenname, der in diesen Beispielen zum Hinzufügen von Parametern zur ``nova.conf``-Datei verwendet wird, ist beispielsweise ``nova_nova_conf_overrides``.
id: Format umum untuk nama variabel yang digunakan untuk penggantian adalah ``<service>_<filename>_<file extension>_overrides``. Sebagai contoh, nama variabel yang digunakan dalam contoh ini untuk menambahkan parameter ke file ``nova.conf`` adalah ``nova_nova_conf_overrides``.

source: The general format for the variable names used for overrides is ``<service>_<filename>_<file extension>_overrides``. For example, the variable name used in this example to define a meter exclusion in the ``pipeline.yml`` file for the Telemetry service (ceilometer) is ``ceilometer_pipeline_yaml_overrides``.
de: Das allgemeine Format für die Variablennamen, die für Überschreibungen verwendet werden, ist ``<service>_<filename>_<file extension>_overrides``. Der Variablenname, der in diesem Beispiel zum Definieren eines Zählerausschlusses in der ``pipeline.yml``-Datei für den Telemetriedienst (Ceilometer) verwendet wird, lautet beispielsweise ``ceilometer_pipeline_yaml_overrides``.
id: Format umum untuk nama variabel yang digunakan untuk penggantian adalah ``<service>_<filename>_<file extension>_overrides``. Misalnya, nama variabel yang digunakan dalam contoh ini untuk menentukan pengecualian meter dalam file ``pipeline.yml`` untuk layanan Telemetri (ceilometer) adalah ``ceilometer_pipeline_yaml_overrides``.

source: The general format for the variable names used for overrides is ``<service>_policy_overrides``. For example, the variable name used in this example to add a policy to the Identity service (keystone) ``policy.json`` file is ``keystone_policy_overrides``.
de: Das allgemeine Format für die Variablennamen, die für Überschreibungen verwendet werden, ist ``<service> _policy_overrides``. Der Variablenname, der in diesem Beispiel zum Hinzufügen einer Richtlinie zur Datei ``policy.json`` des Identitätsdienstes (Keystone) verwendet wird, lautet beispielsweise ``keystone_policy_overrides``.
id: Format umum untuk nama variabel yang digunakan untuk penggantian adalah ``<service>_policy_overrides``. Misalnya, nama variabel yang digunakan dalam contoh ini untuk menambahkan kebijakan ke layanan Identity (keystone) file ``policy.json`` adalah ``keystone_policy_overrides``.

source: The hypervisor presents the disk as a device to the instance.
de: Der Hypervisor präsentiert die Festplatte als ein Gerät für die Instanz.
id: Hypervisor menyajikan disk sebagai perangkat ke instance.

source: The interface ``lxcbr0`` provides connectivity for the containers to the outside world, thanks to dnsmasq (dhcp/dns) + NAT.
id: Antarmuka ``lxcbr0`` menyediakan konektivitas untuk kontainer ke dunia luar, berkat dnsmasq (dhcp / dns) + NAT.

source: The list of overrides available may be found by executing:
de: Die Liste der verfügbaren Überschreibungen finden Sie, indem Sie Folgendes ausführen:
id: Daftar penggantian yang tersedia dapat ditemukan dengan menjalankan:

source: The lxc_hosts Group
de: Die lxc_hosts-Gruppe
id: Grup lxc_hosts

source: The only exception to this rule is for the ``master`` branch, which intentionally consumes the ``master`` branch from all roles between releases so that any changes are immediately integration tested.
id: Satu-satunya pengecualian untuk aturan ini adalah untuk branch ``master``, yang sengaja mengkonsumsi branch ``master`` dari semua role di antara rilis sehingga setiap perubahan segera diuji integrasi.

source: The paths to the ``openstack-ansible`` top level directory can be relative in this file.
de: Die Pfade zum obersten Verzeichnis ``openstack-ansible`` können in dieser Datei relativ sein.
id: Path ke direktori level atas ``openstack-ansible`` dapat bersifat relatif dalam file ini.

source: The relevant environment variables for OpenStack-Ansible are as follows:
de: Die relevanten Umgebungsvariablen für OpenStack-Ansible sind wie folgt:
id: Variabel lingkungan yang relevan untuk OpenStack-Ansible adalah sebagai berikut:

source: The rendered file on disk, namely ``/tmp/test.ini`` looks like this:
de: Die gerenderte Datei auf der Festplatte, nämlich ``/tmp/test.ini`` sieht wie folgt aus:
id: File yang diberikan pada disk, yaitu ``/tmp/test.ini`` terlihat seperti ini:

source: The repository holds the reference set of artifacts that are used for the installation of the environment. The artifacts include:
de: Das Repository enthält den Referenzsatz von Artefakten, die für die Installation der Umgebung verwendet werden. Die Artefakte umfassen:
id: Repositori menyimpan set artefak referensi yang digunakan untuk instalasi lingkungan. Artefak meliputi:

source: The roles will be fetched into the standard ``ANSIBLE_ROLES_PATH``, which defaults to ``/etc/ansible/roles``.
de: Die Rollen werden in den Standard ``ANSIBLE_ROLES_PATH`` geholt, der standardmäßig ``/etc/ansible/roles`` ist.
id: Peran akan diambil ke standar ``ANSIBLE_ROLES_PATH``, yang standarnya adalah ``/etc/ansible/roles``.

source: The same JSON structure is printed to stdout, which is consumed by Ansible as the inventory for the playbooks.
de: Die gleiche JSON-Struktur wird auf stdout gedruckt, die von Ansible als Inventar für die Playbooks verwendet wird.
id: Struktur JSON yang sama dicetak ke stdout, yang dikonsumsi oleh Ansible sebagai inventory untuk playbook.

source: The same script can be used to safely remove hosts from the inventory, export the inventory based on hosts, and clear IP addresses from containers within the inventory files.
de: Dasselbe Skript kann verwendet werden, um Hosts sicher aus dem Inventar zu entfernen, das Inventar basierend auf Hosts zu exportieren und IP-Adressen aus Containern in den Inventardateien zu löschen.
id: Skrip yang sama dapat digunakan untuk menghapus host dengan aman dari inventory, mengekspor inventory berdasarkan host, dan menghapus alamat IP dari kontainer di dalam file inventory.

source: The script that creates the inventory is located at ``inventory/dynamic_inventory.py``.
id: Skrip yang membuat inventaris terletak di ``inventory/dynamic_inventory.py``.

source: The shared filesystem service (manila) can be configured to provide file systems on a variety of storage back ends as supported by the `manila_store drivers`_.
id: Layanan filesystem bersama (manila) dapat dikonfigurasikan untuk menyediakan sistem file pada berbagai ujung belakang penyimpanan sebagaimana didukung oleh `manila_store drivers`_.

source: The simple nature of machine containers allows the deployer to treat containers as physical machines. The same concepts apply for machine containers and physical machines: This will allow deployers to use existing operational tool sets to troubleshoot issues within a deployment and the ability to revert an application or service within inventory to a known working state without having to re-kick a physical host.
de: Die einfache Beschaffenheit von Maschinencontainern ermöglicht es dem Deployer, Container als physische Maschinen zu behandeln. Die gleichen Konzepte gelten für Maschinencontainer und physische Maschinen: Dies ermöglicht es den Bereitstellern, vorhandene operative Toolsets zu verwenden, um Probleme innerhalb einer Bereitstellung zu beheben und eine Anwendung oder einen Service innerhalb des Inventars in einen bekannten Arbeitsstatus zurückzusetzen, ohne einen neuen Kickdown durchführen zu müssen physischer Gastgeber.
id: Sifat sederhana dari kontainer mesin memungkinkan penyusun untuk memperlakukan kontainer sebagai mesin fisik. Konsep yang sama berlaku untuk kontainer mesin dan mesin fisik: Hal ini akan memungkinkan deployer untuk menggunakan kumpulan alat operasional yang ada untuk memecahkan masalah dalam penerapan dan kemampuan untuk mengembalikan aplikasi atau layanan dalam inventaris ke keadaan kerja yang diketahui tanpa harus mendepak ulang (re-kick) host fisik.

source: The system will allow you to install and build any package that is a python installable. The repository infrastructure will look for and create any git based or PyPi installable package. When the package is built the repo-build role will create the sources as Python wheels to extend the base system and requirements.
de: Das System ermöglicht es Ihnen, jedes Paket zu installieren und zu erstellen, das Python-installierbar ist. Die Repository-Infrastruktur sucht und erstellt ein git-basiertes oder PyPi-installierbares Paket. Wenn das Paket erstellt wird, erstellt die Repo-Build-Rolle die Quellen als Python-Räder, um das Basissystem und die Anforderungen zu erweitern.
id: Sistem akan memungkinkan Anda untuk menginstal dan membangun paket apa pun yang dapat diinstal python. Infrastruktur repositori akan mencari dan membuat paket yang dapat diinstal berbasis git atau PyPi. Ketika paket dibangun, peran repo-build akan membuat sumber sebagai roda (wheel) Python untuk memperluas sistem dan persyaratan dasar.

source: The use of ``container_vars`` and mapping from container groups to host groups is the same for a service deployed directly onto the host.
de: Die Verwendung von ``container_vars`` und die Zuordnung von Containergruppen zu Hostgruppen ist für einen Service identisch, der direkt auf dem Host bereitgestellt wird.
id: Penggunaan ``container_vars`` dan pemetaan dari grup container ke grup host sama dengan layanan yang disebarkan langsung ke host.

source: The use of containers allows for additional abstractions of entire application stacks to be run all within the same physical host machines.
de: Die Verwendung von Containern ermöglicht, dass zusätzliche Abstraktionen von ganzen Anwendungsstapeln alle innerhalb der gleichen physischen Host-Maschinen ausgeführt werden können.
id: Penggunaan kontainer memungkinkan untuk abstraksi tambahan dari seluruh tumpukan aplikasi (application stack) untuk dijalankan semua dalam mesin host fisik yang sama.

source: There is no ``ansible.cfg`` provided with OpenStack-Ansible. Environment variables are used to alter the default Ansible behavior if necessary.
de: Es gibt keine `ansible.cfg` mit OpenStack-Ansible. Umgebungsvariablen werden verwendet, um das standardmäßige Ansible-Verhalten bei Bedarf zu ändern.
id: Tidak ada ``ansible.cfg`` yang disediakan dengan OpenStack-Ansible. Variabel lingkungan digunakan untuk mengubah perilaku Ansible default jika perlu.

source: These are the options available as found within the virtual module documentation section.
de: Dies sind die verfügbaren Optionen, die Sie im Dokumentationsabschnitt des virtuellen Moduls finden.
id: Ini adalah opsi yang tersedia seperti yang ditemukan dalam bagian dokumentasi modul virtual.

source: These policies are applied and governed at the kernel level. Any process that violates a policy is denied access to the resource. All denials are logged in ``auditd`` and are available at ``/var/log/audit/audit.log``.
de: Diese Richtlinien werden auf Kernel-Ebene angewendet und verwaltet. Jedem Prozess, der gegen eine Richtlinie verstößt, wird der Zugriff auf die Ressource verweigert. Alle Ablehnungen werden in ``auditd`` protokolliert und sind unter ``/var/log/audit/audit.log`` verfügbar.
id: Kebijakan ini diterapkan dan diatur di tingkat kernel. Setiap proses yang melanggar suatu kebijakan tidak diberi akses ke sumber daya. Semua penolakan masuk ``auditd`` dan tersedia di ``/var/log/audit/audit.log``.

source: These services *must* be offered on a highly restricted network that is available only to administrative users.
de: Diese Dienste *müssen* in einem stark eingeschränkten Netzwerk angeboten werden, das nur für Benutzer mit Administratorrechten verfügbar ist.
id: Layanan ini *must* ditawarkan pada jaringan yang sangat terbatas yang hanya tersedia untuk pengguna administratif.

source: These services include Compute (nova), Object Storage (swift), Networking (neutron), and Image (glance).
de: Zu diesen Diensten gehören Compute (nova), Object Storage (swift), Networking (Neutron) und Image (glance).
id: Layanan ini termasuk Compute (nova), Object Storage (swift), Networking (neutron), and Image (glance).

source: These services include MariaDB, Memcached, RabbitMQ, and the admin API endpoint for the Identity (keystone) service.
de: Zu diesen Diensten gehören MariaDB, Memcached, RabbitMQ und der Admin-API-Endpunkt für den Identity (Keystone) -Dienst.
id: Layanan ini termasuk MariaDB, Memcached, RabbitMQ, dan admin API endpoint untuk layanan Identity (keystone).

source: These services should be offered on a sufficiently restricted network that still allows all end users to access the services.
de: Diese Dienste sollten in einem ausreichend eingeschränkten Netzwerk angeboten werden, das allen Endbenutzern den Zugriff auf die Dienste ermöglicht.
id: Layanan ini harus ditawarkan pada jaringan terbatas yang masih memungkinkan semua pengguna akhir (end user) untuk mengakses layanan.

source: These variables are typically internal to the role and are not designed to be overridden. However, deployers may choose to override them using extra-vars by placing the overrides into the user variables file.
de: Diese Variablen sind in der Regel für die Rolle intern und nicht für das Überschreiben vorgesehen. Implementierer können diese jedoch überschreiben, indem sie extra-vars verwenden, indem sie die Überschreibungen in die Benutzervariablendatei einfügen.
id: Variabel ini biasanya internal untuk peran dan tidak dirancang untuk diganti. Namun, deployer dapat memilih untuk menimpa mereka menggunakan extra-vars dengan menempatkan penggantian ke file variabel pengguna.

source: They can be overridden at multiple levels.
de: Sie können auf mehreren Ebenen außer Kraft gesetzt werden.
id: Mereka dapat ditimpa pada berbagai tingkatan.

source: This JSON output has two top-level keys: ``hosts`` and ``all``.
de: Diese JSON-Ausgabe hat zwei Schlüssel der obersten Ebene: ``hosts`` und ``all``.
id: Output JSON ini memiliki dua kunci tingkat atas: ``hosts`` dan ``all``.

source: This also allows developers to point to their own code for their work.
de: Auf diese Weise können Entwickler auch auf ihren eigenen Code für ihre Arbeit verweisen.
id: Ini juga memungkinkan pengembang untuk menunjuk kode mereka sendiri untuk pekerjaan mereka.

source: This chapter contains all the extra reference information to deploy, configure, or upgrade an OpenStack-Ansible cloud.
id: Bab ini berisi semua informasi referensi tambahan untuk menggunakan, mengkonfigurasi, atau upgrade cloud OpenStack-Ansible.

source: This check does not do YAML syntax validation, though it will fail if there are unparseable errors.
de: Diese Überprüfung führt keine YAML-Syntaxvalidierung durch, obwohl sie fehlschlägt, wenn nicht korrigierbare Fehler auftreten.
id: Pemeriksaan ini tidak melakukan validasi sintaks YAML, meskipun akan gagal jika ada kesalahan yang tidak dapat diurai.
