Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: de, id

source: If MariaDB fails to start, run the ``mysqld`` command and perform further analysis on the output. As a last resort, rebuild the container for the node.
de: Wenn MariaDB nicht gestartet werden kann, führen Sie den Befehl ``mysqld`` aus und führen Sie eine weitere Analyse der Ausgabe durch. Als letzten Ausweg erstellen Sie den Container für den Knoten neu.
id: Jika MariaDB gagal untuk memulai, jalankan perintah ``mysqld`` dan lakukan analisis lebih lanjut pada output. Sebagai usaha terakhir, buat kembali kontainer untuk node.

source: If VLAN:
de: Wenn VLAN:

source: If VXLAN:
de: Wenn VXLAN:
id: Jika VXLAN:

source: If a Compute host needs to be shut down:
de: Wenn ein Compute-Host heruntergefahren werden muss:
id: Jika host Compute perlu dimatikan:

source: If a LVM backed Block Storage host needs to be shut down:
de: Wenn ein von LVM unterstützter Block Storage-Host heruntergefahren werden muss:
id: Jika host Block Storage yang didukung LVM perlu dimatikan:

source: If a failure does occur, follow these steps to restore the database from the Primary (failed) Region:
de: Wenn ein Fehler auftritt, führen Sie die folgenden Schritte aus, um die Datenbank aus der primären (fehlgeschlagenen) Region wiederherzustellen:
id: Jika terjadi kegagalan, ikuti langkah-langkah ini untuk memulihkan database dari Primary (failed) Region:

source: If a single node fails, the other nodes maintain quorum and continue to process SQL requests.
de: Wenn ein einzelner Knoten fehlschlägt, behalten die anderen Knoten das Quorum und verarbeiten weiterhin SQL-Anforderungen.
id: Jika satu simpul gagal, simpul lainnya mempertahankan kuorum dan terus memproses permintaan SQL.

source: If all cluster nodes stop in a simultaneous and uncontrolled manner, (for example, with a power cut) you can be left with a situation in which all nodes think that some other node stopped after them. In this case you can use the :command:`force_boot` command on one node to make it bootable again.
de: Wenn alle Clusterknoten gleichzeitig und unkontrolliert anhalten (z. B. bei einem Stromausfall), können Sie eine Situation erhalten, in der alle Knoten denken, dass ein anderer Knoten nach ihnen gestoppt wurde. In diesem Fall können Sie den Befehl :command:`force_boot` auf einem Knoten verwenden, um ihn wieder bootfähig zu machen.
id: Jika semua node cluster berhenti secara simultan dan tidak terkontrol, (misalnya, dengan pemadaman listrik), Anda dapat ditinggalkan dengan situasi di mana semua node berpikir bahwa beberapa node lain berhenti setelahnya. Dalam hal ini Anda dapat menggunakan perintah :command:`force_boot` pada satu node untuk membuatnya dapat di-boot kembali.

source: If any single node has a positive ``seqno`` value, then that node can be used to restart the cluster. However, because there is no guarantee that each node has an identical copy of the data, we do not recommend to restart the cluster using the ``--wsrep-new-cluster`` command on one node.
de: Wenn ein einzelner Knoten einen positiven Wert ``seqno`` hat, kann dieser Knoten zum Neustarten des Clusters verwendet werden. Da jedoch nicht garantiert werden kann, dass jeder Knoten über eine identische Kopie der Daten verfügt, wird nicht empfohlen, den Cluster mit dem Befehl ``--wsrep-new-cluster`` auf einem Knoten neu zu starten.
id: Jika ada node tunggal yang memiliki nilai ``seqno`` positif, maka node tersebut dapat digunakan untuk me-restart klaster. Namun, karena tidak ada jaminan bahwa setiap node memiliki salinan data yang identik, kami tidak menyarankan untuk me-restart klaster menggunakan perintah ``--wsrep-new-cluster`` pada satu node.

source: If creating multiple instances with this configuration, enter an integer up to the number permitted by the quota, which is ``10`` by default.
de: Wenn Sie mehrere Instanzen mit dieser Konfiguration erstellen, geben Sie eine ganze Zahl ein, die der Quote entspricht, die durch das Kontingent zulässig ist (standardmäßig ``10``).
id: Jika membuat beberapa instance dengan konfigurasi ini, masukkan bilangan integer ke nomor yang diizinkan oleh kuota, yaitu ``10`` secara default.

source: If multicast, make sure the physical switches are properly allowing and distributing multicast traffic.
de: Stellen Sie bei Multicast sicher, dass die physischen Switches Multicast-Datenverkehr ordnungsgemäß zulassen und verteilen.
id: Jika multicast, pastikan switch fisik aktif dan mendistribusikan lalu lintas multicast dengan benar.

source: If necessary, also modify the ``used_ips`` stanza.
de: Ändern Sie bei Bedarf auch die Zeilengruppe ``used_ips``.
id: Jika perlu, ubah juga bait (stanza) ``used_ips``.

source: If rows are found, detach and re-attach the volumes using the values listed in the previous query:
de: Wenn Zeilen gefunden werden, trennen Sie die Datenträger, und hängen Sie sie erneut an, indem Sie die in der vorherigen Abfrage aufgeführten Werte verwenden:
id: Jika baris ditemukan, lepaskan dan pasang kembali volume menggunakan nilai yang tercantum dalam permintaan sebelumnya:

source: If shared storage is not used, data can be copied from the ``/var/lib/nova/instances`` directory on the failed Compute node ``${FAILED_NODE}`` to another node ``${RECEIVING_NODE}``\ before performing the following procedure. Please note this method is not supported.
de: Wenn kein gemeinsam genutzter Speicher verwendet wird, können Daten aus dem Verzeichnis ``/var/lib/nova/instances`` auf dem fehlerhaften Compute-Knoten ``${FAILED_NODE}`` auf einen anderen Knoten ``${RECEIVING_NODE}``\ vor dem Ausführen der folgenden Prozedur kopiertwerden. Bitte beachten Sie, dass diese Methode nicht unterstützt wird.
id: Jika penyimpanan bersama tidak digunakan, data dapat disalin dari direktori ``/var/lib/nova/instances`` pada Compute node yang gagal ``${FAILED_NODE}`` ke simpul lain ``${RECEIVING_NODE}``\ sebelum melakukan prosedur berikut. Harap dicatat metode ini tidak didukung.

source: If the cluster is utilizing Telemetry/Metering (ceilometer), edit the ``/etc/openstack_deploy/conf.d/ceilometer.yml`` file and add the host to the ``metering-compute_hosts`` stanza.
de: Wenn der Cluster Telemetrie/Metering (Ceilometer) verwendet, bearbeiten Sie die Datei ``/etc/openstack_deploy/conf.d/ceilometer.yml`` und fügen Sie den Host der Zeilengruppe ``metering-compute_hosts`` hinzu.
id: Jika cluster menggunakan Telemetry/Metering (ceilometer), edit file ``/etc/openstack_deploy/conf.d/ceilometer.yml`` dan tambahkan host ke stanza ``metering-compute_hosts``.

source: If the container does not respond, it can be restarted from the physical network host:
de: Wenn der Container nicht antwortet, kann er vom physischen Netzwerkhost neu gestartet werden:
id: Jika kontainer tidak merespons, dapat dimulai kembali dari host jaringan fisik:

source: If the host DOES have to be brought down for the hardware replacement, how should the resources on that host be handled?
de: Wenn der Host zum Hardware-Austausch heruntergefahren werden muss, wie sollten die Ressourcen auf diesem Host gehandhabt werden?
id: Jika host TIDAK harus dibawa down untuk penggantian perangkat keras, bagaimana sumber daya pada host itu harus ditangani?

source: If the host still shows as part of the cluster, but it is not running, execute:
de: Wenn der Host weiterhin als Teil des Clusters angezeigt wird, aber nicht ausgeführt wird, führen Sie Folgendes aus:
id: Jika host masih menunjukkan sebagai bagian dari cluster, tetapi tidak berjalan, laksanakan:

source: If the last node to go offline cannot be brought back up, it can be removed from the cluster using the :command:`forget_cluster_node` command.
de: Wenn der letzte Knoten, der offline gehen soll, nicht wiederhergestellt werden kann, kann er mit dem Kommando :command:`forget_cluster_node` aus dem Cluster entfernt werden.
id: Jika node terakhir untuk offline tidak dapat dibawa kembali, itu dapat dihapus dari cluster menggunakan perintah :command:`forget_cluster_node` .

source: If you have a Compute (nova) host that has a disk failure on a RAID-10, you can swap the failed disk without powering the host down. On the other hand, if the RAM has failed, you would have to power the host down. Having a plan in place for how you will manage these types of events is a vital part of maintaining your OpenStack environment.
de: Wenn Sie einen Compute-Host (nova) mit einem Festplattenfehler auf einem RAID-10-System haben, können Sie den ausgefallenen Datenträger austauschen, ohne den Host herunterzufahren. Auf der anderen Seite, wenn der RAM fehlgeschlagen ist, müssten Sie den Host herunterfahren. Einen Plan für die Verwaltung dieser Ereignistypen zu erstellen, ist ein wichtiger Teil der Wartung Ihrer OpenStack-Umgebung.
id: Jika Anda memiliki host Compute (nova) yang memiliki kegagalan disk pada RAID-10, Anda dapat menukar disk yang gagal tanpa mematikan host. Di sisi lain, jika RAM gagal, Anda harus mematikan host. Memiliki rencana tentang bagaimana Anda akan mengelola jenis peristiwa ini adalah bagian penting dari menjaga lingkungan OpenStack Anda.

source: If you remove the containers and data for the entire galera_server container group you will lose all your databases! Also, if you destroy the first container in many host groups you will lose other important items like certificates, keys, etc. Be sure that you understand what you're doing when using this tool.
de: Wenn Sie die Container und Daten für die gesamte Containergruppe galera_server entfernen, verlieren Sie alle Ihre Datenbanken! Wenn Sie den ersten Container in vielen Host-Gruppen zerstören, verlieren Sie auch andere wichtige Elemente wie Zertifikate, Schlüssel usw. Achten Sie darauf, dass Sie verstehen, was Sie tun, wenn Sie dieses Tool verwenden.
id: Jika Anda menghapus kontainer dan data untuk seluruh grup kontainer galera_server Anda akan kehilangan semua basis data Anda! Juga, jika Anda menghancurkan kontainer pertama di banyak grup host, Anda akan kehilangan item penting lainnya seperti sertifikat, kunci, dll. Pastikan Anda memahami apa yang Anda lakukan saat menggunakan alat ini.

source: If you start the nodes out of order, you could run into an issue where it thinks the current `master` should not be the master and drops the messages to ensure that no new messages are queued while the real master is down.
de: Wenn Sie die Knoten in der falschen Reihenfolge starten, könnten Sie auf ein Problem stoßen, bei dem der aktuelle `master` nicht der Master ist und die Nachrichten ablegt, um sicherzustellen, dass keine neuen Nachrichten in die Warteschlange gestellt werden, während der echte Master ausgefallen ist.
id: Jika Anda memulai nodes yang tidak berurutan, Anda dapat mengalami masalah saat berpikir `master` saat ini tidak boleh menjadi master dan menghapus pesan untuk memastikan bahwa tidak ada pesan baru yang diantrikan sementara master asli turun.

source: Image service
de: Abbildservice
id: Layanan Image

source: In cases where the live migration fails, both the source and destination compute nodes need to be checked for errors. Usually it is sufficient to search for the instance UUID only to find errors related to the live migration.
de: In Fällen, in denen die Live-Migration fehlschlägt, müssen sowohl der Quell- als auch der Zielcomputerknoten auf Fehler überprüft werden. In der Regel reicht es aus, nur nach der UUID der Instanz zu suchen, um Fehler im Zusammenhang mit der Livemigration zu finden.
id: Dalam kasus di mana migrasi langsung gagal, baik sumber dan tujuan menghitung node perlu diperiksa untuk kesalahan. Biasanya cukup mencari UU UU hanya untuk menemukan kesalahan yang terkait dengan migrasi langsung.

source: In larger deployments, it may take some time for the MariaDB daemon to start in the new container. It will be synchronizing data from the other MariaDB servers during this time. You can monitor the status during this process by tailing the ``/var/log/mysql_logs/galera_server_error.log`` log file.
de: In größeren Bereitstellungen kann es einige Zeit dauern, bis der MariaDB-Daemon im neuen Container gestartet wird. Während dieser Zeit werden die Daten von den anderen MariaDB-Servern synchronisiert. Sie können den Status während dieses Vorgangs überwachen, indem Sie die Protokolldatei ``/var/log/mysql_logs/galera_server_error.log`` protokollieren.
id: Dalam penyebaran yang lebih besar, mungkin diperlukan beberapa waktu untuk daemon MariaDB untuk memulai di kontainer baru. Ini akan menyinkronkan data dari server MariaDB lain selama waktu ini. Anda dapat memantau status selama proses ini dengan mengikuti bagian akhir (tailing) file log ``/var/log/mysql_logs/galera_server_error.log``.

source: In multi-region Object Storage utilizing separate database backends, objects are retrievable from an alternate location if the ``default_project_id`` for a user in the keystone database is the same across each database backend.
de: Bei der Objektspeicherung in mehreren Regionen mit separaten Datenbank-Back-Ends können Objekte von einem alternativen Speicherort abgerufen werden, wenn die ``default_project_id`` für einen Benutzer in der Keystone-Datenbank in jedem Datenbank-Backend identisch ist.
id: Dalam multi-region Object Storage menggunakan backend database terpisah, objek dapat diambil dari lokasi alternatif jika ``default_project_id`` untuk pengguna dalam database keystone adalah sama di setiap backend database.

source: In order to add an image using the Dashboard, prepare an image binary file, which must be accessible over HTTP using a valid and direct URL. Images can be compressed using ``.zip`` or ``.tar.gz``.
de: Um ein Abbild über das Dashboard hinzuzufügen, bereiten Sie eine Image-Binärdatei vor, auf die über HTTP mit einer gültigen und direkten URL zugegriffen werden muss. Abbilder können mit ``.zip`` oder ``.tar.gz`` komprimiert werden.
id: Untuk menambahkan image menggunakan Dasbor, siapkan file biner image, yang harus dapat diakses melalui HTTP menggunakan URL yang valid dan langsung. Image dapat dikompresi menggunakan ``.zip`` atau ``.tar.gz``.

source: In the Launch Instance dialog, click the **Access & Security** tab. Select the keypair. Set the security group as "default".
de: Klicken Sie im Dialogfeld Instanz starten auf die Registerkarte **Access & Security**. Wählen Sie das Schlüsselpaar aus. Legen Sie die Sicherheitsgruppe als "default" fest.
id: Dalam dialog Launch Instance, klik tab **Access & Security**. Pilih keypair. Setel grup keamanan sebagai "default".

source: In the Secondary Region, update the references to the ``project_id`` to match the ID from the Primary Region:
de: Aktualisieren Sie im sekundären Bereich die Verweise auf ``project_id`` so, dass sie mit der ID aus dem primären Bereich übereinstimmen:
id: Di Secondary Region, perbarui referensi ke ``project_id`` untuk mencocokkan ID dari Primary Region:

source: In the default configuration, Nova determines the correct transport URL for how to transfer the data from one host to the other. Depending on the ``nova_virt_type`` override the following configurations are used:
de: In der Standardkonfiguration ermittelt Nova die korrekte Transport-URL für die Übertragung der Daten von einem Host zum anderen. Abhängig von der ``nova_virt_type`` Überschreibung werden folgende Konfigurationen verwendet:
id: Dalam konfigurasi default, Nova menentukan URL transportasi yang benar untuk cara mentransfer data dari satu host ke yang lain. Tergantung pada ``nova_virt_type`` mengganti konfigurasi berikut yang digunakan:

source: In this example, ``galera_container`` has a container value of one. In practice, any containers that do not need adjustment can remain at the default value of one, and should not be adjusted above or below the value of one.
de: In diesem Beispiel hat ``galera_container`` einen Container-Wert von eins. In der Praxis können alle Container, die keine Anpassung benötigen, auf dem Standardwert von eins bleiben und sollten nicht über oder unter den Wert eins gesetzt werden.
id: Dalam contoh ini, ``galera_container`` memiliki nilai kontainer satu. Dalam prakteknya, setiap kontainer yang tidak perlu penyesuaian dapat tetap pada nilai default satu, dan tidak boleh disesuaikan di atas atau di bawah nilai satu.

source: In this example, all nodes in the cluster contain the same positive ``seqno`` values as they were synchronized just prior to graceful shutdown. If all ``seqno`` values are equal, any node can start the new cluster.
de: In diesem Beispiel enthalten alle Knoten im Cluster die gleichen positiven ``seqno``-Werte wie sie vor dem ordnungsgemäßen Herunterfahren synchronisiert wurden. Wenn alle ``seqno``-Werte gleich sind, kann jeder Knoten den neuen Cluster starten.
id: Dalam contoh ini, semua node dalam kluster mengandung nilai positif ``seqno`` yang sama karena disinkronkan sesaat sebelum shutdown yang anggun. Jika semua nilai ``seqno`` sama, setiap node dapat memulai kluster baru.

source: In this example, node 3 failed.
de: In diesem Beispiel ist Knoten 3 fehlgeschlagen.
id: Dalam contoh ini, node 3 gagal.

source: In this example, node 3 has failed.
de: In diesem Beispiel ist Knoten 3 fehlgeschlagen.
id: Dalam contoh ini, node 3 telah gagal.

source: In this example, nodes 2 and 3 have failed. The remaining operational server indicates ``non-Primary`` because it cannot achieve quorum.
de: In diesem Beispiel sind die Knoten 2 und 3 fehlerhaft. Der verbleibende betriebsfähige Server zeigt ``non-Primary`` an, da er das Quorum nicht erreichen kann.
id: Dalam contoh ini, node 2 dan 3 gagal. Server operasional yang tersisa menunjukkan ``non-Primer`` karena tidak dapat mencapai kuorum.

source: In this example, only one node responded.
de: In diesem Beispiel hat nur ein Knoten geantwortet.
id: Dalam contoh ini, hanya satu simpul yang merespons.

source: Individual OpenStack services, and other open source project services, run within containers. It is possible to scale out these services by modifying the ``/etc/openstack_deploy/openstack_user_config.yml`` file.
de: Einzelne OpenStack-Dienste und andere Open-Source-Projektdienste werden in Containern ausgeführt. Es ist möglich, diese Dienste zu skalieren, indem Sie die Datei ``/etc/openstack_deploy/openstack_user_config.yml`` modifizieren.
id: Layanan OpenStack individu, dan layanan proyek open source lainnya, dijalankan dalam kontainer. Dimungkinkan untuk meningkatkan layanan ini dengan memodifikasi file ``/etc/openstack_deploy/openstack_user_config.yml``

source: Introduction
de: Einführung
id: Pengantar

source: Invariably due to something in your environment, you are likely to lose a node in your cluster. In this scenario, multiple LXC containers on the same host are running Rabbit and are in a single Rabbit cluster.
de: Aus irgendeinem Grund in Ihrer Umgebung verlieren Sie wahrscheinlich einen Knoten in Ihrem Cluster. In diesem Szenario führen mehrere LXC-Container auf demselben Host Rabbit aus und befinden sich in einem einzelnen Rabbit-Cluster.
id: Tanpa kecuali penyebab sesuatu di lingkungan Anda, Anda cenderung kehilangan node di kluster Anda. Dalam skenario ini, beberapa kontainer LXC di host yang sama menjalankan Rabbit dan berada dalam satu cluster Rabbit.

source: Invoke the MySQL command line tool
de: Rufen Sie das MySQL-Befehlszeilentool auf
id: Aktifkan alat baris perintah (command line tool) MySQL

source: Is the connectivity issue egress from the instance?
de: Tritt das Verbindungsproblem aus der Instanz aus?
id: Apakah masalah konektivitas egress dari instance?

source: Is the connectivity issue ingress to the instance?
de: Tritt das Konnektivitätsproblem bei der Instanz ein?
id: Apakah masalah konektivitas ingress ke instance?

source: Is there a Neutron router in play?
de: Gibt es einen Neutron Router im Spiel?
id: Apakah ada router Neutron yang sedang dimainkan?

source: Issue the **openstack server create** command with a name for the instance, along with the name of the image and flavor to use:
de: Geben Sie den Befehl **openstack server create** mit einem Namen für die Instanz zusammen mit dem Namen des zu verwendenden Abbilds und Variante ein:
id: Berikan perintah **openstack server create** dengan nama untuk instance, bersama dengan nama image dan flavor untuk digunakan:

source: It explains how CLIs can be used as an admin and a user, to ensure the well-behavior of your cloud.
de: Es wird erläutert, wie CLIs als Administrator und Benutzer verwendet werden können, um das einwandfreie Verhalten Ihrer Cloud zu gewährleisten.
id: Ini menjelaskan bagaimana CLI dapat digunakan sebagai admin dan pengguna, untuk memastikan perilaku baik cloud Anda.

source: It explains operations such as managing images, instances, or networks.
de: Es erläutert Vorgänge wie die Verwaltung von Abbildern, Instanzen oder Netzwerken.
id: Ini menjelaskan operasi seperti mengelola image, instance, atau jaringan.

source: It is essential to plan and know how to replace failed hardware in your cluster without compromising your cloud environment.
de: Es ist wichtig zu planen und zu wissen, wie Sie fehlerhafte Hardware in Ihrem Cluster ersetzen können, ohne Ihre Cloud-Umgebung zu gefährden.
id: Sangat penting untuk merencanakan dan mengetahui cara mengganti perangkat keras yang gagal di cluster Anda tanpa membahayakan lingkungan cloud Anda.

source: It is recommended to perform the following steps before a failure occurs to avoid having to dump and restore the database.
de: Es wird empfohlen, die folgenden Schritte auszuführen, bevor ein Fehler auftritt, um zu vermeiden, dass die Datenbank gesichert und wiederhergestellt werden muss.
id: Dianjurkan untuk melakukan langkah-langkah berikut sebelum terjadi kegagalan untuk menghindari harus membuang dan mengembalikan database.

source: Join the cluster, and restart the application on the third node.
de: Treten Sie dem Cluster bei und starten Sie die Anwendung auf dem dritten Knoten neu.
id: Bergabunglah dengan cluster, dan restart aplikasi pada node ketiga.

source: Join the cluster, then restart the application:
de: Treten Sie dem Cluster bei und starten Sie die Anwendung neu:
id: Bergabunglah dengan kluster, lalu mulai ulang aplikasi:

source: Libvirt TCP port to transfer the data to migrate.
de: Libvirt TCP-Port zum Übertragen der zu migrierenden Daten.
id: Libvirt port TCP untuk mentransfer data untuk bermigrasi.

source: Lines starting with ``WSREP_SST`` will appear during the sync process and you should see a line with ``WSREP: SST complete, seqno: <NUMBER>`` if the sync was successful.
de: Zeilen, die mit ``WSREP_SST`` beginnen, werden während des Synchronisationsprozesses angezeigt und Sie sollten eine Zeile mit ``WSREP: SST complete, seqno: <NUMBER>`` sehen, wenn die Synchronisierung erfolgreich war.
id: Baris yang dimulai dengan ``WSREP_SST`` akan muncul selama proses sinkronisasi dan Anda akan melihat baris dengan ``WSREP: SST complete, seqno: <NUMBER>`` jika sinkronisasi berhasil.

source: Linux distribution
de: Linux-Verteilung
id: Distribusi Linux

source: List all instances with Block Storage volumes attached:
de: Auflisten aller Instanzen mit angehängten Blockspeicher-Datenträgern:
id: Daftar semua instance dengan volume Block Storage yang terlampir:

source: List all running instances on the Compute host:
de: Listet alle laufenden Instanzen auf dem Compute-Host auf:
id: Daftar semua instance yang berjalan pada host Compute:
