Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: de, id

source: Source based deployments
de: Quellenbasierte Bereitstellungen
id: Sumber berdasarkan penyebaran

source: Start a container:
de: Starten Sie einen Container:
id: Mulai container:

source: Stop a container:
de: Stoppen Sie einen Container:
id: Hentikan container:

source: Storage architecture
de: Speicherarchitektur
id: Arsitektur penyimpanan

source: Swift storage (for direct access to drive)
de: Swift-Speicher (für direkten Zugriff auf Laufwerk)
id: Swift storage (untuk akses langsung ke drive)

source: Systemd nspawn commands
id: Perintah systemd nspawn

source: The "containerized" applications are sometimes grouped within a single container where it makes sense, or distributed in multiple containers based on application and or architectural needs.
de: Die ``containerisierten`` Anwendungen werden manchmal in einem einzelnen Container gruppiert, in dem sie sinnvoll sind, oder in mehreren Containern basierend auf Anwendungs- und Architekturanforderungen verteilt.
id: Aplikasi "containerized" biasanya dikelompokkan dalam satu kontainer yang masuk akal, atau didistribusikan dalam beberapa kontainer berdasarkan aplikasi dan atau kebutuhan arsitektur.

source: The Block Storage (cinder) service manages volumes on storage devices in an environment. In a production environment, the device presents storage via a storage protocol (for example, NFS, iSCSI, or Ceph RBD) to a storage network (``br-storage``) and a storage management API to the management network (``br-mgmt``). Instances are connected to the volumes via the storage network by the hypervisor on the Compute host.
de: Der Blockspeicherdienst (Cinder) verwaltet Datenträger auf Speichergeräten in einer Umgebung. In einer Produktionsumgebung präsentiert das Gerät Speicher über ein Speicherprotokoll (z.B. NFS, iSCSI oder Ceph RBD) für ein Speichernetzwerk (``br-Speicher``) und eine Speicherverwaltungs-API für das Verwaltungsnetzwerk (`` br-mgmt``). Instanzen werden vom Hypervisor auf dem Compute-Host über das Speichernetzwerk mit den Datenträger verbunden.
id: Layanan Block Storage (cinder) mengelola volume pada perangkat penyimpanan di lingkungan. Dalam lingkungan produksi, perangkat menyajikan penyimpanan melalui protokol penyimpanan (misalnya, NFS, iSCSI, atau Ceph RBD) ke jaringan penyimpanan (`br-storage``) dan API manajemen penyimpanan ke jaringan manajemen (``br-mgmt``). Instance terhubung ke volume melalui jaringan penyimpanan oleh hypervisor pada host Compute.

source: The Compute host is configured with access to the storage device. The Compute host accesses the storage space via the storage network (``br-storage``) by using a storage protocol (for example, NFS, iSCSI, or Ceph RBD).
de: Der Compute-Host ist mit Zugriff auf das Speichergerät konfiguriert. Der Compute-Host greift über das Speichernetzwerk (``br-storage``) auf den Speicherplatz zu, indem er ein Speicherprotokoll verwendet (z. B. NFS, iSCSI oder Ceph RBD).
id: Host Compute dikonfigurasi dengan akses ke perangkat penyimpanan. Host Compute mengakses ruang penyimpanan melalui jaringan penyimpanan (``br-storage``) dengan menggunakan protokol penyimpanan (misalnya, NFS, iSCSI, atau Ceph RBD).

source: The Image service (glance) can be configured to store images on a variety of storage back ends supported by the `glance_store drivers`_.
de: Der Abbild-Dienst (glance) kann so konfiguriert werden, dass er Abbilder auf verschiedenen Speicher-Back-Ends speichert, die von den `glance_store drivers`_ unterstützt werden.
id: Layanan Image (glance) dapat dikonfigurasikan untuk menyimpan image pada berbagai back end yang didukung oleh `glance_store drivers`_.

source: The Object Storage (swift) service implements a highly available, distributed, eventually consistent object/blob store that is accessible via HTTP/HTTPS.
de: Der Objektspeicherdienst (swift) implementiert einen hoch verfügbaren, verteilten, möglicherweise konsistenten Objekt-/Blob-Speicher, auf den über HTTP/HTTPS zugegriffen werden kann.
id: Layanan Object Storage (swift) mengimplementasikan penyimpanan object/blob konsisten yang sangat tersedia, didistribusikan, akhirnya dapat diakses melalui HTTP/HTTPS.

source: The OpenStack series names are alphabetical, with each letter matched to a number (eg: Austin = 1, Bexar = 2, Newton = 14, Pike = 16, etc). OSA adopted the same ``<MAJOR>`` release numbering as the Nova project to match the overall OpenStack series version numbering.
id: Nama-nama seri OpenStack adalah abjad, dengan setiap huruf dicocokkan dengan nomor (misalnya: Austin = 1, Bexar = 2, Newton = 14, Pike = 16, dll). OSA mengadopsi penomoran rilis ``<MAJOR>`` yang sama dengan proyek Nova untuk mencocokkan penomoran versi seri OpenStack secara keseluruhan.

source: The OpenStack-Ansible project provides a basic OpenStack environment, but many deployers will wish to extend the environment based on their needs. This could include installing extra services, changing package versions, or overriding existing variables.
de: Das OpenStack-Ansible-Projekt stellt eine grundlegende OpenStack-Umgebung bereit, aber viele Implementierer möchten die Umgebung basierend auf ihren Anforderungen erweitern. Dies könnte die Installation zusätzlicher Dienste, das Ändern von Paketversionen oder das Überschreiben vorhandener Variablen umfassen.
id: Proyek OpenStack-Ansible menyediakan lingkungan OpenStack dasar, tetapi banyak deployer akan ingin memperluas lingkungan berdasarkan kebutuhan mereka. Ini bisa termasuk menginstal layanan tambahan, mengubah versi paket, atau mengganti variabel yang ada.

source: The `LVMVolumeDriver`_ is designed as a reference driver implementation, which we do not recommend for production usage. The LVM storage back-end is a single-server solution that provides no high-availability options. If the server becomes unavailable, then all volumes managed by the ``cinder-volume`` service running on that server become unavailable. Upgrading the operating system packages (for example, kernel or iSCSI) on the server causes storage connectivity outages because the iSCSI service (or the host) restarts.
de: Der `LVMVolumeDriver`_ ist als eine Referenztreiberimplementierung konzipiert, die wir für die Produktionsnutzung nicht empfehlen. Das LVM-Speicher-Back-End ist eine Einzelserverlösung, die keine Hochverfügbarkeitsoptionen bietet. Wenn der Server nicht mehr verfügbar ist, sind alle Datenträger, die vom auf dieser Server ausgeführten Dienst ``cinder-volume`` verwaltet werden, nicht mehr verfügbar. Das Aktualisieren der Betriebssystempakete (z. B. Kernel oder iSCSI) auf dem Server führt zu Speicherkonnektivitätsausfällen, da der iSCSI-Dienst (oder der Host) neu gestartet wird.
id: `LVMVolumeDriver`_ dirancang sebagai implementasi driver referensi, yang kami tidak rekomendasikan untuk penggunaan produksi. Back-end penyimpanan LVM adalah solusi server tunggal yang tidak menyediakan opsi ketersediaan tinggi (high-availability). Jika server menjadi tidak tersedia, maka semua volume yang dikelola oleh layanan ``cinder-volume`` yang berjalan di server itu menjadi tidak tersedia. Meningkatkan paket sistem operasi (misalnya, kernel atau iSCSI) di server menyebabkan gangguan konektivitas penyimpanan karena layanan iSCSI (atau host) restart.

source: The `Linux Security Modules`_ (LSM) framework allows administrators to set `mandatory access controls`_ (MAC) on a Linux system. MAC is different than `discretionary access controls`_ (DAC) because the kernel enforces strict policies that no user can bypass. Although any user might be able to change a DAC policy (such as ``chown bob secret.txt``), only the ``root`` user can alter a MAC policy.
de: Das `Linux Security Modules`_ (LSM) -Framework ermöglicht es Administratoren, `mandatory access controls`_ (MAC) auf einem Linux-System zu setzen. MAC unterscheidet sich von `discretionary access controls`_ (DAC), da der Kernel strenge Richtlinien erzwingt, die kein Benutzer umgehen kann. Obwohl jeder Benutzer in der Lage ist, eine DAC-Richtlinie zu ändern (z. B. ``chown bob secret.txt``), kann nur der Benutzer ``root`` eine MAC-Richtlinie ändern.
id: Kerangka kerja `Linux Security Modules`_ (LSM) memungkinkan administrator untuk mengatur `mandatory access controls`_ (MAC) pada sistem Linux. MAC berbeda dari `discretionary access controls`_ (DAC) karena kernel memberlakukan kebijakan ketat yang tidak dapat dilewati oleh pengguna. Meskipun setiap pengguna mungkin dapat mengubah kebijakan DAC (seperti ``chown bob secret.txt``), hanya pengguna ``root`` yang dapat mengubah kebijakan MAC.

source: The ``--clear-ips`` parameter can be used to remove all container IP address information from the ``openstack_inventory.json`` file. Baremetal hosts will not be changed.
de: Der ``clear-ips``-Parameter kann verwendet werden, um alle Container-IP-Adressinformationen aus der ``openstack_inventory.json``-Datei zu entfernen. Baremetal-Hosts werden nicht geändert.
id: Parameter ``--clear-ips`` dapat digunakan untuk menghapus semua informasi alamat IP kontainer dari file ``openstack_inventory.json``. Host bare metal tidak akan diubah.

source: The ``--debug/-d`` parameter allows writing of a detailed log file for debugging the inventory script's behavior. The output is written to ``inventory.log`` in the current working directory.
de: Der Parameter ``--debug/-d`` ermöglicht das Schreiben einer detaillierten Protokolldatei zum Debuggen des Verhaltens des Inventarscripts. Die Ausgabe wird in das aktuelle Arbeitsverzeichnis in ``inventory.log`` geschrieben.
id: Parameter ``--debug/-d`` memungkinkan penulisan file log terperinci untuk debugging perilaku skrip inventaris. Output ditulis ke ``inventory.log`` di direktori kerja saat ini.

source: The ``--environment/-e`` argument will take the path to a directory containing an ``env.d`` directory. This defaults to ``inventory/`` in the OpenStack-Ansible codebase.
de: Das Argument ``-environment/-e`` nimmt den Pfad zu einem Verzeichnis, das ein ``env.d``-Verzeichnis enthält. Dies ist standardmäßig ``inventory/`` in der OpenStack-Ansible-Codebasis.
id: Argumen ``--environment / -e`` akan membawa path ke direktori yang berisi direktori ``env.d``. Ini default ke ``inventory/`` di basis kode OpenStack-Ansible.

source: The ``/etc/openstack_deploy/env.d`` directory sources all YAML files into the deployed environment, allowing a deployer to define additional group mappings. This directory is used to extend the environment skeleton, or modify the defaults defined in the ``inventory/env.d`` directory.
de: Das Verzeichnis ``/etc/openstack_deploy/env.d` `bezieht alle YAML-Dateien in die implementierte Umgebung, sodass ein Deployer zusätzliche Gruppenzuordnungen definieren kann. Dieses Verzeichnis wird verwendet, um das Umgebungsskelett zu erweitern oder die im Verzeichnis ``inventory / env.d`` definierten Standardwerte zu ändern.
id: Direktori ``/etc/openstack_deploy/env.d`` sumber semua file YAML ke dalam lingkungan yang digunakan, yang memungkinkan seorang deployer untuk menentukan pemetaan grup tambahan. Direktori ini digunakan untuk memperluas kerangka lingkungan, atau memodifikasi default yang ditentukan dalam direktori ``inventory/env.d``.

source: The ``/etc/openstack_deploy/openstack_inventory.json`` file is read by default. An alternative file can be specified with ``--file``.
de: Die Datei ``/etc/openstack_deploy/openstack_inventory.json`` wird standardmäßig gelesen. Eine alternative Datei kann mit ``file`` angegeben werden.
id: File ``/etc/openstack_deploy/openstack_inventory.json`` dibaca secara default. File alternatif dapat ditentukan dengan ``--file``.

source: The ``all_containers`` group is automatically defined by OpenStack-Ansible. Any service component managed by OpenStack-Ansible maps to a subset of the ``all_containers`` inventory group, directly or indirectly through another intermediate container group.
de: Die Gruppe ``all_containers`` wird automatisch von OpenStack-Ansible definiert. Jede Dienstkomponente, die von OpenStack-Ansible verwaltet wird, wird einer Untergruppe der Bestandsgruppe ``all_containers`` direkt oder indirekt über eine andere Zwischencontainergruppe zugeordnet.
id: Grup ``all_containers`` secara otomatis ditentukan oleh OpenStack-Ansible. Komponen layanan apa pun yang dikelola oleh peta OpenStack-Ansible ke subset dari grup inventory ``all_containers``, langsung atau tidak langsung melalui grup kontainer perantara lainnya.

source: The ``cinder-volume`` component is deployed directly on the host by default. See the ``env.d/cinder.yml`` file for this example.
de: Die ``cinder-volume``-Komponente wird standardmäßig direkt auf dem Host bereitgestellt. In diesem Beispiel finden Sie die Datei ``env.d/cinder.yml``.
id: Komponen ``cinder-volume`` digunakan secara langsung pada host secara default. Lihat file ``env.d/cinder.yml`` untuk contoh ini.

source: The ``cinder-volume`` service does not run in a highly available configuration. When the ``cinder-volume`` service is configured to manage volumes on the same back end from multiple hosts or containers, one service is scheduled to manage the life cycle of the volume until an alternative service is assigned to do so. This assignment can be made through the `cinder-manage CLI tool`_. This configuration might change if `cinder volume active-active support spec`_ is implemented.
de: Der Dienst ``cinder-volume`` wird nicht in einer hoch verfügbaren Konfiguration ausgeführt. Wenn der Dienst ``cinder-volume`` konfiguriert ist, um Datenträger auf demselben Back-End von mehreren Hosts oder Containern zu verwalten, wird ein Dienst so geplant, dass er den Lebenszyklus des Volumes verwaltet, bis ein alternativer Service zugewiesen wird. Diese Zuweisung kann über das `cinder-manage CLI tool`_ erfolgen. Diese Konfiguration kann sich ändern, wenn `cinder volume active-active support spec`_ für den Datenträger aktiv ist.
id: Layanan ``cinder-volume`` tidak berjalan dalam konfigurasi yang sangat tersedia. Ketika layanan ``cinder-volume`` dikonfigurasikan untuk mengelola volume di back end yang sama dari beberapa host atau container, satu layanan dijadwalkan untuk mengelola siklus masa pakai volume hingga layanan alternatif ditugaskan untuk melakukannya. Tugas ini dapat dilakukan melalui `cinder-manage CLI tool`_. Konfigurasi ini dapat berubah jika `cinder volume active-active support spec`_ diimplementasikan.

source: The ``dynamic_inventory.py`` takes the ``--config`` argument for the directory holding configuration from which to create the inventory. If not specified, the default is ``/etc/openstack_deploy/``.
id: ``dynamic_inventory.py`` mengambil argumen `` --config`` untuk direktori yang menyimpan konfigurasi untuk membuat inventory. Jika tidak ditentukan, standarnya adalah ``/etc/openstack_deploy/``.

source: The ``haproxy.yml.example`` file in the ``conf.d/`` directory provides a simple example of defining a host group (``haproxy_hosts``) with two hosts (``infra1`` and ``infra2``).
id: File ``haproxy.yml.example`` dalam direktori ``conf.d/`` memberikan contoh sederhana untuk mendefinisikan grup host (``haproxy_hosts``) dengan dua host (``infra1`` dan ``infra2``).

source: The ``identity_hosts`` dictionary defines an Ansible inventory group named ``identity_hosts`` containing the three infra hosts. The configuration file ``inventory/env.d/keystone.yml`` defines additional Ansible inventory groups for the containers that are deployed onto the three hosts named with the prefix *infra*.
de: Das ``identity_hosts``-Wörterbuch definiert eine Ansible-Inventory-Gruppe mit dem Namen ``identity_hosts``, die die drei infra-Hosts enthält. Die Konfigurationsdatei ``inventory/env.d/keystone.yml`` definiert zusätzliche Ansible-Inventory-Gruppen für die Container, die auf den drei Hosts mit dem Präfix *infra* bereitgestellt werden.
id: Kamus ``identity_hosts`` mendefinisikan kelompok inventaris yang mungkin bernama ``identity_hosts`` yang berisi tiga host infra. File konfigurasi ``inventory/env.d/keystone.yml`` mendefinisikan grup inventaris tambahan yang mungkin untuk container yang disebarkan ke tiga host yang dinamai dengan awalan *infra*.

source: The ``inventory.log`` file is appended to, not overwritten.
de: Die Datei ``inventory.log`` wird angehängt, nicht überschrieben.
id: File ``inventory.log`` ditambahkan ke, bukan ditimpa.

source: The ``nova-compute`` service configures the hypervisor to present the allocated instance disk as a device to the instance.
de: Der Dienst ``nova-compute`` konfiguriert den Hypervisor so, dass er der Instanz den zugewiesenen Instanzdatenträger als Gerät darstellt.
id: Layanan ``nova-compute`` mengkonfigurasi hypervisor untuk menyajikan disk turunan yang dialokasikan sebagai perangkat ke instance.

source: The ``openstack_inventory.json`` file is the source of truth for the environment. Deleting this in a production environment means that the UUID portion of container names will be regenerated, which then results in new containers being created. Containers generated under the previous version will no longer be recognized by Ansible, even if reachable via SSH.
de: Die ``openstack_inventory.json`` Datei ist die Quelle der Wahrheit für die Umgebung. Wenn Sie dies in einer Produktionsumgebung löschen, bedeutet dies, dass der UUID-Teil der Containernamen neu generiert wird. Dies führt dazu, dass neue Container erstellt werden. Container, die unter der vorherigen Version generiert wurden, werden von Ansible nicht mehr erkannt, selbst wenn sie über SSH erreichbar sind.
id: File ``openstack_inventory.json`` adalah sumber kebenaran untuk lingkungan. Menghapus ini dalam lingkungan produksi berarti bahwa porsi UUID dari nama container akan dibuat ulang, yang kemudian menghasilkan container baru yang dibuat. Kontainer yang dibuat di bawah versi sebelumnya tidak akan lagi dikenali oleh Ansible, bahkan jika bisa dicapai melalui SSH.

source: The ``openstack_user_config.yml.example`` file is heavily commented with the details of how to do more advanced container networking configuration. The contents of the file are shown here for reference.
de: Die ``openstack_user_config.yml.example`` Datei ist stark kommentiert mit den Details, wie erweiterte Containernetzwerkkonfiguration zu tun. Der Inhalt der Datei wird hier als Referenz angezeigt.
id: File ``openstack_user_config.yml.example`` banyak dikomentari dengan perincian tentang bagaimana melakukan konfigurasi jaringan kontainer yang lebih maju. Isi file ditampilkan di sini untuk referensi.

source: The ``swift-proxy`` service is accessed by clients via the load balancer on the management network (``br-mgmt``). The ``swift-proxy`` service communicates with the Account, Container, and Object services on the Object Storage hosts via the storage network(``br-storage``). Replication between the Object Storage hosts is done via the replication network (``br-repl``).
de: Der Dienst ``swift-proxy`` wird von Clients über den Load Balancer im Verwaltungsnetzwerk (``br-mgmt``) aufgerufen. Der Dienst ``swift-proxy`` kommuniziert mit den Diensten Account, Container und Object auf den Object Storage-Hosts über das Speichernetzwerk (`` br-storage``). Die Replikation zwischen den Object Storage-Hosts erfolgt über das Replikationsnetzwerk (`` br-repl``).
id: Layanan ``swift-proxy`` diakses oleh klien melalui load balancer pada jaringan manajemen (``br-mgmt``)). Layanan ``swift-proxy`` berkomunikasi dengan layanan Account, Container, dan Object pada host Storage Object melalui jaringan penyimpanan (``br-storage``). Replikasi antara host Object Storage dilakukan melalui jaringan replikasi (``br-repl``).

source: The ``swift.yml.example`` file provides a more complex example. Here, host variables for a target host are specified by using the ``container_vars`` key. OpenStack-Ansible applies all entries under this key as host-specific variables to any component containers on the specific host.
de: Die Datei ``swift.yml.example`` bietet ein komplexeres Beispiel. Hier werden Hostvariablen für einen Zielhost mit dem Schlüssel ``container_vars`` angegeben. OpenStack-Ansible wendet alle Einträge unter diesem Schlüssel als Host-spezifische Variablen auf alle Komponentencontainer auf dem bestimmten Host an.
id: File ``swift.yml.example`` memberikan contoh yang lebih kompleks. Di sini, variabel host untuk host target ditentukan dengan menggunakan kunci ``container_vars``. OpenStack-Ansible menerapkan semua entri di bawah kunci ini sebagai variabel khusus host untuk setiap kontainer komponen pada host tertentu.

source: The `principle of least privilege`_ is used throughout OpenStack-Ansible to limit the damage that could be caused if an attacker gains access to any credentials.
de: Das `principle of least privilege`_ wird in OpenStack-Ansible verwendet, um den Schaden zu begrenzen, der verursacht werden könnte, wenn ein Angreifer Zugriff auf Anmeldeinformationen erhält.
id: Prinsip `principle of least privilege`_ digunakan di seluruh OpenStack-Ansible untuk membatasi kerusakan yang dapat disebabkan jika penyerang mendapatkan akses ke kredensial.

source: The absence of ``br-vlan`` in-path of instance traffic is also reflected on compute nodes, as shown in the following diagram.
id: Tidak adanya ``br-vlan`` di jalur lalu lintas instance juga tercermin pada node komputasi, seperti yang ditunjukkan pada diagram berikut.

source: The ansible roles are stored under ``/etc/ansible/roles``.
de: Die möglichen Rollen sind unter ``/etc/ansible/roles`` gespeichert.
id: Peran ansible disimpan di bawah ``/etc/ansible/roles``.

source: The code is generally located into ``/opt/openstack-ansible``.
de: Der Code befindet sich im Allgemeinen in ``/opt/openstack-ansible``.
id: Kode ini umumnya terletak di ``/opt/openstack-ansible``.

source: The combination of containers and flexible deployment options requires implementation of advanced Linux networking features, such as bridges and namespaces.
id: Kombinasi kontainer dan opsi penerapan fleksibel memerlukan implementasi fitur jaringan Linux yang canggih, seperti jembatan dan ruang nama (bridge and namespace)

source: The containers are not a mean of securing a system. The containers were not chosen for any eventual security safe guards. The machine containers were chosen because of their practicality with regard to providing a more uniform OpenStack deployment. Even if the abstractions that the containers provides do improve overall deployment security these potential benefits are not the intention of the containerization of services.
de: Die Container sind kein Mittel, um ein System zu sichern. Die Container wurden nicht für eventuelle Sicherheitsabsicherungen ausgewählt. Die Maschinencontainer wurden aufgrund ihrer praktischen Verwendbarkeit ausgewählt, um eine einheitlichere OpenStack-Bereitstellung bereitzustellen. Auch wenn die Abstraktionen, die die Container bieten, die allgemeine Einsatzsicherheit verbessern, sind diese potenziellen Vorteile nicht die Absicht der Containerisierung von Services.
id: Kontainer bukan berarti mengamankan sistem. Kontainer itu tidak dipilih untuk setiap penjaga keamanan yang aman akhirnya. Kontainer mesin dipilih karena kepraktisan mereka sehubungan dengan penyediaan penyebaran OpenStack yang lebih seragam. Bahkan jika abstraksi yang disediakan oleh kontainer meningkatkan keamanan penerapan secara keseluruhan, manfaat potensial ini bukan tujuan dari kontainer layanan.

source: The default container architecture has been built in such a way to allow for scalability and highly available deployments.
de: Die Standard-Containerarchitektur wurde so erstellt, dass Skalierbarkeit und hoch verfügbare Bereitstellungen möglich sind.
id: Arsitektur kontainer bawaan telah dibuat sedemikian rupa untuk memungkinkan skalabilitas dan penyebaran yang sangat tersedia.
