Repository: openstack/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: ko_kr, ru

source: 2023.1 (Antelope): EOM (end-of-maintenance)
ru: 2023.1 (Antelope): EOM (поддержка завершена)

source: 2023.2 (Bobcat): Maintained
ru: 2023.2 (Bobcat): поддерживается

source: 2024.1 (Caracal): Maintained
ru: 2024.1 (Caracal): поддерживается

source: 2024.2 (Dalmatian): Maintained
ru: 2024.2 (Dalmatian): поддерживается

source: 2025.1 (Epoxy): Under development
ru: 2025.1 (Epoxy): в разработке

source: Abstract
ko_kr: 요약
ru: Введение

source: Deployment guide
ru: Руководство по развертыванию

source: Documentation for each of the following releases is available.
ko_kr: 다음 릴리즈에 대한 개별 문서를 사용할 수 있습니다.
ru: Доступна документация для каждого из следующих релизов.

source: Mitaka: EOL (end-of-life)
ru: Mitaka: EOL (жизненный цикл завершен)

source: Newton: EOL (end-of-life)
ru: Newton: EOL (жизненный цикл завершен)

source: Ocata: EOL (end-of-life)
ru: Ocata: EOL (жизненный цикл завершен)

source: OpenStack-Ansible 2023.1 (Antelope) was EOM-ed on January 31, 2025.
ru: Поддержка OpenStack-Ansible 2023.1 (Antelope) была завершена 31 января 2025 года.

source: OpenStack-Ansible 2023.2 (Bobcat) was first released with the 28.0.0 tag on December 7, 2023.
ru: OpenStack-Ansible 2023.2 (Bobcat) был впервые представлен с меткой 28.0.0, 7 декабря 2023 года.

source: OpenStack-Ansible 2024.1 (Caracal) was first released with the 29.0.0 tag on June 6, 2024.
ru: OpenStack-Ansible 2024.1 (Caracal) был впервые представлен с меткой 29.0.0, 6 июня 2024 года.

source: OpenStack-Ansible 2024.2 (Dalmatian) was first released with the 30.0.0 tag on November 28, 2024.
ru: OpenStack-Ansible 2024.2 (Dalmatian) был впервые представлен с меткой 30.0.0, 28 ноября 2024 года.

source: OpenStack-Ansible 2025.1 (Epoxy) is currently Under Development.
ru: OpenStack-Ansible 2025.1 (Epoxy) находится в разработке.

source: OpenStack-Ansible Documentation
ko_kr: OpenStack-Ansible 문서
ru: Документация OpenStack-Ansible

source: OpenStack-Ansible Train series was EOL'd on 3 January 2024.
ru: Жизненный цикл OpenStack-Ansible Train был завершен 3 января 2024 года.

source: OpenStack-Ansible Ussuri series was EOL'd on 3 January 2024.
ru: Жизненный цикл OpenStack-Ansible Ussuri был завершен 3 января 2024 года.

source: OpenStack-Ansible Victoria series was EOM-ed on April 12, 2024.
ru: Поддержка OpenStack-Ansible Victoria была завершена 12 апреля 2024 года.

source: OpenStack-Ansible Wallaby series was EOM-ed on April 12, 2024.
ru: Поддержка OpenStack-Ansible Wallaby была завершена 12 апреля 2024 года.

source: OpenStack-Ansible Xena series was EOM-ed on April 12, 2024.
ru: Поддержка OpenStack-Ansible Xena была завершена 12 апреля 2024 года.

source: OpenStack-Ansible Yoga series was EOM-ed on February 8, 2024.
ru: Поддержка OpenStack-Ansible Yoga была завершена 8 февраля 2024 года.

source: OpenStack-Ansible Zed series was EOM-ed on June 6, 2024.
ru: Поддержка OpenStack-Ansible Zed была завершена 6 июня 2024 года.

source: OpenStack-Ansible provides Ansible playbooks and roles for the deployment and configuration of an OpenStack environment.
ko_kr: OpenStack-Ansible은 OpenStack 환경에 대한 배포 및 구성을 위한 Ansible 플레이북 및 역할을 제공합니다.
ru: OpenStack-Ansible предоставляет плейбуки и роли Ansible для установки и настройки окружения OpenStack.

source: OpenStack-Ansible's Mitaka series was EOL'd on 10 April 2017.
ko_kr: OpenStack-Ansible Mitaka 시리즈는 2017년 4월 10일 서비스 종료(EOL) 되었습니다.
ru: Жизненный цикл OpenStack-Ansible Mitaka был завершен 10 апреля 2017 года.

source: OpenStack-Ansible's Newton series was EOL'd on 3 April 2018.
ko_kr: OpenStack-Ansible Newton 시리즈는 2018년 4월 3일 서비스 종료(EOL) 되었습니다.
ru: Жизненный цикл OpenStack-Ansible Newton был завершен 3 апреля 2018 года.

source: OpenStack-Ansible's Ocata series was EOL'd on 21 December 2022.
ru: Жизненный цикл OpenStack-Ansible Ocata был завершен 19 декабря 2022 года.

source: OpenStack-Ansible's Pike series was EOL'd on 17 June 2022.
ru: Жизненный цикл OpenStack-Ansible Pike был завершен 17 июня 2022 года.

source: OpenStack-Ansible's Queens series was EOL'd on 19 October 2022.
ru: Жизненный цикл OpenStack-Ansible Queens был завершен 19 октября 2022 года.

source: OpenStack-Ansible's Rocky series was EOL'd on 11 July 2023.
ru: Жизненный цикл OpenStack-Ansible Rocky был завершен 11 июля 2023 года.

source: OpenStack-Ansible's Stein series was EOL'd on 14 December 2023.
ru: Жизненный цикл OpenStack-Ansible Stein был завершен 14 декабря 2023 года.

source: Pike: EOL (end-of-life)
ru: Pike: EOL (жизненный цикл завершен)

source: Queens: EOL (end-of-life)
ru: Queens: EOL (жизненный цикл завершен)

source: Release notes
ru: Примечания к релизу

source: Rocky: EOL (end-of-life)
ru: Rocky: EOL (жизненный цикл завершен)

source: Stein: EOL (end-of-life)
ru: Stein: EOL (жизненный цикл завершен)

source: To view the documentation only, see the `OpenStack-Ansible Mitaka Documentation <https://docs.openstack.org/openstack-ansible/mitaka/>`_.
ko_kr: 단지 문서 보기는 `OpenStack-Ansible Mitaka 참고자료 <https://docs.openstack.org/openstack-ansible/mitaka/>`_ 를 참고하세요.
ru: Для того, что бы просмотреть документацию, см. `Документация OpenStack-Ansible Mitaka <https://docs.openstack.org/openstack-ansible/mitaka/>`_.

source: To view the documentation only, see the `OpenStack-Ansible Newton Documentation <https://docs.openstack.org/openstack-ansible/newton/>`_.
ko_kr: 단지 문서 보기는 `OpenStack-Ansible Newton 참고자료 <https://docs.openstack.org/openstack-ansible/newton/>`_ 를 참고하세요.
ru: Для того, что бы просмотреть документацию, см. `Документация OpenStack-Ansible Newton <https://docs.openstack.org/openstack-ansible/newton/>`_.

source: Train: EOL (end-of-life)
ru: Train: EOL (жизненный цикл завершен)

source: Ussuri: EOL (end-of-life)
ru: Ussuri: EOL (жизненный цикл завершен)

source: Victoria: EOM (end-of-maintenance)
ru: Victoria: EOM (поддержка завершена)

source: Wallaby: EOM (end-of-maintenance)
ru: Wallaby: EOM (поддержка завершена)

source: Xena: EOM (end-of-maintenance)
ru: Xena: EOM (поддержка завершена)

source: Yoga: EOM (end-of-maintenance)
ru: Yoga: EOM (поддержка завершена)

source: Zed: EOM (end-of-maintenance)
ru: Zed: EOM (поддержка завершена)

source: `OpenStack-Ansible 2023.1 Documentation`_
ru: `Документация OpenStack-Ansible 2023.1`_

source: `OpenStack-Ansible 2023.1 series release notes`_
ru: `Примечания к релизу OpenStack-Ansible 2023.1`_

source: `OpenStack-Ansible 2023.2 Documentation`_
ru: `Документация OpenStack-Ansible 2023.2`_

source: `OpenStack-Ansible 2023.2 series release notes`_
ru: `Примечания к релизу OpenStack-Ansible 2023.2`_

source: `OpenStack-Ansible 2024.1 Documentation`_
ru: `Документация OpenStack-Ansible 2024.1`_

source: `OpenStack-Ansible 2024.1 series release notes`_
ru: `Примечания к релизу OpenStack-Ansible 2024.1`_

source: `OpenStack-Ansible 2024.2 Documentation`_
ru: `Документация OpenStack-Ansible 2024.2`_

source: `OpenStack-Ansible 2024.2 series release notes`_
ru: `Примечания к релизу OpenStack-Ansible 2024.2`_

source: `OpenStack-Ansible Ocata Documentation`_
ko_kr: `OpenStack-Ansible Ocata 참고자료`_
ru: `Документация OpenStack-Ansible Ocata`_

source: `OpenStack-Ansible Ocata series release notes`_
ko_kr: `OpenStack-Ansible Ocata 시리즈 릴리즈 노트`_
ru: `Примечания к релизу OpenStack-Ansible Ocata`_

source: `OpenStack-Ansible Pike Documentation`_
ko_kr: `OpenStack-Ansible Pike 참고자료`_
ru: `Документация OpenStack-Ansible Pike`_

source: `OpenStack-Ansible Pike series release notes`_
ko_kr: `OpenStack-Ansible Pike 시리즈 릴리즈 노트`_
ru: `Примечания к релизу OpenStack-Ansible Pike`_

source: `OpenStack-Ansible Queens Documentation`_
ko_kr: `OpenStack-Ansible Queens 참고자료`_
ru: `Документация OpenStack-Ansible Queens`_

source: `OpenStack-Ansible Queens series release notes`_
ko_kr: `OpenStack-Ansible Queens 시리즈 릴리즈 노트`_
ru: `Примечания к релизу OpenStack-Ansible Queens`_

source: `OpenStack-Ansible Rocky Documentation`_
ko_kr: `OpenStack-Ansible Rocky 참고자료`_
ru: `Документация OpenStack-Ansible Rocky`_

source: `OpenStack-Ansible Rocky series release notes`_
ko_kr: `OpenStack-Ansible Rocky 시리즈 릴리즈 노트`_
ru: `Примечания к релизу OpenStack-Ansible Rocky`_

source: `OpenStack-Ansible Stein Documentation`_
ru: `Документация OpenStack-Ansible Stein`_

source: `OpenStack-Ansible Stein series release notes`_
ru: `Примечания к релизу OpenStack-Ansible Stein`_

source: `OpenStack-Ansible Train Documentation`_
ru: `Документация OpenStack-Ansible Train`_

source: `OpenStack-Ansible Train series release notes`_
ru: `Примечания к релизу OpenStack-Ansible Train`_

source: `OpenStack-Ansible Ussuri Documentation`_
ru: `Документация OpenStack-Ansible Ussuri`_

source: `OpenStack-Ansible Ussuri series release notes`_
ru: `Примечания к релизу OpenStack-Ansible Ussuri`_

source: `OpenStack-Ansible Victoria Documentation`_
ru: `Документация OpenStack-Ansible Victoria`_

source: `OpenStack-Ansible Victoria series release notes`_
ru: `Примечания к релизу OpenStack-Ansible Victoria`_

source: `OpenStack-Ansible Wallaby Documentation`_
ru: `Документация OpenStack-Ansible Wallaby`_

source: `OpenStack-Ansible Wallaby series release notes`_
ru: `Примечания к релизу OpenStack-Ansible Wallaby`_

source: `OpenStack-Ansible Xena Documentation`_
ru: `Документация OpenStack-Ansible Xena`_

source: `OpenStack-Ansible Xena series release notes`_
ru: `Примечания к релизу OpenStack-Ansible Xena`_

source: `OpenStack-Ansible Yoga Documentation`_
ru: `Документация OpenStack-Ansible Yoga`_

source: `OpenStack-Ansible Yoga series release notes`_
ru: `Примечания к релизу OpenStack-Ansible Yoga`_

source: `OpenStack-Ansible Zed Documentation`_
ru: `Документация OpenStack-Ansible Zed`_

source: `OpenStack-Ansible Zed series release notes`_
ru: `Примечания к релизу OpenStack-Ansible Zed`_

source: Ocata: Extended Maintenance
ko_kr: Ocata: 확장 유지보수 중

source: OpenStack-Ansible Stein is currently in development.
ko_kr: OpenStack-Ansible Stein은 현재 개발 진행 중입니다.

source: OpenStack-Ansible's Ocata series was first released with the 15.0.0 tag on 8 March 2017.
ko_kr: OpenStack-Ansible Ocata 시리즈는 2017년 3월 8일 15.0.0 태그로 처음 릴리즈 되었습니다.

source: OpenStack-Ansible's Pike series was first released with the 16.0.0 tag on 14 September 2017.
ko_kr: OpenStack-Ansible Pike 시리즈는 2017년 9월 14일 16.0.0 태그로 처음 릴리즈 되었습니다.

source: OpenStack-Ansible's Queens series was first released with the 17.0.0 tag on 14 March 2018.
ko_kr: OpenStack-Ansible Queens 시리즈는 2018년 3월 14일 17.0.0 태그로 처음 릴리즈 되었습니다.

source: OpenStack-Ansible's Rocky series was first released with the 18.0.0 tag on 16 October 2018.
ko_kr: OpenStack-Ansible Rocky 시리즈는 2018년 10월 16일 18.0.0 태그로 처음 릴리즈 되었습니다.

source: Pike: Maintained
ko_kr: Pike: 유지보수 중

source: Queens: Maintained
ko_kr: Queens: 유지보수 중

source: Rocky: Maintained
ko_kr: Rocky: 유지보수 중

source: Stein: Pre-release
ko_kr: Stein: 릴리즈 이전
