Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The sysctl configuration task was not skipping configurations where ``enabled`` was set to ``no``. Instead, it was removing configurations when ``enabled: no`` was set.
id: Tugas konfigurasi sysctl tidak melewatkan konfigurasi di mana ``enabled`` disetel ke ``no``. Sebagai gantinya, itu menghapus konfigurasi ketika ``enabled: no`` ditetapkan.

source: The tacker dashboard is available in Horizon. Deployers can enable the panel by setting the following Ansible variable:
id: Dasbor tacker tersedia di Horizon. Deployer dapat mengaktifkan panel dengan mengatur variabel Ansible berikut:

source: The tag options when creating an LXC container have been simplified. The two tags now supported by the `lxc_container_create` role are **lxc-{create,config}**.
id: Opsi tag saat membuat kontainer LXC telah disederhanakan. Dua tag yang sekarang didukung oleh peran `lxc_container_create` adalah **lxc-{create,config}**.

source: The task dropping the aodh systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas menjatuhkan (dropping) file unit systemd aodh sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk mengkustomisasi file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratannya

source: The task dropping the barbican systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas dropping file unit systemd barbican sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk mengkustomisasi file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratannya.

source: The task dropping the ceilometer systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and pollute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas dropping file unit systemd ceilometer sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk menyesuaikan file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratannya.

source: The task dropping the ceilometer systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas dropping file unit systemd ceilometer sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk mengkustomisasi file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratannya.

source: The task dropping the cinder systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas menjatuhkan file unit systemd cinder sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses penyebar untuk menyesuaikan file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan polute file unit systemd generik dengan variabel jinja2 dan persyaratan.

source: The task dropping the designate systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas dropping file unit systemd designate sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk mengkustomisasi file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratannya.

source: The task dropping the glance systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas dropping file unit systemd glance sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk mengkustomisasi file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratannya.

source: The task dropping the gnocchi systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas menjatuhkan file unit systemd gnocchi sekarang menggunakan plugin aksi `` config_template`` yang memungkinkan para penyebar mengakses untuk mengkustomisasi file-file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan memutarkan file unit systemd umum dengan variabel jinja2 dan persyaratan.

source: The task dropping the heat systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas dropping file unit systemd heat sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk mengkustomisasi file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratannya.

source: The task dropping the ironic systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas dropping file unit systemd ironis sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk menyesuaikan file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratan.

source: The task dropping the keystone systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas dropping file unit systemd keystone sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk mengkustomisasi file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratannya.

source: The task dropping the magnum systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas menjatuhkan file unit systemd magnum sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses penyebar untuk menyesuaikan file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan polute file unit systemd generik dengan variabel jinja2 dan persyaratan.

source: The task dropping the neutron systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas dropping file unit systemd neutron sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk mengkustomisasi file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratannya.

source: The task dropping the nova systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas menjatuhkan file unit systemd nova sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk menyesuaikan file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan polute file unit systemd umum dengan variabel jinja2 dan persyaratan.

source: The task dropping the octavia systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas dropping file unit systemd octavia sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk mengkustomisasi file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratannya.

source: The task dropping the sahara systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas dropping file unit systemd sahara sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk mengkustomisasi file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratannya.

source: The task dropping the swift systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas menjatuhkan file unit systemd swift sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan deployer akses untuk mengkustomisasi file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratan.

source: The task dropping the trove systemd unit files now uses the ``config_template`` action plugin allowing deployers access to customize the unit files as they see fit without having to load extra options into the defaults and polute the generic systemd unit file with jinja2 variables and conditionals.
id: Tugas dropping file unit systemve trove sekarang menggunakan plugin aksi ``config_template`` yang memungkinkan akses deployer untuk mengkustomisasi file unit sesuai keinginan tanpa harus memuat opsi tambahan ke default dan mencemari file unit systemd generik dengan variabel jinja2 dan persyaratannya.

source: The task now removes any permissions that are not allowed by the STIG. Any log files that meet or exceed the STIG requirements will not be modified.
id: Tugas sekarang menghapus semua izin yang tidak diizinkan oleh STIG. File log apa pun yang memenuhi atau melampaui persyaratan STIG tidak akan diubah.

source: The tasks creating a keystone service user have been removed, along with related variables ``keystone_service_user_name`` and ``keystone_service_password``. This user can be deleted in existing deployments.
id: Tugas membuat pengguna layanan keystone telah dihapus, bersama dengan variabel terkait ``keystone_service_user_name`` dan ``keystone_service_password``. Pengguna ini dapat dihapus di deployment yang ada.

source: The tasks in the os_horizon role will determine which LBaaS version is in use (via ``neutron_plugin_base``) and activate the correct panel for LBaaS v1 or v2.
id: Tugas dalam role os_horizon akan menentukan versi LBaaS mana yang digunakan (melalui ``neutron_plugin_base``) dan mengaktifkan panel yang benar untuk LBaaS v1 atau v2.

source: The tasks that search for ``.shosts`` and ``shosts.equiv`` files (STIG ID: RHEL-07-040330) are now skipped by default. The search takes a long time to complete on systems with lots of files and it also causes a significant amount of disk I/O while it runs.
id: Tugas yang mencari file ``.shosts`` dan ``shosts.equiv`` (STIG ID: RHEL-07-040330) sekarang dilewati secara default. Pencarian membutuhkan waktu lama untuk diselesaikan pada sistem dengan banyak file dan itu juga menyebabkan sejumlah besar I/O disk saat dijalankan.

source: The tasks within the ansible-hardening role are now based on Version 1, Release 3 of the Red Hat Enteprise Linux Security Technical Implementation Guide.
id: Tugas dalam role ansible-hardening sekarang didasarkan pada Version 1, Release 3 of the Red Hat Enteprise Linux Security Technical Implementation Guide.

source: The trove service setup in keystone will now be executed through delegation to the ``trove_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Setup layanan trove di keystone sekarang akan dieksekusi melalui delegasi dimana ``trove_service_setup_host``, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The upgrade playbook `nova-flavor-migration.yml` will perform a migration of nova flavor data. This will need to be completed prior to upgrading to Liberty. It is recommended that Kilo be deployed from the `eol-kilo` tag prior to upgrading to Liberty to ensure that this task is completed successfully.
id: Playbook upgrade `nova-flavor-migration.yml` akan melakukan migrasi data flavor nova. Ini harus diselesaikan sebelum upgrading ke Liberty. Dianjurkan agar Kilo digunakan dari tag `eol-kilo` sebelum upgrading ke Liberty untuk memastikan bahwa tugas ini berhasil diselesaikan.

source: The upgrade process will backup and re-configure the /etc/openstack_deploy directory. This includes inserting new environment details, updating changed variable names, and generating newly added secrets.
id: Proses upgrade akan mencadangkan dan mengkonfigurasi ulang direktori /etc/openstack_deploy. Ini termasuk memasukkan detail lingkungan baru, memperbarui nama variabel yang diubah, dan menghasilkan rahasia yang baru ditambahkan.

source: The upgrade step to remove legacy MariaDB apt sources was failing due to the destruction of the repo containers. This issue has now been fixed by skipping the repo containers in this step.
id: Langkah upgrade untuk menghapus sumber apt MariaDB lawas gagal karena penghancuran kontainer repo. Masalah ini sekarang telah diperbaiki dengan melewatkan kontainer repo di langkah ini.

source: The upstream MariaDB init script has replaced the custom init script that was provided by OpenStack-Ansible in previous versions.
id: Skrip init MariaDB hulu telah menggantikan skrip init kustom yang disediakan oleh OpenStack-Ansible di versi sebelumnya.

source: The upstream noVNC developers recommend that the keymap be automatically detected for virtual machine consoles. The defaults for three Ansible variables have been removed:
id: Pengembang noVNC hulu merekomendasikan agar keymap terdeteksi secara otomatis untuk konsol mesin virtual. Default untuk tiga variabel Ansible telah dihapus:

source: The upstream noVNC developers recommend that the keymap be automatically detected for virtual machine consoles. Three Ansible variables have been removed:
id: Pengembang noVNC hulu merekomendasikan agar keymap terdeteksi secara otomatis untuk konsol mesin virtual. Tiga variabel yang mungkin telah dihapus:

source: The use of the ``apt_package_pinning`` role as a meta dependency has been removed from the rabbitmq_server role. While the package pinning role is still used, it will now only be executed when the apt task file is executed.
id: Penggunaan role ``apt_package_pinning`` sebagai ketergantungan meta telah dihapus dari role rabbitmq_server. Sementara role pinning paket masih digunakan, sekarang hanya akan dieksekusi ketika file tugas apt dieksekusi.

source: The use_neutron option was marked to be removed in sahara.
id: Opsi use_neutron ditandai untuk dihapus di sahara.

source: The var ``lxc_container_ssh_delay`` along with SSH specific ping checks have been removed in favor of using Ansible's wait_for_connection module, which will not rely on SSH to the container to verify connectivity. A new variable called ``lxc_container_wait_params`` has been added to allow configuration of the parameters passed to the ``wait_for_connection`` module.
id: Var ``lxc_container_ssh_delay`` bersama dengan pemeriksaan ping spesifik SSH telah dihapus karena menggunakan modul wait_for_connection Ansible, yang tidak akan bergantung pada SSH ke kontainer untuk memverifikasi konektivitas. Variabel baru yang disebut ``lxc_container_wait_params`` telah ditambahkan untuk memungkinkan konfigurasi parameter yang diteruskan ke modul ``wait_for_connection``.

source: The var ``lxc_container_ssh_delay`` along with SSH specific ping checks have been removed in favor of using Ansible's wait_for_connection module, which will not rely on SSH to the container.
id: Var ``lxc_container_ssh_delay`` bersama dengan pemeriksaan ping spesifik SSH telah dihapus karena menggunakan modul wait_for_connection Ansible, yang tidak akan bergantung pada SSH ke kontainer.

source: The variable ``aodh_apt_packages`` has been renamed to ``aodh_distro_packages``.
id: Variabel ``aodh_apt_packages`` telah diubah namanya menjadi ``aodh_distro_packages``.

source: The variable ``aodh_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``aodh_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``barbican_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``barbican_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``ceilometer_apt_packages`` has been renamed to ``ceilometer_distro_packages``.
id: Variabel ``ceilometer_apt_packages`` telah diubah namanya menjadi ``ceilometer_distro_packages``.

source: The variable ``ceilometer_developer_mode_apt_packages`` has been renamed to ``ceilometer_developer_mode_distro_packages``.
id: Variabel ``ceilometer_developer_mode_apt_packages`` telah diubah namanya menjadi ``ceilometer_developer_mode_distro_packages``.

source: The variable ``cinder_apt_packages`` has been renamed to ``cinder_distro_packages``.
id: Variabel ``cinder_apt_packages`` telah diubah namanya menjadi ``cinder_distro_packages``.

source: The variable ``cinder_lvm_volume_apt_packages`` has been renamed to ``cinder_lvm_volume_distro_packages``.
id: Variabel ``cinder_lvm_volume_apt_packages`` telah diubah namanya menjadi ``cinder_lvm_volume_distro_packages``.

source: The variable ``cinder_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``cinder_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``cinder_volume_apt_packages`` has been renamed to ``cinder_volume_distro_packages``.
id: Variabel ``cinder_volume_apt_packages`` telah diubah namanya menjadi ``cinder_volume_distro_packages``.

source: The variable ``cloudkitty_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``cloudkitty_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``designate_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``designate_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``galera_client_apt_packages`` has been replaced by ``galera_client_distro_packages``.
id: Variabel ``galera_client_apt_packages`` telah digantikan oleh ``galera_client_distro_packages``.

source: The variable ``galera_packages`` has been renamed to ``galera_server_mariadb_distro_packages``.
id: Variabel ``galera_packages`` telah diubah namanya menjadi ``galera_server_mariadb_distro_packages``.

source: The variable ``galera_pre_packages`` has been renamed to ``galera_server_required_distro_packages``.
id: Variabel ``galera_pre_packages`` telah diubah namanya menjadi ``galera_server_required_distro_packages``.

source: The variable ``galera_xtrabackup_threads`` has been renamed to ``galera_mariabackup_threads`` to reflect the change in the SST provider.
id: Variabel ``galera_xtrabackup_threads`` telah diubah namanya menjadi ``galera_mariabackup_threads`` untuk mencerminkan perubahan pada penyedia SST.

source: The variable ``glance_apt_packages`` has been renamed to ``glance_distro_packages``.
id: Variabel ``glance_apt_packages`` telah diubah namanya menjadi ``glance_distro_packages``.

source: The variable ``glance_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``glance_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``gnocchi_required_pip_packages`` was incorrectly named and has been renamed to ``gnocchi_requires_pip_packages`` to match the standard across all roles.
id: Variabel ``gnocchi_required_pip_packages`` salah nama dan telah diubah namanya menjadi ``gnocchi_requires_pip_packages`` untuk mencocokkan standar di semua role.

source: The variable ``gnocchi_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``gnocchi_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``haproxy_packages`` has been renamed to ``haproxy_distro_packages``.
id: Variabel ``haproxy_packages`` telah diubah namanya menjadi ``haproxy_distro_packages``.

source: The variable ``haproxy_pre_packages`` has been renamed to ``haproxy_required_distro_packages``.
id: Variabel ``haproxy_pre_packages`` telah diubah namanya menjadi ``haproxy_required_distro_packages``.

source: The variable ``heat_apt_packages`` has been renamed to ``heat_distro_packages``.
id: Variabel ``heat_apt_packages`` telah diubah namanya menjadi ``heat_distro_packages``.

source: The variable ``heat_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``heat_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``horizon_apt_packages`` has been renamed to ``horizon_distro_packages``.
id: Variabel ``horizon_apt_packages`` telah diubah namanya menjadi ``horizon_distro_packages``.
