Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: Two new options were added for handling authentication with Swift storage backends - ``glance_swift_store_user_domain`` and ``glance_swift_store_project_domain``. Both are set to ``default`` and can be adjusted if deployers use a different Keystone domain to authenticate to swift.
id: Dua opsi baru ditambahkan untuk menangani otentikasi dengan backend penyimpanan Swift - ``glance_swift_store_user_domain`` dan ``glance_swift_store_project_domain``. Keduanya diatur ke ``default`` dan dapat disesuaikan jika deployer menggunakan domain Keystone yang berbeda untuk mengautentikasi ke swift.

source: Two new variables (`rabbitmq_async_threads` and `rabbitmq_process_limit`) have been added to the openstack-ansible-rabbitmq_server role. The variable `rabbitmq_async_threads` limits the number of asynchronous threads for file and socket I/O. The variable `rabbitmq_process_limit` limits the overall number of supported processes inside the erlang VM.
id: Dua variabel baru (`rabbitmq_async_threads` dan` rabbitmq_process_limit`) telah ditambahkan ke peran openstack-ansible-rabbitmq_server. Variabel `rabbitmq_async_threads` membatasi jumlah asynchronous thread untuk file dan soket I/O. Variabel `rabbitmq_process_limit` membatasi jumlah keseluruhan proses yang didukung di dalam VM erlang.

source: Ubuntu Cloud Archive (UCA) was installed by default on repo, nova, neutron nodes, but not on the other nodes. From now on, we are using UCA everywhere to avoid dependency issues (like having virtualenv build with incompatible versions of python-cryptography). The same reasoning applies to CentOS and RDO packages.
id: Ubuntu Cloud Archive (UCA) diinstal secara default pada repo, nova, node neutron, tetapi tidak pada node lain. Mulai sekarang, kami menggunakan UCA di mana-mana untuk menghindari masalah ketergantungan (seperti membangun virtualenv dengan versi python-cryptography yang tidak kompatibel). Alasan yang sama berlaku untuk paket CentOS dan RDO.

source: Ubuntu Trusty (14.04) support is now removed from the os_cloudkitty role.
id: Dukungan Ubuntu Trusty (14.04) sekarang dihapus dari peran os_cloudkitty.

source: Ubuntu has 4 different 'components' - main, universe, multiverse and restricted:
id: Ubuntu memiliki 4 'components' yang berbeda - main, universe, multiverse and restricted:

source: Universe: Community maintained software, i.e. not officially supported software.
id: Universe: Perangkat lunak yang dikelola komunitas, yaitu perangkat lunak yang tidak didukung secara resmi.

source: Upgrade Notes
id: Catatan Upgrade

source: Upgrades will not replace entries in the /etc/openstack_deploy/env.d directory, though new versions of OpenStack-Ansible will now use the shipped env.d as a base, which may alter existing deployments.
id: Upgrade tidak akan menggantikan entri di direktori /etc/openstack_deploy/env.d, meskipun versi baru OpenStack-Ansible sekarang akan menggunakan env.d yang dikirimkan sebagai basis, yang dapat mengubah penyebaran yang ada.

source: Upgrading from Newton to Ocata will now correctly add existing Nova instances to the ``nova_cell1_name`` cell. For more information see `bug 1682169 <https://bugs.launchpad.net/openstack-ansible/+bug/1682169>`_.
id: Upgrading dari Newton ke Ocata sekarang akan dengan benar menambahkan instance Nova yang ada ke sel ``nova_cell1_name``. Untuk informasi lebih lanjut, lihat `bug 1682169 <https://bugs.launchpad.net/openstack-ansible/+bug/1682169>`_.

source: Upstream is now depending on version 2.1.0 of ldappool.
id: Upstream sekarang tergantung pada versi 2.1.0 dari ldappool.

source: Usage of tempest_tempest_conf_overrides, where it could have 2 different formats. one for config_template and another one for tempestconf.profile Now for tempestconf.profile overrides `tempest_tempestconf_profile_overrides` variable should be used.
id: Penggunaan tempest_tempest_conf_overrides, di mana ia bisa memiliki 2 format berbeda. satu untuk config_template dan satu lagi untuk tempestconf.profile Now untuk override tempestconf.profile `tempest_tempestconf_profile_overrides` variabel harus digunakan.

source: Users should purge the 'ntp' package from their hosts if ceph-ansible is enabled. ceph-ansible previously was configured to install ntp by default which conflicts with the OSA ansible-hardening role chrony service.
id: Pengguna harus membersihkan paket 'ntp' dari host mereka jika mungkin diaktifkan. ceph-ansible sebelumnya dikonfigurasikan untuk menginstal ntp secara default yang bertentangan dengan layanan kroni role ansible-hardening OSA.

source: Ussuri Series Release Notes
id: Catatan Rilis Seri Ussuri

source: VPNaaS dashboard is again available in Horizon. Deployers can enable the panel by setting the following Ansible variable:
id: Dasbor VPNaaS tersedia lagi di Horizon. Deployer dapat mengaktifkan panel dengan mengatur variabel Ansible berikut:

source: Variable ``ceph_extra_confs`` has been expanded to support retrieving additional ceph.conf and keyrings from multiple ceph clusters automatically.
id: Variabel ``ceph_extra_confs`` telah diperluas untuk mendukung pengambilan ceph.conf tambahan dan keyring dari beberapa cluster ceph secara otomatis.

source: Variable `libvirt_package` in ceph_client role has been renamed to `libvirt_packages` and converted from string to a list.
id: Variabel `libvirt_package` dalam peran ceph_client telah diubah namanya menjadi`libvirt_packages` dan dikonversi dari string ke daftar.

source: Variable `rabbitmq_release_version` has been removed as not used anymore.
id: Variabel `rabbitmq_release_version` telah dihapus karena tidak digunakan lagi.

source: Variable `uca_repo` has been removed. Deployers are appreciated to use `user_external_repos_list` instead if they want to define extra repository Variable `uca_apt_repo_url` was renamed to `apt_repo_url` in order to correspond it's usage as it also affect Debian deployments now.
id: Variabel `uca_repo` telah dihapus. Pemberi kerja diapresiasi untuk menggunakan `user_external_repos_list` sebagai gantinya jika mereka ingin mendefinisikan repositori tambahan. Variabel `uca_apt_repo_url` diubah namanya menjadi `apt_repo_url` untuk menyesuaikan penggunaannya karena hal itu juga mempengaruhi penyebaran Debian sekarang.

source: We are limiting the tarred inventory backups to 15 in addition to changes that only apply backups when the config has changed. These changes are to address an issue where the inventory was corruped with parallel runs on large clusters.
id: Kami membatasi tarred inventory backup hingga 15 di samping perubahan yang hanya berlaku backup saat konfigurasi telah berubah. Perubahan ini untuk mengatasi masalah di mana inventory rusak dengan berjalan paralel pada kluster besar.

source: When Glance is configured to use a swift store backend, it will use Keystone v3 authentication by default via the ``glance_swift_store_auth_version`` variable.
id: Ketika Glance dikonfigurasikan untuk menggunakan swift store backend, ia akan menggunakan otentikasi Keystone v3 secara default melalui variabel ``glance_swift_store_auth_version``.

source: When ``venvwithindex=True`` and ``ignorerequirements=True`` are both specified in ``rally_git_install_fragments`` (as was previously the default), this results in rally being installed from PyPI without any constraints being applied. This results in inconsistent builds from day to day, and can cause build failures for stable implementations due to new library releases. Going forward, we remove the ``rally_git_*`` overrides in ``playbooks/defaults/repo_packages/openstack_testing.yml`` so that the integrated build installs rally from PyPI, but with appropriate constraints applied.
id: Ketika ``venvwithindex=True`` dan ``ignorerequirements=True`` keduanya ditentukan dalam ``rally_git_install_fragments`` (seperti sebelumnya default), ini menghasilkan rally yang dipasang dari PyPI tanpa kendala yang diterapkan. Ini menghasilkan build yang tidak konsisten dari hari ke hari, dan dapat menyebabkan kegagalan build untuk implementasi yang stabil karena rilis library baru. Ke depan, kami menghapus ``rally_git_*`` overrides di ``playbooks/defaults/repo_packages/openstack_testing.yml`` sehingga build terintegrasi menginstal rally dari PyPI, tetapi dengan batasan yang sesuai diterapkan.

source: When `venvwithindex=True` and `ignorerequirements=True` are both specified in `tempest_git_install_fragments` (as was previously the default), this results in tempest being installed from PyPI without any constraints being applied. This could result in the version of tempest being installed in the integrated build being different than the version being installed in the independent role tests. Going forward, we remove the `tempest_git_*` overrides in playbooks/defaults/repo_packages/openstack_testing.yml so that the integrated build installs tempest from PyPI, but with appropriate constraints applied.
id: Ketika `venvwithindex=True` and `ignorerequirements=True` keduanya ditentukan dalam `tempest_git_install_fragments` (seperti sebelumnya default), ini mengakibatkan tempest diinstal dari PyPI tanpa kendala yang diterapkan. Ini bisa mengakibatkan versi tempest yang dipasang di integrated build berbeda dari versi yang diinstal di independent role test. Ke depan, kami menghapus `tempest_git_*` overrides di playbooks/defaults/repo_packages/openstack_testing.yml sehingga integrated build menginstal tempest dari PyPI, tetapi dengan batasan yang sesuai diterapkan.

source: When a task fails while executing a playbook, the default behaviour for Ansible is to fail for that host without executing any notifiers. This can result in configuration changes being executed, but services not being restarted. OpenStack-Ansible now sets ``ANSIBLE_FORCE_HANDLERS`` to ``True`` by default to ensure that all notified handlers attempt to execute before stopping the playbook execution.
id: Ketika tugas gagal saat menjalankan playbook, perilaku default untuk Ansible adalah gagal untuk host itu tanpa mengeksekusi notifier. Ini dapat mengakibatkan perubahan konfigurasi yang dieksekusi, tetapi layanan tidak restarted. OpenStack-Ansible sekarang menetapkan ``ANSIBLE_FORCE_HANDLERS`` menjadi ``True`` secara default untuk memastikan bahwa semua penangan yang diberitahukan mencoba melakukan sebelum menghentikan eksekusi playbook.

source: When enabled, Neutron Firewall as a Service (FWaaS) provides projects the option to implement perimeter security (filtering at the router), adding to filtering at the instance interfaces which is provided by 'Security Groups'.
id: Ketika diaktifkan, Neutron Firewall as a Service (FWaaS) memberikan proyek opsi untuk menerapkan keamanan perimeter (pemfilteran pada router), menambah pemfilteran pada antarmuka instance yang disediakan oleh 'Security Groups'.

source: When executing a deployment which includes the telemetry systems (ceilometer, gnocchi, aodh), the repo build will fail due to the inability for pip to read the constraints properly from the extras section in ceilometer's setup.cfg. The current workaround for this is to add the following content to ``/etc/openstack_deploy/user_variables.yml``.
id: Ketika menjalankan deployment yang mencakup sistem telemetri (ceilometer, gnocchi, aodh), repo build akan gagal karena ketidakmampuan pip untuk membaca kendala dengan benar dari bagian ekstra di setup.cfg ceilometer. Solusi saat ini untuk ini adalah menambahkan konten berikut ke ``/etc/openstack_deploy/user_variables.yml``.

source: When migrating from Liberty to Mitaka neutron does not automatically set or migrate networks MTU settings. Neutron has no migration to correctly set the MTU on existing networks so we've created an OSA MTU migration playbook to work-around this issue. The playbook will set the MTU on networks created before the upgrade by iterating on known values from the user_variables and facts. Should any known network name be encountered the MTU will be set to the known value. If no MTU and no global override is present the playbook will fall back to using 1500 for vlan/flat networks and 1450 for vxlan networks.
id: Ketika bermigrasi dari Liberty ke Mitaka, neutron tidak secara otomatis mengatur atau memigrasi pengaturan jaringan MTU. Neutron tidak memiliki migrasi untuk mengatur MTU dengan benar di jaringan yang ada sehingga kami telah membuat playbook migrasi OSA MTU untuk mengatasi masalah ini. Playbook akan mengatur MTU pada jaringan yang dibuat sebelum upgrade dengan mengulangi (iterating) nilai yang diketahui dari user_variables dan fakta. Jika ada nama jaringan yang diketahui dijumpai, MTU akan ditetapkan ke nilai yang diketahui. Jika tidak ada MTU dan tidak ada global override, playbook akan kembali menggunakan 1500 untuk jaringan vlan/flat dan 1450 untuk jaringan vxlan.

source: When running aodh with apache(httpd) all apache logs will be stored in the standard apache log directory which is controlled by the distro specific variable ``aodh_apache_default_log_folder``.
id: Saat menjalankan aodh dengan apache(httpd) semua log apache akan disimpan dalam direktori log apache standar yang dikendalikan oleh variabel spesifik distro ``aodh_apache_default_log_folder``.

source: When running keystone with apache(httpd) all apache logs will be stored in the standard apache log directory which is controlled by the distro specific variable ``keystone_apache_default_log_folder``.
id: Saat menjalankan keystone dengan apache(httpd) semua log apache akan disimpan dalam direktori log apache standar yang dikendalikan oleh variabel spesifik distro ``keystone_apache_default_log_folder``.

source: When the ``glance_enable_v2_registry`` variable is set to ``True`` the corresponding ``data_api`` setting is now correctly set. Previously it was not set and therefore the API service was not correctly informed that the registry was operating.
id: Ketika variabel ``glance_enable_v2_registry`` diatur ke ``True`` pengaturan ``data_api`` yang sesuai sekarang diatur dengan benar. Sebelumnya itu tidak disetel dan oleh karena itu layanan API tidak diinformasikan dengan benar bahwa registri beroperasi.

source: When the security role was run in Ansible's check mode and a tag was provided, the ``check_mode`` variable was not being set. Any tasks which depend on that variable would fail. This `bug is fixed <https://bugs.launchpad.net/openstack-ansible/+bug/1590086>`_ and the ``check_mode`` variable is now set properly on every playbook run.
id: Ketika peran keamanan dijalankan dalam mode pemeriksaan Ansible dan tag diberikan, variabel ``check_mode`` tidak diatur. Tugas apa pun yang bergantung pada variabel itu akan gagal. Bug ini diperbaiki `bug is fixed <https://bugs.launchpad.net/openstack-ansible/+bug/1590086>` _ dan variabel ``check_mode`` sekarang ditetapkan dengan benar pada setiap proses playbook.

source: When upgrading a Swift deployment from Mitaka to Newton it should be noted that the enabled middleware list has changed. In Newton the "staticweb" middleware will be loaded by default. While the change adds a feature it is non-disruptive in upgrades.
id: Ketika upgrading deployment Swift dari Mitaka ke Newton, harus diperhatikan bahwa daftar middleware yang diaktifkan telah berubah. Di Newton middleware "staticweb" akan dimuat secara default. Sementara perubahan menambahkan fitur, itu tidak mengganggu dalam upgrade.

source: When upgrading deployers will need to ensure they have a backup of all logging from within the container prior to running the playbooks. If the logging node is present within the deployment all logs should already be sync'd with the logging server and no action is required. As a pre-step it's recommended that deployers clean up logging directories from within containers prior to running the playbooks. After the playbooks have run the bind mount will be in effect at "/var/log" which will mount over all previous log files and directories.
id: Saat upgrading versi, deployer perlu memastikan mereka memiliki backup semua pencatatan (logging) dari dalam kontainer sebelum menjalankan playbooks. Jika node logging hadir dalam deployment semua log harus sudah disinkronkan dengan server logging dan tidak ada aksi yang diperlukan. Sebagai langkah awal, disarankan agar para deployers membersihkan direktori pendataan dari dalam kontainer sebelum menjalankan playbooks. Setelah playbook dijalankan, bind mount akan berlaku di "/var/log" yang akan dipasang di semua file log dan direktori sebelumnya.

source: When upgrading from Kilo to Liberty, the ``port_security`` extension driver will not be configured due to the known issues with enabling it after creating networks.
id: Saat upgrading dari Kilo ke Liberty, driver ekstensi ``port_security`` tidak akan dikonfigurasikan karena masalah yang diketahui dengan mengaktifkannya setelah membuat jaringan.

source: When upgrading from early Kilo versions of OpenStack-Ansible, the RabbitMQ minor version may need to be upgraded during the upgrade process. This is noted in both the manual steps and the ``run-upgrade.sh`` script.
id: Saat upgrading dari versi Kilo awal OpenStack-Ansible, versi minor RabbitMQ mungkin perlu ditingkatkan (upgraded) selama proses upgrade. Ini dicatat di kedua langkah manual dan skrip ``run-upgrade.sh``.

source: When upgrading from pike to queens there are the following changes to the container/service setup.
id: Saat upgrading dari pike ke queen ada perubahan berikut untuk pengaturan container/service.

source: When upgrading it is possible for an old "neutron-ns-metadata-proxy" process to remain running in memory. If this happens the old version of the process can cause unexpected issues in a production environment. To fix this a task has been added to the os_neutron role that will execute a process lookup and kill any "neutron-ns-metadata-proxy" processes that are not running the current release tag. Once the old processes are removed the metadata agent running will respawn everything needed within 60 seconds.
id: Ketika upgrading dimungkinkan untuk proses lama "neutron-ns-metadata-proxy" untuk tetap berjalan di memori. Jika ini terjadi, versi proses lama dapat menyebabkan masalah yang tidak terduga di lingkungan produksi. Untuk memperbaikinya, tugas telah ditambahkan ke peran os_neutron yang akan menjalankan pencarian proses dan membunuh proses "neutron-ns-metadata-proxy" yang tidak menjalankan tag rilis saat ini. Setelah proses lama dihapus, agen metadata yang berjalan akan respawn semua yang dibutuhkan dalam waktu 60 detik.

source: When upgrading it is possible for an old ``neutron-ns-metadata-proxy`` process to remain running in memory. If this happens the old version of the process can cause unexpected issues in a production environment. To fix this a task has been added to the os_neutron role that will execute a process lookup and kill any ``neutron-ns-metadata-proxy`` processes that are not running the current release tag. Once the old processes are removed the metadata agent running will respawn everything needed within 60 seconds.
id: Ketika upgrading dimungkinkan untuk proses lama ``neutron-ns-metadata-proxy`` untuk tetap berjalan di memori. Jika ini terjadi, versi proses lama dapat menyebabkan masalah yang tidak terduga di lingkungan produksi. Untuk memperbaikinya, tugas telah ditambahkan ke peran os_neutron yang akan menjalankan pencarian proses dan membunuh proses ``neutron-ns-metadata-proxy`` yang tidak menjalankan tag rilis saat ini. Setelah proses lama dihapus, agen metadata yang berjalan akan respawn semua yang dibutuhkan dalam waktu 60 detik.

source: When upgrading nova the cinder ``catalog_info`` will change to use the ``cinderv3`` endpoint. Ensure that you have upgraded cinder so that the ``cinderv3`` endpoint exists in the keystone catalog.
id: Saat upgrading nova, cinder ``catalog_info`` akan berubah untuk menggunakan endpoint ``cinderv3``. Pastikan Anda telah upgraded cinder sehingga endpoint ``cinderv3`` ada di katalog keystone.

source: When upgrading there is nothing a deployer **must** immediately do to run neutron agent services on hosts within the ``network_hosts`` group. Simply executing the playbooks will deploy the neutron servers on the baremetal machines and will leave all existing agents containers alone.
id: Ketika upgrading tidak ada yang bisa digunakan deployer **must** segera untuk menjalankan layanan agen neutron di host dalam grup ``network_hosts``. Cukup menjalankan playbook akan deploy server neutron pada mesin baremetal dan akan meninggalkan semua kontainer agen yang ada sendirian.

source: When using Glance and NFS the NFS mount point will now be managed using a systemd mount unit file. This change ensures the deployment of glance is not making potentially system impacting changes to the ``/etc/fstab`` and modernizes how we deploy glance when using shared storage.
id: Saat menggunakan Glance dan NFS, NFS mount point sekarang akan dikelola menggunakan file unit mount systemd. Perubahan ini memastikan deployment glance tidak berpotensi mengubah sistem yang berdampak pada ``/etc/fstab`` dan memodernisasi cara kami deploy glance saat menggunakan penyimpanan bersama.

source: When using LXC containers with a copy-on-write back-end, the ``lxc_hosts`` role execution would fail due to undefined variables with the ``nspawn_host_`` prefix. This issue has now been fixed.
id: Saat menggunakan kontainer LXC dengan back-end copy-on-write, eksekusi role ``lxc_hosts`` akan gagal karena variabel yang tidak ditentukan dengan awalan (prefix) ``nspawn_host_``. Masalah ini sekarang telah diperbaiki.

source: When using a copy-on-write backing store, the lxc_container_base_name can now include a prefix defined by ``lxc_container_base_name_prefix``.
id: Saat menggunakan backing store copy-on-write, lxc_container_base_name sekarang dapat menyertakan awalan yang ditentukan oleh ``lxc_container_base_name_prefix``.

source: When using copy-on-write backing stores for containers, the base container name may be set using the variable ``lxc_container_base_name`` which defaults to `<linux-distribution>`-`distribution-release>`-`<host-cpu-architecture>`.
id: Saat menggunakan backing store copy-on-write untuk kontainer, nama kontainer dasar dapat diatur menggunakan variabel ``lxc_container_base_name`` yang default ke `<linux-distribution>`-`distribution-release>`-`<host-cpu-architecture>`.

source: When using the **nspawn** driver container networking is managed by systemd-networkd both on the host and within the container. This gives us a single interface to manage regardless of distro and allows systemd to efficiently manage the resources.
id: Saat menggunakan jaringan kontainer driver **nspawn** dikelola oleh systemd-networkd baik pada host maupun di dalam kontainer. Ini memberi kami satu antarmuka untuk mengelola terlepas dari distro dan memungkinkan systemd untuk mengelola sumber daya secara efisien.

source: When using the **nspawn** driver containers will connect to the system bridges using a MACVLAN, more on this type of network setup can be seen `here <https://www.systutorials.com/docs/linux/man/8-ip-link/>`_.
id: Saat menggunakan kontainer driver **nspawn** akan terhubung ke sistem bridge menggunakan MACVLAN, lebih lanjut tentang jenis pengaturan jaringan ini dapat dilihat `here <https://www.systutorials.com/docs/linux/man/8-ip-link/>`_.

source: When using the connection plugin's ``container_user`` option, ``ansible_remote_tmp`` should be set to a system writable path such as '/var/tmp/'.
id: Saat menggunakan plugin koneksi opsi ``container_user``, ``ansible_remote_tmp`` harus disetel ke path writable sistem seperti '/var/tmp/'.
