Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The os_magnum role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``magnum_package_state`` to ``present``.
id: Peran os_magnum sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``magnum_package_state`` ke ``present``.

source: The os_neutron role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``neutron_package_state`` should be set to ``present``.
id: Peran os_neutron selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``neutron_package_state`` harus diatur ke ``present``.

source: The os_neutron role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``neutron_package_state`` to ``present``.
id: Peran os_neutron sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``neutron_package_state`` ke ``present``.

source: The os_neutron role uses the same handler name as the etcd role for executing ``systemcl daemon-reload``. Given that newton uses Ansible 2.1.x and that version of Ansible cannot process more than one handler by the same name in a single playbook, only one handler ends up being executed. The handler that does get executed is the etcd handler which is skipped unless the deployment is using Calico.
id: Peran os_neutron menggunakan nama penangan yang sama dengan peran etcd untuk mengeksekusi ``systemcl daemon-reload``. Mengingat bahwa newton menggunakan Ansible 2.1.x dan versi Ansible tidak dapat memproses lebih dari satu penangan dengan nama yang sama dalam satu playbook, hanya satu penangan yang akhirnya dieksekusi. Handler yang dieksekusi adalah handler etcd yang dilewati kecuali deployment menggunakan Calico.

source: The os_nova role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``nova_package_state`` should be set to ``present``.
id: Peran os_nova selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``nova_package_state`` harus diatur ke ``present``.

source: The os_nova role can now deploy the a custom /etc/libvirt/qemu.conf file by defining ``qemu_conf_dict``.
id: Peran os_nova sekarang dapat menggunakan file /etc/libvirt/qemu.conf kustom dengan mendefinisikan ``qemu_conf_dict``.

source: The os_nova role can now deploy the nova-lxd hypervisor. This can be achieved by setting ``nova_virt_type`` to ``lxd`` on a per-host basis in ``openstack_user_config.yml`` or on a global basis in ``user_variables.yml``.
id: Peran os_nova sekarang dapat menggunakan hypervisor nova-lxd. Ini dapat dicapai dengan mengatur ``nova_virt_type`` ke ``lxd`` pada basis per-host di ``openstack_user_config.yml`` atau secara global dalam ``user_variables.yml``.

source: The os_nova role can now detect a PowerNV environment and set the virtualization type to 'kvm'.
id: Peran os_nova sekarang dapat mendeteksi lingkungan PowerNV dan mengatur tipe virtualisasi ke 'kvm'.

source: The os_nova role can now detect and support basic deployment of a PowerVM environment. This sets the virtualization type to 'powervm' and installs/updates the PowerVM NovaLink package and nova-powervm driver.
id: Peran os_nova sekarang dapat mendeteksi dan mendukung penyebaran dasar lingkungan PowerVM. Ini menetapkan tipe virtualisasi ke 'powervm' dan menginstal/memperbarui paket PowerVM NovaLink dan driver nova-powervm.

source: The os_nova role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``nova_package_state`` to ``present``.
id: Peran os_nova sekarang mendukung kemampuan untuk mengkonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``nova_package_state`` ke ``present``.

source: The os_rally role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``rally_package_state`` should be set to ``present``.
id: Peran os_rally selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``rally_package_state`` harus diatur ke ``present``.

source: The os_rally role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``rally_package_state`` to ``present``.
id: Peran os_rally sekarang mendukung kemampuan untuk mengkonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``rally_package_state`` ke ``present``.

source: The os_sahara role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``sahara_package_state`` should be set to ``present``.
id: Peran os_sahara selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``sahara_package_state`` harus diatur ke ``present``.

source: The os_sahara role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``sahara_package_state`` to ``present``.
id: Peran os_sahara sekarang mendukung kemampuan untuk mengkonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket tersebut hadir dengan mengatur ``sahara_package_state`` ke ``present``.

source: The os_swift and os_swift_sync role have been merged into the single os_swift role. Two variables (``swift_do_setup`` and ``swift_do_sync``) have been implemented to action the install and synchronise code paths. The separate playbooks have been adjusted to make use of these variables to ensure that the behaviour is exactly the same as before.
id: Peran os_swift dan os_swift_sync telah digabungkan ke dalam peran os_swift tunggal. Dua variabel (``swift_do_setup`` dan ``swift_do_sync``) telah diterapkan untuk melakukan tindakan menginstal dan menyinkronkan path kode. Playbook terpisah telah disesuaikan untuk menggunakan variabel ini untuk memastikan bahwa perilaku itu persis sama seperti sebelumnya.

source: The os_swift role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``swift_package_state`` should be set to ``present``.
id: Peran os_swift selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``swift_package_state`` harus diatur ke ``present``.

source: The os_swift role now allows the permissions for the log files created by the swift account, container and object servers to be set. The variable is ``swift_syslog_log_perms`` and is set to ``0644`` by default.
id: Peran os_swift sekarang memungkinkan izin untuk file log yang dibuat oleh akun swift, kontainer dan server objek diatur. Variabelnya adalah ``swift_syslog_log_perms`` dan diatur ke ``0644`` secara default.

source: The os_swift role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``swift_package_state`` to ``present``.
id: Peran os_swift sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``swift_package_state`` ke ``present``.

source: The os_swift role now supports the swift3 middleware, allowing access to swift via the Amazon S3 API. This feature can enabled by setting ``swift_swift3_enabled`` to ``true``.
id: Peran os_swift sekarang mendukung middleware swift3, memungkinkan akses cepat melalui Amazon S3 API. Fitur ini dapat diaktifkan dengan mengatur ``swift_swift3_enabled`` ke ``true``.

source: The override ``rabbitmq_memory_high_watermark`` can be used to set the maximum size of the erlang Virtual Machine before the garbage collection is triggered. The default is lowered to ``0.2``, from ``0.4`` as the garbage collection can require 2x of allocated amount during its operation. This can result in a equivalent use of ``0.4``, resulting in 40% of memory usage, visible to the rabbitMQ container. The original default setting of ``0.4`` can lead to 80% memory allocation of rabbitMQ, potentially leading to a scenario where the underlying Linux kernel is killing the process due to shortage of virtual memory.
id: Override ``rabbitmq_memory_high_watermark`` dapat digunakan untuk mengatur ukuran maksimum Mesin Virtual erlang sebelum pengumpulan sampah dipicu. Default diturunkan ke ``0,2``, dari ``0,4`` karena pengumpulan sampah dapat membutuhkan 2x jumlah yang dialokasikan selama operasinya. Ini dapat menghasilkan penggunaan setara dengan ``0,4``, menghasilkan 40% penggunaan memori, terlihat oleh kontainer rabbitMQ. Pengaturan default asli dari ``0,4`` dapat menyebabkan alokasi memori 80% dari rabbitMQ, berpotensi mengarah ke skenario di mana kernel Linux yang mendasarinya membunuh proses karena kekurangan memori virtual.

source: The package cache on the repo server has been removed. If caching of packages is desired, it should be setup outside of OpenStack-Ansible and the variable ``lxc_container_cache_files`` (for LXC containers) or ``nspawn_container_cache_files_from_host`` (for nspawn containers) can be used to copy the appropriate host configuration from the host into the containers on creation. Alternatively, environment variables can be set to use the cache in the host /etc/environment file prior to container creation, or the ``deployment_environment_variables`` can have the right variables set to use it. The following variables have been removed.
id: Cache paket pada server repo telah dihapus. Jika caching paket diinginkan, itu harus di-setup di luar OpenStack-Ansible dan variabel ``lxc_container_cache_files`` (untuk kontainer LXC) atau ``nspawn_container_cache_files_from_host`` (untuk nspawn kontainer) dapat digunakan untuk menyalin konfigurasi host yang sesuai dari host ke dalam kontainer saat penciptaan. Atau, variabel lingkungan dapat diatur untuk menggunakan cache di file host /etc/environment sebelum pembuatan kontainer, atau ``deployment_environment_variables`` dapat memiliki variabel yang tepat diatur untuk menggunakannya. Variabel berikut telah dihapus.

source: The password minimum and maximum lifetimes are now opt-in changes that can take action against user accounts instead of printing debug warnings. Refer to the documentation for STIG requirements V-71927 and V-71931 to review the opt-in process and warnings.
id: Masa hidup minimum dan maksimum kata sandi sekarang merupakan perubahan opt-in yang dapat mengambil aksi terhadap akun pengguna daripada mencetak peringatan debug. Rujuk ke dokumentasi untuk persyaratan STIG V-71927 dan V-71931 untuk meninjau proses opt-in dan peringatan.

source: The percona repository stayed in placed even after a change of the variable ``use_percona_upstream``. From now on, the percona repository will not be present unless the deployer decides to ``use_percona_upstream``. This also fixes a bug of the presence of this apt repository after an upgdrade from Mitaka.
id: Repositori percona tetap ditempatkan bahkan setelah perubahan variabel ``use_percona_upstream``. Mulai sekarang, repositori percona tidak akan ada kecuali jika deployer memutuskan untuk ``use_percona_upstream``. Ini juga memperbaiki bug dari keberadaan repositori yang tepat ini setelah pembaruan dari Mitaka.

source: The percona-xtrabackup repository is now enabled in OpenStack-Ansible and it allows deployers to install and use `Percona's XtraBackup project <https://www.percona.com/software/mysql-database/percona-xtrabackup>`_ to perform online backups of data stored in MariaDB.
id: Repository percona-xtrabackup sekarang diaktifkan di OpenStack-Ansible dan memungkinkan deployer untuk menginstal dan menggunakan `Percona's XtraBackup project <https://www.percona.com/software/mysql-database/percona-xtrabackup>`_ untuk melakukan backup online data yang disimpan di MariaDB.

source: The ping check that happens inside keepalived to make sure that the server that runs it can reach 193.0.14.129 has been removed by default. The functionality can continue to be used if you define the `keepalived_ping_address` in your `user_variables.yml` file to `193.0.14.129` or any IP of your choice.
id: Pemeriksaan ping yang terjadi di dalam keepalived untuk memastikan bahwa server yang menjalankannya dapat mencapai 193.0.14.129 telah dihapus secara default. Fungsionalitas dapat terus digunakan jika Anda mendefinisikan `keepalived_ping_address` dalam file `user_variables.yml` Anda menjadi `193.0.14.129` atau IP apa pun pilihan Anda.

source: The pip_install role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``pip_install_package_state`` should be set to ``present``.
id: Peran pip_install selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``pip_install_package_state`` harus diatur ke ``present``.

source: The pip_install role can now configure pip to be locked down to the repository built by OpenStack-Ansible. To enable the lockdown configuration, deployers may set ``pip_lock_to_internal_repo`` to ``true`` in ``/etc/openstack_deploy/user_variables.yml``.
id: Peran pip_install sekarang dapat mengkonfigurasi pip agar dikunci ke repositori yang dibangun oleh OpenStack-Ansible. Untuk mengaktifkan konfigurasi penguncian, deployer dapat mengatur ``pip_lock_to_internal_repo`` ke ``true`` dalam ``/etc/openstack_deploy/user_variables.yml``.

source: The pip_install role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``pip_install_package_state`` to ``present``.
id: Peran pip_install sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``pip_install_package_state`` ke ``present``.

source: The pip_install_options variable is now honored during repo building. This variable allows deployers to specify trusted CA certificates by setting the variable to "--cert /etc/ssl/certs/ca-certificates.crt"
id: Variabel pip_install_options sekarang dihormati selama pembuatan repo. Variabel ini memungkinkan deployer untuk menentukan sertifikat CA tepercaya dengan mengatur variabel ke "--cert /etc/ssl/certs/ca-certificates.crt"

source: The plugin names for the classifier and sfc changed:
id: Nama plugin untuk classifier dan sfc berubah:

source: The plugins folders have been renamed to the default names used in Ansible 2.x. This is part of the preparation for Ansible 2.x readiness. The renames are specifically ``actions > action``, ``callbacks > callback``, ``filters > filter``, ``lookups > lookup``.
id: Folder plugins telah diubah namanya menjadi nama default yang digunakan dalam Ansible 2.x. Ini adalah bagian dari persiapan untuk kesiapan Ansible 2.x. Ganti nama secara khusus ``actions > action``, ``callbacks > callback``, ``filters > filter``, ``lookups > lookup``.

source: The plumgrid network provider has been removed. This is being dropped without a full deprecation cycle because the company, plumgrid, no longer exists.
id: Penyedia jaringan plumgrid telah dihapus. Ini dijatuhkan tanpa siklus penghentian penuh karena perusahaan, plumgrid, tidak ada lagi.

source: The previous way of using a common backend_host across all deployments was not recommended by the Cinder team and it will cause duplicate messages that cause problems in the environment.
id: Cara sebelumnya menggunakan backend_host umum di semua penyebaran tidak direkomendasikan oleh tim Cinder dan itu akan menyebabkan pesan duplikat yang menyebabkan masalah di environment.

source: The problem has been registered upstream and progresson the issue can be followed there: https://jira.mariadb.org/browse/MDEV-15254
id: Masalahnya telah terdaftar di hulu dan perkembangan masalah dapat diikuti di sana : https://jira.mariadb.org/browse/MDEV-15254

source: The python packages `pip`, `setuptools` and `wheel` are now all pinned on a per-tag basis. The pins are updated along with every OpenStack Service update. This is done to ensure a consistent build experience with the latest available packages at the time the tag is released. A deployer may override the pins by adding a list of required pins using the `pip_packages` variable in `user_variables.yml`.
id: Paket python `pip`, `setuptools` dan `wheel` sekarang semuanya disematkan (pinned) pada basis per-tag. Pin diperbarui bersama dengan setiap update OpenStack Service. Ini dilakukan untuk memastikan pengalaman membangun yang konsisten dengan paket terbaru yang tersedia pada saat tag dirilis. Deployer dapat menimpa pin dengan menambahkan daftar pin yang diperlukan menggunakan variabel `pip_packages` di `user_variables.yml`.

source: The python venv build process now only happens when requirements change. A venv rebuild may be forced by using the boolean variable ``repo_build_venv_rebuild``.
id: Proses pembuatan python venv sekarang hanya terjadi ketika persyaratan berubah. Pembangunan kembali venv dapat dipaksa dengan menggunakan variabel boolean ``repo_build_venv_rebuild``.

source: The python wheel build process now only happens when requirements change. A wheel rebuild may be forced by using the boolean variable ``repo_build_wheel_rebuild``.
id: Proses pembuatan python wheel sekarang hanya terjadi ketika persyaratan berubah. Pembangunan kembali wheel dapat dipaksa dengan menggunakan variabel boolean ``repo_build_wheel_rebuild``.

source: The quota for security group rules was erroneously set to 100 with the aim to have 100 security group rules per security group instead of to 100*#security group rules. This patch fixes this discrepancy.
id: Kuota untuk aturan grup keamanan secara keliru ditetapkan ke 100 dengan tujuan untuk memiliki 100 aturan grup keamanan per grup keamanan daripada ke aturan grup 100*#security . Patch ini memperbaiki perbedaan ini.

source: The rabbitMQ high watermark is set to ``0.2`` rather than ``0.4`` to prevent possible OOM situations, which limits the maximum memory usage by rabbitMQ to 40% rather than 80% of the memory visible to the rabbitMQ container. The override ``rabbitmq_memory_high_watermark`` can be used to alter the limit.
id: Watermark tinggi rabbitMQ diatur ke ``0,2`` daripada ``0,4`` untuk mencegah kemungkinan situasi OOM, yang membatasi penggunaan memori maksimum oleh rabbitMQ hingga 40% daripada 80% memori yang terlihat oleh kontainer rabbitMQ. Override ``rabbitmq_memory_high_watermark`` dapat digunakan untuk mengubah batas.

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging Notify parameters in order to abstract the messaging service from the actual backend server deployment. - swift_oslomsg_notify_servers replaces swift_rabbitmq_telemetry_servers - swift_oslomsg_notify_port replaces swift_rabbitmq_telemetry_port - swift_oslomsg_notify_use_ssl replaces swift_rabbitmq_telemetry_use_ssl - swift_oslomsg_notify_userid replaces swift_rabbitmq_telemetry_userid - swift_oslomsg_notify_vhost replaces swift_rabbitmq_telemetry_vhost - swift_oslomsg_notify_password replaces swift_rabbitmq_telemetry_password
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging Notify untuk mengabstraksi layanan pesan dari deployment server backend yang sebenarnya. - swift_oslomsg_notify_servers menggantikan swift_rabbitmq_telemetry_servers - swift_oslomsg_notify_port menggantikan swift_rabbitmq_telemetry_port - swift_oslomsg_notify_use_ssl menggantikan swift_rabbitmq_telemetry_use_ssl - swift_oslomsg_notify_userid menggantikan swift_rabbitmq_telemetry_userid - swift_oslomsg_notify_vhost menggantikan swift_rabbitmq_telemetry_vhost - swift_oslomsg_notify_password menggantikan swift_rabbitmq_telemetry_password
