Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: Deployers can now define the varible ``cinder_qos_specs`` to create qos specs and assign those specs to desired cinder volume types.
id: Deployer sekarang dapat mendefinisikan variabel ``cinder_qos_specs`` untuk membuat spesifikasi qos dan menetapkan spesifikasi tersebut ke tipe volume cinder yang diinginkan.

source: Deployers can now set the ``container_tech`` to **nspawn** when deploying OSA within containers. When making the decision to deploy container types the deployer only needs to define the desired ``container_tech`` and continue the deployment as normal.
id: Deployer sekarang dapat mengatur ``container_tech`` ke **nspawn** saat menggunakan OSA di dalam kontainer. Saat membuat keputusan untuk menggunakan tipe kontainer, deployer hanya perlu mendefinisikan ``container_tech`` yang diinginkan dan melanjutkan deployment seperti biasa.

source: Deployers can now set the ``install_method`` to either ``source`` (default) or ``distro`` to choose the method for installing OpenStack services on the hosts. This only applies to *new* deployments. Existing deployments which are source based, cannot be converted to the new ``distro`` method. For more information, please refer to the `Deployment Guide <https://docs.openstack.org/project-deploy-guide/openstack-ansible>`_.
id: Deployer sekarang dapat mengatur ``install_method`` menjadi ``source`` (default) atau ``distro`` untuk memilih metode untuk menginstal layanan OpenStack pada host. Ini hanya berlaku untuk deployment *new* Deployment yang ada yang berbasis sumber, tidak dapat dikonversi ke metode ``distro`` yang baru. Untuk informasi lebih lanjut, silakan merujuk ke `Deployment Guide <https://docs.openstack.org/project-deploy-guide/openstack-ansible>`_.

source: Deployers can now specify a custom package name or URL for an EPEL release package. CentOS systems use ``epel-release`` by default, but some deployers have a customized package that redirects servers to internal mirrors.
id: Deployer sekarang dapat menentukan nama paket kustom atau URL untuk paket rilis EPEL. Sistem CentOS menggunakan ``epel-release`` secara default, tetapi beberapa deployer memiliki paket khusus yang mengarahkan ulang (redirect) server ke mirror internal.

source: Deployers can opt out of this change by setting ``openstack_host_keep_journals`` to ``no``.
id: Deployer dapat menyisih dari perubahan ini dengan mengatur ``openstack_host_keep_journals`` ke ``no``.

source: Deployers can opt-out of the change entirely by setting a variable:
id: Deployer dapat menyisih dari perubahan sepenuhnya dengan menetapkan variabel:

source: Deployers can opt-out of this change by setting ``security_disable_netconsole`` to ``no``.
id: Deployer dapat menyisih dari perubahan ini dengan mengatur ``security_disable_netconsole`` ke ``no``.

source: Deployers can opt-out of this change by setting ``security_disable_rdisc`` to ``no``.
id: Deployer dapat menyisih dari perubahan ini dengan mengatur ``security_disable_rdisc`` ke ``no``.

source: Deployers can optionally remove the Keystone v2 endpoints from the database. Those endpoints will not be removed by the upgrade process.
id: Deployer secara opsional dapat menghapus endpoint Keystone v2 dari database. Endpoint tersebut tidak akan dihapus oleh proses upgrade.

source: Deployers can optionally set a UID and/or GID for the nova user and group. This is helpful for environments with shared storage.
id: Deployer secara opsional dapat mengatur UID dan/atau GID untuk pengguna dan grup nova. Ini bermanfaat untuk lingkungan dengan penyimpanan bersama.

source: Deployers can provide a customized login banner via a new Ansible variable: ``security_login_banner_text``. This banner text is used for non-graphical logins, which includes console and ssh logins.
id: Deployer dapat memberikan banner login khusus melalui variabel Ansible baru: ``security_login_banner_text``. Teks banner ini digunakan untuk non-graphical login, yang mencakup login ssh dan konsol.

source: Deployers can set ``heat_cinder_backups_enabled`` to enable or disable the cinder backups feature in heat. If heat has cinder backups enabled, but cinder's backup service is disabled, newly built stacks will be undeletable.
id: Deployer dapat mengatur ``heat_cinder_backups_enabled`` untuk mengaktifkan atau menonaktifkan fitur cinder backup di heat. Jika heat memiliki cinder backup diaktifkan, tetapi layanan cinder backup dinonaktifkan, stack yang baru dibangun akan tidak terhapus.

source: Deployers can set ``lxc_hosts_opensuse_mirror_url`` to use their preferred mirror for the openSUSE repositories. They can also set the ``lxc_hosts_opensuse_mirror_obs_url`` if they want to set a different mirror for the OBS repositories. If they want to use the same mirror in both cases then they can leave the latter variable to its default value. The full list of mirrors and their capabilities can be obtained at http://mirrors.opensuse.org/
id: Deployer dapat mengatur ``lxc_hosts_opensuse_mirror_url`` untuk menggunakan mirror pilihan mereka untuk repositori openSUSE. Mereka juga dapat mengatur ``lxc_hosts_opensuse_mirror_obs_url`` jika mereka ingin mengatur mirror lain untuk repositori OBS. Jika mereka ingin menggunakan mirror yang sama dalam kedua kasus maka mereka dapat membiarkan variabel yang terakhir ke nilai default. Daftar lengkap cermin dan kemampuannya dapat diperoleh di http://mirrors.opensuse.org/

source: Deployers can set ``openstack_host_nf_conntrack_max`` to control the maximum size of the netfilter connection tracking table. The default of ``262144`` should be increased if virtual machines will be handling large amounts of concurrent connections.
id: Deployer dapat mengatur ``openstack_host_nf_conntrack_max`` untuk mengontrol ukuran maksimum tabel pelacakan koneksi netfilter. Default ``262144`` harus ditingkatkan jika mesin virtual akan menangani sejumlah besar koneksi konkuren.

source: Deployers can set ``pip_install_centos_mirror_url`` to use their preferred mirror for the RDO repositories.
id: Deployer dapat mengatur ``pip_install_centos_mirror_url`` untuk menggunakan mirror pilihan mereka untuk repositori RDO.

source: Deployers can set ``pip_install_opensuse_mirror_url`` to use their preferred mirror for the openSUSE repositories. They can also set the ``pip_install_opensuse_mirror_obs_url`` if they want to set a different mirror for the OBS repositories. If they want to use the same mirror in both cases then they can leave the latter variable to its default value. The full list of mirrors and their capabilities can be obtained at http://mirrors.opensuse.org/
id: Deployer dapat mengatur ``pip_install_opensuse_mirror_url`` untuk menggunakan mirror pilihan mereka untuk repositori openSUSE. Mereka juga dapat mengatur ``pip_install_opensuse_mirror_obs_url`` jika mereka ingin mengatur mirror lain untuk repositori OBS. Jika mereka ingin menggunakan mirror yang sama dalam kedua kasus maka mereka dapat membiarkan variabel yang terakhir ke nilai default. Daftar lengkap cermin dan kemampuannya dapat diperoleh di http://mirrors.opensuse.org/

source: Deployers can set a default availability zone (AZ) for new instance builds which do not provide an AZ. The value is ``None`` by default, but it can be changed with the ``nova_default_schedule_zone`` Ansible variable.
id: Deployer dapat mengatur zona ketersediaan default (AZ) untuk bangunan instance baru yang tidak menyediakan AZ. Nilai secara default adalah ``None``, tetapi dapat diubah dengan variabel ``nova_default_schedule_zone``.

source: Deployers can set a refresh interval for haproxy's stats page by setting the ``haproxy_stats_refresh_interval`` variable. The default value is ``60``, which causes haproxy to refresh the stats page every 60 seconds.
id: Deployer dapat mengatur interval penyegaran untuk halaman statistik haproxy dengan mengatur variabel ``haproxy_stats_refresh_interval``. Nilai defaultnya adalah ``60``, yang menyebabkan haproxy me-refresh halaman statistik setiap 60 detik.

source: Deployers can specify the authentication credentials to be used with wsrep by configuring ``galera_wsrep_sst_auth_user`` and ``galera_wsrep_sst_auth_password``.
id: Deployer dapat menentukan kredensial otentikasi untuk digunakan dengan wsrep dengan mengkonfigurasi ``galera_wsrep_sst_auth_user`` dan ``galera_wsrep_sst_auth_password``.

source: Deployers can still set a specific keymap using a nova configuration override if necessary.
id: Deployer masih dapat mengatur keymap spesifik menggunakan konfigurasi nova override jika perlu.

source: Deployers can use the rolling restart functionality provided in the upgrade playbook within the main `OpenStack-Ansible repository <https://github.com/openstack/openstack-ansible/blob/stable/mitaka/scripts/upgrade-utilities/playbooks/galera-cluster-rolling-restart.yml>`_.
id: Deployer dapat menggunakan fungsionalitas rolling restart yang disediakan dalam playbook upgrade dalam file main `OpenStack-Ansible repository <https://github.com/openstack/openstack-ansible/blob/stable/mitaka/scripts/upgrade-utilities/playbooks/galera-cluster-rolling-restart.yml>`_.

source: Deployers how have the option to set the the wsrep method via the ``galera_wsrep_sst_method``.
id: Deployer memiliki opsi cara untuk mengatur metode wsrep melalui ``galera_wsrep_sst_method``.

source: Deployers may opt-in for the change without automatically updating the active ``grub.cfg`` file by setting the following Ansible variables:
id: Deployer dapat memilih ikut serta dalam perubahan tanpa secara otomatis updating file ``grub.cfg`` yang aktif dengan mengatur variabel Ansible berikut ini:

source: Deployers may provide a list of custom haproxy template files to copy from the deployment host through the ``octavia_user_haproxy_templates`` variable and configure Octavia to make use of a custom haproxy template file with with ``octavia_haproxy_amphora_template`` variable.
id: Deployer dapat memberikan daftar file templat haproxy khusus untuk disalin dari host penyebaran melalui variabel ``octavia_user_haproxy_templates`` dan mengkonfigurasi Octavia untuk menggunakan file template haproxy khusus dengan variabel ``octavia_haproxy_amphora_template``.

source: Deployers may require custom CA certificates installing on their openstack hosts or service containers. A new variable openstack_host_ca_certificates is added which is a list of certificates that should be copied from the deploy host to the target hosts. Certificates may be selectively deployed by defining the variable either in user_variables.yml or via host/group vars.
id: Deployers mungkin memerlukan sertifikat CA khusus yang dipasang di host openstack atau containers layanan mereka. Variabel openstack_host_ca_certificates baru ditambahkan yang merupakan daftar sertifikat yang harus disalin dari deploy host ke host target. Sertifikat dapat digunakan secara selektif dengan mendefinisikan variabel baik di user_variables.yml atau melalui host/group vars.

source: Deployers now have the option to prevent the EPEL repository from being installed by the role. Setting ``security_epel_install_repository`` to ``no`` prevents EPEL from being installed. This setting may prevent certain packages from installing, such as ClamAV.
id: Deployer sekarang memiliki opsi untuk mencegah repositori EPEL diinstal oleh peran tersebut. Mengatur ``security_epel_install_repository`` ke ``no`` mencegah EPEL diinstal. Pengaturan ini dapat mencegah pemasangan paket tertentu, seperti ClamAV.

source: Deployers of CentOS 7 environments can use the ``openstack_hosts_enable_yum_fastestmirror`` variable to enable or disable yum's fastestmirror plugin. The default setting of ``yes`` ensures that fastestmirror is enabled.
id: Deployer lingkungan CentOS 7 dapat menggunakan variabel ``openstack_hosts_enable_yum_fastestmirror`` untuk mengaktifkan atau menonaktifkan plugin fastestmirror yum. Pengaturan default ``yes`` memastikan bahwa fastestmirror diaktifkan.

source: Deployers should review the defaults provided in ``playbooks/os_keystone/defaults/main.yml`` and adjust any variables in ``user_variables.yml`` if they exist there.
id: Deployer harus meninjau default yang disediakan di ``playbooks/os_keystone/defaults/main.yml`` dan menyesuaikan variabel apa pun di ``user_variables.yml`` jika ada di sana.

source: Deployers should review the new RHEL 7 STIG variables in ``defaults/main.yml`` to provide custom configuration for the Ansible tasks.
id: Deployer harus meninjau variabel RHEL 7 STIG baru di ``defaults/main.yml`` untuk memberikan konfigurasi khusus untuk tugas Ansible.

source: Deployers that need a graphical interface will need to set the following Ansible variable:
id: Deployer yang membutuhkan antarmuka grafis perlu mengatur variabel Ansible berikut:

source: Deployers that need this logging enabled will need to set the following Ansible variable:
id: Deployer yang membutuhkan logging ini diaktifkan perlu mengatur variabel Ansible berikut:

source: Deployments on ppc64le are limited to Ubuntu 16.04 for the Newton release of OpenStack-Ansible.
id: Penerapan pada ppc64le terbatas pada Ubuntu 16.04 untuk rilis Newton dari OpenStack-Ansible.

source: Deployments will now default to using python3 when a python3 interpreter is present in the operating system. Each openstack-ansible role has a new variable for the form <role>_venv_python_executable which defaults to python2 but a global variable openstack_venv_python_executable in the openstack-ansible group variables sets this to python3 on supporting operating systems. This enables a deployer is to selectively use python2 or python3 on a per service basis if required. The ansible-runtime venv is also created using python3 on the deploy host if possible.
id: Penyebaran sekarang akan default untuk menggunakan python3 ketika python3 interpreter hadir dalam sistem operasi. Setiap peran yang dimungkinkan openstack memiliki variabel baru untuk bentuk <role>_venv_python_executable yang default ke python2 tetapi variabel global openstack_venv_python_executable dalam variabel-variabel kelompok openstack-ansible mengatur ini ke python3 pada sistem operasi pendukung. Hal ini memungkinkan penggelar untuk secara selektif menggunakan python2 atau python3 berdasarkan layanan jika diperlukan. The ansible-runtime venv juga dibuat menggunakan python3 pada host deploy jika memungkinkan.

source: Deprecation Notes
id: Catatan Depresiasi

source: Developers can specify additional python packages for the repo build process by creating YAML files within ``/etc/openstack_deploy/``. Refer to the `documentation on adding packages <http://docs.openstack.org/developer/openstack-ansible/developer-docs/extending.html#build-the-environment-with-additional-python-packages>`_ for more details.
id: Pengembang dapat menentukan paket python tambahan untuk proses repo build dengan membuat file YAML di dalam ``/etc/openstack_deploy/``. Lihat `documentation on adding packages <http://docs.openstack.org/developer/openstack-ansible/developer-docs/extending.html#build-the-environment-with-additional-python-packages>` _ untuk keterangan lebih lanjut.

source: Disable HTTPS entirely by setting ``haproxy_ssl: no`` (which will also disable https on haproxy. This setting is inherited by the new ``horizon_enable_ssl`` variable by default. This is a new option.
id: Nonaktifkan HTTPS seluruhnya dengan mengatur ``haproxy_ssl: no`` (yang juga akan menonaktifkan https di haproxy. Pengaturan ini diwarisi (inherited) oleh variabel ``horizon_enable_ssl`` yang baru secara default. Ini adalah opsi baru.

source: Download and install the neutron-fwaas-dashboard if being enabled within the os_horizon role by the ``horizon_enable_neutron_fwaas`` var.
id: Unduh dan pasang dasbor neutron-fwaas jika diaktifkan di dalam peran os_horizon oleh var `` horizon_enable_neutron_fwaas``.

source: Downloading and unarchiving a .tar.gz has been removed. The related tempest options ``ami_img_file``, ``aki_img_file``, and ``ari_img_file`` have been removed from tempest.conf.j2.
id: Mengunduh dan membatalkan pengarsipan .tar.gz telah dihapus. Opsi tempest terkait ``ami_img_file``, ``aki_img_file``, dan ``ari_img_file`` telah dihapus dari tempest.conf.j2.

source: Dragonflow is no longer maintained as an OpenStack project and has therefore been removed from OpenStack-Ansible as a supported ML2 driver for neutron.
id: Dragonflow tidak lagi dipertahankan sebagai proyek OpenStack dan karenanya telah dihapus dari OpenStack-Ansible sebagai driver ML2 yang didukung untuk neutron.

source: Due to a change in how backend_host is defined when using Ceph, all the Cinder volumes will restart under the same backend name. This will mean that any volumes which previously were assigned to the host or container that hosted the volume will no longer be managable. The workaround for this is to use the `cinder-manage volume update_host` command to move those volumes to the new backend host. This known issue will be resolved soon with an upgrade playbook.
id: Karena perubahan dalam cara backend_host didefinisikan saat menggunakan Ceph, semua volume Cinder akan memulai kembali dengan nama backend yang sama. Ini berarti bahwa volume apa pun yang sebelumnya ditugaskan ke host atau container yang menampung volume tidak lagi dapat dikelola. Solusi untuk ini adalah dengan menggunakan perintah `cinder-manage volume update_host` untuk memindahkan volume tersebut ke host backend baru. Masalah yang diketahui ini akan segera teratasi dengan playbook pemutakhiran.

source: Due to a change in how backend_host is defined when using Ceph, all the Cinder volumes will restart under the same backend name. This will mean that any volumes which previously were assigned to the host or container that hosted the volume will no longer be manageable. The workaround for this is to use the `cinder-manage volume update_host` command to move those volumes to the new backend host. This known issue will be resolved soon with an upgrade playbook.
id: Karena perubahan dalam cara backend_host didefinisikan saat menggunakan Ceph, semua volume Cinder akan memulai kembali dengan nama backend yang sama. Ini berarti bahwa volume apa pun yang sebelumnya ditugaskan ke host atau kontainer yang menampung volume tidak lagi dapat dikelola. Solusi untuk ini adalah dengan menggunakan perintah `cinder-manage volume update_host` untuk memindahkan volume tersebut ke host backend baru. Masalah yang diketahui ini akan segera teratasi dengan playbook pemutakhiran.

source: Due to a new bind mount at "/var/log" all containers will be restarted. This is a required restart. It is recommended that deployers run the container restarts in serial to not impact production workloads.
id: Karena bind mount baru di "/var/log" semua kontainer akan di-restart. Ini adalah restart yang diperlukan. Direkomendasikan agar para penyalur menjalankan kontainer restart secara serial untuk tidak memengaruhi beban kerja produksi.

source: Due to the smart-reources implementation, variables, related to custom git path of exact config files were removed. Now all config files are taken from upstream git repo, but overrides and client configs are still supported. The following variables are not supported now: * ceilometer_git_config_lookup_location * ceilometer_data_meters_git_file_path * ceilometer_event_definitions_git_file_path * ceilometer_gnocchi_resources_git_file_path * ceilometer_loadbalancer_v2_meter_definitions_git_file_path * ceilometer_osprofiler_event_definitions_git_file_path * ceilometer_polling_git_file_path If you are maintaining custom ceilometer git repository, you still may use ``ceilometer_git_repo`` variable, to provide url to your git repository.
id: Karena implementasi smart-reource, variabel, yang terkait dengan jalur git kustom dari file konfigurasi yang tepat telah dihapus. Sekarang semua file config diambil dari repo git hulu, tetapi penggantian dan konfigurasi klien masih didukung. Variabel berikut tidak didukung sekarang: * ceilometer_git_config_lookup_location * ceilometer_data_meters_git_file_path * ceilometer_event_definitions_git_file_path * ceilometer_gnocchi_resources_git_file_path * ceilometer_loadbalancer_v2_meter_definitions_git_file_path * ceilometer_osprofiler_event_definitions_git_file_path * ceilometer_polling_git_file_path Jika Anda memelihara kebiasaan ceilometer git repositori, Anda masih dapat menggunakan variabel ``ceilometer_git_repo``, untuk memberikan url ke repositori git Anda.

source: Due to usage of systemd-journald mapping of /openstack/log/ to /var/log/$SERVICE is not present anymore. Also rsyslog_client role is not called for projects since logs are stored in journald. Also variables like service_log_dir are not supported anymore and have no effect.
id: Karena penggunaan pemetaan systemd-journald dari /openstack/log/ to /var/log/$SERVICE tidak ada lagi. Peran rsyslog_client juga tidak dipanggil untuk proyek karena log disimpan di journald. Juga variabel seperti service_log_dir tidak didukung lagi dan tidak berpengaruh.

source: During a kilo to liberty upgrade, container and service restarts for the mariadb/galera cluster were being triggered multiple times and causing the cluster to become unstable and often unrecoverable. This situation has been improved immensely, and we now have tight control such that restarts of the galera containers only need to happen once, and are done so in a controlled, predictable and repeatable way.
id: Selama dari kilo ke upgrade liberty, kontainer dan restart layanan untuk cluster mariadb/galera sedang dipicu beberapa kali dan menyebabkan cluster menjadi tidak stabil dan sering tidak dapat dipulihkan. Situasi ini telah sangat ditingkatkan, dan kami sekarang memiliki kontrol ketat sehingga me-restart kontainer galera hanya perlu terjadi sekali, dan dilakukan dengan cara yang terkendali, dapat diprediksi, dan dapat diulang (repeatable way).

source: During an upgrade using the run-upgrade script, the neutron agents will now automatically be migrated from the neutron_agents containers on to the network_hosts. The neutron_agents containers will be deleted as they are no longer necessary. Any environments which previously upgraded to Queens can make use of the same playbooks to handle to migration, or inspect the playbooks to determine how to do it by hand if preferred.
id: Selama upgrade menggunakan skrip run-upgrade, agen neutron sekarang akan secara otomatis dimigrasikan dari kontainer neutron_agents ke network_hosts. Kontainer neutron_agents akan dihapus karena tidak perlu lagi. Setiap lingkungan yang sebelumnya upgraded ke Queens dapat menggunakan playbook yang sama untuk menangani migrasi, atau memeriksa playbook untuk menentukan bagaimana melakukannya dengan tangan jika diinginkan.

source: During the keepalived role upgrade the keepalived process will restart and introduce a brief service disruption.
id: Selama upgrade role keepalived, proses keepalived akan restart dan memperkenalkan gangguan layanan singkat.

source: During the upgrade from Kilo to Liberty, this change deletes the repo containers and recreates them to fix an upgrade issue with dependencies.
id: Selama upgrade dari Kilo ke Liberty, perubahan ini menghapus kontainer repo dan membuatnya kembali untuk memperbaiki masalah upgrade dengan dependensi.

source: During the upgrade process new secrets, such as passwords and keys, will be generated and added to ``/etc/openstack_deploy/user_secrets.yml``. Existing values will not be changed.
id: Selama proses upgrade, rahasia baru, seperti kata sandi dan kunci, akan dihasilkan dan ditambahkan ke ``/etc/openstack_deploy/user_secrets.yml``. Nilai yang ada tidak akan diubah.
