Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The limits.conf file for galera servers will now be deployed under ``/etc/security/limits.d/99-limits.conf``. This is being done to ensure our changes do not clobber existing settings within the system's default ``/etc/security/limits.conf`` file when the file is templated.
id: File limit.conf untuk server galera sekarang akan digunakan di bawah ``/etc/security/limits.d/99-limits.conf``. Ini sedang dilakukan untuk memastikan perubahan kami tidak merusak pengaturan yang ada dalam file ``/etc/security/limits.conf`` default sistem ketika file tersebut templated.

source: The list of enabled filters for the Cinder scheduler, `scheduler_default_filters` in `cinder.conf`, could previously be defined only via an entry in ``cinder_cinder_conf_overrides``. You now have the option to instead define a list variable, ``cinder_scheduler_default_filters``, that defines the enabled filters. This is helpful if you either want to disable one of the filters enabled by default (at the time of writing, these are `AvailabilityZoneFilter`, `CapacityFilter`, and `CapabilitiesFilter`), or if conversely you want to add a filter that is normally not enabled, such as `DifferentBackendFilter` or `InstanceLocalityFilter`.
id: Daftar filter yang diaktifkan untuk penjadwal Cinder, `scheduler_default_filters` pada `cinder.conf`, sebelumnya hanya dapat didefinisikan melalui entri di ``cinder_cinder_conf_overonfes``. Anda sekarang memiliki opsi untuk mendefinisikan variabel daftar, ``cinder_scheduler_default_filters``, yang menentukan filter yang diaktifkan. Ini berguna jika Anda ingin menonaktifkan salah satu filter yang diaktifkan secara default (pada saat penulisan, ini adalah `AvailabilityZoneFilter`,` CapacityFilter`, dan `CapabilitiesFilter`), atau jika sebaliknya Anda ingin menambahkan filter yang biasanya tidak diaktifkan, seperti `DifferentBackendFilter` atau` InstanceLocalityFilter`.

source: The location of the ``/etc/openstack-release`` file placement can now be changed. Set the variable ``openstack_distrib_file_path`` to place it in a different path.
id: Lokasi penempatan file ``/etc/openstack-release`` sekarang dapat diubah. Atur variabel ``openstack_distrib_file_path`` untuk menempatkannya di jalur yang berbeda.

source: The log path, ``/var/log/aodh`` is no longer used to capture service logs. All logging for the aodh service will now be sent directly to the systemd journal.
id: Path log, ``/var/log/aodh`` tidak lagi digunakan untuk mengambil log layanan. Semua logging untuk layanan aodh sekarang akan dikirim langsung ke jurnal systemd.

source: The log path, ``/var/log/barbican`` is no longer used to capture service logs. All logging for the barbican service will now be sent directly to the systemd journal.
id: Path log, ``/var/log/barbican`` tidak lagi digunakan untuk mengambil log layanan. Semua logging untuk layanan barbican sekarang akan dikirim langsung ke jurnal systemd.

source: The log path, ``/var/log/blazar`` is no longer used to capture service logs. All logging for the blazar service will now be sent directly to the systemd journal.
id: Path log, ``/var/log/blazar`` tidak lagi digunakan untuk mengambil log layanan. Semua logging untuk layanan blazar sekarang akan dikirim langsung ke jurnal systemd.

source: The log path, ``/var/log/ceilometer`` is no longer used to capture service logs. All logging for the ceilometer service will now be sent directly to the systemd journal.
id: Path log, ``/var/log/ceilometer`` tidak lagi digunakan untuk mengambil log layanan. Semua logging untuk layanan ceilometer sekarang akan dikirim langsung ke jurnal systemd.

source: The log path, ``/var/log/cinder`` is no longer used to capture service logs. All logging for the cinder service will now be sent directly to the systemd journal.
id: Path log, ``/var/log/cinder`` tidak lagi digunakan untuk mengambil log layanan. Semua pencatatan untuk layanan cinder sekarang akan dikirim langsung ke jurnal systemd.

source: The log path, ``/var/log/cloudkitty`` is no longer used to capture service logs. All logging for the cloudkitty service will now be sent directly to the systemd journal.
id: Path log, ``/var/log/cloudkitty`` tidak lagi digunakan untuk mengambil log layanan. Semua logging untuk layanan cloudkitty sekarang akan dikirim langsung ke jurnal systemd.

source: The log path, ``/var/log/congress`` is no longer used to capture service logs. All logging for the congress service will now be sent directly to the systemd journal.
id: Path log, ``/var/log/congress``` tidak lagi digunakan untuk mengambil log layanan. Semua logging untuk layanan kongres sekarang akan dikirim langsung ke jurnal systemd.

source: The log path, ``/var/log/designate`` is no longer used to capture service logs. All logging for the designate service will now be sent directly to the systemd journal.
id: Path log, ``/var/log/designate`` tidak lagi digunakan untuk mengambil log layanan. Semua logging untuk layanan yang ditunjuk sekarang akan dikirim langsung ke jurnal systemd.

source: The log path, ``/var/log/keystone`` is no longer used to capture service logs. All logging for the Keystone service will now be sent directly to the systemd journal.
id: Path log, ``/var/log/keystone`` tidak lagi digunakan untuk mengambil log layanan. Semua logging untuk layanan Keystone sekarang akan dikirim langsung ke jurnal systemd.

source: The lxc_hosts role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``lxc_hosts_package_state`` should be set to ``present``.
id: Peran lxc_hosts selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``lxc_hosts_package_state`` harus diatur ke ``present``.

source: The lxc_hosts role can now make use of a primary and secondary gpg keyserver for gpg validation of the downloaded cache. Setting the servers to use can be done using the ``lxc_image_cache_primary_keyserver`` and ``lxc_image_cache_secondary_keyserver`` variables.
id: Peran lxc_hosts sekarang dapat menggunakan server gpg primer dan sekunder untuk validasi gpg dari cache yang diunduh. Pengaturan server untuk digunakan dapat dilakukan dengan menggunakan variabel ``lxc_image_cache_primary_keyserver`` dan ``lxc_image_cache_secondary_keyserver``.

source: The lxc_hosts role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``lxc_hosts_package_state`` to ``present``.
id: Peran lxc_hosts sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Aksi default adalah untuk memastikan bahwa paket terbaru hadir. Aksi yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``lxc_hosts_package_state`` ke ``present``.

source: The magnum client interaction will now make use of the public endpoints by default. Previously this was set to use internal endpoints.
id: Interaksi klien magnum sekarang akan menggunakan endpoint publik secara default. Sebelumnya ini diatur untuk menggunakan endpoint internal.

source: The masakari dashboard is available in Horizon. Deployers can enable the panel by setting the following Ansible variable:
id: Dasbor masakari tersedia di Horizon. Deployer dapat mengaktifkan panel dengan mengatur variabel Ansible berikut:

source: The max connections setting for Galera is now determined automatically by taking the number of vCPUs available and multiplying it by 100. Deployers may override this default via the ``galera_max_connections`` variable.
id: Pengaturan koneksi maks untuk Galera sekarang ditentukan secara otomatis dengan mengambil jumlah vCPU yang tersedia dan mengalikannya dengan 100. Penyedia dapat menimpa default ini melalui variabel ``galera_max_connections``.

source: The maximum amount of time to wait until forcibly failing the LXC cache preparation process is now configurable using the ``lxc_cache_prep_timeout`` variable. The value is specified in seconds, with the default being 20 minutes.
id: Jumlah maksimum waktu untuk menunggu hingga gagal secara paksa dalam proses persiapan cache LXC sekarang dapat dikonfigurasi menggunakan variabel ``lxc_cache_prep_timeout``. Nilai ditentukan dalam detik, dengan default adalah 20 menit.

source: The maximum erlang process limit for RabbitMQ has been set to 1048576 in order to prevent virtual machine lockups which are caused when this limit has been reached.
id: Batas proses erlang maksimum untuk RabbitMQ telah ditetapkan ke 1048576 untuk mencegah penguncian mesin virtual yang disebabkan ketika batas ini telah tercapai.

source: The memcached log is removed from /var/log/memcached.log and is now stored in the /var/log/memcached folder.
id: Log memcached dihapus dari /var/log/memcached.log dan sekarang disimpan di folder /var/log/memcached

source: The memcached_server role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``memcached_package_state`` should be set to ``present``.
id: Peran memcached_server selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang penggelar ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``memcached_package_state`` harus diatur ke ``present``.

source: The memcached_server role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``memcached_package_state`` to ``present``.
id: Peran memcached_server sekarang mendukung kemampuan untuk mengkonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket itu hadir dengan mengatur ``memcached_package_state`` ke ``present``.

source: The murano dashboard is available in Horizon. Deployers can enable the panel by setting the following Ansible variable:
id: Dasbor murano tersedia di Horizon. Deployer dapat mengaktifkan panel dengan mengatur variabel Ansible berikut:

source: The new LBaaS v2 dashboard is available in Horizon. Deployers can enable the panel by setting the following Ansible variable:
id: Dasbor LBaaS v2 baru tersedia di Horizon. Deployer dapat mengaktifkan panel dengan mengatur variabel Ansible berikut:

source: The new host group ``neutron_openvswitch_agent`` has been added to the ``env.d/neutron.yml`` and ``env.d/nova.yml`` environment configuration files in order to support the implementation of Open vSwitch. Deployers must ensure that their environment configuration files are updated to include the above group name. Please see the example implementations in `env.d/neutron.yml <https://github.com/openstack/openstack-ansible/blob/stable/newton/etc/openstack_deploy/env.d/neutron.yml>`_ and `env.d/nova.yml <https://github.com/openstack/openstack-ansible/blob/stable/newton/etc/openstack_deploy/env.d/nova.yml>`_.
id: Grup host baru ``neutron_openvswitch_agent`` telah ditambahkan ke file konfigurasi lingkungan ``env.d/neutron.yml`` dan ``env.d/nova.yml`` dalam rangka mendukung implementasi Open vSwitch. Deployer harus memastikan bahwa file konfigurasi lingkungan mereka diperbarui untuk menyertakan nama grup di atas. Silakan lihat contoh implementasi di `env.d/neutron.yml <https://github.com/openstack/openstack-ansible/blob/stable/newton/etc/openstack_deploy/env.d/neutron.yml>`_ dan `env.d/nova.yml <https://github.com/openstack/openstack-ansible/blob/stable/newton/etc/openstack_deploy/env.d/nova.yml>`_.

source: The new option `haproxy_backend_arguments` can be utilized to add arbitrary options to a HAProxy backend like tcp-check or http-check.
id: Opsi baru `haproxy_backend_arguments` dapat digunakan untuk menambahkan opsi arbitrary(acak) ke backend HAProxy seperti tcp-check atau http-check.

source: The new provider network attribute ``sriov_host_interfaces`` is added to support SR-IOV network mappings inside Neutron. The provider_network adds new items network_sriov_mappings and network_sriov_mappings_list to the provider_networks dictionary. Multiple interfaces can be defined by comma separation.
id: Atribut jaringan penyedia baru ``sriov_host_interfaces`` ditambahkan untuk mendukung pemetaan jaringan SR-IOV di dalam Neutron. Provider_network menambahkan item baru network_sriov_mappings dan network_sriov_mappings_list ke kamus (dictionary) provider_networks. Beberapa antarmuka dapat didefinisikan dengan pemisahan koma.

source: The new variable ``tempest_workspace`` has been introduced to set the location of the tempest workspace.
id: Variabel baru ``tempest_workspace`` telah diperkenalkan untuk mengatur lokasi ruang kerja tempest.

source: The nova SSH public key distribution has been made a lot faster especially when deploying against very large clusters. To support larger clusters the role has moved away from the "authorized_key" module and is now generating a script to insert keys that may be missing from the authorized keys file. The script is saved on all nova compute nodes and can be found at ``/usr/local/bin/openstack-nova-key.sh``. If ever there is a need to reinsert keys or fix issues on a given compute node the script can be executed at any time without directly running the ansible playbooks or roles.
id: Distribusi kunci publik SSH nova telah dibuat jauh lebih cepat terutama ketika digunakan terhadap kluster yang sangat besar. Untuk mendukung kluster yang lebih besar, peran telah berpindah dari modul "authorized_key" dan sekarang membuat skrip untuk memasukkan kunci yang mungkin hilang dari file kunci yang diotorisasi. Script disimpan pada semua node komputasi nova dan dapat ditemukan d i``/usr/local/bin/openstack-nova-key.sh``. Jika pernah ada kebutuhan untuk memasukkan kembali kunci atau memperbaiki masalah pada node komputasi yang diberikan, skrip dapat dieksekusi kapan saja tanpa secara langsung menjalankan playbook atau peran ansible.

source: The nova admin endpoint is now correctly registered as ``/v2.1/%(tenant_id)s`` instead of ``/v2/%(tenant_id)s``.
id: The nova admin endpoint is now correctly registered as ``/v2.1/%(tenant_id)s`` sebagai ganti ``/v2/%(tenant_id)s``.

source: The nova configuration is updated to always specify an LXD storage pool name when 'nova_virt_type' is 'lxd'. The variable 'lxd_storage_pool' is defaulted to 'default', the LXD default storage pool name. A new variable 'lxd_init_storage_pool' is introduced which specifies the underlying storage pool name. 'lxd_init_storage_pool' is used by lxd init when setting up the storage pool. If not provided, lxd init will not use this parameter at all. Please see the lxd man page for further information about the storage pool parameter.
id: Konfigurasi nova diperbarui untuk selalu menentukan nama LXD storage pool ketika 'nova_virt_type' adalah 'lxd'. Variabel 'lxd_storage_pool' default ke 'default', nama LXD storage pool default. Variabel baru 'lxd_init_storage_pool' diperkenalkan yang merincis (specify) nama storage pool yang mendasarinya. 'lxd_init_storage_pool' digunakan oleh lxd init saat mengatur storage pool. Jika tidak disediakan, lxd init tidak akan menggunakan parameter ini sama sekali. Silakan lihat halaman manual lxd untuk informasi lebih lanjut tentang parameter kumpulan penyimpanan (storage pool).

source: The nova-cert service has been deprecated, is marked for removal in the Ocata release, and will no longer be deployed by the os_nova role.
id: Layanan nova-cert telah ditinggalkan, ditandai untuk dihapus dalam rilis Ocata, dan tidak akan lagi digunakan oleh peran os_nova.

source: The nova-lxd driver is no longer supported upstream, and the git repo for it's source code has been retired on the master branch. All code for deploying or testing nova-lxd has been removed from the os_nova ansible role. The following variables have been removed:
id: Driver nova-lxd tidak lagi didukung hulu, dan repo git untuk kode sumbernya telah dipensiunkan pada cabang master. Semua kode untuk menggunakan atau menguji nova-lxd telah dihapus dari os_nova ansible role. Variabel berikut telah dihapus:

source: The nova_placement database which was implemented in the ocata release of OpenStack-Ansible was never actually used for anything due to reverts in the upstream code. The database should be empty and can be deleted. With this the following variables also no longer have any function and have been removed.
id: Database nova_placement yang diimplementasikan dalam rilis ocata dari OpenStack-Ansible tidak pernah benar digunakan untuk apa pun karena kembali pada kode hulu. Database harus kosong dan dapat dihapus. Dengan ini, variabel berikut juga tidak lagi memiliki fungsi dan telah dihapus.

source: The number of erlang asynchronous threads used by RabbitMQ have been increased from the default of 32 to 128 in order to speed up message processing.
id: Jumlah thread asynchronous erlang yang digunakan oleh RabbitMQ telah ditingkatkan dari default 32 menjadi 128 untuk mempercepat pemrosesan pesan.

source: The number of inotify watch instances available is limited system wide via a sysctl setting. It is possible for certain processes, such as pypi-server, or elasticsearch from the ops repo to consume a large number of inotify watches. If the system wide maximum is reached then any process on the host or in any container on the host will be unable to create a new inotify watch. Systemd uses inotify watches, and if there are none available it is unable to restart services. The processes which synchronise the repo server contents between infra nodes also relies on inotify watches. If the repo servers fail to synchronise, or services fail to restart when expected check the the inotify watch limit which is defined in the sysctl value fs.inotify.max_user_watches. Patches have merged to increase these limits, but for existing environments or those which have not upgraded to a recent enough point release may have to apply an increased limit manually.
id: Jumlah inotify watch instances yang tersedia terbatas pada seluruh sistem melalui pengaturan sysctl. Dimungkinkan untuk proses tertentu, seperti pypi-server, atau elasticsearch dari ops repo untuk mengkonsumsi sejumlah besar inotify watch. Jika lebar sistem maksimum tercapai maka proses apa pun pada host atau dalam kontainer apa pun pada host tidak akan dapat membuat inotify watch baru. Systemd menggunakan inotify watch, dan jika tidak ada yang tersedia, ia tidak dapat memulai kembali layanan. Proses yang menyinkronkan konten server repo antara infra nodes juga bergantung pada inotify watch. Jika server repo gagal menyinkronkan, atau layanan gagal untuk me-restart ketika diharapkan periksa batas inotify watch yang didefinisikan dalam nilai sysctl fs.inotify.max_user_watches. Patch telah bergabung untuk meningkatkan batas ini, tetapi untuk lingkungan yang ada atau yang belum ditingkatkan ke point release yang cukup baru mungkin harus menerapkan batas yang ditingkatkan secara manual.

source: The number of worker threads for neutron will now be capped at 16 unless a specific value is specified. Previously, the calculated number of workers could get too high on systems with a large number of processors. This was particularly evident on POWER systems.
id: Jumlah worker thread untuk neutron sekarang akan ditutup pada 16 kecuali nilai tertentu ditentukan. Sebelumnya, jumlah worker yang dihitung bisa menjadi terlalu tinggi pada sistem dengan sejumlah besar prosesor. Ini sangat jelas pada sistem POWER.

source: The old class path names used within the ``neutron_plugin_base`` have been deprecated in favor of the friendly names. Support for the use of the class path plugins will be removed in the OpenStack Newton cycle.
id: Nama path kelas (class path) lama yang digunakan dalam ``neutron_plugin_base`` telah ditinggalkan, lebih menyukai nama yang bersahabat. Dukungan untuk penggunaan plugin path kelas akan dihapus dalam siklus OpenStack Newton.

source: The openrc role will no longer be executed on all OpenStack service containers/hosts. Instead a single host is designated through the use of the ``openstack_service_setup_host`` variable. The default is ``localhost`` (the deployment host). Deployers can opt to change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Peran openrc tidak lagi dijalankan pada semua kontainer/host layanan OpenStack. Sebagai gantinya satu host ditunjuk melalui penggunaan variabel ``openstack_service_setup_host``. Defaultnya adalah ``localhost`` (host penyebaran). Deployer dapat memilih untuk mengubahnya ke kontainer utilitas dengan mengimplementasikan penggantian berikut di ``user_variables.yml``.

source: The openstack service uri protocol variables were not being used to set the Trove specific uris. This resulted in 'http' always being used for the public, admin and internal uris even when 'https' was intended.
id: Variabel protokol layanan uri openstack tidak digunakan untuk mengatur uris spesifik Trove. Ini mengakibatkan 'http' selalu digunakan untuk publik, admin dan uris internal bahkan ketika 'https' dimaksudkan.

source: The openstack-ansible-memcached_server role includes a new override, ``memcached_connections`` which is automatically calculated from the number of memcached connection limit plus additional 1k to configure the OS nofile limit. Without proper nofile limit configuration, memcached will crash in order to support higher parallel connection TCP/Memcache counts.
id: Peran openstack-ansible-memcached_server termasuk override baru, ``memcached_connections`` yang secara otomatis dihitung dari jumlah batas koneksi memcached ditambah 1k tambahan untuk mengkonfigurasi batas nofile OS. Tanpa konfigurasi batas nofile yang tepat, memcached akan macet untuk mendukung jumlah TCP/Memcache koneksi paralel yang lebih tinggi.

source: The openstack-ansible-memcached_server role includes a new override,`memcached_connections` which is automatically calculated from the number of memcached connection limit plus additional 1k to configure the OS nofile limit. Without proper nofile limit configuration, memcached will crash in order to support higher parallel connection TCP/Memcache counts.
id: Peran openstack-ansible-memcached_server mencakup override baru, `memcached_connections` yang secara otomatis dihitung dari jumlah batas koneksi memcached ditambah 1k tambahan untuk mengkonfigurasi batas nofile OS. Tanpa konfigurasi batas nofile yang tepat, memcached akan macet untuk mendukung jumlah TCP/Memcache koneksi paralel yang lebih tinggi.

source: The openstack-ansible-security role is now configured to apply the security configurations from the Red Hat Enterprise Linux 7 STIG to OpenStack-Ansible deployments.
id: Peran openstack-ansible-security sekarang dikonfigurasi untuk menerapkan konfigurasi keamanan dari Red Hat Enterprise Linux 7 STIG ke penyebaran OpenStack-Ansible.
