Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The ``openstack-ansible-os_swift`` role will now prevent deployers from changing the ``swift_hash_path_prefix`` and ``swift_hash_path_suffix`` variables on clusters that already have a value set in ``/etc/swift/swift.conf``. You can set the new ``swift_force_change_hashes`` variable to ``True`` to force the ``swift_hash_path_`` variables to be changed. We recommend setting this by running the os-swift.yml playbook with ``-e swift_force_change_hashes=True``, to avoid changing the ``swift_hash_path_`` variables unintentionally. Use with caution, changing the ``swift_hash_path_`` values causes end-user impact.
id: Peran ``openstack-ansible-os_swift`` sekarang akan mencegah penyebaran mengubah ``swift_hash_path_prefix`` dan variabel ``swift_hash_path_suffix`` pada kluster yang sudah memiliki nilai yang ditetapkan di ``/etc/swift/swift.conf``. Anda dapat mengatur variabel ``swift_force_change_hashes`` baru menjadi ``True`` untuk memaksa variabel ``swift_hash_path_`` diubah. Kami merekomendasikan pengaturan ini dengan menjalankan os-swift.yml playbook dengan ``-e swift_force_change_hash = True``, untuk menghindari mengubah variabel ``swift_hash_path_`` secara tidak sengaja. Gunakan dengan hati-hati, mengubah nilai ``swift_hash_path_`` menyebabkan dampak end-user.

source: The ``openstack_host_apt_packages`` variable has been deprecated. ``openstack_host_packages`` should be used instead to override packages required to install on all OpenStack hosts.
id: Variabel ``openstack_host_apt_packages`` telah ditinggalkan. ``openstack_host_packages`` harus digunakan sebagai gantinya untuk menimpa paket yang diperlukan untuk menginstal pada semua host OpenStack.

source: The ``openstack_tempest_gate.sh`` script has been removed as it requires the use of the ``run_tempest.sh`` script which has been deprecated in Tempest. In order to facilitate the switch, the default for the variable ``tempest_run`` has been set to ``yes``, forcing the role to execute tempest by default. This default can be changed by overriding the value to ``no``. The test whitelist may be set through the list variable ``tempest_test_whitelist``.
id: Skrip ``openstack_tempest_gate.sh`` telah dihapus karena membutuhkan penggunaan skrip ``run_tempest.sh`` yang telah ditinggalkan dalam Tempest. Untuk memfasilitasi switch, default untuk variabel ``tempest_run`` telah disetel ke ``yes``, yang memaksa peran untuk mengeksekusi tempest secara default. Default ini dapat diubah dengan mengganti nilainya menjadi ``no``. Daftar putih (whitelist) pengujian dapat ditetapkan melalui variabel daftar ``tempest_test_whitelist``.

source: The ``os-cinder-install.yml`` playbook will now execute a rolling upgrade of cinder including database migrations (both schema and online) as per the procedure described in the `cinder documentation <https://docs.openstack.org/developer/cinder/upgrade.html>`_. When haproxy is used as the load balancer, the backend being changed will be drained before changes are made, then added back to the pool once the changes are complete.
id: Playbook ``os-cinder-install.yml`` sekarang akan menjalankan rolling upgrade cinder termasuk migrasi basis data (baik skema dan online) sesuai prosedur yang dijelaskan dalam `cinder documentation <https://docs.openstack.org /developer/cinder/upgrade.html>`_. Ketika haproxy digunakan sebagai penyeimbang beban, backend yang diubah akan dikeringkan (drained) sebelum perubahan dilakukan, kemudian ditambahkan kembali ke pool setelah perubahan selesai.

source: The ``os-designate`` role now supports Ubuntu 16.04 and SystemD.
id: Peran ``os-designate`` sekarang mendukung Ubuntu 16.04 dan SystemD.

source: The ``os-neutron-install.yml`` playbook will now execute a rolling upgrade of neutron including database migrations (both expand and contract) as per the procedure described in the `neutron documentation <https://docs.openstack.org/developer/neutron/devref/upgrade.html>`_.
id: Playbook ``os-neutron-install.yml`` sekarang akan menjalankan upgrade neutron secara bergulir termasuk migrasi basis data (keduanya diperluas dan dikontrak) sesuai prosedur yang dijelaskan dalam `neutron documentation <https://docs.openstack.org/developer/neutron/devref/upgrade.html>`_.

source: The ``os-nova-install.yml`` playbook will now execute a rolling upgrade of nova including database migrations as per the procedure described in the `nova documentation <https://docs.openstack.org/developer/nova/upgrade.html>`_.
id: Playbook ``os-nova-install.yml`` sekarang akan menjalankan upgrade nova termasuk migrasi basis data sesuai prosedur yang dijelaskan dalam `nova documentation <https://docs.openstack.org/developer/nova/upgrade.html>`_.

source: The ``os_barbican`` role now supports deployment on Ubuntu 16.04 using SystemD.
id: Peran ``os_barbican`` sekarang mendukung penyebaran di Ubuntu 16.04 menggunakan SystemD.

source: The ``os_ceilometer`` role now includes a facility where you can place your own templates in ``/etc/openstack_deploy/ceilometer`` (by default) and it will be deployed to the target host after being interpreted by the template engine. If no file is found there, the fallback of the git sourced template is used.
id: Peran ``os_ceilometer`` sekarang termasuk fasilitas tempat Anda dapat menempatkan templat Anda sendiri di ``/etc/openstack_deploy/ceilometer`` (secara default) dan akan digunakan untuk host target setelah diinterpretasikan oleh mesin templat. Jika tidak ada file yang ditemukan di sana, fallback dari template bersumber git digunakan.

source: The ``os_cinder`` role now provides for doing online data migrations once the db sync has been completed. The data migrations will not be executed until the boolean variable ``cinder_all_software_updated`` is true. This variable will need to be set by the playbook consuming the role.
id: Peran ``os_cinder`` sekarang menyediakan untuk melakukan migrasi data online setelah sinkronisasi db selesai. Migrasi data tidak akan dieksekusi sampai variabel boolean ``cinder_all_software_updated`` menjadi true. Variabel ini perlu diatur oleh playbook yang menggunakan peran tersebut.

source: The ``os_cinder`` role now supports Ubuntu 16.04.
id: Peran ``os_cinder`` sekarang mendukung Ubuntu 16.04.

source: The ``os_glance`` role now supports Ubuntu 16.04 and SystemD.
id: Peran ``os_glance`` sekarang mendukung Ubuntu 16.04 dan SystemD.

source: The ``os_gnocchi`` role now includes a facility where you can place your own default ``api-paste.ini`` or ``policy.json`` file in ``/etc/openstack_deploy/gnocchi`` (by default) and it will be deployed to the target host after being interpreted by the template engine.
id: Peran ``os_gnocchi`` sekarang termasuk fasilitas tempat Anda dapat menempatkan file ``api-paste.ini`` atau file ``policy.json`` default Anda di ``/etc/openstack_deploy/gnocchi`` (secara default ) dan itu akan digunakan untuk host target setelah ditafsirkan oleh mesin template.

source: The ``os_horizon`` role now supports configuration of custom themes. Deployers can use the new ``horizon_custom_themes`` and ``horizon_default_theme`` variables to configure the dashboard with custom themes and default to a specific theme respectively.
id: Peran ``os_horizon`` sekarang mendukung konfigurasi tema kustom. Penyebar dapat menggunakan variabel ``horizon_custom_themes`` dan ``horizon_default_theme`` yang baru untuk mengkonfigurasi dasbor dengan tema kustom dan default ke masing-masing tema spesifik.

source: The ``os_horizon`` role now supports distribution of user custom themes. Deployers can use the new key ``theme_src_archive`` of ``horizon_custom_themes`` dictionary to provide absolute path to the archived theme. Only .tar.gz, .tgz, .zip, .tar.bz, .tar.bz2, .tbz, .tbz2 archives are supported. Structure inside archive should be as a standard theme, without any leading folders.
id: Peran ``os_horizon`` sekarang mendukung distribusi tema kustom pengguna. Penyebar dapat menggunakan kunci baru ``theme_src_archive`` dari kamus ``horizon_custom_themes`` untuk memberikan jalur absolut ke tema yang diarsipkan. Hanya arsip .tar.gz, .tgz, .zip, .tar.bz, .tar.bz2, .tbz, .tbz2 yang didukung. Struktur di dalam arsip harus sebagai tema standar, tanpa folder utama.

source: The ``os_keystone`` role will now (by default) source the ``keystone-paste.ini``, ``policy.json`` and ``sso_callback_template.html`` templates from the service git source instead of from the role. It also now includes a facility where you can place your own templates in ``/etc/openstack_deploy/keystone`` (by default) and it will be deployed to the target host after being interpreted by the template engine.
id: Peran ``os_keystone`` sekarang akan (secara default) sumber ``keystone-paste.ini``, ``policy.json`` dan ``sso_callback_template.html`` templat dari sumber layanan git daripada dari peran. Sekarang juga termasuk fasilitas di mana Anda dapat menempatkan templat Anda sendiri di ``/etc/openstack_deploy/keystone`` (secara default) dan itu akan digunakan untuk host target setelah ditafsirkan oleh mesin templat.

source: The ``os_magnum`` role now supports deployment on Ubuntu 16.04 using systemd.
id: Peran ``os_magnum`` sekarang mendukung penyebaran di Ubuntu 16.04 menggunakan systemd.

source: The ``os_masakari`` role now covers the monitors installation and configuration, completing the full service configuration.
id: Peran ``os_masakari`` sekarang mencakup pemasangan dan konfigurasi monitor, menyelesaikan konfigurasi layanan lengkap.

source: The ``os_neutron`` role now configures neutron ml2 to load the ``l2_population`` mechanism driver by default based on the value of ``neutron_l2_population``. Deployers may directly control the neutron ml2 mechanism drivers list by overriding the ``mechanisms`` variable in the ``neutron_plugins`` dictionary.
id: Peran ``os_neutron`` sekarang mengkonfigurasi neutron ml2 untuk memuat driver mekanisme ``l2_population`` secara default berdasarkan nilai ``neutron_l2_population``. Deployer dapat langsung mengontrol daftar driver mekanisme ml2 neutron dengan mengesampingkan variabel ``mechanisms`` dalam kamus ``neutron_plugins``.

source: The ``os_neutron`` role now determines the default configuration for openvswitch-agent ``tunnel_types`` and the presence or absence of ``local_ip`` configuration based on the value of ``neutron_ml2_drivers_type``. Deployers may directly control this configuration by overriding the ``neutron_tunnel_types`` variable .
id: Peran ``os_neutron`` sekarang menentukan konfigurasi default untuk agen openvswitch ``tunnel_types`` dan ada atau tidaknya konfigurasi ``local_ip`` berdasarkan nilai ``neutron_ml2_drivers_type``. Deployer dapat secara langsung mengontrol konfigurasi ini dengan mengganti variabel ``neutron_tunnel_types``.

source: The ``os_neutron`` role will now default to the OVS firewall driver when ``neutron_plugin_type`` is ``ml2.ovs`` and the host is running Ubuntu 16.04 on PowerVM. To override this default behavior, deployers should define ``neutron_ml2_conf_ini_overrides`` and 'neutron_openvswitch_agent_ini_overrides' in 'user_variables.yml'. Example below
id: Peran ``os_neutron`` sekarang akan default ke driver firewall OVS ketika ``neutron_plugin_type`` adalah ``ml2.ovs`` dan host menjalankan Ubuntu 16.04 di PowerVM. Untuk mengesampingkan perilaku default ini, para deployer harus mendefinisikan ``neutron_ml2_conf_ini_overrides`` dan 'neutron_openvswitch_agent_ini_overrides' di 'user_variables.yml'. Contoh di bawah ini

source: The ``os_nova`` role now provides for doing online data migrations once the db sync has been completed. The data migrations will not be executed until the boolean variable ``nova_all_software_updated`` is true. This variable will need to be set by the playbook consuming the role.
id: Peran ``os_nova`` sekarang menyediakan untuk melakukan migrasi data online setelah sinkronisasi db selesai. Migrasi data tidak akan dieksekusi sampai variabel boolean ``nova_all_software_updated`` menjadi true. Variabel ini perlu diatur oleh playbook yang menggunakan peran tersebut.

source: The ``os_swift`` role has 3 new variables that will allow a deployer to change the hard, soft and fs.file-max limits. the hard and soft limits are being added to the limits.conf file for the swift system user. The fs.file-max settings are added to storage hosts via kernel tuning. The new options are ``swift_hard_open_file_limits`` with a default of 10240 ``swift_soft_open_file_limits`` with a default of 4096 ``swift_max_file_limits`` with a default of 24 times the value of ``swift_hard_open_file_limits``.
id: Peran ``os_swift`` memiliki 3 variabel baru yang akan memungkinkan deployer mengubah batas hard, soft, dan fs.file-max. Batas hard dan soft sedang ditambahkan ke file limit.conf untuk pengguna sistem yang cepat. Pengaturan fs.file-max ditambahkan ke host penyimpanan melalui penyetelan kernel. Opsi baru adalah ``swift_hard_open_file_limits`` dengan default 10240 ``swift_soft_open_file_limits`` dengan default 4096 ``swift_max_file_limits`` dengan default 24 kali nilai ``swift_hard_open_file``.

source: The ``os_swift`` role will now include the swift "staticweb" middleware by default.
id: Peran ``os_swift`` sekarang akan menyertakan middleware swift "staticweb" secara default.

source: The ``os_tempest`` role now has the ability to install from distribution packages by setting ``tempest_install_method`` to ``distro``.
id: Peran ``os_tempest`` sekarang memiliki kemampuan untuk menginstal dari paket distribusi dengan mengatur ``tempest_install_method`` ke ``distro``.

source: The ``os_tempest`` tempest role was downloading images twice - once arbitrarily, and once to use for testing. This has been consolidated into a single download to a consistent location.
id: Peran ``os_tempest`` sedang mengunduh image dua kali - sekali secara acak, dan satu kali untuk digunakan untuk pengujian. Ini telah dikonsolidasikan ke dalam satu unduhan ke lokasi yang konsisten.

source: The ``pip_get_pip_options`` override has been removed from group_vars, resulting in the empty default being used. Previously this method was used to lock the pip install source appropriately, but this has been handled through the pip_lock_down role for several cycles. If a deployer has implemented an override in user_variables based on the previous group_vars settings then the settings should be reviewed. This override may now be used for catering to situations where the pip installation requires extra options set to allow installing through a proxy, or disabling certificate validation.
id: Override ``pip_get_pip_options`` telah dihapus dari group_vars, menghasilkan default kosong yang digunakan. Sebelumnya metode ini digunakan untuk mengunci sumber pemasangan pip dengan tepat, tetapi ini telah ditangani melalui peran pip_lock_down untuk beberapa siklus. Jika seorang deployer telah mengimplementasikan override dalam user_variables berdasarkan pada pengaturan group_vars sebelumnya maka pengaturan harus ditinjau. Override ini sekarang dapat digunakan untuk memenuhi situasi di mana pemasangan pip memerlukan opsi tambahan yang diatur untuk memungkinkan pemasangan melalui proxy, atau menonaktifkan validasi sertifikat.

source: The ``pip_packages_tmp`` variable has been renamed ``pip_tmp_packages`` to avoid unintended processing by the py_pkgs lookup plugin.
id: Variabel ``pip_packages_tmp`` telah diubah namanya menjadi ``pip_tmp_packages`` untuk menghindari pemrosesan yang tidak diinginkan oleh plugin pencarian py_pkgs.

source: The ``pretend_min_part_hours_passed`` option can now be passed to swift-ring-builder prior to performing a rebalance. This is set by the ``swift_pretend_min_part_hours_passed`` boolean variable. The default for this variable is False. We recommend setting this by running the os-swift.yml playbook with ``-e swift_pretend_min_part_hours_passed=True``, to avoid resetting ``min_part_hours`` unintentionally on every run. Setting ``swift_pretend_min_part_hours_passed`` to True will reset the clock on the last time a rebalance happened, thus circumventing the min_part_hours check. This should only be used with extreme caution. If you run this command and deploy rebalanced rings before a replication pass completes, you may introduce unavailability in your cluster. This has an end-user imapct.
id: Opsi ``pretend_min_part_hours_passed`` sekarang dapat diteruskan ke swift-ring-builder sebelum melakukan penyeimbangan kembali. Ini diatur oleh variabel boolean ``swift_pretend_min_part_hours_passed``. Default untuk variabel ini adalah False. Kami menyarankan pengaturan ini dengan menjalankan os-swift.yml playbook dengan ``-e swift_pretend_min_part_hours_passed=True``, untuk menghindari pengaturan ulang ``min_part_hours`` secara tidak sengaja pada setiap proses. Mengatur ``swift_pretend_min_part_hours_passed`` ke True akan mengatur ulang jam saat terakhir kali penyeimbangan kembali terjadi, sehingga menghindari pemeriksaan min_part_hours. Ini hanya digunakan dengan sangat hati-hati. Jika Anda menjalankan perintah ini dan menggunakan cincin rebalanced (rebalanced rings) sebelum lulus replikasi selesai, Anda dapat memperkenalkan tidak tersedianya di cluster Anda. Ini memiliki dampak end-user.

source: The ``provider_networks`` library has been updated to support the definition of network interfaces that can automatically be added as ports to OVS provider bridges setup during a deployment. As a result, the ``network_interface`` value applied to the ``neutron_provider_networks`` override in ``user_variables.yml``, as described in previous Open vSwitch deployment guides, is no longer effective. If overrides are necessary, use ``network_interface_mappings`` within the provider network override and specify the respective bridge-to-interface mapping (e.g. "br-provider:bond1"). For more information, refer to the latest Open vSwitch deployment guide.
id: Pustaka ``provider_networks`` telah diperbarui untuk mendukung definisi antarmuka jaringan yang secara otomatis dapat ditambahkan sebagai port ke pengaturan jembatan penyedia OVS selama penyebaran. Akibatnya, nilai ``network_interface`` yang diterapkan pada ``neutron_provider_networks`` menggantikan dalam ``user_variables.yml``, seperti dijelaskan dalam panduan penyebaran Open vSwitch sebelumnya, tidak lagi efektif. Jika perlu mengganti, gunakan ``network_interface_mappings`` di dalam jaringan penyedia dan timpa pemetaan masing-masing jembatan ke antarmuka (mis. "Br-provider: bond1"). Untuk informasi lebih lanjut, lihat panduan penyebaran Open vSwitch terbaru.

source: The ``provider_networks`` library has been updated to support the definition of network interfaces that can automatically be added as ports to OVS provider bridges setup during a deployment. To activate this feature, add the ``network_interface`` key to the respective flat and/or vlan provider network definition in ``openstack_user_config.yml``. For more information, refer to the latest Open vSwitch deployment guide.
id: Pustaka ``provider_networks`` telah diperbarui untuk mendukung definisi antarmuka jaringan yang secara otomatis dapat ditambahkan sebagai port ke pengaturan jembatan penyedia OVS selama penyebaran. Untuk mengaktifkan fitur ini, tambahkan kunci ``network_interface`` ke definisi jaringan flat dan/atau penyedia vlan masing-masing di ``openstack_user_config.yml``. Untuk informasi lebih lanjut, lihat panduan penyebaran Open vSwitch terbaru.

source: The ``py_pkgs`` and ``packages_file`` Ansible lookups are no longer used in OSA and have been removed from the plugins repository.
id: Pencarian ``py_pkgs`` dan ``packages_file`` tidak lagi digunakan dalam OSA dan telah dihapus dari repositori plugins.

source: The ``py_pkgs`` lookup plugin now has strict ordering for requirement files discovered. These files are used to add additional requirements to the python packages discovered. The order is defined by the constant, ``REQUIREMENTS_FILE_TYPES`` which contains the following entries, 'test-requirements.txt', 'dev-requirements.txt', 'requirements.txt', 'global-requirements.txt', 'global-requirement-pins.txt'. The items in this list are arranged from least to most priority.
id: Plugin pencarian ``py_pkgs`` sekarang memiliki pemesanan ketat untuk file persyaratan yang ditemukan. File-file ini digunakan untuk menambahkan persyaratan tambahan untuk paket python yang ditemukan. Urutan ditentukan oleh konstanta, ``REQUIREMENTS_FILE_TYPES`` yang berisi entri berikut, 'test-requirements.txt', 'dev-requirements.txt', 'requirements.txt', 'global-requirements.txt', 'global-requirement-pins.txt'. Item dalam daftar ini disusun dari prioritas paling rendah hingga paling tinggi.

source: The ``rabbitmq_apt_packages`` variable has been deprecated. ``rabbitmq_dependencies`` should be used instead to override additional packages to install alongside rabbitmq-server.
id: Variabel ``rabbitmq_apt_packages`` telah ditinggalkan. ``rabbitmq_dependencies`` harus digunakan sebagai gantinya untuk mengganti paket tambahan untuk diinstal bersama rabbitmq-server.

source: The ``rabbitmq_server`` now supports a configurable inventory host group. Deployers can override the ``rabbitmq_host_group`` variable if they wish to use the role to create additional RabbitMQ clusters on a custom host group.
id: ``Rabbitmq_server`` sekarang mendukung grup host persediaan yang dapat dikonfigurasi. Deployer dapat mengganti variabel ``rabbitmq_host_group`` jika mereka ingin menggunakan peran tersebut untuk membuat cluster RabbitMQ tambahan pada grup host kustom.

source: The ``rabbitmq_server`` role now supports configuring HiPE compilation of the RabbitMQ server Erlang code. This configuration option may improve server performance for some workloads and hardware. Deployers can override the ``rabbitmq_hipe_compile`` variable, setting a value of ``True`` if they wish to enable this feature.
id: Peran ``rabbitmq_server`` sekarang mendukung konfigurasi kompilasi HiPE dari kode Erlang server RabbitMQ. Opsi konfigurasi ini dapat meningkatkan kinerja server untuk beberapa beban kerja dan perangkat keras. Deployer dapat mengganti variabel ``rabbitmq_hipe_compile``, menetapkan nilai ``True`` jika mereka ingin mengaktifkan fitur ini.

source: The ``rabbitmq_server`` role now supports deployer override of the RabbitMQ policies applied to the cluster. Deployers can override the ``rabbitmq_policies`` variable, providing a list of desired policies.
id: Peran ``rabbitmq_server`` sekarang mendukung override deployer dari kebijakan RabbitMQ yang diterapkan pada cluster. Deployer dapat mengganti variabel ``rabbitmq_policies``, memberikan daftar kebijakan yang diinginkan.

source: The ``rabbitmq_server`` role now supports disabling listeners that do not use TLS. Deployers can override the ``rabbitmq_disable_non_tls_listeners`` variable, setting a value of ``True`` if they wish to enable this feature.
id: Peran ``rabbitmq_server`` sekarang mendukung menonaktifkan pendengar yang tidak menggunakan TLS. Penyebar dapat menimpa variabel ``rabbitmq_disable_non_tls_listeners``, mengatur nilai ``True`` jika mereka ingin mengaktifkan fitur ini.

source: The ``repo-clone-mirror.yml`` play has been removed as it is no longer used by the project.
id: Play ``repo-clone-mirror.yml`` telah dihapus karena tidak lagi digunakan oleh proyek.

source: The ``repo-store-source.yml`` playbook has been removed as it is no longer needed.
id: Playbook ``repo-store-source.yml`` telah dihapus karena tidak lagi diperlukan.
