Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: Multiple HAProxy nodes can now be deployed in an HA configuration with keepalived and LetsEncrypt certificates. Certbot can be treated as a backend service for haproxy and acme-challenge requests from LetsEncrypt can be directed to whichever HAProxy server is running a certificate renewal. New variables are defined for frontend ACLs and options to be passed to Certbot which enable this new feature, but the majority of the required configuration is done via the existing HAProxy service setup. An example is provided in the documentation.
id: Beberapa node HAProxy sekarang dapat digunakan dalam konfigurasi HA dengan sertifikat keepalived dan LetsEncrypt. Certbot dapat diperlakukan sebagai layanan backend untuk permintaan haproxy dan acme-challenge dari LetsEncrypt dapat diarahkan ke server HAProxy mana pun yang menjalankan pembaruan sertifikat. Variabel baru didefinisikan untuk ACL frontend dan opsi untuk diteruskan ke Certbot yang memungkinkan fitur baru ini, tetapi sebagian besar konfigurasi yang diperlukan dilakukan melalui pengaturan layanan HAProxy yang ada. Contoh disediakan dalam dokumentasi.

source: Multiverse: Software that is not free.
id: Multiverse: Perangkat lunak yang tidak gratis.

source: Mysql cnf files can now be properly overridden. The config_template module has been extended to support valueless options, such as those that are found in the my.cnf file(i.e. `quick` under the `mysqldump` section). To use valueless options, use the `ignore_none_type` attribute of the config_template module.
id: File cnf Mysql sekarang dapat diganti dengan benar. Modul config_template telah diperluas untuk mendukung opsi yang tidak berharga, seperti yang ditemukan di file my.cnf (misal `quick` di bawah bagian `mysqldump`). Untuk menggunakan opsi yang tidak bernilai, gunakan atribut `ignore_none_type` dari modul config_template.

source: Neutron BGP dynamic routing plugin can now optionally be deployed and configured. Please see `OpenStack Networking Guide: BGP dynamic routing <http://docs.openstack.org/networking-guide/config-bgp-dynamic-routing.html>`_ for details about what the service is and what it provides.
id: Plugin routing dinamis BGP Neutron sekarang dapat secara opsional digunakan dan dikonfigurasi. Tolong lihat `OpenStack Networking Guide: BGP dynamic routing <http://docs.openstack.org/networking-guide/config-bgp-dynamic-routing.html>`_ untuk perincian tentang apa layanan itu dan apa yang disediakannya.

source: Neutron DHCP options have been set to allow a DHCP server running dnsmasq to coexist with other DHCP servers within the same network. This works by instructing dnsmasq to ignore any clients which are not specified in dhcp-host files.
id: Opsi DHCP Neutron telah diatur untuk memungkinkan server DHCP yang menjalankan dnsmasq untuk hidup berdampingan dengan server DHCP lain dalam jaringan yang sama. Ini bekerja dengan menginstruksikan dnsmasq untuk mengabaikan klien yang tidak ditentukan dalam file dhcp-host.

source: Neutron DHCP options have been set to provide for logging which makes debugging DHCP and connectivity issues easier by default.
id: Opsi DHCP Neutron telah diatur untuk menyediakan logging yang membuat debugging DHCP dan masalah konektivitas lebih mudah secara default.

source: Neutron Firewall as a Service (FWaaS) can now optionally be deployed and configured. Please see the `FWaaS Configuration Reference <http://docs.openstack.org/admin-guide-cloud/networking_introduction.html#firewall-as-a-service-fwaas-overview>`_ for details about the what the service is and what it provides. See the `FWaaS Install Guide <http://docs.openstack.org/developer/openstack-ansible/install-guide/configure-fwaas.html>`_ for implementation details.
id: Neutron Firewall as a Service (FWaaS) sekarang dapat digunakan dan dikonfigurasi secara opsional. Silakan lihat `FWaaS Configuration Reference <http://docs.openstack.org/admin-guide-cloud/networking_introduction.html#firewall-as-a-service-fwaas-overview>`_ untuk detail tentang layanan apa yang dimaksud dan apa yang disediakannya. Lihat `FWaaS Install Guide <http://docs.openstack.org/developer/openstack-ansible/install-guide/configure-fwaas.html>`_ untuk detail implementasi.

source: Neutron HA router capabilities in Horizon will be enabled automatically if the neutron plugin type is ML2 and environment has >=2 L3 agent nodes.
id: Kemampuan router Neutron HA di Horizon akan diaktifkan secara otomatis jika jenis plugin neutron adalah ML2 dan lingkungan memiliki >= 2 node agen L3.

source: Neutron SR-IOV can now be optionally deployed and configured. For details about the what the service is and what it provides, see the `SR-IOV Installation Guide <http://docs.openstack.org/developer/openstack-ansible-os_neutron/configure-network-services.html#sr--iov-support-optional>`_ for more information.
id: Neutron SR-IOV sekarang dapat digunakan dan dikonfigurasi secara opsional. Untuk perincian tentang apa layanan itu dan apa yang disediakannya, lihat `SR-IOV Installation Guide <http://docs.openstack.org/developer/openstack-ansible-os_neutron/configure-network-services.html#sr--iov-support-optional>`_ untuk informasi lebih lanjut.

source: Neutron VPN as a Service (VPNaaS) can now optionally be deployed and configured. Please see the `OpenStack Networking Guide <http://docs.openstack.org/mitaka/networking-guide/>`_ for details about the what the service is and what it provides. See the `VPNaaS Install Guide <http://docs.openstack.org/developer/openstack-ansible/install-guide/configure-network-services.html#virtual-private-network-service-optional>`_ for implementation details.
id: Neutron VPN as a Service (VPNaaS) kini dapat digunakan dan dikonfigurasi secara opsional. Silakan lihat `OpenStack Networking Guide <http://docs.openstack.org/mitaka/networking-guide/>`_ untuk perincian tentang apa layanan ini dan apa yang disediakannya. Lihat `VPNaaS Install Guide <http://docs.openstack.org/developer/openstack-ansible/install-guide/configure-network-services.html#virtual-private-network-service-optional>`_ untuk detail implementasi.

source: Neutron connectivity agents will now be deployed on baremetal within the "network_hosts" defined within the ``openstack_user_config.yml``.
id: Agen konektivitas Neutron sekarang akan digunakan pada baremetal dalam "network_hosts" yang didefinisikan dalam ``openstack_user_config.yml``.

source: Neutron currently does not support enabling the ``port_security`` extension driver cleanly for existing networks. If networks are created and the plugin is enabled afterwards, VMs connected to those networks will not start. See bug https://bugs.launchpad.net/neutron/+bug/1509312
id: Neutron saat ini tidak mendukung pengaktifan driver ekstensi ``port_security`` secara bersih untuk jaringan yang ada. Jika jaringan dibuat dan plugin diaktifkan setelahnya, VM yang terhubung ke jaringan tersebut tidak akan mulai. Lihat bug https://bugs.launchpad.net/neutron/+bug/1509312

source: Neutron notifications to nova will now use the internal API endpoint instead of the public endpoint.
id: Notifikasi Neutron ke nova sekarang akan menggunakan internal API endpoint daripada public endpoint.

source: Neutron now makes use of Ubuntu Cloud Archive by default. This can be disabled by setting ``neutron_uca_enable`` to ``False``.
id: Neutron sekarang menggunakan Ubuntu Cloud Archive secara default. Ini dapat dinonaktifkan dengan mengatur ``neutron_uca_enable`` ke ``False``.

source: New Features
id: Fitur baru

source: New hypervisor groups have been added allowing deployers to better define their compute workloads. While the generic "compute_hosts" group will still work explicit definitions for compute hosts can now be defined using the `ironic-compute_hosts`, `kvm-compute_hosts`, `lxd-compute_hosts`, `qemu-compute_hosts`, and `powervm-compute_hosts` groups accordingly
id: Grup hypervisor baru telah ditambahkan yang memungkinkan deployer untuk lebih mendefinisikan beban kerja komputasi mereka. Sementara grup "compute_hosts" generik masih akan bekerja definisi eksplisit untuk host komputasi sekarang dapat didefinisikan menggunakan grup `ironic-compute_hosts`, `kvm-compute_hosts`, `lxd-compute_hosts`, `qemu-compute_hosts`, dan `powervm-compute_hosts` yang sesuai.

source: New overrides are provided to allow for better customization around logfile retention and rate limiting for UDP/TCP sockets. ``rsyslog_server_logrotation_window`` defaults to 14 days ``rsyslog_server_ratelimit_interval`` defaults to 0 seconds ``rsyslog_server_ratelimit_burst`` defaults to 10000
id: Override baru disediakan untuk memungkinkan penyesuaian yang lebih baik di sekitar penyimpanan file log dan pembatasan tingkat untuk soket UDP/TCP. ``rsyslog_server_logrotation_window`` secara default menjadi 14 hari ``rsyslog_server_ratelimit_interval`` menjadi 0 detik, ``rsyslog_server_ratelimit_burst`` default ke 10000

source: New rabbitmq-server role override rabbitmq_async_threads defaults to 128 threads for IO operations inside the RabbitMQ erlang VM. This setting doubled the threads for IO operations.
id: Role baru rabbitmq-server menggantikan rabbitmq_async_threads default menjadi 128 thread untuk operasi IO di dalam RabbitMQ erlang VM. Pengaturan ini menggandakan thread untuk operasi IO.

source: New rabbitmq-server role override rabbitmq_process_limit defaults to 1048576 for number of concurrent processes inside the erlang VM. Each network connection and file handle does need its own process inside erlang.
id: Role rabbitmq-server baru menimpa default rabbitmq_process_limit menjadi 1048576 untuk jumlah proses bersamaan di dalam erlang VM. Setiap koneksi jaringan dan file handle memang perlu prosesnya sendiri di dalam erlang.

source: New variable ``ceph_extra_confs`` may be defined to support deployment of extra Ceph config files. This is useful for cinder deployments that utilize multiple Ceph clusters as cinder backends.
id: Variabel baru ``ceph_extra_confs`` dapat didefinisikan untuk mendukung penyebaran file konfigurasi Ceph tambahan. Ini berguna untuk penyebaran cinder yang menggunakan beberapa cluster Ceph sebagai backend cinder.

source: New variables have been added to allow a deployer to customize a aodh systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit systemd aodh sesuai keinginan mereka.

source: New variables have been added to allow a deployer to customize a barbican systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit systemd barbican sesuai dengan keinginan mereka.

source: New variables have been added to allow a deployer to customize a ceilometer systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit ceilometer systemd sesuai keinginan mereka.

source: New variables have been added to allow a deployer to customize a cinder systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit cinder systemd sesuai dengan keinginan mereka.

source: New variables have been added to allow a deployer to customize a designate systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit systemd designate systemd dengan keinginan mereka.

source: New variables have been added to allow a deployer to customize a glance systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit glance systemd sesuai keinginan mereka.

source: New variables have been added to allow a deployer to customize a gnocchi systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit gnocchi systemd sesuai dengan keinginan mereka.

source: New variables have been added to allow a deployer to customize a heat systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit heat systemd sesuai dengan keinginan mereka.

source: New variables have been added to allow a deployer to customize a ironic systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit ironic systemd sesuai dengan keinginan mereka.

source: New variables have been added to allow a deployer to customize a keystone systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit keystone systemd sesuai dengan keinginan mereka.

source: New variables have been added to allow a deployer to customize a magnum systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit magnum systemd sesuai dengan keinginan mereka.

source: New variables have been added to allow a deployer to customize a neutron systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit neutron systemd sesuai keinginan mereka.

source: New variables have been added to allow a deployer to customize a nova systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit nova systemd sesuai keinginan mereka.

source: New variables have been added to allow a deployer to customize a octavia systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit octavia systemd sesuai keinginan mereka.

source: New variables have been added to allow a deployer to customize a sahara systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit sahara systemd sesuai dengan keinginan mereka.

source: New variables have been added to allow a deployer to customize a swift systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit swift systemd sesuai dengan keinginan mereka.

source: New variables have been added to allow a deployer to customize a trove systemd unit file to their liking.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk menyesuaikan file unit trove systemd sesuai dengan keinginan mereka.

source: New variables have been added to the glance role allowing a deployer to set the UID and GID of the glance user. The new options are, ``glance_system_user_uid`` and ``glance_system_group_uid``. These options are useful when deploying glance with shared storage as the back-end for images and will only set the UID and GID of the glance user when defined.
id: Variabel baru telah ditambahkan ke peran glance yang memungkinkan seorang penggelar untuk mengatur UID dan GID dari pengguna glance. Opsi baru adalah, ``glance_system_user_uid`` dan ``glance_system_group_uid``. Opsi ini berguna saat menggunakan glance dengan penyimpanan bersama sebagai back-end untuk images dan hanya akan mengatur UID dan GID pengguna glance saat ditentukan.

source: New virtual environments will be created using python3, giving a straightforward transition from python2 to python3 during the major upgrade. The ansible-runtime virtual environment on the deployment host will also be upgraded from python2 to python3 where the operating system allows.
id: Lingkungan virtual baru akan dibuat menggunakan python3, memberikan transisi langsung dari python2 ke python3 selama upgrade utama. Lingkungan virtual ansible-runtime pada host penyebaran juga akan ditingkatkan dari python2 ke python3 dimana sistem operasi memungkinkan.

source: Newer releases of CentOS ship a version of libnss that depends on the existance of /dev/random and /dev/urandom in the operating system in order to run. This causes a problem during the cache preparation process which runs inside chroot that does not contain this, resulting in errors with the following message.
id: Rilis CentOS yang lebih baru menghadirkan versi libnss yang tergantung pada keberadaan /dev/random and /dev/urandom dalam sistem operasi untuk menjalankannya. Ini menyebabkan masalah selama proses persiapan cache yang berjalan di dalam chroot yang tidak mengandung ini, menghasilkan kesalahan dengan pesan berikut.

source: Newer releases of CentOS ship a version of libnss that depends on the existance of /dev/random and /dev/urandom in the operating system in order to run. This causes a problem during the cache preparation process which runs inside chroot that does not contain this, resulting in errors with the following message:
id: Rilis CentOS yang lebih baru menghadirkan versi libnss yang tergantung pada keberadaan /dev/random and /dev/urandom dalam sistem operasi untuk menjalankannya. Ini menyebabkan masalah selama proses persiapan cache yang berjalan di dalam chroot yang tidak mengandung ini, mengakibatkan kesalahan dengan pesan berikut:

source: Newton Series Release Notes
id: Catatan Rilis Seri Newton

source: Note that the value for ``openstack_distrib_release`` will be taken from the variable ``openstack_release`` if it is set.
id: Perhatikan bahwa nilai untuk ``openstack_distrib_release`` akan diambil dari variabel ``openstack_release`` jika diatur.

source: Nova UCA repository support is implemented by default. This will allow the users to benefit from the updated packages for KVM. The ``nova_uca_enable`` variable controls the install source for the KVM packages. By default this value is set to ``True`` to make use of UCA repository. User can set to ``False`` to disable.
id: Dukungan repositori Nova UCA diimplementasikan secara default. Ini akan memungkinkan pengguna mendapat manfaat dari paket yang diperbarui untuk KVM. Variabel ``nova_uca_enable`` mengontrol sumber instal untuk paket KVM. Secara default, nilai ini diatur ke ``True`` untuk memanfaatkan repositori UCA. Pengguna dapat mengatur ke ``False`` untuk menonaktifkan.

source: Nova cell_v2 support has been added. The default cell is ``cell1`` which can be overridden by the ``nova_cell1_name``. Support for multiple cells is not yet available.
id: Dukungan Nova cell_v2 telah ditambahkan. Sel default adalah ``cell1`` yang dapat ditimpa oleh ``nova_cell1_name``. Dukungan untuk banyak sel belum tersedia.

source: Nova features that use libguestfs (libvirt password/key injection) now work on compute hosts running Ubuntu. When Nova is deployed to Ubuntu compute hosts and either ``nova_libvirt_inject_key`` or ``nova_libvirt_inject_password`` are set to True, then kernels stored in /boot/vmlinuz-* will be made readable to nova user. See launchpad bug 1507915.
id: Fitur Nova yang menggunakan libguestfs (libvirt password/key injection) sekarang berfungsi pada host komputasi yang menjalankan Ubuntu. Ketika Nova dikerahkan ke host komputasi Ubuntu dan ``nova_libvirt_inject_key`` atau ``nova_libvirt_inject_password`` disetel ke True, maka kernel yang disimpan di /boot/vmlinuz-* akan dapat dibaca oleh pengguna nova. Lihat bug launchpad 1507915.

source: Nova may now use an encrypted database connection. This is enabled by setting ``nova_galera_use_ssl`` to ``True``.
id: Nova sekarang dapat menggunakan koneksi database terenkripsi. Ini diaktifkan dengan mengatur ``nova_galera_use_ssl`` ke ``True``.

source: Nova now utilizes version 2 of the Cinder API. Tempest is now configured to use the v2 Cinder API as well.
id: Nova sekarang menggunakan versi 2 dari Cinder API. Tempest sekarang dikonfigurasi untuk menggunakan API Cinder v2 juga.

source: Ocata Series Release Notes
id: Catatan Rilis Seri Ocata

source: Octavia is creating vms, securitygroups, and other things in its project. In most cases the default quotas are not big enough. This will adjust them to (configurable) reasonable values.
id: Octavia membuat vms, grup keamanan, dan hal lain dalam proyeknya. Dalam kebanyakan kasus, kuota default tidak cukup besar. Ini akan menyesuaikannya dengan nilai wajar (dapat dikonfigurasi).

source: Octavia requires SSL certificates for communication with the amphora. This adds the automatic creation of self signed certificates for this purpose. It uses different certificate authorities for amphora and control plane thus insuring maximum security.
id: Octavia membutuhkan sertifikat SSL untuk komunikasi dengan amphora. Ini menambahkan pembuatan otomatis sertifikat yang ditandatangani sendiri untuk tujuan ini. Ini menggunakan otoritas sertifikat yang berbeda untuk amphora dan control plane sehingga menjamin keamanan maksimum.

source: On OpenStack-Ansible Train release you should upgrade your Debian from 9 (stretch) to 10 (buster). Debian 9 support will be deprecated during the next release of OpenStack-Ansible (Ussuri).
id: Pada rilis OpenStack-Ansible Train Anda harus meningkatkan versi Debian Anda dari 9 (stretch) ke 10 (buster). Dukungan Debian 9 akan dihentikan selama rilis OpenStack-Ansible (Ussuri) berikutnya.

source: Once this is done, the repo build process should complete as it did before and the updated software can now be deployed.
id: Setelah ini selesai, proses pembuatan repo harus selesai seperti sebelumnya dan perangkat lunak yang diperbarui sekarang dapat digunakan.

source: Once this is done, the upgrade process for neutron services will work properly.
id: Setelah ini selesai, proses upgrade untuk layanan neutron akan bekerja dengan baik.

source: Only Ceph repos are supported for now.
id: Hanya repo Ceph yang didukung untuk saat ini.

source: Open vSwitch dataplane with NSH support has been implemented. This feature may be activated by setting ``ovs_nsh_support: True`` in ``/etc/openstack_deploy/user_variables.yml``.
id: Buka dataplane vSwitch dengan dukungan NSH telah diterapkan. Fitur ini dapat diaktifkan dengan mengatur `` ovs_nsh_support: ``/etc/openstack_deploy/user_variables.yml``.

source: Open vSwitch driver support has been implemented. This includes the implementation of the appropriate Neutron configuration and package installation. This feature may be activated by setting ``neutron_plugin_type: ml2.ovs`` in ``/etc/openstack_deploy/user_variables.yml``.
id: Buka dukungan driver vSwitch telah diterapkan. Ini termasuk implementasi konfigurasi Neutron yang sesuai dan instalasi paket. Fitur ini dapat diaktifkan dengan mengatur ``neutron_plugin_type: ml2.ovs`` di ``/etc/openstack_deploy/user_variables.yml``.

source: OpenStack services have been set to communicate with RabbitMQ using SSL by default. This feature may be disabled by setting ``rabbit_use_ssl`` to ``false`` in ``/etc/openstack_deploy/user_variables.yml``. The default behaviour will be to use a self-signed certificate for communications. This can be changed by the procedure referred to in `the SSL documentation <http://docs.openstack.org/developer/openstack-ansible/mitaka/install-guide/configure-sslcertificates.html>`_.
id: Layanan OpenStack telah diatur untuk berkomunikasi dengan RabbitMQ menggunakan SSL secara default. Fitur ini dapat dinonaktifkan dengan mengatur ``rabbit_use_ssl`` ke ``false`` di `` ``/etc/openstack_deploy/user_variables.yml``. Perilaku default adalah menggunakan sertifikat yang ditandatangani sendiri untuk komunikasi. Ini dapat diubah dengan prosedur sebagaimana dimaksud dalam `the SSL documentation <http://docs.openstack.org/developer/openstack-ansible/mitaka/install-guide/configure-sslcertificates.html>`_.

source: OpenStack-Ansible Release Notes
id: Catatan Rilis OpenStack-Ansible
