Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The following variable changes have been made in the ``lxc_host`` role:
id: Perubahan variabel berikut telah dibuat dalam peran ``lxc_host``:

source: The following variable name changes have been implemented in order to better reflect their purpose.
id: Perubahan nama variabel berikut telah diterapkan untuk lebih mencerminkan tujuan mereka.

source: The following variables are no longer used and have therefore been removed.
id: Variabel berikut tidak lagi digunakan dan karenanya telah dihapus.

source: The following variables have been removed as they no longer serve any purpose.
id: Variabel berikut telah dihapus karena tidak lagi melayani tujuan apa pun.

source: The following variables have been removed because they are no longer used. * ``galera_percona_xtrabackup_repo`` * ``use_percona_upstream`` * ``galera_xtrabackup_compression`` * ``galera_server_percona_distro_packages``
id: Variabel berikut telah dihapus karena tidak lagi digunakan. * ``galera_percona_xtrabackup_repo`` * ``use_percona_upstream`` * ``galera_xtrabackup_compression`` * ``galera_server_percona_distro_packages``

source: The following variables have been removed from the ``haproxy_server`` role as they are no longer necessary or used. - haproxy_repo - haproxy_gpg_keys - haproxy_required_distro_packages
id: Variabel berikut telah dihapus dari peran ``haproxy_server`` karena tidak lagi diperlukan atau digunakan. - haproxy_repo - haproxy_gpg_keys - haproxy_required_distro_packages

source: The following variables have been removed from the ``os_ceilometer`` role as their respective upstream files are no longer present. * ``ceilometer_event_definitions_yaml_overrides`` * ``ceilometer_event_pipeline_yaml_overrides``
id: Variabel berikut telah dihapus dari peran ``os_ceilometer`` karena masing-masing file hulu tidak lagi ada. * ``ceilometer_event_definitions_yaml_overrides`` * ``ceilometer_event_pipeline_yaml_overrides``

source: The following variables have been removed from the ``os_tempest`` role to simplify it. They have been replaced through the use of the data structure ``tempest_images`` which now has equivalent variables per image. - cirros_version - tempest_img_url - tempest_image_file - tempest_img_disk_format - tempest_img_name - tempest_images.sha256 (replaced by checksum)
id: Variabel berikut telah dihapus dari peran ``os_tempest`` untuk menyederhanakannya. Mereka telah diganti melalui penggunaan struktur data ``tempest_images`` yang sekarang memiliki variabel setara per image. - cirros_version - tempest_img_url - tempest_image_file - tempest_img_disk_format - tempest_img_name - tempest_images.sha256 (replaced by checksum)

source: The following variables have been renamed in order to make the variable names neutral for multiple operating systems.
id: Variabel berikut telah diubah namanya untuk membuat nama variabel netral untuk beberapa sistem operasi.

source: The following variables therefore have been removed.
id: Karena itu variabel berikut telah dihapus.

source: The functionality previously using these variables has been transitioned to using a simpler data structure.
id: Fungsi yang sebelumnya menggunakan variabel-variabel ini telah ditransisikan untuk menggunakan struktur data yang lebih sederhana.

source: The galera cluster now supports cluster health checks over HTTP using port 9200. The new cluster check ensures a node is healthy by running a simple query against the wsrep sync status using monitoring user. This change will provide for a more robust cluster check ensuring we have the most fault tolerant galera cluster possible.
id: Cluster galera sekarang mendukung pemeriksaan kesehatan cluster melalui HTTP menggunakan port 9200. Pemeriksaan cluster baru memastikan node sehat dengan menjalankan kueri sederhana terhadap status sinkronisasi wsrep menggunakan pengguna pemantauan. Perubahan ini akan menyediakan untuk pemeriksaan gugus yang lebih kuat yang memastikan kami memiliki galera yang paling toleran terhadap kesalahan.

source: The galera_client role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``galera_client_package_state`` should be set to ``present``.
id: Peran galera_client selalu memeriksa apakah paket terbaru diinstal ketika dieksekusi. Jika seorang penggelar ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``galera_client_package_state`` harus diatur ke ``present``.

source: The galera_client role now installs MariaDB client version 10.1.
id: Peran galera_client sekarang menginstal klien MariaDB versi 10.1.

source: The galera_client role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``galera_client_package_state`` to ``present``.
id: Peran galera_client sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``galera_client_package_state`` ke ``present``.

source: The galera_server role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``galera_server_package_state`` should be set to ``present``.
id: Peran galera_server selalu memeriksa apakah paket terbaru diinstal ketika dieksekusi. Jika seorang penggelar ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``galera_server_package_state`` harus diatur ke ``present``.

source: The galera_server role now includes the functionality from the galera_client role, and as a result a number of the variables from the galera_client defaults are now available to override in the galera_server role defaults. In addition, a number of default variables have been generalised, removing the specific `_client_` or `_server_` parts of the names. Users of this role should check that any overrides they are using have the correct variables names for the new combined role.
id: Peran galera_server sekarang termasuk fungsionalitas dari peran galera_client, dan sebagai hasilnya sejumlah variabel dari standar galera_client sekarang tersedia untuk menggantikan dalam standar peran galera_server. Selain itu, sejumlah variabel default telah digeneralisasi, menghapus bagian `_client_` atau` _server_` tertentu dari nama. Pengguna peran ini harus memeriksa bahwa setiap penggantian yang mereka gunakan memiliki nama variabel yang benar untuk peran gabungan yang baru.

source: The galera_server role now includes the functionality from the galera_client role, and can optionally install the client and server components. This is controlled using two booleans, galera_install_server and galera_install_client, both of which default to false.
id: Peran galera_server sekarang termasuk fungsionalitas dari peran galera_client, dan secara opsional dapat menginstal komponen klien dan server. Ini dikontrol menggunakan dua booleans, galera_install_server, dan galera_install_client, yang keduanya default ke false.

source: The galera_server role now installs MariaDB server version 10.1.
id: Peran galera_server sekarang menginstal server MariaDB versi 10.1.

source: The galera_server role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``galera_server_package_state`` to ``present``.
id: Peran galera_server sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``galera_server_package_state`` ke ``present``.

source: The git clone part of the repo build process now only happens when the requirements change. A git reclone can be forced by using the boolean variable ``repo_build_git_reclone``.
id: Bagian git clone dari proses repo build sekarang hanya terjadi ketika persyaratan berubah. Sebuah git reclone dapat dipaksa dengan menggunakan variabel boolean ``repo_build_git_reclone``.

source: The git source for python2_lxc was used in the past as the package was not available on pypi. Now that the package `has been published <https://pypi.python.org/pypi/lxc-python2>`_ the `py_from_git` role dependency has been removed from the `lxc_hosts` playbook, the role has been removed from the required roles list and the repo details have been removed from the repo_packages files as none of these details are required any more.
id: Sumber git untuk python2_lxc digunakan di masa lalu karena paket tidak tersedia di pypi. Sekarang paket `has been published <https://pypi.python.org/pypi/lxc-python2>`_ ketergantungan peran `py_from_git` telah dihapus dari playbook` lxc_hosts`, peran tersebut telah dihapus dari daftar peran yang diperlukan dan detail repo telah dihapus dari file repo_packages karena tidak ada detail ini yang diperlukan lagi.

source: The glance registry service for the v2 API is now disabled by default as it is not required and is scheduled to be removed in the future. The service can be enabled by setting ``glance_enable_v2_registry`` to ``True``. As the glance v1 API is still enabled by default, and it requires the registry service, the glance-registry service will still remain running and operational as before. If the variable ``glance_enable_v1_api`` is set to ``False`` then both the v1 API and the registry service will be disabled and removed.
id: Layanan sekilas registri untuk API v2 sekarang dinonaktifkan secara default karena tidak diperlukan dan dijadwalkan untuk dihapus di masa depan. Layanan ini dapat diaktifkan dengan mengatur ``glance_enable_v2_registry`` ke ``True``. Karena glance v1 API masih diaktifkan secara default, dan memerlukan layanan registri, layanan glance-registry akan tetap berjalan dan operasional seperti sebelumnya. Jika variabel ``glance_enable_v1_api`` diatur ke ``False`` maka API v1 dan layanan registri akan dinonaktifkan dan dihapus.

source: The glance registry service is now disabled by default as it is not required for the v2 API and is scheduled to be removed in the future. The service can be enabled by setting ``glance_enable_v2_registry`` to ``True``.
id: Layanan glance registry sekarang dinonaktifkan secara default karena tidak diperlukan untuk API v2 dan dijadwalkan untuk dihapus di masa depan. Layanan ini dapat diaktifkan dengan mengatur ``glance_enable_v2_registry`` ke ``True``.

source: The glance v1 API is now disabled by default as the API is scheduled to be removed in Queens.
id: Glance v1 API sekarang dinonaktifkan secara default karena API dijadwalkan akan dihapus di Queens.

source: The glance v1 API is now removed upstream and the deployment code is now removed from this glance ansible role. The variable ``glance_enable_v1_api`` is removed.
id: Glance v1 API sekarang dihapus di hulu dan kode penempatan sekarang dihapus dari peran glance ansible ini. Variabel ``glance_enable_v1_api`` dihapus.

source: The global override ``cinder_nfs_client`` is replaced in favor of fully supporting multi backends configuration via the cinder_backends stanza.
id: Override global ``cinder_nfs_client`` diganti demi konfigurasi multi-backend yang sepenuhnya mendukung melalui stanza cinder_backends.

source: The gnocchi ceph component has been moved out as a default component required by the ceph_client role. It can now be optionally specified through the use of the ``ceph_extra_components`` variable.
id: Komponen gnocchi ceph telah dipindahkan sebagai komponen default yang diperlukan oleh peran ceph_client. Sekarang dapat ditentukan secara opsional melalui penggunaan variabel ``ceph_extra_components``.

source: The gnocchi_archive_policies and gnocchi_archive_policy_rules variables never had full support in the role so were ineffective at the intended purpose. The task references to them have been removed and the library to perform gnocchi operations has also been removed. This eliminates the need for the gnocchi client to be installed outside the virtual environment as well.
id: Variabel gnocchi_archive_policies dan gnocchi_archive_policy_rules tidak pernah memiliki dukungan penuh dalam peran sehingga tidak efektif pada tujuan yang dimaksud. Referensi tugas kepada mereka telah dihapus dan perpustakaan untuk melakukan operasi gnocchi juga telah dihapus. Ini menghilangkan kebutuhan untuk klien gnocchi untuk diinstal di luar lingkungan virtual juga.

source: The haproxy daemon is now able to bind to any port on CentOS 7. The ``haproxy_connect_any`` SELinux boolean is now set to ``on``.
id: Daemon haproxy sekarang dapat mengikat ke port apa pun di CentOS 7. ``haproxy_connect_any`` SELinux boolean sekarang disetel ke ``on``.

source: The haproxy-install.yml playbook will now be run as a part of setup-infrastructure.yml.
id: Playbook haproxy-install.yml sekarang akan dijalankan sebagai bagian dari setup-infrastructure.yml.

source: The haproxy_server role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``haproxy_package_state`` should be set to ``present``.
id: Peran haproxy_server selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``haproxy_package_state`` harus diatur ke ``present``.

source: The haproxy_server role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``haproxy_package_state`` to ``present``.
id: Peran haproxy_server sekarang mendukung kemampuan untuk mengkonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``haproxy_package_state`` ke ``present``.

source: The horizon next generation instance management panels have been enabled by default. This changes horizon to use the upstream defaults instead of the legacy panels. `Documentation can be found here <http://docs.openstack.org/developer/horizon/topics/settings.html#launch-instance-ng-enabled>`_.
id: Panel manajemen instance horizon generasi berikutnya telah diaktifkan secara default. Ini mengubah horizon untuk menggunakan default upstream daripada panel lawas (legacy) `Documentation can be found here <http://docs.openstack.org/developer/horizon/topics/settings.html#launch-instance-ng-enabled>`_.

source: The in tree "ansible.cfg" file in the playbooks directory has been removed. This file was making compatibility difficult for deployers who need to change these values. Additionally this files very existance forced Ansible to ignore any other config file in either a users home directory or in the default "/etc/ansible" directory.
id: File in tree "ansible.cfg" di direktori playbooks telah dihapus. File ini menyulitkan kompatibilitas untuk para deployer yang perlu mengubah nilai ini. Selain itu, file ini sangat dipaksa keberadaan Ansible untuk mengabaikan file konfigurasi lain di direktori home user atau di direktori "/etc/ansible" default.

source: The installation of Erlang and is now optimized for CentOS. Erlang 19.x is now installed via a single package that is maintained by RabbitMQ developers and it provides the minimal features required for RabbitMQ to function. It also includes HiPE support for increased performance.
id: Instalasi Erlang dan sekarang dioptimalkan untuk CentOS. Erlang 19.x sekarang diinstal melalui satu paket yang dikelola oleh pengembang RabbitMQ dan menyediakan fitur minimal yang diperlukan agar RabbitMQ berfungsi. Ini juga termasuk dukungan HiPE untuk peningkatan kinerja.

source: The installation of ``chrony`` is still enabled by default, but it is now controlled by the ``security_enable_chrony`` variable.
id: Instalasi ``chrony`` masih diaktifkan secara default, tetapi sekarang dikendalikan oleh variabel ``security_enable_chrony``.

source: The internal variable ``python_ceph_package`` has been renamed to ``python_ceph_packages`` and is now a list instead of a string. If you are using gnocchi with ceph and are using this internal variable in your ``ceph_extra_components`` overrides, please update it to ``python_ceph_packages``.
id: Variabel internal ``python_ceph_package`` telah diubah namanya menjadi ``python_ceph_packages`` dan sekarang menjadi daftar bukan lagi string. Jika Anda menggunakan gnocchi dengan ceph dan menggunakan variabel internal ini dalam override ``ceph_extra_components`` Anda, update ke ``python_ceph_packages``.

source: The inventory generation code has been switched to use standard Python packaging tools. For most, this should not be a visible change. However, running the dynamic inventory script on a local development environment should now be called via ``python dynamic_inventory.py``.
id: Kode pembuatan inventory telah diubah untuk menggunakan alat packaging Python standar. Bagi kebanyakan orang, ini seharusnya bukan perubahan yang terlihat. Namun, menjalankan skrip inventaris dinamis pada lingkungan pengembangan lokal sekarang harus dipanggil melalui ``python dynamic_inventory.py``.

source: The inventory script will now dynamically populate the ``lxc_hosts`` group dynamically based on which machines have container affinities defined. This group is not allowed in user-defined configuration.
id: Skrip inventory sekarang akan secara dinamis mengisi grup ``lxc_hosts`` secara dinamis berdasarkan pada mesin yang memiliki kesamaan (affinity) kontainer yang ditentukan. Grup ini tidak diizinkan dalam konfigurasi yang ditentukan pengguna.

source: The ironic conductor service has been consolidated into the ``ironic_api_container``. The previously implemented ``ironic_conductor_container`` can be removed.
id: Layanan konduktor ironic telah dikonsolidasikan ke dalam ``ironic_api_container``. ``ironic_conductor_container`` yang sebelumnya diterapkan dapat dihapus.

source: The journald-remote is disabled from execution inside setup-infrastructure until https://github.com/systemd/systemd/issues/2376 has been incorporated in current systemd packages. The playbook can be enabled by setting ``journald_remote_enabled`` to ``True``
id: Remote-journald dinonaktifkan dari eksekusi di dalam setup-infrastructure hingga https://github.com/systemd/systemd/issues/2376 telah dimasukkan dalam paket systemd saat ini. Playbook dapat diaktifkan dengan mengatur ``journald_remote_enabled`` ke ``True``

source: The journald-remote playbook is disabled from execution inside setup-infrastructure until setting ``journald_remote_enabled`` is set to ``True`` due to https://github.com/systemd/systemd/issues/2376
id: Playbook journald-remote dinonaktifkan dari eksekusi di dalam setup-infrastructure sampai pengaturan ``journald_remote_enabled`` diatur ke ``True`` karena https://github.com/systemd/systemd/issues/2376

source: The keepalived role was updated, and now includes an optional way to configure vrrp scripts timeouts. See also: `VRRP timeout PR on keepalived role <https://github.com/evrardjp/ansible-keepalived/commit/0b2d13a13c1a03e14ac6f67286811ca1bf1928ac>`_.
id: Peran keepalived diperbarui, dan sekarang termasuk cara opsional untuk mengkonfigurasi batas waktu skrip vrrp. Lihat juga: `VRRP timeout PR on keepalived role <https://github.com/evrardjp/ansible-keepalived/commit/0b2d13a13c1a03e14ac6f67286811ca1bf1928ac>`_.

source: The key **is_ssh_address** has been removed from the `openstack_user_config.yml` and the dynamic inventory. This key was responsible mapping an address to the container which was used for SSH connectivity. Because we've created the SSH connectivity plugin, which allows us the ability to connect to remote containers without SSH, this option is no longer useful. To keep the `openstack_user_config.yml` clean deployers can remove the option however moving forward it no longer has any effect.
id: Kunci **is_ssh_address** telah dihapus dari `openstack_user_config.yml` dan dynamic inventory. Kunci ini bertanggung jawab memetakan alamat ke kontainer yang digunakan untuk konektivitas SSH. Karena kami telah membuat plugin konektivitas SSH, yang memungkinkan kami kemampuan untuk terhubung ke kontainer jarak jauh tanpa SSH, opsi ini tidak lagi berguna. Untuk menjaga, clean deployers `openstack_user_config.yml` dapat menghapus opsi namun bergerak maju tidak lagi memiliki efek.

source: The keystone endpoints for instances spawned by magnum will now be provided with the public endpoints by default. Previously this was set to use internal endpoints.
id: Endpoint keystone untuk instance yang dihasilkan oleh magnum sekarang akan disediakan dengan endpoint publik secara default. Sebelumnya ini diatur untuk menggunakan endpoint internal.

source: The keystone endpoints now have versionless URLs. Any existing endpoints will be updated.
id: Endpoint keyston sekarang memiliki URL tanpa versi. Setiap endpoint yang ada akan diperbarui.

source: The kubernetes version deployed with ocata is now constrained to version 2.0.0, matching the same version as deployed in all pike releases.
id: Versi kubernet yang digunakan dengan ocata sekarang dibatasi untuk versi 2.0.0, cocok dengan versi yang sama seperti yang digunakan di semua rilis pike.

source: The latest stable release of Ceph, Jewel, is now used as the default client version since Hammer was scheduled for EOL in November 2016.
id: Rilis stabil terbaru dari Ceph, Jewel, sekarang digunakan sebagai versi klien default sejak Hammer dijadwalkan untuk EOL pada November 2016.

source: The latest version of the RHEL 7 STIG requires that a standard login banner is presented to users when they log into the system (V-71863). The security role now deploys a login banner that is used for console and ssh sessions.
id: Versi terbaru dari RHEL 7 STIG mensyaratkan bahwa banner login standar (standard login banner) disajikan kepada pengguna ketika mereka masuk ke sistem (V-71863). Peran keamanan sekarang menyebarkan login banner yang digunakan untuk sesi konsol dan ssh.

source: The liberty release notes list the configuration options scrubber_datadir, cleanup_scrubber and cleanup_scrubber_time as being deprecated. Accordingly, they have been removed from the OSA glance role.
id: Catatan rilis liberty mencantumkan opsi konfigurasi scrubber_datadir, cleanup_scrubber dan cleanup_scrubber_time sudah tidak digunakan lagi. Dengan demikian, mereka telah dihapus dari peran glance OSA.
