Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The default horizon instance launch panels have been changed to the next generation panels. To enable legacy functionality set the following options accordingly:
id: Panel peluncuran instance horizon default telah diubah menjadi panel generasi berikutnya. Untuk mengaktifkan fungsi legacy, setel opsi berikut sesuai:

source: The default location for the image downloads in the ``os_tempest`` role set by the ``tempest_image_dir`` variable has now been changed to be ``/opt/cache/files`` in order to match the default location in nodepool. This improves the reliability of CI testing in OpenStack CI as it will find the file already cached there.
id: Lokasi default untuk unduhan image dalam peran ``os_tempest`` yang ditetapkan oleh variabel ``tempest_image_dir`` sekarang telah diubah menjadi ``/opt/cache/files`` untuk mencocokkan lokasi default di nodepool. Ini meningkatkan keandalan pengujian CI di OpenStack CI karena akan menemukan file sudah di-cache di sana.

source: The default location of the default tempest configuration is now ``/etc/tempest/tempest.conf`` rather than the previous default of ``$HOME/.tempest/etc``.
id: Lokasi default dari konfigurasi tempest default sekarang ``/etc/tempest/tempest.conf`` sebagai ganti default sebelumnya ``$HOME/.tempest/etc``.

source: The default method for download roles has been switched from ``galaxy`` to ``git-clone``. This has no functional effect, but is now required in order to successfully download the ``ceph-ansible`` repository. In order to prevent clashes between the old and new roles, the existing ``/etc/ansible/roles/ceph*`` folders should be removed prior to running ``scripts/bootstrap-ansible.sh`` during the minor upgrade process.
id: Metode default untuk peran unduhan telah diubah dari ``galaxy`` ke ``git-clone``. Ini tidak memiliki efek fungsional, tetapi sekarang diperlukan untuk berhasil mengunduh repositori ``ceph-ansible``. Untuk mencegah bentrokan antara peran lama dan baru, folder ``/etc/ansible/roles/ceph*`` yang ada harus dihapus sebelum menjalankan ``scripts/bootstrap-ansible.sh`` selama proses upgrade minor. .

source: The default nova console type has been changed to novnc. Spice is still supported however due to novnc being more actively maintained it is now a better default option.
id: Jenis konsol nova default telah diubah menjadi novnc. Spice masih didukung namun karena novnc lebih aktif dipelihara sekarang menjadi opsi default yang lebih baik.

source: The default queue policy has changed to ``^(?!(amq\.)|(.*_fanout_)|(reply_)).*`` instead of ``^(?!amq\.).*`` for efficiency. The new HA policy excludes reply queues (these queues have a single consumer and TTL policy), fanout queues (they have the TTL policy) and amq queues (they are auto-delete queues, with a single consumer).
id: Kebijakan antrian default telah berubah menjadi ``^(?!(amq\.)|(.*_fanout_)|(reply_)).*`` instead of ``^(?!amq\.).*`` untuk efisiensi. Kebijakan HA yang baru tidak termasuk reply queues (antrian ini memiliki satu konsumen dan kebijakan TTL), fanout queues (mereka memiliki kebijakan TTL) dan amq queues (antrian auto-delete, dengan satu konsumen).

source: The default ulimit for RabbitMQ is now 65536. Deployers can still adjust this limit using the ``rabbitmq_ulimit`` Ansible variable.
id: Ulimit default untuk RabbitMQ sekarang 65536. Deployer masih dapat menyesuaikan batas ini menggunakan variabel ``rabbitmq_ulimit``.

source: The default value of ``service_credentials/os_endpoint_type`` within ceilometer's configuration file has been changed to **internalURL**. This may be overridden through the use of the ``ceilometer_ceilometer_conf_overrides`` variable.
id: Nilai default dari ``service_credentials/os_endpoint_type`` dalam file konfigurasi ceilometer telah diubah menjadi **internalURL**. Ini mungkin ditimpa melalui penggunaan variabel ``ceilometer_ceilometer_conf_overrides``.

source: The default values for ``ceph_gpg_keys`` have been changed for all supported platforms and now use vendored keys. This means that the task execution will no longer reach out to the internet to add the keys, making offline or proxy-based installations easier and more reliable.
id: Nilai default untuk ``ceph_gpg_keys`` telah diubah untuk semua platform yang didukung dan sekarang menggunakan kunci yang dibatalkan. Ini berarti bahwa pelaksanaan tugas tidak lagi menjangkau ke internet untuk menambahkan kunci, membuat instalasi offline atau berbasis proxy lebih mudah dan lebih dapat diandalkan.

source: The default values for ``galera_client_gpg_keys`` have been changed for all supported platforms will use vendored keys. This means that the task execution will no longer reach out to the internet to add the keys, making offline or proxy-based installations easier and more reliable.
id: Nilai default untuk ``galera_client_gpg_keys`` telah diubah untuk semua platform yang didukung akan menggunakan kunci yang dibatalkan. Ini berarti bahwa pelaksanaan tugas tidak lagi menjangkau ke internet untuk menambahkan kunci, membuat instalasi offline atau berbasis proxy lebih mudah dan lebih dapat diandalkan.

source: The default values for ``galera_gpg_keys`` have been changed for all supported platforms will use vendored keys. This means that the task execution will no longer reach out to the internet to add the keys, making offline or proxy-based installations easier and more reliable.
id: Nilai default untuk ``galera_gpg_keys`` telah diubah untuk semua platform yang didukung akan menggunakan kunci yang dibatalkan. Ini berarti bahwa pelaksanaan tugas tidak lagi menjangkau ke internet untuk menambahkan kunci, membuat instalasi offline atau berbasis proxy lebih mudah dan lebih dapat diandalkan.

source: The default values for ``rabbitmq_gpg_keys`` have been changed for all supported platforms will use vendored keys. This means that the task execution will no longer reach out to the internet to add the keys, making offline or proxy-based installations easier and more reliable.
id: Nilai default untuk ``rabbitmq_gpg_keys`` telah diubah untuk semua platform yang didukung akan menggunakan kunci yang dibatalkan. Ini berarti bahwa pelaksanaan tugas tidak lagi menjangkau ke internet untuk menambahkan kunci, membuat instalasi offline atau berbasis proxy lebih mudah dan lebih dapat diandalkan.

source: The default variable `nova_default_schedule_zone` was previously set by default to ``nova``. This default has been removed to allow the default to be set by the nova code instead. Deployers wishing to maintain the default availability zone of nova must now set the variable as a user_variables.yml or group_vars override.
id: Variabel default `nova_default_schedule_zone` sebelumnya ditetapkan secara default ke ``nova``. Default ini telah dihapus untuk memungkinkan default diatur oleh kode nova sebagai gantinya. Deployer yang ingin mempertahankan zona ketersediaan default nova sekarang harus menetapkan variabel sebagai override user_variables.yml atau group_vars.

source: The deployer can now define an environment variable ``GROUP_VARS_PATH`` with the folders of its choice (separated by the colon sign) to define an user space group_vars folder. These vars will apply but be (currently) overriden by the OpenStack-Ansible default group vars, by the set facts, and by the user_* variables. If the deployer defines multiple paths, the variables found are merged, and precedence is increasing from left to right (the last defined in GROUP_VARS_PATH wins)
id: Deployer sekarang dapat mendefinisikan variabel lingkungan ``GROUP_VARS_PATH`` dengan folder pilihannya (dipisahkan oleh tanda titik dua) untuk menentukan folder space_vars ruang pengguna. Vars ini akan berlaku tetapi akan (saat ini) ditimpa oleh vars grup default OpenStack-Ansible, oleh fakta yang ditetapkan, dan oleh variabel user_*. Jika deployer mendefinisikan beberapa lintasan, variabel yang ditemukan digabungkan, dan prioritas meningkat dari kiri ke kanan (yang terakhir didefinisikan dalam GROUP_VARS_PATH wins)

source: The deployer can now define an environment variable ``HOST_VARS_PATH`` with the folders of its choice (separated by the colon sign) to define an user space host_vars folder. These vars will apply but be (currently) overriden by the OpenStack-Ansible default host vars, by the set facts, and by the user_* variables. If the deployer defines multiple paths, the variables found are merged, and precedence is increasing from left to right (the last defined in HOST_VARS_PATH wins)
id: Deployer sekarang dapat mendefinisikan variabel lingkungan ``HOST_VARS_PATH`` dengan folder pilihannya (dipisahkan oleh tanda titik dua) untuk menentukan folder host_vars ruang pengguna. Vars ini akan berlaku tetapi akan (saat ini) diganti oleh vars host default OpenStack-Ansible, oleh fakta yang ditetapkan, dan oleh variabel user_*. Jika deployer mendefinisikan beberapa lintasan, variabel yang ditemukan digabungkan, dan prioritas meningkat dari kiri ke kanan (yang terakhir didefinisikan dalam HOST_VARS_PATH wins)

source: The deployment configuration file ``openstack_environment.yml`` has been removed and is no longer used in the dynamic inventory generation process. This file was previously rendered functionally irrelevant to the inventory generation process in the Liberty release.
id: File konfigurasi penyebaran ``openstack_environment.yml`` telah dihapus dan tidak lagi digunakan dalam proses pembuatan inventaris dinamis. File ini sebelumnya secara fungsional tidak relevan dengan proses pembuatan inventaris dalam rilis Liberty.

source: The deprecated Neutron LBaaS v2 plugin has been removed from the Neutron role.
id: Plugin Neutron LBaaS v2 yang sudah usang telah dihapus dari peran Neutron.

source: The deprecated Neutron LBaaS v2 plugin support has been removed from openstack-ansible.
id: Dukungan plugin Neutron LBaaS v2 yang sudah usang telah dihapus dari openstack-ansible.

source: The dictionary-based variables in ``defaults/main.yml`` are now individual variables. The dictionary-based variables could not be changed as the documentation instructed. Instead it was required to override the entire dictionary. Deployers must use the new variable names to enable or disable the security configuration changes applied by the security role. For more information, see `Launchpad Bug 1577944 <https://bugs.launchpad.net/openstack-ansible/+bug/1577944>`_.
id: Variabel dictionary-based di ``defaults/main.yml`` sekarang menjadi variabel individual. Variabel dictionary-based tidak dapat diubah seperti yang diperintahkan oleh dokumentasi. Sebaliknya itu diperlukan untuk menimpa seluruh dictionary. Deployer harus menggunakan nama variabel baru untuk mengaktifkan atau menonaktifkan perubahan konfigurasi keamanan yang diterapkan oleh peran keamanan. Untuk informasi lebih lanjut, lihat `Launchpad Bug 1577944 <https://bugs.launchpad.net/openstack-ansible/+bug/1577944>`_.

source: The distribution of the ``.my.cnf`` database access configuration file which contains sensitive root credentials has now been limited to only be distributed to containers and hosts which require it for troubleshooting purposes.
id: Distribusi file konfigurasi akses database ``.my.cnf`` yang berisi kredensial root sensitif kini telah dibatasi hanya didistribusikan ke kontainer dan host yang memerlukannya untuk tujuan pemecahan masalah.

source: The distribution of the ``.my.cnf`` database access configuration file which contains sensitive root credentials has now been limited to only be distributed to containers and hosts which require it for troubleshooting purposes. It is recommended that this file be removed from all hosts and containers. The only containers that should have the file are the Utility container and the Galera containers. This may be done by executing ``ansible 'all:!galera:!utility' -m shell -a 'rm -f /root/.my.cnf'`` from the ``/opt/openstack-ansible/`` directory.
id: Distribusi file konfigurasi akses database ``.my.cnf`` yang berisi kredensial root sensitif kini telah dibatasi hanya didistribusikan ke kontainer dan host yang memerlukannya untuk tujuan pemecahan masalah. Disarankan bahwa file ini dihapus dari semua host dan kontainer. Satu-satunya kontainer yang harus memiliki file adalah kontainer Utility dan kontainer Galera. Ini dapat dilakukan dengan mengeksekusi direktori ``ansible 'all:!galera:!utility' -m shell -a 'rm -f /root/.my.cnf'`` from the ``/opt/openstack-ansible/`` .

source: The distribution package lookup and data output has been removed from the py_pkgs lookup so that the repo-build use of py_pkgs has reduced output and the lookup is purpose specific for python packages only.
id: Pencarian paket distribusi dan output data telah dihapus dari pencarian py_pkgs sehingga penggunaan repo-build dari py_pkgs telah mengurangi output dan pencarian khusus untuk paket python saja.

source: The documentation for STIG V-51337 has more information about how each LSM is enabled along with special notes for SELinux.
id: Dokumentasi untuk STIG V-51337 memiliki informasi lebih lanjut tentang bagaimana setiap LSM diaktifkan bersama dengan catatan spesial untuk SELinux.

source: The dynamic_inventory script previously set the provider network attributes ``is_container_address`` and ``is_ssh_address`` to True for the management network regardless of whether a deployer had them configured this way or not. Now, these attributes must be configured by deployers and the dynamic_inventory script will fail if they are missing or not True.
id: Script dynamic_inventory sebelumnya menetapkan atribut jaringan provider ``is_container_address`` dan ``is_ssh_address`` ke True untuk jaringan manajemen terlepas dari apakah seorang deployer telah mereka konfigurasikan dengan cara ini atau tidak. Sekarang, atribut ini harus dikonfigurasikan oleh deployer dan script dynamic_inventory akan gagal jika hilang atau not True.

source: The endpoint which designate uses to communicate with neutron has been set to the internalURL by default. This change has been done within the template ``designate.conf.j2`` and can be changed using the ``designate_designate_conf_overrides`` variable.
id: Endpoint yang digunakan untuk berkomunikasi dengan neutron telah ditetapkan ke internalURL secara default. Perubahan ini telah dilakukan di dalam template ``designate.conf.j2`` dan dapat diubah menggunakan variabel ``designate_designate_conf_overrides``.

source: The entire repo build process is now idempotent. From now on when the repo build is re-run, it will only fetch updated git repositories and rebuild the wheels/venvs if the requirements have changed, or a new release is being deployed.
id: Seluruh proses pembuatan repo sekarang idempoten. Mulai sekarang ketika repo build dijalankan kembali (re-run), ia hanya akan mengambil repositori git yang diperbarui dan membangun kembali (rebuild) wheels/venvs jika persyaratan telah berubah, atau rilis baru sedang digunakan.

source: The env.d directory included with OpenStack-Ansible is now used as the first source for the environment skeleton, and ``/etc/openstack_deploy/env.d`` will be used only to override values. Deployers without customizations will no longer need to copy the env.d directory to /etc/openstack_deploy. As a result, the env.d copy operation has been removed from the node bootstrap role.
id: Direktori env.d yang disertakan dengan OpenStack-Ansible sekarang digunakan sebagai sumber pertama untuk kerangka lingkungan, dan ``/etc/openstack_deploy/env.d`` hanya akan digunakan untuk mengganti nilai. Deployer tanpa kustomisasi tidak perlu lagi menyalin direktori env.d ke /etc/openstack_deploy. Akibatnya, operasi copy env.d telah dihapus dari peran bootstrap node.

source: The environment variable ``FORKS`` is no longer used. The standard Ansible environment variable ``ANSIBLE_FORKS`` should be used instead.
id: Variabel lingkungan ``FORKS`` tidak lagi digunakan. Variabel lingkungan Ansible standar ``ANSIBLE_FORKS`` harus digunakan sebagai gantinya.

source: The environment variables added are:
id: Variabel lingkungan yang ditambahkan adalah:

source: The extra packages percona packages used by the ppc64le are now downloaded by the Ansible deployment host by default, as opposed to the target hosts. Once downloaded the packages are pushed up to the target hosts. This behaviour may be adjusted by setting ``galera_server_extra_package_downloader`` to ``target-host``. The packages are downloaded to the path set in ``galera_server_extra_package_path``.
id: Paket tambahan paket percona yang digunakan oleh ppc64le sekarang diunduh oleh host deployment Ansible secara default, sebagai lawan dari host target. Setelah diunduh, paket didorong ke host target. Perilaku ini dapat disesuaikan dengan mengatur ``galera_server_extra_package_downloader`` ke ``target-host``. Paket tersebut diunduh ke jalur yang ditetapkan ``galera_server_extra_package_path``.

source: The filename of the apt source can now be defined with the variable ``filename`` inside the dicts ``galera_repo`` and ``galera_percona_xtrabackup_repo``.
id: Nama file dari sumber apt sekarang dapat didefinisikan dengan variabel ``filename`` di dalam dict ``galera_repo`` dan ``galera_percona_xtrabackup_repo``.

source: The filename of the apt source for the haproxy ppa can now be defined with the ``filename`` section of the dict ``haproxy_repo``.
id: Nama file sumber apt untuk haproxy ppa sekarang dapat didefinisikan dengan bagian ``filename`` dict ``haproxy_repo``.

source: The filename of the apt source for the ubuntu cloud archive can now be defined with the variable ``uca_apt_source_list_filename``.
id: Nama file sumber apt untuk arsip cloud ubuntu sekarang dapat didefinisikan dengan variabel ``uca_apt_source_list_filename``.

source: The filename of the apt source for the ubuntu cloud archive used in ceph client can now be defined by giving a filename in the uca part of the dict ``ceph_apt_repos``.
id: Nama file sumber apt untuk arsip cloud ubuntu yang digunakan dalam ceph client sekarang dapat didefinisikan dengan memberikan nama file di bagian uca dict ``ceph_apt_repos``.

source: The filename of the apt/yum source can now be defined with the variable ``mariadb_repo_filename``.
id: Nama file dari sumber apt/yum sekarang dapat didefinisikan dengan variabel ``mariadb_repo_filename``.

source: The first release of the Red Hat Enterprise Linux 7 STIG was entirely renumbered from the pre-release versions. Many of the STIG configurations simply changed numbers, but some were removed or changed. A few new configurations were added as well.
id: Rilis pertama Red Hat Enterprise Linux 7 STIG sepenuhnya dinomori ulang dari versi pra-rilis. Banyak konfigurasi STIG hanya mengubah angka, tetapi beberapa dihapus atau diubah. Beberapa konfigurasi baru juga ditambahkan.

source: The first tier of the ``keystone_ldap`` dictionary variable now relates to the Keystone Domain name. An existing ``keystone_ldap`` configuration entry can be converted by renaming the ``ldap`` key to the domain name 'Default'. **Note** that the domain name entry is case-sensitive.
id: Tingkat pertama dari variabel kamus ``keystone_ldap`` sekarang berhubungan dengan nama Keystone Domain. Entri konfigurasi ``keystone_ldap`` yang ada dapat dikonversi dengan mengganti nama kunci ``ldap`` ke nama domain 'Default'. **Note** bahwa entri nama domain adalah peka huruf besar-kecil (case-sensitive).

source: The fix for the broken bind mounts in the galera container (see `bug 1609862 <https://launchpad.net/bugs/1609862>` for details) will be applied to the LXC container configuration file, but a restart of each galera container is required to put the change into effect.
id: Perbaikan untuk pemasangan bind yang rusak di kontainer galera (lihat `bug 1609862 <https://launchpad.net/bugs/1609862>` untuk detailnya) akan diterapkan pada file konfigurasi kontainer LXC, tetapi memulai kembali (restart) setiap kontainer galera diperlukan untuk memberlakukan perubahan.

source: The fix to remove deleted global override keys mistakenly deleted the ``container_cidr`` key. This was used by downstream consumers, and cannot be reconstructed with other information inside the inventory file. Regression tests were also added.
id: Perbaikan untuk menghapus kunci global override yang dihapus secara keliru menghapus kunci ``container_cidr``. Ini digunakan oleh konsumen hilir, dan tidak dapat direkonstruksi dengan informasi lain di dalam file inventory. Tes regresi juga ditambahkan.

source: The following Nova tunables have been removed, users need to start using the `nova_nova_conf_overrides` dictionary to override them. If those values were not previously overridden, there should be no need to override them. - nova_quota_cores - nova_quota_injected_file_content_bytes - nova_quota_injected_file_path_length - nova_quota_injected_files - nova_quota_instances - nova_quota_key_pairs - nova_quota_metadata_items - nova_quota_ram - nova_quota_server_group_members - nova_quota_server_groups - nova_max_instances_per_host - nova_scheduler_available_filters - nova_scheduler_weight_classes - nova_scheduler_driver - nova_scheduler_driver_task_period - nova_rpc_conn_pool_size - nova_rpc_thread_pool_size - nova_rpc_response_timeout - nova_force_config_drive - nova_enable_instance_password - nova_default_schedule_zone - nova_fatal_deprecations - nova_resume_guests_state_on_host_boot - nova_cross_az_attach - nova_remove_unused_resized_minimum_age_seconds - nova_cpu_model - nova_cpu_model_extra_flags
id: Nova tunables berikut telah dihapus, pengguna harus mulai menggunakan kamus `nova_nova_conf_overrides` untuk menimpanya. Jika nilai-nilai itu sebelumnya tidak diganti, seharusnya tidak perlu menimpa mereka. - nova_quota_cores - nova_quota_injected_file_content_bytes - nova_quota_injected_file_path_length - nova_quota_injected_files - nova_quota_instances - nova_quota_key_pairs - nova_quota_metadata_items - nova_quota_ram - nova_quota_server_group_members - nova_quota_server_groups - nova_max_instances_per_host - nova_scheduler_available_filters - nova_scheduler_weight_classes - nova_scheduler_driver - nova_scheduler_driver_task_period - nova_rpc_conn_pool_size - nova_rpc_thread_pool_size - nova_rpc_response_timeout - nova_force_config_drive - nova_enable_instance_password - nova_default_schedule_zone - nova_fatal_deprecations - nova_resume_guests_state_on_host_boot - nova_cross_az_attach - nova_remove_unused_resized_minimum_age_seconds - nova_cpu_model - nova_cpu_model_extra_flags

source: The following Nova variables have been removed because they have no effect in the current release of Nova. - nova_max_age - nova_osapi_compute_workers - nova_metadata_workers
id: Variabel Nova berikut telah dihapus karena tidak memiliki efek dalam rilis Nova saat ini. - nova_max_age - nova_osapi_compute_workers - nova_metadata_workers

source: The following headers were added as additional default (and static) values. `X-Content-Type-Options nosniff`, `X-XSS-Protection "1; mode=block"`, and `Content-Security-Policy "default-src 'self' https: wss:;"`. Additionally, the `X-Frame-Options DENY` header was added, defaulting to DENY. You may override the header via the `keystone_x_frame_options` variable.
id: Header berikut ditambahkan sebagai nilai default tambahan (dan statis). `X-Content-Type-Options nosniff`, `X-XSS-Protection "1; mode=block"`, dan `Content-Security-Policy "default-src 'self' https: wss:;"`. Selain itu, tajuk `X-Frame-Options DENY` telah ditambahkan, default ke DENY. Anda dapat mengganti header melalui variabel `keystone_x_frame_options`.

source: The following secrets are no longer used by OpenStack-Ansible and can be removed from user_secrets.yml:
id: Rahasia berikut tidak lagi digunakan oleh OpenStack-Ansible dan dapat dihapus dari user_secrets.yml:
