Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The role now supports using the distribution packages for the OpenStack services instead of the pip ones. This feature is disabled by default and can be enabled by simply setting the ``keystone_install_method`` variable to ``distro``.
id: Role sekarang mendukung menggunakan paket distribusi untuk layanan OpenStack bukan yang pip. Fitur ini dinonaktifkan secara default dan dapat diaktifkan hanya dengan mengatur variabel ``keystone_install_method`` menjadi ``distro``.

source: The role now supports using the distribution packages for the OpenStack services instead of the pip ones. This feature is disabled by default and can be enabled by simply setting the ``neutron_install_method`` variable to ``distro``.
id: Role sekarang mendukung menggunakan paket distribusi untuk layanan OpenStack bukan yang pip. Fitur ini dinonaktifkan secara default dan dapat diaktifkan hanya dengan mengatur variabel ``neutron_install_method`` menjadi ``distro``.

source: The role now supports using the distribution packages for the OpenStack services instead of the pip ones. This feature is disabled by default and can be enabled by simply setting the ``nova_install_method`` variable to ``distro``.
id: Peran sekarang mendukung menggunakan paket distribusi untuk layanan OpenStack bukan yang pip. Fitur ini dinonaktifkan secara default dan dapat diaktifkan hanya dengan mengatur variabel ``nova_install_method`` menjadi ``distro``.

source: The role now supports using the distribution packages for the OpenStack services instead of the pip ones. This feature is disabled by default and can be enabled by simply setting the ``octavia_install_method`` variable to ``distro``.
id: Role sekarang mendukung menggunakan paket distribusi untuk layanan OpenStack bukan yang pip. Fitur ini dinonaktifkan secara default dan dapat diaktifkan hanya dengan mengatur variabel ``octavia_install_method`` ke ``distro``.

source: The role now supports using the distribution packages for the OpenStack services instead of the pip ones. This feature is disabled by default and can be enabled by simply setting the ``swift_install_method`` variable to ``distro``.
id: Role sekarang mendukung menggunakan paket distribusi untuk layanan OpenStack bukan yang pip. Fitur ini dinonaktifkan secara default dan dapat diaktifkan hanya dengan mengatur variabel ``swift_install_method`` menjadi ``distro``.

source: The role now syncs the LXC packages down from COPR to each host and builds a local LXC package repository in `/opt/thm-lxc2.0`. This greatly reduces the amount of times that packages must be downloaded from the COPR server during deployments, which will reduce failures until the packages can be hosted with a more reliable source.
id: Role sekarang menyinkronkan paket LXC turun dari COPR ke setiap host dan membangun repositori paket LXC lokal di `/opt/thm-lxc2.0`. Ini sangat mengurangi jumlah paket yang harus diunduh dari server COPR selama penerapan, yang akan mengurangi kegagalan sampai paket dapat di-host dengan sumber yang lebih andal.

source: The role previously did not restart the audit daemon after generating a new rules file. The `bug <https://launchpad.net/bugs/1590916>`_ has been fixed and the audit daemon will be restarted after any audit rule changes.
id: Role sebelumnya tidak me-restart daemon audit setelah membuat file aturan baru. `bug <https://launchpad.net/bugs/1590916>`_ telah diperbaiki dan daemon audit akan dimulai kembali setelah ada perubahan peraturan audit.

source: The rsyslog.conf is now using v7+ style configuration settings
id: Rsyslog.conf sekarang menggunakan pengaturan konfigurasi style v7+

source: The rsyslog_client role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``rsyslog_client_package_state`` should be set to ``present``.
id: Role rsyslog_client selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``rsyslog_client_package_state`` harus diatur ke ``present``.

source: The rsyslog_client role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``rsyslog_client_package_state`` to ``present``.
id: Peran rsyslog_client sekarang mendukung kemampuan untuk mengkonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket tersebut hadir dengan mengatur ``rsyslog_client_package_state`` ke ``present``.

source: The rsyslog_server role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``rsyslog_server_package_state`` should be set to ``present``.
id: Role rsyslog_server selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``rsyslog_server_package_state`` harus diatur ke ``present``.

source: The rsyslog_server role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``rsyslog_server_package_state`` to ``present``.
id: Role rsyslog_server sekarang mendukung kemampuan untuk mengkonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``rsyslog_server_package_state`` ke ``present``.

source: The security role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``security_package_state`` should be set to ``present``.
id: Role keamanan selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``security_package_state`` harus diatur ke ``present``.

source: The security role now handles ``ssh_config`` files that contain ``Match`` stanzas. A marker is added to the configuration file and any new configuration items will be added below that marker. In addition, the configuration file is validated for each change to the ssh configuration file.
id: Role keamanan sekarang menangani file ``ssh_config`` yang berisi stanzas ``Match``. Marker ditambahkan ke file konfigurasi dan setiap item konfigurasi baru akan ditambahkan di bawah marker itu. Selain itu, file konfigurasi divalidasi untuk setiap perubahan ke file konfigurasi ssh.

source: The security role now has tasks that will disable the graphical interface on a server using upstart (Ubuntu 14.04) or systemd (Ubuntu 16.04 and CentOS 7). These changes take effect after a reboot.
id: Role keamanan sekarang memiliki tugas yang akan menonaktifkan antarmuka grafis pada server menggunakan upstart (Ubuntu 14.04) atau systemd (Ubuntu 16.04 dan CentOS 7). Perubahan ini mulai berlaku setelah reboot.

source: The security role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``security_package_state`` to ``present``.
id: Role keamanan sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``security_package_state`` ke ``present``.

source: The security role previously set the permissions on all audit log files in ``/var/log/audit`` to ``0400``, but this prevents the audit daemon from writing to the active log file. This will prevent ``auditd`` from starting or restarting cleanly.
id: Role keamanan sebelumnya mengatur izin pada semua file log audit di ``/var/log/audit`` ke ``0400``, tetapi ini mencegah daemon audit agar tidak menulis ke file log aktif. Ini akan mencegah ``auditd`` dari memulai atau memulai ulang dengan bersih.

source: The security role will accept the currently installed version of a package rather than attempting to update it. This reduces unexpected changes on the system from subsequent runs of the security role. Deployers can still set ``security_package_state`` to ``latest`` to ensure that all packages installed by the security role are up to date.
id: Peran keamanan akan menerima versi paket yang saat ini diinstal daripada mencoba memperbaruinya. Ini mengurangi perubahan tak terduga pada sistem dari menjalankan peran keamanan selanjutnya. Deployer masih dapat mengatur ``security_package_state`` ke `` atest`` untuk memastikan bahwa semua paket yang diinstal oleh role keamanan adalah yang terbaru.

source: The security role will no longer fix file permissions and ownership based on the contents of the RPM database by default. Deployers can opt in for these changes by setting ``security_reset_perm_ownership`` to ``yes``.
id: Role keamanan tidak akan lagi memperbaiki izin file dan kepemilikan berdasarkan isi dari database RPM secara default. Deployer dapat ikut serta dalam perubahan ini dengan mengatur ``security_reset_perm_ownership`` ke ``yes``.

source: The security-hardening playbook hosts target can now be filtered using the ``security_host_group`` var.
id: Target host security-hardening playbook sekarang dapat difilter menggunakan var ``security_host_group``.

source: The service setup in keystone for aodh will now be executed through delegation to the ``aodh_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk aodh sekarang akan dieksekusi melalui delegasi dimana ``aodh_service_setup_host``, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service setup in keystone for barbican will now be executed through delegation to the ``barbican_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk barbican sekarang akan dieksekusi melalui delegasi ke dimana ``barbican_service_setup_host``, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service setup in keystone for ceilometer will now be executed through delegation to the ``ceilometer_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk ceilometer sekarang akan dieksekusi melalui delegasi dimana ``ceilometer_service_setup_host``, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service setup in keystone for cinder will now be executed through delegation to the ``cinder_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk cinder sekarang akan dieksekusi melalui delegasi dimana ``cinder_service_setup_host`` yang, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service setup in keystone for cloudkitty will now be executed through delegation to the ``cloudkitty_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk cloudkitty sekarang akan dieksekusi melalui delegasi ke ``cloudkitty_service_setup_host`` yang, secara default, adalah ``localhost`` (host penyebaran). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan penggantian berikut di ``user_variables.yml``.

source: The service setup in keystone for designate will now be executed through delegation to the ``designate_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk ditunjuk sekarang akan dieksekusi melalui delegasi dimana ``designate_service_setup_host``, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service setup in keystone for glance will now be executed through delegation to the ``glance_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk sekilas sekarang akan dieksekusi melalui delegasi dimana ``glance_service_setup_host``, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service setup in keystone for gnocchi will now be executed through delegation to the ``gnocchi_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk gnocchi sekarang akan dieksekusi melalui delegasi ke `` gnocchi_service_setup_host`` yang, secara default, adalah `` localhost`` (host penyebaran). Deployer dapat memilih untuk mengubah ini ke wadah utilitas dengan mengimplementasikan penggantian berikut di `` user_variables.yml``.

source: The service setup in keystone for heat will now be executed through delegation to the ``heat_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk panas sekarang akan dieksekusi melalui delegasi ke `` heat_service_setup_host`` yang, secara default, adalah `` localhost`` (host penyebaran). Deployer dapat memilih untuk mengubah ini ke wadah utilitas dengan mengimplementasikan penggantian berikut di `` user_variables.yml``.

source: The service setup in keystone for horizon will now be executed through delegation to the ``horizon_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk horizon sekarang akan dieksekusi melalui delegasi dimana ``horizon_service_setup_host``, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service setup in keystone for ironic will now be executed through delegation to the ``ironic_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk ironic sekarang akan dieksekusi melalui delegasi dimana ``ironic_service_setup_host``, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service setup in keystone for magnum will now be executed through delegation to the ``magnum_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk magnum sekarang akan dieksekusi melalui delegasi ke `` magnum_service_setup_host`` yang, secara default, adalah `` localhost`` (host penyebaran). Deployer dapat memilih untuk mengubah ini ke wadah utilitas dengan mengimplementasikan penggantian berikut di `` user_variables.yml``.

source: The service setup in keystone for neutron will now be executed through delegation to the ``neutron_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk neutron sekarang akan dieksekusi melalui delegasi dimana ``neutron_service_setup_host``, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service setup in keystone for nova will now be executed through delegation to the ``nova_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk nova sekarang akan dieksekusi melalui delegasi dimana ``nova_service_setup_host``, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service setup in keystone for octavia will now be executed through delegation to the ``octavia_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk octavia sekarang akan dieksekusi melalui delegasi dimana ``octavia_service_setup_host``, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service setup in keystone for sahara will now be executed through delegation to the ``sahara_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk sahara sekarang akan dieksekusi melalui delegasi dimana ``sahara_service_setup_host``, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service setup in keystone for swift will now be executed through delegation to the ``swift_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk swift sekarang akan dieksekusi melalui delegasi dimana ``swift_service_setup_host``, secara default, adalah ``localhost``(the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service setup in keystone for tempest will now be executed through delegation to the ``tempest_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pengaturan layanan dalam keystone untuk prahara sekarang akan dijalankan melalui delegasi dimana ``tempest_service_setup_host`` yang, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The service updates for keystone will now be executed through delegation to the ``keystone_service_setup_host`` which, by default, is ``localhost`` (the deploy host). Deployers can opt to rather change this to the utility container by implementing the following override in ``user_variables.yml``.
id: Pembaruan layanan untuk keystone sekarang akan dieksekusi melalui delegasi ke dimana ``keystone_service_setup_host``, secara default, adalah ``localhost`` (the deploy host). Deployer dapat memilih untuk mengubah ini ke kontainer utilitas dengan mengimplementasikan override berikut di ``user_variables.yml``.

source: The standard collectstatic and compression process in the os_horizon role now happens after horizon customizations are installed, so that all static resources will be collected and compressed.
id: Proses pengumpulan dan kompresi standar dalam role os_horizon sekarang terjadi setelah penyesuaian horizon diinstal, sehingga semua sumber daya statis akan dikumpulkan dan dikompresi.

source: The supported upgrade path from Xenial to Bionic is via re-installation of the host OS across all nodes and redeployment of the required services. The Rocky branch of OSA is intended as the transition point for such upgrades from Xenial to Bionic. At this time there is no support for in-place operating system upgrades (typically via ``do-release-upgrade``).
id: Path upgrade yang didukung dari Xenial ke Bionic adalah melalui re-installation OS host di semua node dan redeployment layanan yang diperlukan. Branch Rocky dari OSA dimaksudkan sebagai titik transisi untuk upgrade dari Xenial ke Bionic. Saat ini tidak ada dukungan untuk upgrade sistem operasi in-place (biasanya melalui ``do-release-upgrade``).
