Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The variables ``gnocchi_requirements_git_repo`` and ``gnocchi_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``gnocchi_requirements_git_repo`` dan ``gnocchi_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``haproxy_keepalived_(internal|external)_cidr`` now has a default set to ``169.254.(2|1).1/24``. This is to prevent Ansible undefined variable warnings. Deployers must set values for these variables for a working haproxy with keepalived environment when using more than one haproxy node.
id: Variabel ``haproxy_keepalived_(internal|external)_cidr`` sekarang memiliki pengaturan default ke ``169.254.(2|1).1/24``. Ini untuk mencegah peringatan variabel yang tidak terdefinisi Ansible. Deployer harus menetapkan nilai variabel ini untuk haproxy yang berfungsi dengan lingkungan keepalived ketika menggunakan lebih dari satu node haproxy.

source: The variables ``heat_requirements_git_repo`` and ``heat_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``heat_requirements_git_repo`` dan ``heat_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``horizon_requirements_git_repo`` and ``horizon_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``horizon_requirements_git_repo`` dan ``horizon_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``ironic_requirements_git_repo`` and ``ironic_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``ironic_requirements_git_repo`` dan ``ironic_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``keystone_apache_enabled`` and ``keystone_mod_wsgi_enabled`` have been removed and replaced with a single variable ``keystone_web_server`` to optionally set the web server used for keystone.
id: Variabel ``keystone_apache_enabled`` dan ``keystone_mod_wsgi_enabled`` telah dihapus dan diganti dengan variabel tunggal ``keystone_web_server`` untuk secara opsional mengatur server web yang digunakan untuk keystone.

source: The variables ``keystone_memcached_servers`` and ``keystone_cache_backend_argument`` have been deprecated in favor of ``keystone_cache_servers``, a list of servers for caching purposes.
id: Variabel ``keystone_memcached_servers`` dan ``keystone_cache_backend_argument`` telah tidak digunakan lagi mendukung ``keystone_cache_servers``, daftar server untuk tujuan caching.

source: The variables ``keystone_requirements_git_repo`` and ``keystone_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``keystone_requirements_git_repo`` dan ``keystone_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file the upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``magnum_requirements_git_repo`` and ``magnum_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel `` magnum_requirements_git_repo`` dan ``magnum_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file the upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``neutron_requirements_git_repo`` and ``neutron_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``neutron_requirements_git_repo`` dan ``neutron_requirements_git_install_branch`` telah dihapus karena menggunakan URL / path ke file batasan atas menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``nova_lxd_requirements_git_repo`` and ``nova_lxd_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``nova_lxd_requirements_git_repo`` dan ``nova_lxd_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file the upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``nova_requirements_git_repo`` and ``nova_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``nova_requirements_git_repo`` dan ``nova_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file the upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``nova_scheduler_use_baremetal_filters`` and ``nova_metadata_host`` have been removed, matching upstream nova changes. The ``nova_virt_types`` dict no longer needs the ``nova_scheduler_use_baremetal_filters`` and ``nova_firewall_driver`` keys as well.
id: Variabel ``nova_scheduler_use_baremetal_filters`` dan ``nova_metadata_host`` telah dihapus, sesuai dengan perubahan nova hulu. Pustaka ``nova_virt_types`` tidak lagi membutuhkan kunci ``nova_scheduler_use_baremetal_filters`` dan juga ``nova_firewall_driver``.

source: The variables ``rally_requirements_git_repo`` and ``rally_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``rally_requirements_git_repo`` dan ``rally_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file the upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``sahara_requirements_git_repo`` and ``sahara_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``sahara_requirements_git_repo`` dan ``sahara_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file the upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``swift_requirements_git_repo`` and ``swift_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``swift_requirements_git_repo`` dan ``swift_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file the upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``tempest_requirements_git_repo`` and ``tempest_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``tempest_requirements_git_repo`` dan ``tempest_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file the upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``trove_requirements_git_repo`` and ``trove_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``trove_requirements_git_repo`` dan ``trove_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file the upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables beginning with ``openstack_host_systat_`` in the openstack_hosts role have been renamed to ``openstack_host_sysstat_``. This was done to better reflect their dependency to sysstat.
id: Variabel yang dimulai dengan ``openstack_host_systat_`` dalam peran openstack_hosts telah diubah namanya menjadi ``openstack_host_sysstat_``. Ini dilakukan untuk lebih mencerminkan ketergantungan mereka pada sysstat.

source: The variables used to produce the ``/etc/openstack-release`` file have been changed in order to improve consistency in the name spacing according to their purpose.
id: Variabel yang digunakan untuk menghasilkan file ``/etc/openstack-release`` telah diubah untuk meningkatkan konsistensi dalam spasi nama (name spacing) sesuai dengan tujuannya.

source: The vars plugin ``override_folder.py`` has been removed. With the move to Ansible 2.4 ["https://review.openstack.org/#/c/522778"] this plugin is no longer required. The functionality this plugin provided has been replaced with the native Ansible inventory plugin.
id: Plugin vars ``override_folder.py`` telah dihapus. Dengan pindah ke Ansible 2.4 ["https://review.openstack.org/#/c/522778"] plugin ini tidak lagi diperlukan. Fungsionalitas yang disediakan plugin ini telah diganti dengan plugin inventory native Ansible.

source: The vars to set ``source_sample_interval`` for the ``os_ceilometer`` role are deprecated and will be removed in the Queen cycle. To override these variables after Queen, utilize the ``ceilometer_pipeline_yaml_overrides`` file.
id: Vars untuk mengatur ``source_sample_interval`` untuk peran ``os_ceilometer`` sudah usang dan akan dihapus dalam siklus Queen. Untuk mengganti variabel ini setelah Queen, gunakan file ``ceilometer_pipeline_yaml_overrides``.

source: The version of Erlang is kept constant using yum's versionlock plugin.
id: Versi Erlang dijaga konstan menggunakan plugin versionlock yum.

source: The watcher dashboard is available in Horizon. Deployers can enable the panel by setting the following Ansible variable:
id: Dasbor watcher tersedia di Horizon. Deployer dapat mengaktifkan panel dengan mengatur variabel Ansible berikut:

source: The workaround of requiring the addition of gnocchiclient to the ``repo_build_upper_constraints_overrides`` variable is no longer required. The appropriate constraints have been implemented as a global pin.
id: Penyelesaian yang membutuhkan penambahan gnocchiclient ke variabel ``repo_build_upper_constraints_overrides`` tidak lagi diperlukan. Kendala yang sesuai telah diterapkan sebagai pin global.

source: The zun dashboard is available in Horizon. Deployers can enable the panel by setting the following Ansible variable:
id: Dasbor zun tersedia di Horizon. Deployer dapat mengaktifkan panel dengan mengatur variabel Ansible berikut:

source: There is a bug in the version of keepalived which ships with Ubuntu 14.04 which results in all backup nodes having the same priority. This causes the automatic failover to fail when more than two keepalived hosts are configured. To work around this issue it is recommended that deployers limit the number of keepalived hosts to no more than two, or that each host is configured with different priorities.
id: Ada bug dalam versi keepalived yang dikirimkan bersama Ubuntu 14.04 yang menghasilkan semua node cadangan yang memiliki prioritas yang sama. Hal ini menyebabkan automatic failover gagal ketika lebih dari dua host yang disimpan tetap dikonfigurasi. Untuk mengatasi masalah ini, disarankan bahwa para deployer membatasi jumlah host yang disimpan tidak lebih dari dua, atau bahwa setiap host dikonfigurasi dengan prioritas yang berbeda.

source: There is a new default configuration for keepalived, supporting more than 2 nodes.
id: Ada konfigurasi default baru untuk keepalived, mendukung lebih dari 2 node.

source: There is a new default configuration for keepalived. When running the haproxy playbook, the configuration change will cause a keepalived restart unless the deployer has used a custom configuration file. The restart will cause the virtual IP addresses managed by keepalived to be briefly unconfigured, then reconfigured.
id: Ada konfigurasi default baru untuk keepalived. Saat menjalankan haproxy playbook, perubahan konfigurasi akan menyebabkan restart tetap hidup kecuali jika deployer telah menggunakan file konfigurasi kustom. Restart akan menyebabkan alamat IP virtual yang dikelola oleh keepalived secara singkat tidak dikonfigurasi, kemudian dikonfigurasi ulang.

source: There is currently an Ansible bug in regards to ``HOSTNAME``. If the host ``.bashrc`` holds a var named ``HOSTNAME``, the container where the ``lxc_container`` module attaches will inherit this var and potentially set the wrong ``$HOSTNAME``. See `the Ansible fix <https://github.com/ansible/ansible/pull/22246>`_ which will be released in Ansible version 2.3.
id: Saat ini ada bug Ansible terkait ``HOSTNAME``. Jika host ``.bashrc`` memegang var bernama ``HOSTNAME``, kontainer tempat modul ``lxc_container`` dilampirkan akan mewarisi var ini dan berpotensi mengatur ``$HOSTNAME`` yang salah. Lihat `the Ansible fix <https://github.com/ansible/ansible/pull/22246>` _ yang akan dirilis dalam versi Ansible 2.3.

source: There is now a fix in place that ensures any sysctl configuration with ``enabled: no`` will be skipped and the configuration will be left unaltered on the system.
id: Sekarang ada perbaikan di tempat yang memastikan konfigurasi sysctl dengan ``enabled: no`` akan dilewati dan konfigurasi akan dibiarkan tidak diubah pada sistem.

source: There is now experimental support to deploy OpenStack-Ansible on CentOS 7 for both development and test environments.
id: Sekarang ada dukungan eksperimental untuk menggunakan OpenStack-Ansible di CentOS 7 untuk pengembangan dan lingkungan pengujian.

source: There was previously an environment variable (``ANSIBLE_ROLE_FETCH_MODE``) to set whether the roles in ansible-role-requirements.yml were fetched using ansible-galaxy or using git, however the default has been git for some time ansible since the use of the ``ceph-ansible`` respoitory for ceph deployment, using ansible-galaxy to download the roles does not work properly. This functionality has therefore been removed.
id: Sebelumnya ada variabel lingkungan (``ANSIBLE_ROLE_FETCH_MODE``) untuk mengatur apakah role dalam ansible-role-requirements.yml diambil menggunakan ansible-galaxy atau menggunakan git, namun defaultnya telah git selama beberapa waktu ansible karena penggunaan respoitory ``ceph-ansible`` untuk deployment ceph, menggunakan ansible-galaxy untuk mengunduh role tidak berfungsi dengan baik. Fungsi ini karenanya telah dihapus.

source: These kernel parameters are now set to ``1`` on all hosts by the ``openstack_hosts`` role, which ensures that bridge traffic is always sent through iptables.
id: Parameter kernel ini sekarang disetel ke ``1`` pada semua host oleh role ``openstack_hosts``, yang memastikan bahwa lalu lintas jembatan (bridge traffic) selalu dikirim melalui iptables.

source: This also allows the initialization to become a blocking process and Ansible will wait for the initialization to complete prior to running the next task.
id: Ini juga memungkinkan inisialisasi menjadi proses pemblokiran dan Ansible akan menunggu inisialisasi selesai sebelum menjalankan tugas berikutnya.

source: This consolidates the amphora image tasks in a common file and adds a way to download an amphora image from an artefact storage over http(s). With the Octavia team providing test images the tests were modified to not build images any longer but download them.
id: Ini mengkonsolidasikan tugas image amphora dalam file umum dan menambahkan cara untuk mengunduh image amphora dari penyimpanan artefak melalui http(s). Dengan tim Octavia yang menyediakan image uji, pengujian tersebut dimodifikasi untuk tidak membuat image lagi tetapi mengunduhnya.

source: This has been resolved by introducing a /dev/random and /dev/urandom inside the chroot-ed environment.
id: Ini telah diselesaikan dengan memperkenalkan /dev/random dan /dev/urandom di dalam lingkungan chroot-ed.

source: This issue can be resolved either by upgrading the environment to a recent OpenStack-Ansible Ocata release, or by doing the following.
id: Masalah ini dapat diatasi dengan memutakhirkan lingkungan ke rilis OpenStack-Ansible Ocata terbaru, atau dengan melakukan hal berikut.

source: This issue has been resolved in the 14.2.15 release.
id: Masalah ini telah diatasi dalam rilis 14.2.15.

source: This issue has been resolved in the 15.1.17 release.
id: Masalah ini telah diatasi dalam rilis 15.1.17.

source: This issue has been resolved in the 16.0.8 release.
id: Masalah ini telah diatasi dalam rilis 16.0.8.

source: This results in any upgrades to the newton software to never end up running the version of neutron software as intended. This can be seen by observing that the running processes are still using the older software venv.
id: Ini menghasilkan setiap upgrade ke perangkat lunak newton agar tidak pernah menjalankan versi perangkat lunak neutron sebagaimana dimaksud. Ini dapat dilihat dengan mengamati bahwa proses yang berjalan masih menggunakan perangkat lunak yang lebih lama.

source: This role assumes that there is a network named "public|private" and a subnet named "public|private-subnet". These names are made configurable by the addition of two sets of variables; ``tempest_public_net_name`` and ``tempest_public_subnet_name`` for public networks and ``tempest_private_net_name`` and ``tempest_private_subnet_name`` for private networks This addresses `bug 1588818 <https://bugs.launchpad.net/openstack-ansible/+bug/1588818>`_
id: Role ini mengasumsikan bahwa ada jaringan bernama "public|private" dan subnet bernama "public|private-subnet". Nama ini dibuat dapat dikonfigurasi dengan penambahan dua set variabel; ``tempest_public_net_name`` dan ``tempest_public_subnet_name`` untuk jaringan publik dan ``tempest_private_net_name`` dan ``tempest_private_subnet_name`` untuk jaringan pribadi. Alamat ini `bug 1588818 <https://bugs.launchpad.net/openstack-ansible/+bug/1588818>`_

source: This role now optionally enables your compute nodes' KVM kernel module nested virtualization capabilities, by setting nova_nested_virt_enabled to true. Depending on your distribution and libvirt version, you might need to set additional variables to fully enabled nested virtualization. For details, please see https://docs.openstack.org/nova/latest/admin/configuration/hypervisor-kvm.html#nested-guest-support.
id: Role ini sekarang secara opsional memungkinkan node komputasi Anda punya kemampuan virtualisasi tersarang modul kernel KVM, dengan mengatur nova_nested_virt_enabled menjadi true. Bergantung pada distribusi dan versi libvirt Anda, Anda mungkin perlu mengatur variabel tambahan untuk virtualisasi bersarang (nested) yang diaktifkan sepenuhnya. Untuk detailnya, silakan lihat https://docs.openstack.org/nova/latest/admin/configuration/hypervisor-kvm.html#nested-guest-support.

source: This upgrade task is related to `bug 1582279 <https://bugs.launchpad.net/openstack-ansible/+bug/1582279>`_.
id: Tugas pemutakhiran ini terkait dengan `bug 1582279 <https://bugs.launchpad.net/openstack-ansible/+bug/1582279>`_.

source: This upgrade task is related to `bug 1594584 <https://bugs.launchpad.net/openstack-ansible/+bug/1594584>`_.
id: Tugas pemutakhiran ini terkait dengan `bug 1594584 <https://bugs.launchpad.net/openstack-ansible/+bug/1594584>`_.

source: This version is the minimum version necessary to upgrade from Pike to Queens for deployers using ANSIBLE_ROLE_FETCH_MODE="git-clone".
id: Versi ini adalah versi minimum yang diperlukan untuk meningkatkan dari Pike ke Queens untuk deployer menggunakan ANSIBLE_ROLE_FETCH_MODE="git-clone".

source: This will also cause the old error logs in ``/var/log/mysql_logs`` in the container to become unavailable since the new bind mount is mounted on top of the existing logs directory within the container. If these logs are critical for a deployer to keep, the deployer should:
id: Ini juga akan menyebabkan log kesalahan lama di ``/var/log/mysql_logs`` dalam kontainer menjadi tidak tersedia karena bind mount baru dipasang di atas direktori log yang ada di dalam kontainer. Jika log ini penting untuk disimpan oleh seorang deployer, deployer harus:

source: To ensure the deployment system remains clean the Ansible execution environment is contained within a virtual environment. The virtual environment is created at "/opt/ansible-runtime" and the "ansible.*" CLI commands are linked within /usr/local/bin to ensure there is no interruption in the deployer workflow.
id: Untuk memastikan sistem deployment tetap bersih, lingkungan eksekusi Ansible termuat dalam lingkungan virtual. Lingkungan virtual dibuat di "/opt/ansible-runtime" dan "ansible.*" Perintah CLI ditautkan dalam /usr/local/bin untuk memastikan tidak ada gangguan dalam alur kerja penggunaan.

source: To fix this issue the ``pip.conf`` file needs to be removed from all repository servers. The upgrade playbook ``repo-server-pip-conf-removal.yml`` will remove the pip.conf file from the repository servers if it's found.
id: Untuk memperbaiki masalah ini, file ``pip.conf`` perlu dihapus dari semua server repositori. Upgrade playbook ``repo-server-pip-conf-removal.yml`` akan menghapus file pip.conf dari server repositori jika ditemukan.

source: To provide compatibility with Centos-8 the LXC cache preparation has been greatly simplified to remove the requirement for machinectl and btrfs, which is a combination not available on Centos-8. This has the side effect of machinectl no longer being a supported backing store for LXC.
id: Untuk memberikan kompatibilitas dengan Centos-8 persiapan cache LXC telah sangat disederhanakan untuk menghapus persyaratan untuk machinectl dan btrfs, yang merupakan kombinasi yang tidak tersedia pada Centos-8. Ini memiliki efek samping dari machinectl tidak lagi menjadi supported backing store untuk LXC.

source: To work around this issue, the recommendation is to set the following overrides in ``/etc/openstack_deploy/user_variables.yml`` to ensure that the last known good version of MariaDB is used.
id: Untuk mengatasi masalah ini, rekomendasinya adalah mengatur override berikut di ``/etc/openstack_deploy/user_variables.yml`` untuk memastikan bahwa versi MariaDB yang baik dan terakhir diketahui digunakan.

source: Train Series Release Notes
id: Catatan Rilis Seri Train

source: Two Neutron variables have been deprecated and are now removed from OpenStack-Ansible - ``neutron_l3_router_delete_namespaces`` and ``neutron_dhcp_delete_namespaces``.
id: Dua variabel Neutron telah ditinggalkan dan sekarang dihapus dari OpenStack-Ansible - ``neutron_l3_router_delete_namespaces`` dan ``neutron_dhcp_delete_namespaces``.
