Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: **NOTE:** This fix is partially applied for existing OpenStack-Ansible deployments. See the upgrade section of the release notes for the work required to fully apply the fix.
id: **NOTE:*** Perbaikan ini sebagian diterapkan untuk penerapan OpenStack-Ansible yang ada. Lihat bagian upgrade dari catatan rilis untuk pekerjaan yang diperlukan untuk menerapkan perbaikan sepenuhnya.

source: **This is a breaking change for existing CentOS deployments.** The ``yum`` package manager will have errors when it finds that certain packages that it installed from EPEL are no longer available. Deployers may need to rebuild container or reinstall packages to complete this change.
id: **This is a breaking change for existing CentOS deployments.** Manajer paket ``yum`` akan memiliki kesalahan ketika menemukan bahwa paket tertentu yang diinstal dari EPEL tidak lagi tersedia. Deployer mungkin perlu membangun kembali kontainer atau menginstal ulang paket untuk menyelesaikan perubahan ini.

source: **lxc_cache_validate_certs**: Removed because the Ansible ``get_url`` module is no longer used.
id: **lxc_cache_validate_certs **: Dihapus karena modul ``get_url`` Ansible tidak lagi digunakan.

source: **lxc_container_base_delete**: Removed because the cache will be refreshed upon role execution.
id: **lxc_container_base_delete **: Dihapus karena cache akan di-refresh setelah eksekusi peran.

source: **lxc_container_caches**: Removed because the container create process will build a cached image based on the host OS.
id: **lxc_container_caches **: Dihapus karena proses pembuatan kontainer akan membangun image yang di-cache berdasarkan OS host.

source: **lxc_container_release**: Removed because image is now tied with the host operating system.
id: **lxc_container_release **: Dihapus karena image sekarang diikat dengan sistem operasi host.

source: **lxc_container_template**: Removed because the template option is now contained within the operating system specific variable file loaded at runtime.
id: **lxc_container_template**: Dihapus karena opsi templat sekarang terdapat dalam file variabel sistem operasi spesifik yang dimuat saat runtime.

source: **lxc_container_template_main_apt_repo**: Removed because this option is now being set within the cache creation process and is no longer needed here.
id: ** lxc_container_template_main_apt_repo **: Dihapus karena opsi ini sekarang sedang diatur dalam proses pembuatan cache dan tidak lagi diperlukan di sini.

source: **lxc_container_template_options**: This option was renamed to *lxc_cache_download_template_options*. The deprecation filter was not used because the values provided from this option have been fundamentally changed and potentially old overrides will cause problems.
id: **lxc_container_template_options**: Opsi ini diubah namanya menjadi *lxc_cache_download_template_options*. Filter penghentian tidak digunakan karena nilai yang disediakan dari opsi ini telah diubah secara mendasar dan berpotensi penggantian yang lama akan menyebabkan masalah.

source: **lxc_container_template_options**: This option was renamed to *lxc_container_download_template_options*. The deprecation filter was not used because the values provided from this option have been fundamentally changed and old overrides will cause problems.
id: **lxc_container_template_options**: Opsi ini diubah namanya menjadi *lxc_container_download_template_options*. Filter penghentian tidak digunakan karena nilai yang disediakan dari opsi ini telah diubah secara mendasar dan penggantian yang lama akan menyebabkan masalah.

source: **lxc_container_template_security_apt_repo**: Removed because this option is now being set within the cache creation process and is no longer needed here.
id: **lxc_container_template_security_apt_repo**: Dihapus karena opsi ini sekarang sedang diatur dalam proses pembuatan cache dan tidak lagi diperlukan di sini.

source: **lxc_container_user_name**: Removed because the default users are no longer created when the cached image is created.
id: **lxc_container_user_name**: Dihapus karena pengguna default tidak lagi dibuat ketika image yang di-cache dibuat.

source: **lxc_container_user_password**: Removed because the default lxc container user is no longer created by the lxc container template.
id: **lxc_container_user_password**: Dihapus karena pengguna kontainer lxc default tidak lagi dibuat oleh template kontainer lxc.

source: **lxc_container_user_password**: Removed because the default users are no longer created when the cached image is created.
id: **lxc_container_user_password**: Dihapus karena pengguna default tidak lagi dibuat ketika image yang di-cache dibuat.

source: A bug that caused the Keystone credential keys to be lost when the playbook is run during a rebuild of the first Keystone container has been fixed. Please see launchpad bug 1667960 for more details.
id: Bug yang menyebabkan kunci kredensial (credential key) Keystone hilang saat playbook dijalankan selama pembangunan kembali kontainer Keystone pertama telah diperbaiki. Silakan lihat launchpad bug 1667960 untuk lebih jelasnya.

source: A conditional has been added to the ``_local_ip`` settings used in the ``neutron_local_ip`` which removes the hard requirement for an overlay network to be set within a deployment. If no overlay network is set within the deployment the ``local_ip`` will be set to the value of "ansible_ssh_host".
id: Sebuah kondisional telah ditambahkan ke pengaturan ``_local_ip`` yang digunakan dalam ``neutron_local_ip`` yang menghilangkan persyaratan sulit untuk jaringan overlay yang akan diatur dalam penyebaran. Jika tidak ada jaringan overlay yang diatur dalam penyebaran, ``local_ip`` akan ditetapkan ke nilai "ansible_ssh_host".

source: A new LXC container template has been added which will allow us to better manage containers on the host machines we support. The new template uses the `machinectl` command to create container rootfs using the existing cache. This in-turn will provide easier management of container images, faster build times, and the ability to instantly clone a container (or a given variant) without impacting a containers state. This new lxc container create template, and the features it provides, will only impact new containers created allowing deployers to safely adopt this change in any existing environment.
id: Template kontainer LXC baru telah ditambahkan yang akan memungkinkan kami untuk mengelola kontainer dengan lebih baik pada mesin host yang kami dukung. Template baru menggunakan perintah `machinectl` untuk membuat rootfs kontainer menggunakan cache yang ada. Pada gilirannya ini akan memberikan pengelolaan image kontainer yang lebih mudah, waktu pembuatan yang lebih cepat, dan kemampuan untuk mengkloning kontainer secara kesetika (atau varian yang diberikan) tanpa memengaruhi keadaan kontainer. Kontainer lxc baru ini membuat template, dan fitur-fitur yang disediakannya, hanya akan berdampak pada kontainer baru yang dibuat yang memungkinkan penyebar untuk secara aman mengadopsi perubahan ini di lingkungan yang ada.

source: A new ``heat_api`` container is created with all heat services running in it. The previously implemented ``heat_apis_container`` and ``heat_engine_container`` can be removed.
id: Kontainer ``heat_api`` baru dibuat dengan semua layanan heat berjalan di dalamnya. ``heat_apis_container`` dan ``heat_engine_container` yang sebelumnya dijalankan dapat dihapus.

source: A new configuration parameter ``security_ntp_bind_local_interfaces`` was added to the security role to restrict the network interface to which chronyd will listen for NTP requests.
id: Parameter konfigurasi baru ``security_ntp_bind_local_interfaces`` telah ditambahkan ke peran keamanan untuk membatasi antarmuka jaringan yang chronyd akan mendengarkan permintaan NTP.

source: A new database called `nova_api` has been created. This database has its own user credentials and nova-manage db sync process. For the database password there is a new variable entry in `user_secrets.yml` called ``nova_api_container_mysql_password``.
id: Database baru bernama `nova_api` telah dibuat. Database ini memiliki kredensial pengguna sendiri dan proses sinkronisasi db nova-manage. Untuk kata sandi basis data ada entri variabel baru di `user_secrets.yml` yang disebut ``nova_api_container_mysql_password``.

source: A new debug flag has been added to ``dynamic_inventory.py``. This should make it easier to understand what's happening with the inventory script, and provide a way to gather output for more detailed bug reports. See the developer docs for more details.
id: Flag debug baru telah ditambahkan ke ``dynamic_inventory.py``. Ini akan membuatnya lebih mudah untuk memahami apa yang terjadi dengan skrip inventaris, dan menyediakan cara untuk mengumpulkan output untuk laporan bug yang lebih rinci. Lihat dokumen pengembang untuk detail lebih lanjut.

source: A new global option to control all package install states has been implemented. The default action for all distribution package installations is to ensure that the latest package is installed. This may be changed to only verify if the package is present by setting ``package_state`` to ``present``.
id: Opsi global baru untuk mengontrol semua status instalasi paket telah diterapkan. Tindakan default untuk semua instalasi paket distribusi adalah untuk memastikan bahwa paket terbaru diinstal. Ini dapat diubah menjadi hanya memverifikasi jika paket hadir dengan mengatur ``package_state`` ke ``present``.

source: A new global variable has been created named ``openstack_domain``. This variable has a default value of "openstack.local".
id: Variabel global baru telah dibuat bernama ``openstack_domain``. Variabel ini memiliki nilai default "openstack.local".

source: A new nova admin endpoint will be registered with the suffix ``/v2.1/%(tenant_id)s``. The nova admin endpoint with the suffix ``/v2/%(tenant_id)s`` may be manually removed.
id: Endpoint admin nova baru akan didaftarkan dengan akhiran ``/v2.1/%(tenant_id)s``. Endpoint admin nova dengan akhiran ``/v2/%(tenant_id)s`` dapat dihapus secara manual.

source: A new option `swift_pypy_archive` has been added to allow a pre-built pypy archive to be downloaded and moved into place to support swift running under pypy. This option is a dictionary and contains the URL and SHA256 as keys.
id: Opsi baru `swift_pypy_archive` telah ditambahkan untuk memungkinkan arsip pypy yang sudah ada untuk diunduh dan dipindahkan ke tempatnya untuk mendukung swift yang berjalan di bawah pypy. Opsi ini adalah kamus dan berisi URL dan SHA256 sebagai kunci.

source: A new option `swift_pypy_enabled` has been added to enable or disable the pypy interpreter for swift. The default is "false".
id: Opsi baru `swift_pypy_enabled` telah ditambahkan untuk mengaktifkan atau menonaktifkan penerjemah pypy untuk swift. Nilai defaultnya "false".

source: A new option has been added allowing deployers to disable any and all containers on a given host. The option `no_containers` is a boolean which, if undefined, will default to *false*. This option can be added to any host in the `openstack_user_config.yml` or via an override in `conf.d`. When this option is set to *true* the given host will be treated as a baremetal machine. The new option mirrors the existing environmental option `is_metal` but allows deployers to target specific hosts instead of entire groups.
id: Opsi baru telah ditambahkan yang memungkinkan penelepon menonaktifkan sebagian dan semua kontainer pada host tertentu. Opsi `no_containers` adalah boolean dimana, jika tidak terdefinisi, akan default ke *false *. Opsi ini dapat ditambahkan ke host mana saja di `openstack_user_config.yml` atau melalui override di `conf.d`. Ketika opsi ini disetel ke *true * host yang diberikan akan diperlakukan sebagai mesin baremetal. Opsi baru ini mencerminkan opsi lingkungan yang ada `is_metal` tetapi memungkinkan deployer untuk menargetkan host tertentu daripada seluruh grup.

source: A new option has been added to ``bootstrap-ansible.sh`` to set the role fetch mode. The environment variable ``ANSIBLE_ROLE_FETCH_MODE`` sets how role dependencies are resolved.
id: Opsi baru telah ditambahkan ke ``bootstrap-ansible.sh`` untuk mengatur mode pengambilan peran. Variabel lingkungan ``ANSIBLE_ROLE_FETCH_MODE`` mengatur bagaimana dependensi peran diselesaikan.

source: A new optional file /etc/openstack_deploy/user-role-requirements.yml is now available for a deployer to override individual entries in the upstream ansible-role-requirements file. This can be used to point to alternative repos containing local fixes, or to add supplementary ansible roles that are not specified in the standard ansible-role-requirements.
id: File opsional baru /etc/openstack_deploy/user-role-requirements.yml sekarang tersedia untuk seorang penyebar untuk menimpa entri individual di file upstream ansible-role-requirements. Ini dapat digunakan untuk menunjuk ke repo alternatif yang berisi perbaikan lokal, atau untuk menambahkan peran tambahan yang mungkin tidak ditentukan dalam standard ansible-role-requirements.

source: A new playbook ``infra-journal-remote.yml`` to ship journals has been added. Physical hosts will now ship the all available systemd journals to the logging infrastructure. The received journals will be split up by host and stored in the `/var/log/journal/remote` directory. This feature will give deployers greater access/insight into how the cloud is functioning requiring nothing more that the systemd built-ins.
id: Playbook baru ``infra-jurnal-remote.yml`` untuk mengirim jurnal telah ditambahkan. Host fisik sekarang akan mengirimkan semua jurnal systemd yang tersedia ke infrastruktur logging. Jurnal yang diterima akan dibagi oleh host dan disimpan di direktori `/var/log/journal/remote`. Fitur ini akan memberikan akses/wawasan (access/insight) yang lebih luas kepada pengawas tentang bagaimana cloud berfungsi, tidak memerlukan apa-apa lagi selain systemd built-in.

source: A new playbook ``os-zun-install.yml`` has been added which will deploy the zun service to hosts assigned to the host group ``zun-infra_hosts``.
id: Playbook baru `` os-zun-install.yml`` telah ditambahkan yang akan menyebarkan layanan zun ke host yang ditugaskan ke grup host ``zun-infra_hosts``.

source: A new repository for installing modern erlang from ESL (erlang solutions) has been added giving us the ability to install and support modern stable erlang over numerous operating systems.
id: Sebuah repositori baru untuk menginstal erlang modern dari ESL (solusi erlang) telah ditambahkan memberi kami kemampuan untuk menginstal dan mendukung erlang stabil modern di berbagai sistem operasi.

source: A new switch ``pip_install_build_packages`` is introduced to allow toggling compiler and development library installation. The legacy behavior of installing the compiler and development libraries is maintained as the switch is enabled by default.
id: Switch baru ``pip_install_build_packages`` diperkenalkan untuk memungkinkan pengubahan kompilasi dan pengembangan pustaka pengembangan. Perilaku lama menginstal kompiler dan perpustakaan pengembangan dipertahankan sebagai switch diaktifkan secara default.

source: A new task has been added to the "os-lxc-container-setup.yml" common-tasks file. This new task will allow for additional configurations to be added without having to restart the container. This change is helpful in cases where non-impacting config needs to be added or updated to a running containers.
id: Tugas baru telah ditambahkan ke file tugas umum "os-lxc-container-setup.yml". Tugas baru ini akan memungkinkan konfigurasi tambahan ditambahkan tanpa harus memulai ulang (restart) kontainer. Perubahan ini bermanfaat dalam kasus di mana konfigurasi yang tidak berdampak perlu ditambahkan atau diperbarui ke kontainer yang sedang berjalan.

source: A new task was added to disable ICMPv6 redirects per the requirements in V-38548. However, since this change can cause problems in running OpenStack environments, it is disabled by default. Deployers who wish to enable this task (and disable ICMPv6 redirects) should set ``security_disable_icmpv6_redirects`` to ``yes``.
id: Tugas baru ditambahkan untuk menonaktifkan pengalihan ICMPv6 sesuai persyaratan dalam V-38548. Namun, karena perubahan ini dapat menyebabkan masalah dalam menjalankan lingkungan OpenStack, itu dinonaktifkan secara default. Penyebar yang ingin mengaktifkan tugas ini (dan menonaktifkan pengalihan ICMPv6) harus menetapkan ``security_disable_icmpv6_redirects`` ke ``yes``.

source: A new value ``epel_gpg_keys`` can be overridden to use a different GPG key for the EPEL-7 RPM package repo instead of the vendored key used by default.
id: Nilai baru ``epel_gpg_keys`` dapat diganti untuk menggunakan kunci GPG yang berbeda untuk repo paket EPEL-7 RPM, bukan kunci yang dibatalkan yang digunakan secara default.

source: A new variable called ``ceph_extra_components`` is available for the ceph_client role. Extra components, packages, and services that are not shipped by default by OpenStack-Ansible can be defined here.
id: Variabel baru yang disebut ``ceph_extra_components`` tersedia untuk peran ceph_client. Komponen, paket, dan layanan tambahan yang tidak dikirimkan secara default oleh OpenStack-Ansible dapat didefinisikan di sini.

source: A new variable called ``lxc_container_cache_files`` has been implemented which contains a list of dictionaries that specify files on the deployment host which should be copied into the LXC container cache and what attributes to assign to the copied file.
id: Variabel baru yang disebut ``lxc_container_cache_files`` telah diimplementasikan yang berisi daftar kamus yang menentukan file pada host penyebaran yang harus disalin ke dalam cache kontainer LXC dan atribut apa yang ditugaskan untuk file yang disalin.

source: A new variable has been added to allow a deployer to control the restart of containers from common-tasks/os-lxc-container-setup.yml. This new option is ``lxc_container_allow_restarts`` and has a default of ``true``. If a deployer wishes to disable the auto-restart functionality they can set this value to ``false`` and automatic container restarts will be disabled. This is a complement to the same option already present in the lxc_container_create role. This option is useful to avoid uncoordinated restarts of galera or rabbitmq containers if the LXC container configuration changes in a way that requires a restart.
id: Variabel baru telah ditambahkan untuk memungkinkan deployer untuk mengontrol restart kontainer dari common-tasks/os-lxc-container-setup.yml. Opsi baru ini adalah ``lxc_container_allow_restarts`` dan memiliki standar ``true``. Jika seorang deployer ingin menonaktifkan fungsi restart otomatis, mereka dapat mengatur nilai ini menjadi ``false`` dan restart kontainer otomatis akan dinonaktifkan. Ini adalah pelengkap dari opsi yang sama yang sudah ada dalam peran lxc_container_create. Opsi ini berguna untuk menghindari restart galera atau rabbitmq yang tidak terkoordinasi jika konfigurasi kontainer LXC berubah dengan cara yang membutuhkan restart.

source: A new variable has been added to allow a deployer to control the restart of containers via the handler. This new option is ``lxc_container_allow_restarts`` and has a default of ``true``. If a deployer wishes to disable the auto-restart functionality they can set this value to ``false`` and automatic container restarts that are not absolutely required will be disabled.
id: Variabel baru telah ditambahkan untuk memungkinkan seorang deployer untuk mengontrol restart kontainer melalui handler. Opsi baru ini adalah ``lxc_container_allow_restarts`` dan memiliki standar ``true``. Jika seorang deployer ingin menonaktifkan fungsi restart otomatis mereka dapat menetapkan nilai ini menjadi ``false`` dan restart kontainer otomatis yang tidak mutlak diperlukan akan dinonaktifkan.

source: A new variable has been added to allow a deployer to control the restart of containers via the handler. This new option is ``lxc_container_allow_restarts`` and has a default of ``yes``. If a deployer wishes to disable the auto-restart functionality they can set this value to ``no`` and automatic container restarts that are not absolutely required will be disabled.
id: Variabel baru telah ditambahkan untuk memungkinkan seorang deployer untuk mengontrol restart kontainer melalui handler. Opsi baru ini adalah `` lxc_container_allow_restarts`` dan memiliki default ``yes``. Jika seorang deployer ingin menonaktifkan fungsionalitas restart otomatis, mereka dapat mengatur nilai ini menjadi ``no`` dan restart kontainer otomatis yang tidak mutlak diperlukan akan dinonaktifkan.

source: A new variable has been added which allows deployers to set the container technology OSA will use when running a deployment in containers. This new variable is ``container_tech`` which has a default value of "lxc".
id: Variabel baru telah ditambahkan yang memungkinkan deployer untuk mengatur teknologi kontainer yang akan digunakan OSA saat menjalankan penyebaran dalam kontainer. Variabel baru ini adalah ``container_tech`` yang memiliki nilai default "lxc".

source: A new variable has been introduced into the ``os_tempest`` role named ``tempest_image_downloader``. When set to ``deployment-host`` (which is the default) it uses the deployment host to handle the download of images to be used for tempest testing. The images are then uploaded to the target host for uploading into Glance.
id: Variabel baru telah diperkenalkan ke peran ``os_tempest`` bernama ``tempest_image_downloader``. Ketika diatur ke ``deployment-host`` (yang merupakan default), ia menggunakan host penyebaran untuk menangani unduhan image yang akan digunakan untuk pengujian prahara. Image tersebut kemudian diunggah ke host target untuk diunggah ke Glance.

source: A new variable is supported in the ``neutron_services`` dictionary called ``service_conf_path``. This variable enables services to deploy their config templates to paths outside of /etc/neutron by specifying a directory using the new variable.
id: Variabel baru didukung dalam kamus ``neutron_services`` yang disebut ``service_conf_path``. Variabel ini memungkinkan layanan untuk menyebarkan template konfigurasi mereka ke jalur di luar /etc/neutron dengan menetapkan direktori menggunakan variabel baru.

source: A new variable, ``tempest_flavors``, has been added to the os_tempest role allowing users to define nova flavors to be during tempest testing.
id: Variabel baru, ``tempest_flavours``, telah ditambahkan ke peran os_tempest yang memungkinkan pengguna untuk menentukan rasa nova selama pengujian prahara.

source: A new variable, ``tempest_roles``, has been added to the os_tempest role allowing users to define keystone roles to be during tempest testing.
id: Variabel baru, ``tempest_roles``, telah ditambahkan ke peran os_tempest yang memungkinkan pengguna untuk menentukan peran keystone selama pengujian prahara.

source: A new version of keepalived will be installed on the haproxy nodes if the variable ``keepalived_use_latest_stable`` is set to ``True`` and more than one haproxy node is configured. The update of the package will cause keepalived to restart and therefore will cause the virtual IP addresses managed by keepalived to be briefly unconfigured, then reconfigured.
id: Versi baru keepalived akan diinstal pada node haproxy jika variabel ``keepalived_use_latest_stable`` diatur ke ``True`` dan lebih dari satu node haproxy dikonfigurasi. Pembaruan (update) paket akan menyebabkan keepalived untuk memulai kembali dan oleh karena itu akan menyebabkan alamat IP virtual yang dikelola oleh keepalived secara singkat tidak terkonfigurasi, kemudian dikonfigurasi ulang.
