Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The openstack-ansible-security role is now retired and the ansible-hardening role replaces it. The ansible-hardening role provides the same functionality and will be the maintained hardening role going forward.
id: Peran openstack-ansible-security sekarang sudah pensiun dan peran ansible-hardening menggantikannya. Peran ansible-hardening menyediakan fungsi yang sama dan akan menjadi peran pengerasan (hardening) yang dipertahankan di masa mendatang.

source: The openstack_hosts role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``openstack_hosts_package_state`` should be set to ``present``.
id: Peran openstack_hosts selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``openstack_hosts_package_state`` harus diatur ke ``present``.

source: The openstack_hosts role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``openstack_hosts_package_state`` to ``present``.
id: Peran openstack_hosts sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``openstack_hosts_package_state`` ke ``present``.

source: The option ``openstack_domain`` has been added to the **openstack_hosts** role. This option is used to setup proper hostname entries for all hosts within a given OpenStack deployment.
id: Opsi ``openstack_domain`` telah ditambahkan ke peran **openstack_hosts** . Opsi ini digunakan untuk mengatur entri nama host yang tepat untuk semua host dalam penerapan OpenStack yang diberikan.

source: The option ``rabbitmq_erlang_version_spec`` has been added allowing deployers to set the version of erlang used on a given installation.
id: Opsi ``rabbitmq_erlang_version_spec`` telah ditambahkan yang memungkinkan deployer untuk mengatur versi erlang yang digunakan pada instalasi yang diberikan.

source: The option ``repo_venv_default_pip_packages`` has been added which will allow deployers to insert any packages into a service venv as needed. The option expects a list of strings which are valid python package names as found on PYPI.
id: Opsi ``repo_venv_default_pip_packages`` telah ditambahkan yang akan memungkinkan para deployer untuk memasukkan paket apa pun ke dalam sebuah service venv sesuai kebutuhan. Opsi mengharapkan daftar string yang merupakan nama paket python yang valid seperti yang ditemukan di PYPI.

source: The option `rabbitmq_disable_non_tls_listeners` has been removed in favor of setting the bind address and port configuration directly using a new option `rabbitmq_port_bindings`. This new option is a hash allowing for multiple bind addresses and port configurations.
id: Opsi `rabbitmq_disable_non_tls_listeners` telah dihapus demi pengaturan alamat bind dan konfigurasi port secara langsung menggunakan opsi baru `rabbitmq_port_bindings`. Opsi baru ini adalah hash yang memungkinkan untuk multiple bind addresses dan konfigurasi port.

source: The options ``lxc_host_machine_qgroup_space_limit`` and ``lxc_host_machine_qgroup_compression_limit`` have been added allowing a deployer to set **qgroup** limits as they see fit. The default value for these options is "none" which is effectively **unlimited**. These options accept any nominal size value followed by the single letter type, example ``64G``. These options are only effective when the option ``lxc_host_machine_quota_disabled`` is set to **false**.
id: Opsi ``lxc_host_machine_qgroup_space_limit`` dan ``lxc_host_machine_qgroup_compression_limit`` telah ditambahkan yang memungkinkan seorang deployer untuk menetapkan batas **qgroup** sesuai keinginan mereka. Nilai default untuk opsi ini adalah "none" yang efektif **unlimited**. Opsi ini menerima nilai ukuran nominal apa pun yang diikuti oleh jenis huruf tunggal, misalnya ``64G``. Opsi ini hanya efektif ketika opsi ``lxc_host_machine_quota_disabled`` disetel ke **false**.

source: The options of application logrotate configuration files are now configurable. ``rsyslog_client_log_rotate_options`` can be used to provide a list of directives, and ``rsyslog_client_log_rotate_scripts`` can be used to provide a list of postrotate, prerotate, firstaction, or lastaction scripts.
id: Opsi file konfigurasi logrotate aplikasi sekarang dapat dikonfigurasi. ``rsyslog_client_log_rotate_options`` dapat digunakan untuk memberikan daftar arahan, dan ``rsyslog_client_log_rotate_scripts`` dapat digunakan untuk memberikan daftar scrip postrotate, prerotate, firstaction, atau lastaction.

source: The original ``stable/rocky`` release (18.0.x) contained a reference to a pre-release state of the ceph-ansible role (its 3.2.0beta1 release). That role --- and hence, any OpenStack-Ansible ``stable/rocky`` release prior to 18.1.0 --- should not be used to deploy production Ceph clusters. As of this release, ``stable/rocky`` tracks the ceph-ansible role's ``stable-3.1`` branch.
id: Rilisan ``stable/rocky`` asli (18.0.x) berisi referensi ke status pra-rilis peran ceph-ansible (rilis 3.2.0beta1-nya). Peran itu --- dan karenanya, setiap rilis OpenStack-Ansible ``stable/rocky` --- tidak boleh digunakan untuk menggunakan cluster Ceph produksi. Pada rilis ini, ``stable/rocky`` melacak cabang ``stable-3.1`` peran ceph-ansible

source: The os_aodh role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``aodh_package_state`` should be set to ``present``.
id: Peran os_aodh selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``aodh_package_state`` harus diatur ke ``present``.

source: The os_aodh role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``aodh_package_state`` to ``present``.
id: Peran os_aodh sekarang mendukung kemampuan untuk mengkonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``aodh_package_state`` ke ``present``.

source: The os_barbican role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``barbican_package_state`` should be set to ``present``.
id: Peran os_barbican selalu memeriksa apakah paket terbaru diinstal ketika dieksekusi. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``barbican_package_state`` harus diatur ke ``present``.

source: The os_barbican role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``barbican_package_state`` to ``present``.
id: Peran os_barbican sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``barbican_package_state`` ke ``present``.

source: The os_ceilometer role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``ceilometer_package_state`` should be set to ``present``.
id: Peran os_ceilometer selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``ceilometer_package_state`` harus diatur ke ``present``.

source: The os_ceilometer role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``ceilometer_package_state`` to ``present``.
id: Peran os_ceilometer sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``ceilometer_package_state`` ke ``present``.

source: The os_cinder role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``cinder_package_state`` should be set to ``present``.
id: Peran os_cinder selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``cinder_package_state`` harus diatur ke ``present``.

source: The os_cinder role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``cinder_package_state`` to ``present``.
id: Peran os_cinder sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``cinder_package_state`` ke ``present``.

source: The os_cloudkitty role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``cloudkitty_package_state`` should be set to ``present``.
id: Peran os_cloudkitty selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang penggelar ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``cloudkitty_package_state`` harus diatur ke ``present``.

source: The os_cloudkitty role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``cloudkitty_package_state`` to ``present``.
id: Peran os_cloudkitty sekarang mendukung kemampuan untuk mengkonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``cloudkitty_package_state`` ke ``present``.

source: The os_designate role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``designate_package_state`` should be set to ``present``.
id: Peran os_designate selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``designate_package_state`` harus diatur ke ``present``.

source: The os_designate role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``designate_package_state`` to ``present``.
id: Peran os_designate sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah untuk hanya memastikan bahwa paket hadir dengan mengatur ``designate_package_state`` ke ``present``.

source: The os_glance role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``glance_package_state`` should be set to ``present``.
id: Peran os_glance selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``glance_package_state`` harus diatur ke ``present``.

source: The os_glance role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``glance_package_state`` to ``present``.
id: Peran os_glance sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``glance_package_state`` ke ``present``.

source: The os_gnocchi role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``gnocchi_package_state`` should be set to ``present``.
id: Peran os_gnocchi selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``gnocchi_package_state`` harus diatur ke ``present``.

source: The os_gnocchi role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``gnocchi_package_state`` to ``present``.
id: Peran os_gnocchi sekarang mendukung kemampuan untuk mengkonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``gnocchi_package_state`` ke ``present``.

source: The os_heat role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``heat_package_state`` should be set to ``present``.
id: Peran os_heat selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``heat_package_state`` harus diatur ke ``present``.

source: The os_heat role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``heat_package_state`` to ``present``.
id: Peran os_heat sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``heat_package_state`` ke ``present``.

source: The os_horizon role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``horizon_package_state`` should be set to ``present``.
id: Peran os_horizon selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``horizon_package_state`` harus diatur ke ``present``.

source: The os_horizon role now has support for the horizon designate-ui dashboard. The dashboard may be enabled by setting ``horizon_enable_designate_ui`` to ``True`` in ``/etc/openstack_deploy/user_variables.yml``.
id: Peran os_horizon sekarang memiliki dukungan untuk dasbor horizon designate-ui. Dasbor dapat diaktifkan dengan pengaturan ``horizon_enable_designate_ui`` ke ``True`` dalam ``/etc/openstack_deploy/user_variables.yml``.

source: The os_horizon role now has support for the horizon ironic-ui dashboard. The dashboard may be enabled by setting ``horizon_enable_ironic_ui`` to ``True`` in ``/etc/openstack_deploy/user_variables.yml``.
id: Peran os_horizon sekarang memiliki dukungan untuk dasbor horizon ironic-ui. Dasbor dapat diaktifkan dengan pengaturan ``horizon_enable_ironic_ui`` ke ``True`` dalam ``/etc/openstack_deploy/user_variables.yml``.

source: The os_horizon role now has support for the horizon magnum-ui dashboard. The dashboard may be enabled by setting ``horizon_enable_magnum_ui`` to ``True`` in ``/etc/openstack_deploy/user_variables.yml``.
id: Peran os_horizon sekarang memiliki dukungan untuk dasbor horizon magnum-ui. Dasbor dapat diaktifkan dengan pengaturan ``horizon_enable_magnum_ui`` ke ``True`` dalam ``/etc/openstack_deploy/user_variables.yml``.

source: The os_horizon role now has support for the horizon manila-ui dashboard. The dashboard may be enabled by setting ``horizon_enable_manila_ui`` to ``True`` in ``/etc/openstack_deploy/user_variables.yml``.
id: Peran os_horizon sekarang memiliki dukungan untuk dasbor horizon manila-ui. Dasbor dapat diaktifkan dengan pengaturan ``horizon_enable_manila_ui`` ke ``True`` dalam ``/etc/openstack_deploy/user_variables.yml``.

source: The os_horizon role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``horizon_package_state`` to ``present``.
id: Peran os_horizon sekarang mendukung kemampuan untuk mengkonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``horizon_package_state`` ke ``present``.

source: The os_ironic role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``ironic_package_state`` should be set to ``present``.
id: Peran os_ironic selalu memeriksa apakah paket terbaru diinstal ketika dieksekusi. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``ironic_package_state`` harus diatur ke ``present``.

source: The os_ironic role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``ironic_package_state`` to ``present``.
id: Peran os_ironic sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah untuk hanya memastikan bahwa paket hadir dengan mengatur ``ironic_package_state`` ke ``present``.

source: The os_keystone role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``keystone_package_state`` should be set to ``present``.
id: Peran os_keystone selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``keystone_package_state`` harus diatur ke ``present``.

source: The os_keystone role now performs a rolling upgrade without downtime during installation. `The process for rolling upgrades is documented here <http://docs.openstack.org/developer/keystone/upgrading.html#upgrading-without-downtime>`_.
id: Peran os_keystone sekarang melakukan pemutakhiran bergulir tanpa downtime selama instalasi. `The process for rolling upgrades is documented here <http://docs.openstack.org/developer/keystone/upgrading.html#upgrading-without-downtime>`_.

source: The os_keystone role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``keystone_package_state`` to ``present``.
id: Peran os_keystone sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``keystone_package_state`` ke ``present``.

source: The os_magnum role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``magnum_package_state`` should be set to ``present``.
id: Peran os_magnum selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``magnum_package_state`` harus diatur ke ``present``.
