Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - aodh_oslomsg_rpc_servers replaces aodh_rabbitmq_servers - aodh_oslomsg_rpc_port replaces aodh_rabbitmq_port - aodh_oslomsg_rpc_use_ssl replaces aodh_rabbitmq_use_ssl - aodh_oslomsg_rpc_userid replaces aodh_rabbitmq_userid - aodh_oslomsg_rpc_vhost replaces aodh_rabbitmq_vhost - aodh_oslomsg_rpc_password replaces aodh_rabbitmq_password
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - - aodh_oslomsg_rpc_servers menggantikan aodh_rabbitmq_servers - aodh_oslomsg_rpc_port menggantikan aodh_rabbitmq_port - aodh_oslomsg_rpc_use_ssl menggantikan aodh_rabbitmq_use_ssl - aodh_oslomsg_rpc_userid menggantikan aodh_rabbitmq_userid - aodh_oslomsg_rpc_vhost menggantikan aodh_rabbitmq_vhost - aodh_oslomsg_rpc_password menggantikan aodh_rabbitmq_password

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - barbican_oslomsg_rpc_servers replaces rabbitmq_servers - barbican_oslomsg_rpc_port replaces rabbitmq_port - barbican_oslomsg_rpc_userid replaces barbican_rabbitmq_userid - barbican_oslomsg_rpc_vhost replaces barbican_rabbitmq_vhost - added barbican_oslomsg_rpc_use_ssl - added barbican_oslomsg_notify_servers - added barbican_oslomsg_notify_port - added barbican_oslomsg_notify_use_ssl - added barbican_oslomsg_notify_userid - added barbican_oslomsg_notify_vhost - added barbican_oslomsg_notify_password
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - barbican_oslomsg_rpc_servers menggantikan rabbitmq_servers - barbican_oslomsg_rpc_port menggantikan rabbitmq_port - barbican_oslomsg_rpc_userid menggantikan barbican_rabbitmq_userid - barbican_oslomsg_rpc_vhost menggantikan barbican_rabbitmq_vhost - ditambahkan barbican_oslomsg_rpc_use_ssl - ditambahkan barbican_oslomsg_notify_servers - ditambahkan barbican_oslomsg_notify_port - ditambahkan barbican_oslomsg_notify_use_ssl - ditambahkan barbican_oslomsg_notify_userid - ditambahkan barbican_oslomsg_notify_vhost - ditambahkan barbican_oslomsg_notify_password

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - ceilometer_oslomsg_rpc_servers replaces rabbitmq_servers - ceilometer_oslomsg_rpc_port replaces rabbitmq_port - ceilometer_oslomsg_rpc_userid replaces ceilometer_rabbitmq_userid - ceilometer_oslomsg_rpc_vhost replaces ceilometer_rabbitmq_vhost - added ceilometer_oslomsg_rpc_use_ssl - added ceilometer_oslomsg_notify_servers - added ceilometer_oslomsg_notify_port - added ceilometer_oslomsg_notify_use_ssl - added ceilometer_oslomsg_notify_userid - added ceilometer_oslomsg_notify_vhost - added ceilometer_oslomsg_notify_password
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Beritahu untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - ceilometer_oslomsg_rpc_servers menggantikan rabbitmq_servers - ceilometer_oslomsg_rpc_port menggantikan rabbitmq_port - ceilometer_oslomsg_rpc_userid menggantikan ceilometer_rabbitmq_userid - ceilometer_oslomsg_rpc_vhost menggantikan ceilometer_rabbitmq_vhost - menambahkan ceilometer_oslomsg_rpc_use_ssl - menambahkan ceilometer_oslomsg_notify_servers - menambahkan ceilometer_oslomsg_notify_port - menambahkan ceilometer_oslomsg_notify_use_ssl - menambahkan ceilometer_oslomsg_notify_userid - menambahkan ceilometer_oslomsg_notify_vhost - menambahkan ceilometer_oslomsg_notify_password

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - cinder_oslomsg_rpc_servers replaces cinder_rabbitmq_servers - cinder_oslomsg_rpc_port replaces cinder_rabbitmq_port - cinder_oslomsg_rpc_use_ssl replaces cinder_rabbitmq_use_ssl - cinder_oslomsg_rpc_userid replaces cinder_rabbitmq_userid - cinder_oslomsg_rpc_vhost replaces cinder_rabbitmq_vhost - cinder_oslomsg_notify_servers replaces cinder_rabbitmq_telemetry_servers - cinder_oslomsg_notify_port replaces cinder_rabbitmq_telemetry_port - cinder_oslomsg_notify_use_ssl replaces cinder_rabbitmq_telemetry_use_ssl - cinder_oslomsg_notify_userid replaces cinder_rabbitmq_telemetry_userid - cinder_oslomsg_notify_vhost replaces cinder_rabbitmq_telemetry_vhost
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - cinder_oslomsg_rpc_servers menggantikan cinder_rabbitmq_servers - cinder_oslomsg_rpc_port menggantikan cinder_rabbitmq_port - cinder_oslomsg_rpc_use_ssl menggantikan cinder_rabbitmq_use_ssl - cinder_oslomsg_rpc_userid menggantikan cinder_rabbitmq_userid - cinder_oslomsg_rpc_vhost menggantikan cinder_rabbitmq_vhost - cinder_oslomsg_notify_servers menggantikan cinder_rabbitmq_telemetry_servers - cinder_oslomsg_notify_port menggantikan cinder_rabbitmq_telemetry_port - cinder_oslomsg_notify_use_ssl menggantikan cinder_rabbitmq_telemetry_use_ssl - cinder_oslomsg_notify_userid menggantikan cinder_rabbitmq_telemetry_userid - cinder_oslomsg_notify_vhost menggantikan cinder_rabbitmq_telemetry_vhost

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - cloudkitty_oslomsg_rpc_servers replaces rabbitmq_servers - cloudkitty_oslomsg_rpc_port replaces rabbitmq_port - cloudkitty_oslomsg_rpc_userid replaces rabbitmq_userid - cloudkitty_oslomsg_rpc_vhost replaces rabbitmq_vhost - cloudkitty_oslomsg_rpc_use_ssl replaces rabbitmq_use_ssl - added cloudkitty_oslomsg_notify_servers - added cloudkitty_oslomsg_notify_port - added cloudkitty_oslomsg_notify_use_ssl - added cloudkitty_oslomsg_notify_userid - added cloudkitty_oslomsg_notify_vhost
id: Parameter server rabbitmq telah digantikan oleh oslo.messaging RPC dan Notify parameter yang sesuai untuk abstrak layanan pesan dari penyebaran server backend yang sebenarnya. - cloudkitty_oslomsg_rpc_servers menggantikan rabbitmq_servers - cloudkitty_oslomsg_rpc_port menggantikan rabbitmq_port - cloudkitty_oslomsg_rpc_userid menggantikan rabbitmq_userid - cloudkitty_oslomsg_rpc_vhost menggantikan rabbitmq_vhost - cloudkitty_oslomsg_rpc_use_ssl menggantikan rabbitmq_use_ssl - menambahkan cloudkitty_oslomsg_notify_servers - menambahkan cloudkitty_oslomsg_notify_port - menambahkan cloudkitty_oslomsg_notify_use_ssl - menambahkan cloudkitty_oslomsg_notify_userid - tambah cloudkitty_oslomsg_notify_vhost

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - designate_oslomsg_rpc_servers replaces designate_rabbitmq_servers - designate_oslomsg_rpc_port replaces designate_rabbitmq_port - designate_oslomsg_rpc_use_ssl replaces designate_rabbitmq_use_ssl - designate_oslomsg_rpc_userid replaces designate_rabbitmq_userid - designate_oslomsg_rpc_vhost replaces designate_rabbitmq_vhost - designate_oslomsg_notify_servers replaces designate_rabbitmq_telemetry_servers - designate_oslomsg_notify_port replaces designate_rabbitmq_telemetry_port - designate_oslomsg_notify_use_ssl replaces designate_rabbitmq_telemetry_use_ssl - designate_oslomsg_notify_userid replaces designate_rabbitmq_telemetry_userid - designate_oslomsg_notify_vhost replaces designate_rabbitmq_telemetry_vhost - designate_oslomsg_notify_password replaces designate_rabbitmq_telemetry_password
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - designate_oslomsg_rpc_servers menggantikan designate_rabbitmq_servers - designate_oslomsg_rpc_port menggantikan designate_rabbitmq_port - designate_oslomsg_rpc_use_ssl menggantikan designate_rabbitmq_use_ssl - designate_oslomsg_rpc_userid menggantikan designate_rabbitmq_userid - designate_oslomsg_rpc_vhost menggantikan designate_rabbitmq_vhost - designate_oslomsg_notify_servers menggantikan designate_rabbitmq_telemetry_servers - designate_oslomsg_notify_port menggantikan designate_rabbitmq_telemetry_port - designate_oslomsg_notify_use_ssl menggantikan designate_rabbitmq_telemetry_use_ssl - designate_oslomsg_notify_userid menggantikan designate_rabbitmq_telemetry_userid - designate_oslomsg_notify_vhost menggantikan designate_rabbitmq_telemetry_vhost - designate_oslomsg_notify_password menggantikan designate_rabbitmq_telemetry_password

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - glance_oslomsg_rpc_servers replaces glance_rabbitmq_servers - glance_oslomsg_rpc_port replaces glance_rabbitmq_port - glance_oslomsg_rpc_use_ssl replaces glance_rabbitmq_use_ssl - glance_oslomsg_rpc_userid replaces glance_rabbitmq_userid - glance_oslomsg_rpc_vhost replaces glance_rabbitmq_vhost - glance_oslomsg_notify_servers replaces glance_rabbitmq_telemetry_servers - glance_oslomsg_notify_port replaces glance_rabbitmq_telemetry_port - glance_oslomsg_notify_use_ssl replaces glance_rabbitmq_telemetry_use_ssl - glance_oslomsg_notify_userid replaces glance_rabbitmq_telemetry_userid - glance_oslomsg_notify_vhost replaces glance_rabbitmq_telemetry_vhost - glance_oslomsg_notify_password replaces glance_rabbitmq_telemetry_password
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - glance_oslomsg_rpc_servers menggantikan glance_rabbitmq_servers - glance_oslomsg_rpc_port menggantikan glance_rabbitmq_port - glance_oslomsg_rpc_use_ssl menggantikan glance_rabbitmq_use_ssl - glance_oslomsg_rpc_userid menggantikan glance_rabbitmq_userid - glance_oslomsg_rpc_vhost menggantikan glance_rabbitmq_vhost - glance_oslomsg_notify_servers menggantikan glance_rabbitmq_telemetry_servers - glance_oslomsg_notify_port menggantikan glance_rabbitmq_telemetry_port - glance_oslomsg_notify_use_ssl menggantikan glance_rabbitmq_telemetry_use_ssl - glance_oslomsg_notify_userid menggantikan glance_rabbitmq_telemetry_userid - glance_oslomsg_notify_vhost menggantikan glance_rabbitmq_telemetry_vhost - glance_oslomsg_notify_password menggantikan glance_rabbitmq_telemetry_password

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - heat_oslomsg_rpc_servers replaces heat_rabbitmq_servers - heat_oslomsg_rpc_port replaces heat_rabbitmq_port - heat_oslomsg_rpc_use_ssl replaces heat_rabbitmq_use_ssl - heat_oslomsg_rpc_userid replaces heat_rabbitmq_userid - heat_oslomsg_rpc_vhost replaces heat_rabbitmq_vhost - heat_oslomsg_rpc_password replaces heat_rabbitmq_password - heat_oslomsg_notify_servers replaces heat_rabbitmq_telemetry_servers - heat_oslomsg_notify_port replaces heat_rabbitmq_telemetry_port - heat_oslomsg_notify_use_ssl replaces heat_rabbitmq_telemetry_use_ssl - heat_oslomsg_notify_userid replaces heat_rabbitmq_telemetry_userid - heat_oslomsg_notify_vhost replaces heat_rabbitmq_telemetry_vhost - heat_oslomsg_notify_password replaces heat_rabbitmq_telemetry_password
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - heat_oslomsg_rpc_servers menggantikan heat_rabbitmq_servers - heat_oslomsg_rpc_port menggantikan heat_rabbitmq_port - heat_oslomsg_rpc_use_ssl menggantikan heat_rabbitmq_use_ssl - heat_oslomsg_rpc_userid menggantikan heat_rabbitmq_userid - heat_oslomsg_rpc_vhost menggantikan heat_rabbitmq_vhost - heat_oslomsg_rpc_password menggantikan heat_rabbitmq_password - heat_oslomsg_notify_servers menggantikan heat_rabbitmq_telemetry_servers - heat_oslomsg_notify_port menggantikan heat_rabbitmq_telemetry_port - heat_oslomsg_notify_use_ssl menggantikan heat_rabbitmq_telemetry_use_ssl - heat_oslomsg_notify_userid menggantikan heat_rabbitmq_telemetry_userid - heat_oslomsg_notify_vhost menggantikan heat_rabbitmq_telemetry_vhost - heat_oslomsg_notify_password menggantikan heat_rabbitmq_telemetry_password

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - ironic_oslomsg_rpc_servers replaces ironic_rabbitmq_servers - ironic_oslomsg_rpc_port replaces ironic_rabbitmq_port - ironic_oslomsg_rpc_use_ssl replaces ironic_rabbitmq_use_ssl - ironic_oslomsg_rpc_userid replaces ironic_rabbitmq_userid - ironic_oslomsg_rpc_vhost replaces ironic_rabbitmq_vhost
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - ironic_oslomsg_rpc_servers menggantikan ironic_rabbitmq_servers - ironic_oslomsg_rpc_port menggantikan ironic_rabbitmq_port - ironic_oslomsg_rpc_use_ssl menggantikan ironic_rabbitmq_use_ssl - ironic_oslomsg_rpc_userid menggantikan ironic_rabbitmq_userid - ironic_oslomsg_rpc_vhost menggantikan ironic_rabbitmq_vhost

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - keystone_oslomsg_rpc_servers replaces keystone_rabbitmq_servers - keystone_oslomsg_rpc_port replaces keystone_rabbitmq_port - keystone_oslomsg_rpc_use_ssl replaces keystone_rabbitmq_use_ssl - keystone_oslomsg_rpc_userid replaces keystone_rabbitmq_userid - keystone_oslomsg_rpc_vhost replaces keystone_rabbitmq_vhost - keystone_oslomsg_notify_servers replaces keystone_rabbitmq_telemetry_servers - keystone_oslomsg_notify_port replaces keystone_rabbitmq_telemetry_port - keystone_oslomsg_notify_use_ssl replaces keystone_rabbitmq_telemetry_use_ssl - keystone_oslomsg_notify_userid replaces keystone_rabbitmq_telemetry_userid - keystone_oslomsg_notify_vhost replaces keystone_rabbitmq_telemetry_vhost
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - keystone_oslomsg_rpc_servers menggantikan keystone_rabbitmq_servers - keystone_oslomsg_rpc_port menggantikan keystone_rabbitmq_port - keystone_oslomsg_rpc_use_ssl menggantikan keystone_rabbitmq_use_ssl - keystone_oslomsg_rpc_userid menggantikan keystone_rabbitmq_userid - keystone_oslomsg_rpc_vhost menggantikan keystone_rabbitmq_vhost - keystone_oslomsg_notify_servers menggantikan keystone_rabbitmq_telemetry_servers - keystone_oslomsg_notify_port menggantikan keystone_rabbitmq_telemetry_port - keystone_oslomsg_notify_use_ssl menggantikan keystone_rabbitmq_telemetry_use_ssl - keystone_oslomsg_notify_userid menggantikan keystone_rabbitmq_telemetry_userid - keystone_oslomsg_notify_vhost menggantikan keystone_rabbitmq_telemetry_vhost

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - magnum_oslomsg_rpc_servers replaces rabbitmq_servers - magnum_oslomsg_rpc_port replaces rabbitmq_port - magnum_oslomsg_rpc_userid replaces magnum_rabbitmq_userid - magnum_oslomsg_rpc_vhost replaces magnum_rabbitmq_vhost - added magnum_oslomsg_rpc_use_ssl - added magnum_oslomsg_notify_servers - added magnum_oslomsg_notify_port - added magnum_oslomsg_notify_use_ssl - added magnum_oslomsg_notify_userid - added magnum_oslomsg_notify_vhost - added magnum_oslomsg_notify_password
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - magnum_oslomsg_rpc_servers menggantikan rabbitmq_servers - magnum_oslomsg_rpc_port menggantikan rabbitmq_port - magnum_oslomsg_rpc_userid menggantikan magnum_rabbitmq_userid - magnum_oslomsg_rpc_vhost menggantikan magnum_rabbitmq_vhost - menambahkan magnum_oslomsg_rpc_use_ssl - menambahkan magnum_oslomsg_notify_servers - menambahkan magnum_oslomsg_notify_port - menambahkan magnum_oslomsg_notify_use_ssl - menambahkan magnum_oslomsg_notify_userid - menambahkan magnum_oslomsg_notify_vhost - menambahkan magnum_oslomsg_notify_password

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - neutron_oslomsg_rpc_servers replaces neutron_rabbitmq_servers - neutron_oslomsg_rpc_port replaces neutron_rabbitmq_port - neutron_oslomsg_rpc_use_ssl replaces neutron_rabbitmq_use_ssl - neutron_oslomsg_rpc_userid replaces neutron_rabbitmq_userid - neutron_oslomsg_rpc_vhost replaces neutron_rabbitmq_vhost - neutron_oslomsg_notify_servers replaces neutron_rabbitmq_telemetry_servers - neutron_oslomsg_notify_port replaces neutron_rabbitmq_telemetry_port - neutron_oslomsg_notify_use_ssl replaces neutron_rabbitmq_telemetry_use_ssl - neutron_oslomsg_notify_userid replaces neutron_rabbitmq_telemetry_userid - neutron_oslomsg_notify_vhost replaces neutron_rabbitmq_telemetry_vhost
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - neutron_oslomsg_rpc_servers menggantikan neutron_rabbitmq_servers - neutron_oslomsg_rpc_port menggantikan neutron_rabbitmq_port - neutron_oslomsg_rpc_use_ssl menggantikan neutron_rabbitmq_use_ssl - neutron_oslomsg_rpc_userid menggantikan neutron_rabbitmq_userid - neutron_oslomsg_rpc_vhost menggantikan neutron_rabbitmq_vhost - neutron_oslomsg_notify_servers menggantikan neutron_rabbitmq_telemetry_servers - neutron_oslomsg_notify_port menggantikan neutron_rabbitmq_telemetry_port - neutron_oslomsg_notify_use_ssl menggantikan neutron_rabbitmq_telemetry_use_ssl - neutron_oslomsg_notify_userid menggantikan neutron_rabbitmq_telemetry_userid - neutron_oslomsg_notify_vhost menggantikan neutron_rabbitmq_telemetry_vhost

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - nova_oslomsg_rpc_servers replaces nova_rabbitmq_servers - nova_oslomsg_rpc_port replaces nova_rabbitmq_port - nova_oslomsg_rpc_use_ssl replaces nova_rabbitmq_use_ssl - nova_oslomsg_rpc_userid replaces nova_rabbitmq_userid - nova_oslomsg_rpc_vhost replaces nova_rabbitmq_vhost - nova_oslomsg_notify_servers replaces nova_rabbitmq_telemetry_servers - nova_oslomsg_notify_port replaces nova_rabbitmq_telemetry_port - nova_oslomsg_notify_use_ssl replaces nova_rabbitmq_telemetry_use_ssl - nova_oslomsg_notify_userid replaces nova_rabbitmq_telemetry_userid - nova_oslomsg_notify_vhost replaces nova_rabbitmq_telemetry_vhost - nova_oslomsg_notify_password replaces nova_rabbitmq_telemetry_password
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - nova_oslomsg_rpc_servers menggantikan nova_rabbitmq_servers - nova_oslomsg_rpc_port menggantikan nova_rabbitmq_port - nova_oslomsg_rpc_use_ssl menggantikan nova_rabbitmq_use_ssl - nova_oslomsg_rpc_userid menggantikan nova_rabbitmq_userid - nova_oslomsg_rpc_vhost menggantikan nova_rabbitmq_vhost - nova_oslomsg_notify_servers menggantikan nova_rabbitmq_telemetry_servers - nova_oslomsg_notify_port menggantikan nova_rabbitmq_telemetry_port - nova_oslomsg_notify_use_ssl menggantikan nova_rabbitmq_telemetry_use_ssl - nova_oslomsg_notify_userid menggantikan nova_rabbitmq_telemetry_userid - nova_oslomsg_notify_vhost menggantikan nova_rabbitmq_telemetry_vhost - nova_oslomsg_notify_password menggantikan nova_rabbitmq_telemetry_password

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - octavia_oslomsg_rpc_servers replaces octavia_rabbitmq_servers - octavia_oslomsg_rpc_port replaces octavia_rabbitmq_port - octavia_oslomsg_rpc_use_ssl replaces octavia_rabbitmq_use_ssl - octavia_oslomsg_rpc_userid replaces octavia_rabbitmq_userid - octavia_oslomsg_rpc_vhost replaces octavia_rabbitmq_vhost - octavia_oslomsg_notify_servers replaces octavia_rabbitmq_telemetry_servers - octavia_oslomsg_notify_port replaces octavia_rabbitmq_telemetry_port - octavia_oslomsg_notify_use_ssl replaces octavia_rabbitmq_telemetry_use_ssl - octavia_oslomsg_notify_userid replaces octavia_rabbitmq_telemetry_userid - octavia_oslomsg_notify_vhost replaces octavia_rabbitmq_telemetry_vhost - octavia_oslomsg_notify_password replaces octavia_rabbitmq_telemetry_password
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - octavia_oslomsg_rpc_servers menggantikan octavia_rabbitmq_servers - octavia_oslomsg_rpc_port menggantikan octavia_rabbitmq_port - octavia_oslomsg_rpc_use_ssl menggantikan octavia_rabbitmq_use_ssl - octavia_oslomsg_rpc_userid menggantikan octavia_rabbitmq_userid - octavia_oslomsg_rpc_vhost menggantikan octavia_rabbitmq_vhost - octavia_oslomsg_notify_servers menggantikan octavia_rabbitmq_telemetry_servers - octavia_oslomsg_notify_port menggantikan octavia_rabbitmq_telemetry_port - octavia_oslomsg_notify_use_ssl menggantikan octavia_rabbitmq_telemetry_use_ssl - octavia_oslomsg_notify_userid menggantikan octavia_rabbitmq_telemetry_userid - octavia_oslomsg_notify_vhost menggantikan octavia_rabbitmq_telemetry_vhost - octavia_oslomsg_notify_password menggantikan octavia_rabbitmq_telemetry_password
