Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The ``repo_build_apt_packages`` variable has been renamed. ``repo_build_distro_packages`` should be used instead to override packages required to build Python wheels and venvs.
id: Variabel ``repo_build_apt_packages`` telah diganti namanya. ``repo_build_distro_packages`` harus digunakan sebagai gantinya untuk menimpa paket yang diperlukan untuk membuat (build) Python wheel dan venv.

source: The ``repo_build`` role now correctly applies OpenStack requirements upper-constraints when building Python wheels. This resolves https://bugs.launchpad.net/openstack-ansible/+bug/1605846
id: Peran ``repo_build`` sekarang dengan benar menerapkan persyaratan OpenStack dengan batasan atas saat membuat Python wheel. Ini menyelesaikan https://bugs.launchpad.net/openstack-ansible/+bug/1605846

source: The ``repo_build`` role now makes use of Ubuntu Cloud Archive by default. This can be disabled by setting ``repo_build_uca_enable`` to ``False``.
id: Peran ``repo_build`` sekarang menggunakan Ubuntu Cloud Archive secara default. Ini dapat dinonaktifkan dengan mengatur `` repo_build_uca_enable`` ke `` False``.

source: The ``repo_build`` role now provides the ability to override the upper-constraints applied which are sourced from OpenStack and from the global-requirements-pins.txt file. The variable ``repo_build_upper_constraints_overrides`` can be populated with a list of upper constraints. This list will take the highest precedence in the constraints process, with the exception of the pins set in the git source SHAs.
id: Peran ``repo_build`` sekarang menyediakan kemampuan untuk menimpa batasan atas yang diterapkan yang bersumber dari OpenStack dan dari file global-requirement-pins.txt. Variabel ``repo_build_upper_constraints_overrides`` dapat diisi dengan daftar batasan atas. Daftar ini akan didahulukan dalam proses kendala, dengan pengecualian pin yang diatur dalam SHA sumber git.

source: The ``rsyslog_server`` role now has support for CentOS 7.
id: Peran ``syslog server`` sekarang memiliki dukungan untuk CentOS 7.

source: The ``run-playbooks.sh`` script has been refactored to run all playbooks using our core tool set and run order. The refactor work updates the old special case script to a tool that simply runs the integrated playbooks as they've been designed.
id: Skrip ``run-playbooks.sh`` telah di-refactored untuk menjalankan semua playbook menggunakan set tool inti (core tool) kami dan menjalankan order. Pekerjaan refactor memperbarui skrip kasus spesial lama ke alat yang hanya menjalankan playbook terintegrasi seperti yang telah dirancang.

source: The ``sahara-api`` service has moved to run as a uWSGI application. You can set the max number of WSGI processes, the number of processes, threads, and buffer size utilizing the ``sahara_wsgi_processes_max``, ``sahara_wsgi_processes``, ``sahara_wsgi_threads``, and ``sahara_wsgi_buffer_size``. Additionally, you can override any settings in the uWSGI ini configuration file using the ``sahara_api_uwsgi_ini_overrides`` setting. The uWSGI application will listen on the address specified by ``sahara_uwsgi_bind_address`` which defaults to ``0.0.0.0``.
id: Layanan ``sahara-api`` telah dipindahkan untuk berjalan sebagai aplikasi uWSGI. Anda dapat mengatur jumlah maksimum proses WSGI, jumlah proses, thread, dan ukuran buffer menggunakan ``sahara_wsgi_processes_max``, ``sahara_wsgi_processes``, ``sahara_wsgi_threads``, and ``sahara_wsgi_buffer_size``. Selain itu, Anda dapat mengabaikan pengaturan apa pun di file konfigurasi uWSGI ini menggunakan pengaturan ``sahara_api_uwsgi_ini_overrides``. Aplikasi uWSGI akan mendengarkan alamat yang ditentukan oleh ``sahara_uwsgi_bind_address`` yang secara default adalah ``0.0.0.0``.

source: The ``security_sshd_permit_root_login`` setting can now be set to change the ``PermitRootLogin`` setting in ``/etc/ssh/sshd_config`` to any of the possible options. Set ``security_sshd_permit_root_login`` to one of ``without-password``, ``prohibit-password``, ``forced-commands-only``, ``yes`` or ``no``.
id: Pengaturan ``security_sshd_permit_root_login`` sekarang dapat diatur untuk mengubah pengaturan ``PermitRootLogin`` di ``/etc/ssh/sshd_config`` ke salah satu opsi yang memungkinkan. Setel ``security_sshd_permit_root_login`` menjadi salah satu dari ``without-password``, ``prohibit-password``, ``forced-commands-only``, ``yes`` atau ``no``.

source: The ``signing_dir`` configuration option has changed from ``/var/cache/heat`` to ``/var/lib/heat/cache/heat``. This only applies to heat deployments that use PKI tokens.
id: Opsi konfigurasi ``signature_dir`` telah berubah dari ``/var/cache/heat`` menjadi ``/var/lib/heat/cache/heat``. Ini hanya berlaku untuk deployment heat yang menggunakan token PKI.

source: The ``swift_fallocate_reserve`` default value has changed from 10737418240 (10GB) to 1% in order to match the OpenStack swift default setting.
id: Nilai default ``swift_fallocate_reserve`` telah berubah dari 10737418240 (10GB) menjadi 1% agar sesuai dengan pengaturan default swift OpenStack.

source: The ``swift_keystone_auth_plugin`` variable has been deprecated. ``swift_keystone_auth_type`` should be used instead to configure authentication type.
id: Variabel ``swift_keystone_auth_plugin`` telah ditinggalkan. ``swift_keystone_auth_type`` harus digunakan sebagai gantinya untuk mengkonfigurasi tipe otentikasi.

source: The ``swift_max_rsync_connections`` default value has changed from 2 to 4 in order to match the OpenStack swift documented value.
id: Nilai default ``swift_max_rsync_connections`` telah berubah dari 2 menjadi 4 agar sesuai dengan nilai yang terdokumentasi OpenStack swift.

source: The ``swift_rsync_reverse_lookup`` option has been added. This setting will handle whether rsync performs reverse lookups on client IP addresses, and will default to ``False``. We recommend leaving this option at ``False``, unless DNS or host entries exist for each swift host's replication address.
id: Opsi ``swift_rsync_reverse_lookup`` telah ditambahkan. Pengaturan ini akan menangani apakah rsync melakukan pencarian terbalik pada alamat IP klien, dan akan secara default ke ``False``. Kami menyarankan untuk membiarkan opsi ini di ``False``, kecuali jika DNS atau entri host ada untuk setiap alamat replikasi host swift.

source: The ``sysctl`` parameter ``kernel.randomize_va_space`` is now set to ``2`` by default. This matches the default of most modern Linux distributions and it ensures that Address Space Layout Randomization (ASLR) is enabled.
id: The ``sysctl`` parameter ``kernel.randomize_va_space`` sekarang diatur ke ``2`` secara default. Ini cocok dengan standar distribusi Linux paling modern dan memastikan bahwa Address Space Layout Randomization (ASLR) diaktifkan.

source: The ``sysstat`` package was installed on all distributions, but it was only configured to run on Ubuntu and OpenSUSE. It would not run on CentOS due to bad SELinux contexts and file permissions on ``/etc/cron.d/sysstat``. This has been fixed and ``sysstat`` now runs properly on CentOS.
id: Paket ``sysstat`` diinstal pada semua distribusi, tetapi hanya dikonfigurasikan untuk berjalan di Ubuntu dan OpenSUSE. Itu tidak akan berjalan pada CentOS karena konteks SELinux yang buruk dan izin file pada ``/etc/cron.d/sysstat``. Ini telah diperbaiki dan ``sysstat`` sekarang berjalan dengan baik di CentOS.

source: The ``tempest_images`` data structure for the ``os_tempest`` role now expects the values for each image to include ``name`` (optionally) and ``format`` (the disk format). Also, the optional variable ``checksum`` may be used to set the checksum expected for the file in the format ``<algorithm>:<checksum>``.
id: Struktur data ``tempest_images`` untuk peran ``os_tempest`` sekarang mengharapkan nilai untuk setiap image untuk menyertakan ``name`` (opsional) dan ``format`` (format disk). Juga, variabel opsional ``checksum`` dapat digunakan untuk mengatur checksum yang diharapkan untuk file dalam format ``<algorithm>:<checksum>``.

source: The ``trove_keystone_auth_plugin`` variable has been deprecated. ``trove_keystone_auth_type`` should be used instead to configure authentication type.
id: Variabel ``trove_keystone_auth_plugin`` telah ditinggalkan. ``trove_keystone_auth_type`` harus digunakan sebagai gantinya untuk mengkonfigurasi tipe otentikasi.

source: The ``update`` state for the ``ensure_endpoint`` method of the ``keystone`` module is now deprecated, and will be removed in the Queens cycle. Setting state to ``present`` will achieve the same result.
id: Status ``update`` untuk metode ``ensure_endpoint`` dari modul ``keystone`` sekarang sudah tidak digunakan lagi, dan akan dihapus dalam siklus Queens. Menyetel status ke ``present`` akan mencapai hasil yang sama.

source: The ``utility-all.yml`` playbook will no longer distribute the deployment host's root user's private ssh key to all utility containers. Deployers who desire this behavior should set the ``utility_ssh_private_key`` variable.
id: Playbook ``utility-all.yml`` tidak akan lagi mendistribusikan private ssh key pengguna root dari host deployment ke semua kontainer utilitas. Deployer yang menginginkan perilaku ini harus menetapkan variabel ``utility_ssh_private_key``.

source: The `dynamic_inventory.py` file now takes a new argument, ``--check``, which will run the inventory build without writing any files to the file system. This is useful for checking to make sure your configuration does not contain known errors prior to running Ansible commands.
id: File `dynamic_inventory.py` sekarang mengambil argumen baru, ``--check``, yang akan menjalankan inventory build tanpa menulis file apa pun ke sistem file. Ini berguna untuk memeriksa untuk memastikan konfigurasi Anda tidak mengandung kesalahan yang diketahui sebelum menjalankan perintah Ansible.

source: The `get_nested` filter has been added, allowing for simplified value lookups inside of nested dictionaries. `ansible_local|get_nested('openstack_ansible.swift')`, for example, will look 2 levels down and return the result.
id: Filter `get_nested` telah ditambahkan, memungkinkan pencarian nilai yang disederhanakan di dalam kamus bersarang (nested). `ansible_local|get_nested('openstack_ansible.swift')`, misalnya, akan melihat 2 level ke bawah dan mengembalikan hasilnya.

source: The `max_fail_percentage` playbook option has been used with the default playbooks since the first release of the playbooks back in **Icehouse**. While the intention was to allow large-scale deployments to succeed in cases where a single node fails due to transient issues, this option has produced more problems that it solves. If a failure occurs that is transient in nature but is under the set failure percentage the playbook will report a success, which can cause silent failures depending on where the failure happened. If a deployer finds themselves in this situation the problems are are then compounded because the tools will report there are no known issues. To ensure deployers have the best deployment experience and the most accurate information a change has been made to remove the `max_fail_percentage` option from all of the default playbooks. The removal of this option has the side effect of requiring the deploy to skip specific hosts should one need to be omitted from a run, but has the benefit of eliminating silent, hard to track down, failures. To skip a failing host for a given playbook run use the `--limit '!$HOSTNAME'` CLI switch for the specific run. Once the issues have been resolved for the failing host rerun the specific playbook without the `--limit` option to ensure everything is in sync.
id: Opsi playbook `max_fail_percentage` telah digunakan dengan playbook default sejak rilis pertama playbook kembali di **Icehouse**. Sementara maksudnya adalah untuk memungkinkan penyebaran skala besar untuk berhasil dalam kasus di mana satu node gagal karena masalah sementara, opsi ini telah menghasilkan lebih banyak masalah yang dipecahkan. Jika terjadi kegagalan yang bersifat sementara tetapi berada di bawah persentase kegagalan yang ditetapkan, playbook akan melaporkan keberhasilan, yang dapat menyebabkan kegagalan diam (silent failure) tergantung di mana kegagalan itu terjadi. Jika seorang deployer menemukan diri mereka dalam situasi ini masalahnya kemudian diperparah karena alat akan melaporkan tidak ada masalah yang diketahui. Untuk memastikan bahwa deployer memiliki pengalaman penerapan terbaik dan informasi paling akurat telah dilakukan perubahan untuk menghapus opsi `max_fail_percentage` dari semua playbook default. Penghapusan opsi ini memiliki efek samping yang mengharuskan penyebaran untuk melewati host tertentu jika seseorang harus dihilangkan dari run, tetapi memiliki manfaat menghilangkan kegagalan diam, sulit dilacak, kegagalan. Untuk melewati host yang gagal untuk menjalankan playbook tertentu gunakan `--limit '!$HOSTNAME'` CLI switch untuk menjalankan tertentu. Setelah masalah terselesaikan untuk host yang gagal jalankan kembali playbook tertentu tanpa opsi `--limit` untuk memastikan semuanya tersinkronisasi.

source: The `openstack-ansible-security role <http://docs.openstack.org/developer/openstack-ansible-security/>`_ is now integrated with OpenStack-Ansible. Refer to the `Security Hardening <http://docs.openstack.org/developer/openstack-ansible/mitaka/install-guide/configure-initial.html#security-hardening>`_ section of the OpenStack-Ansible documentation for details on how to deploy host security hardening along with OpenStack-Ansible.
id: The `openstack-ansible-security role <http://docs.openstack.org/developer/openstack-ansible-security/>`_ sekarang terintegrasi dengan OpenStack-Ansible. Lihat bagian `Security Hardeninn <http://docs.openstack.org/developer/openstack-ansible/mitaka/install-guide/configure-initial.html#security-hardening>` _ pada dokumentasi OpenStack-Ansible untuk perincian tentang cara menggunakan pengerasan keamanan host bersama dengan OpenStack-Ansible.

source: The ability to disable the certificate validation when checking and interacting with the internal cinder endpoint has been implemented. In order to do so, set the following in ``/etc/openstack_deploy/user_variables.yml``.
id: Kemampuan untuk menonaktifkan validasi sertifikat ketika memeriksa dan berinteraksi dengan endpoint cinder internal telah diterapkan. Untuk melakukannya, tetapkan yang berikut ini di ``/etc/openstack_deploy/user_variables.yml``.

source: The ability to set the RabbitMQ repo URL for both erlang and RabbitMQ itself has been added. This has been done to allow deployers to define the location of a given repo without having to fully redefine the entire set of definitions for a specific repository. The default variables `rabbitmq_gpg_keys`, `rabbitmq_repo_url`, and `rabbitmq_erlang_repo_url` have been created to facilitate this capability.
id: Kemampuan untuk mengatur URL repo RabbitMQ untuk erlang dan RabbitMQ sendiri telah ditambahkan. Ini telah dilakukan untuk memungkinkan deployer menentukan lokasi repo yang diberikan tanpa harus mendefinisikan ulang seluruh set definisi untuk repositori spesifik. Variabel default `rabbitmq_gpg_keys`,` rabbitmq_repo_url`, dan `rabbitmq_erlang_repo_url` telah dibuat untuk memfasilitasi kemampuan ini.

source: The ability to support MultiStrOps has been added to the config_template action plugin. This change updates the parser to use the ``set()`` type to determine if values within a given key are to be rendered as ``MultiStrOps``. If an override is used in an INI config file the set type is defined using the standard yaml construct of "?" as the item marker.
id: Kemampuan untuk mendukung MultiStrOps telah ditambahkan ke plugin aksi config_template. Perubahan ini memperbarui parser untuk menggunakan tipe ``set()`` untuk menentukan apakah nilai dalam kunci yang diberikan akan diberikan sebagai ``MultiStrOps``. Jika override digunakan dalam file konfigurasi INI, tipe set didefinisikan menggunakan konstruksi yaml standar "?" sebagai penanda item.

source: The ability to support login user domain and login project domain has been added to the keystone module.
id: Kemampuan untuk mendukung domain pengguna masuk dan domain proyek masuk telah ditambahkan ke modul keystone.

source: The ability to support login user domain and login project domain has been added to the keystone module. This resolves https://bugs.launchpad.net/openstack-ansible/+bug/1574000
id: Kemampuan untuk mendukung domain pengguna masuk dan domain proyek masuk telah ditambahkan ke modul keystone. Ini teratasi (resolves) https://bugs.launchpad.net/openstack-ansible/+bug/1574000

source: The addition of multi-domain LDAP configuration support left behind a configuration file for the default domain that causes problems with Keystone. This file will automatically be removed if the deployer is not using the Default domain with an LDAP back end. (`Bug 1547542 <https://bugs.launchpad.net/openstack-ansible/+bug/1547542>`_)
id: Penambahan dukungan konfigurasi LDAP multi-domain meninggalkan file konfigurasi untuk domain default yang menyebabkan masalah dengan Keystone. File ini akan secara otomatis dihapus jika deployer tidak menggunakan domain Default dengan back end LDAP. (`Bug 1547542 <https://bugs.launchpad.net/openstack-ansible/+bug/1547542>` _)

source: The addition of the ``container_tech`` option and the inclusion of **nspawn** support deployers now have the availability to define a desired containerization strategy globally or on specific hosts.
id: Penambahan opsi ``container_tech`` dan dimasukkannya **nspawn** dukungan deployers sekarang memiliki ketersediaan untuk menentukan strategi containerization yang diinginkan secara global atau pada host tertentu.

source: The admin_token_auth middleware presents a potential security risk and will be removed in a future release of keystone. Its use can be removed by setting the ``keystone_keystone_paste_ini_overrides`` variable.
id: Middleware admin_token_auth menyajikan risiko keamanan potensial dan akan dihapus dalam rilis keystone di masa mendatang. Penggunaannya dapat dihapus dengan mengatur variabel ``keystone_keystone_paste_ini_overrides``.

source: The ansible version used by OSA is updated from the 2.7 to the 2.8 series. This requires an upgrade of ceph-ansible to 4.0 and this in turn requires an upgrade of ceph from Mimic to Nautilus. This version dependancy applies where OSA uses ceph-ansible directly to deploy the ceph infrastructure, but not when OSA is integrated with an externally provisioned ceph cluster.
id: Versi ansible yang digunakan oleh OSA diperbarui dari seri 2.7 ke 2.8. Ini membutuhkan pembaruan ceph-ansible untuk 4.0 dan ini pada gilirannya memerlukan pembaruan ceph dari Mimic ke Nautilus. Ketergantungan versi ini berlaku di mana OSA menggunakan ceph-ansible secara langsung untuk menggunakan infrastruktur ceph, tetapi tidak ketika OSA terintegrasi dengan ceph cluster yang disediakan secara eksternal.

source: The ansible-hardening role supports the application of the Red Hat Enterprise Linux 6 STIG configurations to systems running CentOS 7 and Ubuntu 16.04 LTS.
id: Peran ansible-hardening mendukung aplikasi konfigurasi Red Hat Enterprise Linux 6 STIG untuk sistem yang menjalankan CentOS 7 dan Ubuntu 16.04 LTS.

source: The aodh-api init service is removed since aodh-api is deployed as an apache mod_wsgi service.
id: Layanan init aodh-api dihapus karena aodh-api digunakan sebagai layanan mod_wsgi apache.

source: The apt-cacher-ng daemon does not use the proxy server specified in environment variables. The proxy server specified in the ``proxy_env_url`` variable is now set inside the apt-cacher-ng configuration file.
id: Daemon apt-cacher-ng tidak menggunakan server proxy yang ditentukan dalam variabel lingkungan. Server proxy yang ditentukan dalam variabel ``proxy_env_url`` sekarang diatur di dalam file konfigurasi apt-cacher-ng.

source: The audit rules added by the security role now have key fields that make it easier to link the audit log entry to the audit rule that caused it to appear.
id: Aturan audit yang ditambahkan oleh peran keamanan sekarang memiliki key field yang membuatnya lebih mudah untuk menghubungkan entri log audit dengan aturan audit yang menyebabkannya muncul.

source: The auditd rules for auditing V-38568 (filesystem mounts) were incorrectly labeled in the auditd logs with the key of ``export-V-38568``. They are now correctly logged with the key ``filesystem_mount-V-38568``.
id: Aturan auditd untuk audit V-38568 (mount filesystem) salah diberi label dalam log auditd dengan kunci ``export-V-38568``. Mereka sekarang dicatat dengan benar dengan kunci ``filesystem_mount-V-38568``.

source: The auditd rules template included a rule that audited changes to the AppArmor policies, but the SELinux policy changes were not being audited. Any changes to SELinux policies in ``/etc/selinux`` are now being logged by auditd.
id: Templat aturan auditd menyertakan aturan yang mengaudit perubahan kebijakan AppArmor, tetapi perubahan kebijakan SELinux tidak diaudit. Setiap perubahan pada kebijakan SELinux di ``/etc/selinux`` sekarang sedang dicatat oleh auditd.

source: The bind mount for logs on the galera container was found to be broken in `bug 1609862 <https://launchpad.net/bugs/1609862>` and it has been fixed.
id: Mount mengikat untuk log pada kontainer galera ditemukan rusak di `bug 1609862 <https://launchpad.net/bugs/1609862>` dan telah diperbaiki.

source: The blazar dashboard is available in Horizon. Deployers can enable the panel by setting the following Ansible variable:
id: Dasbor blazar tersedia di Horizon. Deployer dapat mengaktifkan panel dengan mengatur variabel Ansible berikut:

source: The bootstrap-ansible script may fail with an incompatible requirement when installing OpenStack-Ansible 13.3.12 and before. See https://bugs.launchpad.net/openstack-ansible/+bug/1658948 for more details.
id: Script bootstrap-ansible mungkin gagal dengan persyaratan yang tidak kompatibel saat menginstal OpenStack-Ansible 13.3.12 dan sebelumnya. Lihat https://bugs.launchpad.net/openstack-ansible/+bug/1658948 untuk rincian lebih lanjut.

source: The bootstrap-ansible script may fail with an incompatible requirement when installing OpenStack-Ansible 14.0.6 and before. See https://bugs.launchpad.net/openstack-ansible/+bug/1658948 for more details.
id: Script bootstrap-ansible mungkin gagal dengan persyaratan yang tidak kompatibel ketika menginstal OpenStack-Ansible 14.0.6 dan sebelumnya. Lihat https://bugs.launchpad.net/openstack-ansible/+bug/1658948 untuk rincian lebih lanjut.

source: The ceilometer API service is now deprecated. OpenStack-Ansible no longer deploys this service. To make queries against metrics, alarms, and/or events, please use the the gnocchi, aodh, and panko APIs, respectively.
id: Layanan ceilometer API sekarang sudah tidak digunakan lagi. OpenStack-Ansible tidak lagi menyebarkan layanan ini. Untuk membuat kueri terhadap metrik, alarm, dan/atau event, silakan gunakan API gnocchi, aodh, dan panko, masing-masing.

source: The ceilometer alarming functionality has been moved into aodh. The ``ceilometer_alarm_notifier`` and ``ceilometer_alarm_evaluator`` entries are removed from the ``/etc/openstack_deploy/env.d/ceilometer.yml`` file.
id: Fungsi mengkhawatirkan ceilometer telah dipindahkan ke aodh. Entri ``ceilometer_alarm_notifier`` dan ``ceilometer_alarm_evaluator`` dihapus dari file ``/etc/openstack_deploy/env.d/ceilometer.yml``.
