Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in swift.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di swift.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in trove.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di trove.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notifications untuk mengaktifkan operasi messaging backend servers yang terpisah dan berbeda.

source: Swift ``versioned_writes`` middleware is added to the pipeline by default. Additionally the ``allow_versioned_writes`` settings in the middleware configuration is set to ``True``. This follows the Swift defaults, and enables the use of the ``X-History-Location`` metadata Header.
id: Middleware Swift ``versioned_writes`` ditambahkan ke pipeline secara default. Selain itu pengaturan ``allow_versioned_writes`` dalam konfigurasi middleware diatur ke ``True``. Ini mengikuti default Swift, dan memungkinkan penggunaan Header metadata ``X-History-Location``.

source: Swift container-sync has been updated to use ``internal-client``. This means a new configuration file ``internal-client.conf`` has been added. Configuration can be overridden using the variable ``swift_internal_client_conf_overrides``.
id: Sinkronisasi kontainer Swift telah diperbarui untuk menggunakan ``internal-client``. Ini berarti file konfigurasi baru ``internal-client.conf`` telah ditambahkan. Konfigurasi dapat diganti menggunakan variabel ``swift_internal_client_conf_overrides``.

source: Swift tempauth users now be specified. The ``swift_tempauth_users`` variable can be defined as a list of tempauth users, and their permissions. You will still need to specify the appropriate Swift middleware using the ``swift_middleware_list`` variable, in order to utilise tempauth.
id: Pengguna swift tempauth sekarang akan terinci. Variabel ``swift_tempauth_users`` dapat didefinisikan sebagai daftar pengguna tempauth, dan izin mereka. Anda masih perlu menentukan middleware Swift yang sesuai menggunakan variabel ``swift_middleware_list``, untuk dapat menggunakan tempauth.

source: Systems using systemd (like Ubuntu Xenial) were incorrectly limited to a low amount of open files. This was causing issues when restarting galera. A deployer can still define the maximum number of open files with the variable ``galera_file_limits`` (Defaults to 65536).
id: Sistem yang menggunakan systemd (seperti Ubuntu Xenial) secara tidak benar terbatas pada jumlah file terbuka yang rendah. Ini menyebabkan masalah saat restarting galera. Penyebar masih dapat menentukan jumlah maksimum file terbuka dengan variabel ``galera_file_limits`` (Default ke 65536).

source: TLS certificate chain verification during the download of LXC cached images can now be toggled using the configuration variable 'lxc_cache_validate_certs'. The default behavior is to validate the certificate chain.
id: Verifikasi rantai sertifikat TLS selama pengunduhan image yang di-cache LXC sekarang dapat diubah menggunakan variabel konfigurasi 'lxc_cache_validate_certs'. Perilaku default adalah untuk memvalidasi rantai sertifikat.

source: Tacker role now uses default systemd_service role. Due to this upstart is not supported anymore. Was added variable tacker_init_config_overrides, with wich deployer may override predifined options. Also variable program_override has no effect now, and tacker_service_names was removed in favor of tacker_service_name.
id: Tacker role sekarang menggunakan peran systemd_service default. Karena pemula (upstart) ini tidak didukung lagi. Telah ditambahkan variabel tacker_init_config_overrides, dimana deployer dapat mengganti opsi yang telah ditentukan. Variabel program_override juga tidak berpengaruh sekarang, dan tacker_service_names telah dihapus karena adanya tacker_service_name.

source: Tags have been added to all of the common tags with the prefix "common-". This has been done to allow a deployer to rapidly run any of the common on a need basis without having to rerun an entire playbook.
id: Tag telah ditambahkan ke semua tag umum dengan awalan "common-". Ini telah dilakukan untuk memungkinkan seorang penyebar menjalankan dengan cepat salah satu kesamaan berdasarkan kebutuhan tanpa harus memutarkan kembali seluruh playbook.

source: Tasks were added to search for any device files without a proper SELinux label on CentOS systems. If any of these device labels are found, the playbook execution will stop with an error message.
id: Tugas ditambahkan untuk mencari file perangkat apa pun tanpa label SELinux yang tepat pada sistem CentOS. Jika salah satu dari label perangkat ini ditemukan, eksekusi playbook akan berhenti dengan pesan kesalahan.

source: That variable would become:
id: Variabel itu akan menjadi:

source: The 'container_cidr' key has been restored back to openstack_inventory.json The fix to remove deleted global override keys mistakenly deleted the 'container_cidr' key, as well. This was used by downstream consumers, and cannot be reconstructed with other information inside the inventory file. Regression tests were also added.
id: Kunci 'container_cidr' telah dipulihkan kembali ke openstack_inventory.json. Perbaikan untuk menghapus kunci global override yang dihapus dengan keliru juga menghapus kunci 'container_cidr'. Ini digunakan oleh konsumen hilir, dan tidak dapat direkonstruksi dengan informasi lain di dalam file inventory. Tes regresi juga ditambahkan.

source: The **openstack_hosts** role will setup an RFC1034/5 hostname and create an alias for all hosts in inventory.
id: Peran **openstack_hosts** akan menyiapkan hostname RFC1034/5 dan membuat alias untuk semua host dalam inventaris.

source: The Ansible SSH plugin has been modified to support running commands within containers without having to directly ssh into them. The change will detect presence of a container. If a container is found the physical host will be used as the SSH target and commands will be run directly. This will improve system reliability and speed while also opening up the possibility for SSH to be disabled from within the container itself.
id: Plugin SSH Ansible telah dimodifikasi untuk mendukung perintah yang berjalan di dalam kontainer tanpa harus langsung melihatnya. Perubahan akan mendeteksi keberadaan kontainer. Jika sebuah kontainer ditemukan, host fisik akan digunakan sebagai target SSH dan perintah akan dijalankan secara langsung. Ini akan meningkatkan keandalan dan kecepatan sistem sementara juga membuka kemungkinan SSH dinonaktifkan dari dalam kontainer itu sendiri.

source: The Aodh data migration script should be run to migrate alarm data from MongoDB storage to Galera due to the pending removal of MongoDB support.
id: Skrip migrasi data Aodh harus dijalankan untuk memigrasi data alarm dari penyimpanan MongoDB ke Galera karena penghentian dukungan MongoDB yang tertunda.

source: The COPR repository for installing LXC on CentOS 7 is now set to a higher priority than the default to ensure that LXC packages always come from the COPR repository.
id: Repositori COPR untuk menginstal LXC pada CentOS 7 sekarang diatur ke prioritas yang lebih tinggi daripada default untuk memastikan bahwa paket LXC selalu berasal dari repositori COPR.

source: The Ceilometer API is no longer available in the Queens release of OpenStack, this patch removes all references to API related configurations as they are no longer needed.
id: Ceilometer API tidak lagi tersedia dalam rilis OpenStack Queens, patch ini menghapus semua referensi untuk konfigurasi terkait API karena mereka tidak lagi diperlukan.

source: The Ceph stable release used by openstack-ansible and its ceph-ansible integration has been changed to the recent `Ceph LTS <http://ceph.com/releases/v12-2-0-luminous-released/>`_ Luminous release.
id: Rilis stabil Ceph yang digunakan oleh openstack-ansible dan integrasi ceph-ansible telah diubah ke yang terbaru `Ceph LTS <http://ceph.com/releases/v12-2-0-luminous-released/>`_ Luminous release.

source: The Datagram Congestion Control Protocol (DCCP) kernel module is now disabled by default, but a reboot is required to make the change effective.
id: Modul kernel Datagram Congestion Control Protocol (DCCP) sekarang dinonaktifkan secara default, tetapi reboot diperlukan untuk membuat perubahan efektif.

source: The Designate V1 API has been removed, and cannot be enabled.
id: Designate V1 API telah dihapus, dan tidak dapat diaktifkan.

source: The Designate pools.yaml file can now be generated via the designate_pools_yaml attribute, if desired. This ability is toggled by the designate_use_pools_yaml_attr attribute. In the future this behavior may become default and designate_pools_yaml may become a required variable.
id: File pools.yaml Designate sekarang dapat dihasilkan melalui atribut designate_pools_yaml, jika diinginkan. Kemampuan ini diaktifkan oleh atribut designate_use_pools_yaml_attr. Di masa depan perilaku ini dapat menjadi default dan designate_pools_yaml dapat menjadi variabel yang diperlukan.

source: The Designate pools.yaml file can now be generated via the designate_pools_yaml attribute, if desired. This allows users to populate the Designate DNS server configuration using attributes from other plays and obviates the need to manage the file outside of the Designate role.
id: File pools.yaml Designate sekarang dapat dihasilkan melalui atribut designate_pools_yaml, jika diinginkan. Hal ini memungkinkan pengguna untuk mengisi konfigurasi server Designate DNS menggunakan atribut dari play lain dan meniadakan kebutuhan untuk mengelola file di luar peran Designate.

source: The EPEL repository is now removed in favor of the RDO repository.
id: Repositori EPEL sekarang dihapus demi repositori RDO.

source: The EPEL repository is only installed and configured when the deployer sets ``security_enable_virus_scanner`` to ``yes``. This allows the ClamAV packages to be installed. If ``security_enable_virus_scanner`` is set to ``no`` (the default), the EPEL repository will not be added.
id: Repositori EPEL hanya diinstal dan dikonfigurasikan ketika deployer menetapkan ``security_enable_virus_scanner`` menjadi ``yes``. Ini memungkinkan paket ClamAV diinstal. Jika ``security_enable_virus_scanner`` diatur ke ``no`` (default), repositori EPEL tidak akan ditambahkan.

source: The GPG key checks for package verification in V-38476 are now working for Red Hat Enterprise Linux 7 in addition to CentOS 7. The checks only look for GPG keys from Red Hat and any other GPG keys, such as ones imported from the EPEL repository, are skipped.
id: Pemeriksaan kunci GPG untuk verifikasi paket di V-38476 sekarang berfungsi untuk Red Hat Enterprise Linux 7 selain CentOS 7. Pemeriksaan hanya mencari kunci GPG dari Red Hat dan kunci GPG lainnya, seperti yang diimpor dari repositori EPEL , dilewati.

source: The Galera client role now has a dependency on the apt package pinning role.
id: Peran klien Galera sekarang memiliki ketergantungan pada peran menyematkan (pinning) paket apt.

source: The Galera installation process has been optimized and takes less time to complete.
id: Proses instalasi Galera telah dioptimalkan dan membutuhkan waktu lebih sedikit untuk menyelesaikannya.

source: The HAProxy role provided by OpenStack-Ansible now terminates SSL using a self-signed certificate by default. While this can be disabled the inclusion of SSL services on all public endpoints as a default will help make deployments more secure without any additional user interaction. More information on SSL and certificate generation can be `found here <http://docs.openstack.org/developer/openstack-ansible/install-guide/configure-haproxy.html#securing-haproxy-communication-with-ssl-certificates>`_.
id: Peran HAProxy yang disediakan oleh OpenStack-Ansible sekarang mengakhiri SSL menggunakan sertifikat yang ditandatangani sendiri secara default. Meskipun hal ini dapat dinonaktifkan, dimasukkannya layanan SSL di semua endpoint publik sebagai standar akan membantu membuat penyebaran lebih aman tanpa interaksi pengguna tambahan. Informasi lebih lanjut tentang SSL dan pembuatan sertifikat dapat `found here <http://docs.openstack.org/developer/openstack-ansible/install-guide/configure-haproxy.html#securing-haproxy-communication-with-ssl-certificates>`_.

source: The Keystone configuration has been updated for liberty. Several variables that may appear in the ``user_config.yml`` file may need to be updated. Those variables include:
id: Konfigurasi Keystone telah diperbarui untuk kebebasan. Beberapa variabel yang mungkin muncul dalam file ``user_config.yml`` mungkin perlu diperbarui. Variabel tersebut meliputi:

source: The Kilo upgrade playbook `glance-db-storage-url-fix.yml` to Liberty will migrate all existing Swift backed Glance images inside the image_locations database table from a Keystone v2 API URL to a v3 URL. This will force the Swift client to operate against a v3 Keystone URL. A backup of the old image_locations table is stored inside a new database table `image_locations_keystone_v3_mig_pre_liberty` and can be safely removed after a successfull upgrade to Liberty.
id: Playbook upgrade Kilo `glance-db-storage-url-fix.yml` ke Liberty akan memigrasikan semua image Glance yang didukung Swift di dalam tabel database image_locations dari Keystone v2 API URL ke v3 URL. Ini akan memaksa klien Swift untuk beroperasi melawan URL v3 Keystone. Cadangan tabel image_locations lama disimpan di dalam tabel database baru `image_locations_keystone_v3_mig_pre_liberty` dan dapat dihapus dengan aman setelah upgrade yang berhasil ke Liberty.

source: The LBaaSv2 device driver is now set by the Ansible variable ``neutron_lbaasv2_device_driver``. The default is set to use the ``HaproxyNSDriver``, which allows for agent-based load balancers.
id: Driver perangkat LBaaSv2 sekarang diatur oleh variabel Ansible ``neutron_lbaasv2_device_driver``. Default diatur untuk menggunakan ``HaproxyNSDriver``, yang memungkinkan penyeimbang beban berbasis agen.

source: The LBaaSv2 service provider configuration can now be adjusted with the ``neutron_lbaasv2_service_provider`` variable. This allows a deployer to choose to deploy LBaaSv2 with Octavia in a future version.
id: Konfigurasi penyedia layanan LBaaSv2 sekarang dapat disesuaikan dengan variabel ``neutron_lbaasv2_service_provider``. Ini memungkinkan seorang penggelar untuk memilih untuk menggunakan LBaaSv2 dengan Octavia di versi masa depan.

source: The LVM configuration tasks and ``lvm.conf`` template have been removed from the ``openstack_hosts`` role since they are no longer needed. All of the LVM configuration is properly handled in the ``os_cinder`` role.
id: Tugas konfigurasi LVM dan template ``lvm.conf`` telah dihapus dari peran ``openstack_hosts`` karena tidak lagi diperlukan. Semua konfigurasi LVM ditangani dengan benar dalam peran ``os_cinder``.

source: The LXC container cache preparation process now copies DNS resolution configuration from the host instead of implementing its own configuration. The ``lxc_cache_resolvers`` variable is therefore unnecessary and has been removed.
id: Proses persiapan cache kontainer LXC sekarang menyalin konfigurasi resolusi DNS dari host daripada mengimplementasikan konfigurasinya sendiri. Variabel ``lxc_cache_resolvers`` karena itu tidak perlu dan telah dihapus.

source: The LXC container cache preparation process now copies package repository configuration from the host instead of implementing its own configuration. The following variables are therefore unnecessary and have been removed:
id: Proses persiapan cache kontainer LXC sekarang menyalin konfigurasi repositori paket dari host daripada mengimplementasikan konfigurasinya sendiri. Karena itu variabel berikut ini tidak perlu dan telah dihapus:

source: The LXC container create option `lxc_container_backing_store` is now defined by default and has a value of "dir". Prior to this release the backend store option was using several auto-detection methods to try and guess the store type based on facts fed into the role and derived from the physical host. While the auto-detection methods worked, they created a cumbersome set of conditionals and limited our ability to leverage additional container stores. Having this option be a default allows deployers to mix and match container stores to suit the needs of the deployment. Existing deployments should set this option within group or user variables to ensure there's no change in the backend store when new container be provisioned.
id: LXC container create option `lxc_container_backing_store` sekarang didefinisikan secara default dan memiliki nilai "dir". Sebelum rilis ini opsi backend store menggunakan beberapa metode deteksi otomatis untuk mencoba dan menebak jenis store berdasarkan fakta dimasukkan ke dalam peran dan berasal dari host fisik. Sementara metode deteksi otomatis bekerja, mereka menciptakan serangkaian persyaratan dan membatasi kemampuan kami untuk memanfaatkan store kontainer tambahan. Dengan menetapkan opsi ini sebagai bawaan, memungkinkan para penyebar untuk mencampur dan mencocokkan store kontainer agar sesuai dengan kebutuhan penyebaran. Penempatan yang ada harus menetapkan opsi ini dalam variabel grup atau pengguna untuk memastikan tidak ada perubahan di penyimpanan backend ketika kontainer baru disediakan.

source: The LXC container create role will now check for the LXC volume group if the option `lxc_container_backing_store` is set to "lvm". If this volume group is not found, the role will halt and instruct the deployer to update their configuration options and inspect their host setup.
id: LXC container create role sekarang akan memeriksa grup volume LXC jika opsi `lxc_container_backing_store` diatur ke "lvm". Jika grup volume ini tidak ditemukan, role akan berhenti dan menginstruksikan penyebar untuk memperbarui opsi konfigurasi mereka dan memeriksa pengaturan host mereka.

source: The LXC container creation and modification process now supports online network additions. This ensures a container remains online when additional networks are added to a system.
id: Proses pembuatan dan modifikasi kontainer LXC sekarang mendukung penambahan jaringan online. Ini memastikan wadah tetap online ketika jaringan ekstra ditambahkan ke sistem.

source: The LXC container creation process now has a configurable delay for the task which waits for the container to start. The variable ``lxc_container_ssh_delay`` can be set to change the default delay of five seconds.
id: Proses pembuatan kontainer LXC sekarang memiliki penundaan yang dapat dikonfigurasi untuk tugas yang menunggu kontainer untuk memulai. Variabel ``lxc_container_ssh_delay`` dapat diatur untuk mengubah penundaan default lima detik.

source: The Linux Security Module (LSM) that is appropriate for the Linux distribution in use will be automatically enabled by the security role by default. Deployers can opt out of this change by setting the following Ansible variable:
id: Linux Security Module (LSM) yang sesuai untuk distribusi Linux yang digunakan akan secara otomatis diaktifkan oleh peran keamanan secara default. Deployer dapat menyisih dari perubahan ini dengan mengatur variabel Ansible berikut:

source: The LinuxBridge configuration that was in ``plugins/ml2/ml2_conf.ini`` is now found in ``plugins/ml2/linuxbridge_agent.ini``.
id: Konfigurasi LinuxBridge yang ada di ``plugins/ml2/ml2_conf.ini`` sekarang ditemukan di``plugins/ml2/linuxbridge_agent.ini``.

source: The MariaDB version has been bumped to 10.2
id: Versi MariaDB telah dinaikkan ke 10.2

source: The MariaDB wait_timeout setting is decreased to 1h to match the SQL Alchemy pool recycle timeout, in order to prevent unnecessary database session buildups.
id: Pengaturan wait_timeout MariaDB dikurangi menjadi 1 jam agar sesuai dengan batas waktu daur ulang kumpulan (pool) Alchemy SQL, untuk mencegah penumpukan (buildup) sesi basis data yang tidak perlu.

source: The Neutron HA tool written by AT&T has been deprecated and will be removed in the Ocata release.
id: Alat Neutron HA yang ditulis oleh AT&T telah ditinggalkan dan akan dihapus dalam rilis Ocata.

source: The Neutron HA tool written by AT&T is no longer enabled by default. This tool was providing HA capabilities for networks and routers that were not using the native Neutron L3HA. Because native Neutron L3HA is stable, compatible with the Linux Bridge Agent, and is a better means of enabling HA within a deployment this tool is no longer being setup by default. If legacy L3HA is needed within a deployment the deployer can set `neutron_legacy_ha_tool_enabled` to **true** to enable the legacy tooling.
id: Alat Neutron HA yang ditulis oleh AT&T tidak lagi diaktifkan secara default. Alat ini menyediakan kemampuan HA untuk jaringan dan router yang tidak menggunakan Neutron L3HA asli (native). Karena Neutron L3HA asli stabil, kompatibel dengan Linux Bridge Agent, dan merupakan cara yang lebih baik untuk mengaktifkan HA dalam penyebaran, alat ini tidak lagi diatur secara default. Jika legacy L3HA diperlukan dalam penyebaran, maka deployer dapat mengatur `neutron_legacy_ha_tool_enabled` ke **true** untuk mengaktifkan tool legacy.

source: The Neutron L3 Agent configuration for the handle_internal_only_routers variable is removed in order to use the Neutron upstream default setting. The current default for handle_internal_only_routers is True, which does allow Neutron L3 router without external networks attached (as discussed per https://bugs.launchpad.net/neutron/+bug/1572390).
id: Konfigurasi Neutron L3 Agent untuk variabel handle_internal_only_routers dihapus untuk menggunakan pengaturan default hulu Neutron. Default saat ini untuk handle_internal_only_routers adalah True, yang memungkinkan router Neutron L3 tanpa jaringan eksternal terpasang (seperti yang dibahas per https://bugs.launchpad.net/neutron/+bug/1572390).

source: The Neutron Service Function Chaining Extension (SFC) can optionally be deployed and configured by defining the following service plugins:
id: Service Function Chaining Extension (SFC) Neutron dapat secara opsional digunakan dan dikonfigurasikan dengan mendefinisikan plugin layanan berikut:

source: The Nova 2.1 variables (``nova_v21_<variable>``), Heat name variables ( ``heat_project_domain_name``, ``heat_user_domain``) and Galera SST Method (``galera_sst_method``) variables have changed. See the `upgrade documentation <http://docs.openstack.org/developer/openstack-ansible/liberty/upgrade-guide/scripts.html#migrate-openstack-vars-py>` for details.
id: Variabel Nova 2.1 (``nova_v21_<variable>``), variabel nama heat (``heat_project_domain_name``, ``heat_user_domain``) dan variabel Galera SST Method (``galera_sst_method``) telah berubah. Lihat `upgrade documentation <http://docs.openstack.org/developer/openstack-ansible/liberty/upgrade-guide/scripts.html#migrate-openstack-vars-py>` untuk detailnya.
