Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: SSL termination is assumed enabled for all public endpoints by default. If this is not needed it can be disabled by setting the ``openstack_external_ssl`` option to **false** and the ``openstack_service_publicuri_proto`` to **http**.
id: Pengakhiran SSL diasumsikan diaktifkan untuk semua endpoint publik secara default. Jika ini tidak diperlukan, itu dapat dinonaktifkan dengan mengatur opsi ``openstack_external_ssl`` ke **false** dan ``openstack_service_publicuri_proto`` ke **http**.

source: SSLv3 is now disabled in the haproxy daemon configuration by default.
id: SSLv3 sekarang dinonaktifkan di konfigurasi daemon haproxy secara default.

source: Searching for world-writable files is now disabled by default. The search causes delays in playbook runs and it can consume a significant amount of CPU and I/O resources. Deployers can re-enable the search by setting ``security_find_world_writable_dirs`` to ``yes``.
id: Mencari file world-writable sekarang dinonaktifkan secara default. Pencarian menyebabkan keterlambatan dalam menjalankan playbook dan dapat mengkonsumsi sejumlah besar sumber daya CPU dan I/O. Deployer dapat mengaktifkan kembali pencarian dengan mengatur ``security_find_world_writable_dirs`` ke ``yes``.

source: Security Issues
id: Masalah keamanan

source: See `Bug 1702167 <https://bugs.launchpad.net/openstack-ansible/+bug/1702167>`_ for more details.
id: Lihat `Bug 1702167 <https://bugs.launchpad.net/openstack-ansible/+bug/1702167>`_ untuk lebih jelasnya.

source: See `Launchpad Bug 1697531 <https://bugs.launchpad.net/openstack-ansible/+bug/1697531>`_ for more details.
id: Lihat `Launchpad Bug 1697531 <https://bugs.launchpad.net/openstack-ansible/+bug/1697531>`_ untuk lebih jelasnya.

source: See `Launchpad Bug 1699191 <https://bugs.launchpad.net/openstack-ansible/+bug/1699191>`_ for more details.
id: Lihat `Launchpad Bug 1699191 <https://bugs.launchpad.net/openstack-ansible/+bug/1699191>`_ untuk lebih jelasnya.

source: See `bug 1605302 <https://launchpad.net/bugs/1605302>`_ for more details.
id: Lihat `bug 1605302 <https://launchpad.net/bugs/1605302>`_ untuk lebih jelasnya.

source: See `bug 1616281 <https://launchpad.net/bugs/1616281>`_ for more details.
id: Lihat `bug 1616281 <https://launchpad.net/bugs/1616281>`_ untuk lebih jelasnya.

source: Services deploy into virtual environments by default when the service relies on Python. Find the virtualenv for each service under ``/openstack/venvs/`` on the host or in the container where the service is deployed. Disable the use of virtualenv by overriding the service-specific variable (for example ``cinder_venv_enabled``) which defaults to ``True``.
id: Layanan menyebar ke lingkungan virtual secara default ketika layanan bergantung pada Python. Temukan virtualenv untuk setiap layanan di bawah ``/openstack/venvs/`` pada host atau dalam kontainer tempat layanan tersebut digunakan. Nonaktifkan penggunaan virtualenv dengan mengesampingkan variabel service-specific (misalnya ``cinder_venv_enabled``) yang secara default adalah ``True``.

source: Services deploy into virtual environments by default when the service relies on Python. On upgrade any Python packages installed on the host or container are not upgraded with the release unless the virtualenv for that service is disabled. There might be older and possibly broken packages left on the system outside of the virtualenv, which can cause confusion for those who attempt to use Python-based tools or services without using the virtualenv. These left over packages can be manually removed at the operator's discretion.
id: Layanan menyebar ke lingkungan virtual secara default ketika layanan bergantung pada Python. Saat memutakhirkan paket Python apa pun yang diinstal pada host atau kontainer tidak upgraded dengan rilis kecuali jika virtualenv untuk layanan itu dinonaktifkan. Mungkin ada paket yang lebih tua dan mungkin rusak yang tersisa di sistem di luar virtualenv, yang dapat menyebabkan kebingungan bagi mereka yang mencoba menggunakan alat atau layanan berbasis Python tanpa menggunakan virtualenv. Paket yang tersisa ini dapat dihapus secara manual atas kebijakan operator.

source: Set ``keystone_mod_wsgi_enabled`` to ``false`` to deploy Keystone under Uwsgi and allow the web server to be bypassed during these tasks.
id: Setel ``keystone_mod_wsgi_enabled`` menjadi ``false`` untuk menggunakan Keystone di bawah Uwsgi dan memungkinkan server web untuk dilewati selama tugas ini.

source: Set diff return variable to a dict of changes applied.
id: Setel variabel pengembalian diff ke dict perubahan yang diterapkan.

source: Set the ``glance_swift_store_auth_insecure`` variable to override the ``swift_store_auth_inscure`` value in ``/etc/glance/glance-api.conf``. Set this value when using an external Swift store that does not have the same ``insecure`` setting as the local Keystone.
id: Setel variabel ``glance_swift_store_auth_insecure`` untuk mengganti nilai ``swift_store_auth_inscure`` dalam ``/etc/glance/glance-api.conf``. Tetapkan nilai ini saat menggunakan external Swift store yang tidak memiliki pengaturan ``insecure`` yang sama dengan Keystone lokal.

source: Setting the haproxy_bind list on a service is now used as an override to the other VIPs defined in the environment. Previously it was being treated as an append to the other VIPs so there was no path to override the VIP binds for a service. For example, haproxy_bind could be used to bind a service to the internal VIP only.
id: Menyetel daftar haproxy_bind pada layanan sekarang digunakan sebagai pengganti bagi VIP lain yang didefinisikan di lingkungan. Sebelumnya itu diperlakukan sebagai tambahan untuk VIP lain sehingga tidak ada jalan untuk mengganti VIP mengikat untuk layanan. Misalnya, haproxy_bind dapat digunakan untuk mengikat layanan ke VIP internal saja.

source: Settings related to nginx and the placement will no longer serve any purpose, and should be removed. Those settings are as follows - ``nova_placement_nginx_access_log_format_extras``, ``nova_placement_nginx_access_log_format_combined``, ``nova_placement_nginx_extra_conf``, ``nova_placement_uwsgi_socket_port``, and ``nova_placement_pip_packages``.
id: Pengaturan yang terkait dengan nginx dan penempatan tidak akan lagi melayani tujuan apa pun, dan harus dihapus. Pengaturan tersebut adalah sebagai berikut - ``nova_placement_nginx_access_log_format_extras``, ``nova_placement_nginx_access_log_format_combined``, ``nova_placement_nginx_extra_conf``, ``nova_placement_uwsgi_socket_port``, dan ``nova_placement_pip_packages``.

source: Setup for the PowerVM driver was not properly configuring the system to support RMC configuration for client instances. This fix introduces an interface template for PowerVM that properly supports mixed IPV4/IPV6 deploys and adds documentation for PowerVM RMC. For more information see bug 1643988.
id: Pengaturan untuk driver PowerVM tidak mengkonfigurasi sistem dengan benar untuk mendukung konfigurasi RMC untuk instance klien. Perbaikan ini memperkenalkan templat antarmuka untuk PowerVM yang benar mendukung penyebaran IPV4/IPV6 campuran dan menambahkan dokumentasi untuk PowerVM RMC. Untuk informasi lebih lanjut lihat bug 1643988.

source: Several ``nova.conf`` options that were deprecated have been removed from the ``os_nova`` role. The following OpenStack-Ansible variables are no longer used and should be removed from any variable override files. * ``nova_dhcp_domain`` * ``nova_quota_fixed_ips`` * ``nova_quota_floating_ips`` * ``nova_quota_security_group_rules`` * ``nova_quota_security_groups``
id: Beberapa opsi ``nova.conf`` yang sudah usang telah dihapus dari peran ``os_nova``. Variabel OpenStack-Ansible berikut tidak lagi digunakan dan harus dihapus dari file override variabel apa pun. * ``nova_dhcp_domain`` * ``nova_quota_fixed_ips`` * ``nova_quota_floating_ips`` * ``nova_quota_security_group_rules`` * ``nova_quota_security_groups``

source: Several configuration files that were not templated for the ``os_ceilometer`` role are now retrieved from git. The git repository used can be changed using the ``ceilometer_git_config_lookup_location`` variable. By default this points to ``git.openstack.org``. These files can still be changed using the ``ceilometer_x_overrides`` variables.
id: Beberapa file konfigurasi yang tidak di-templated untuk role ``os_ceilometer`` sekarang diambil dari git. Repositori git yang digunakan dapat diubah menggunakan variabel ``ceilometer_git_config_lookup_location``. Secara default ini menunjuk ke ``git.openstack.org``. File ini masih dapat diubah menggunakan variabel ``ceilometer_x_overrides``.

source: Several configuration files that were not templated for the ``os_gnocchi` role are now retrieved from git. The git repository used can be changed using the ``gnocchi_git_config_lookup_location`` variable. By default this points to ``git.openstack.org``. These files can still be changed using the ``gnocchi_x_overrides`` variables.
id: Beberapa file konfigurasi yang tidak di-templated untuk role ``os_gnocchi` sekarang diambil dari git. Repositori git yang digunakan dapat diubah menggunakan variabel ``gnocchi_git_config_lookup_location``. Secara default ini menunjuk ke ``git.openstack.org``. File ini masih dapat diubah menggunakan variabel ``gnocchi_x_overrides``.

source: Several environment variables have been added in the bootstrapping functions used by the gate-check-commit script. These variables can be used to skip various phases of the bootstrap during the gate-check-commit or bootstrap-ansible script execution.
id: Beberapa variabel lingkungan telah ditambahkan dalam fungsi bootstrap yang digunakan oleh skrip gate-check-commit. Variabel-variabel ini dapat digunakan untuk melewati berbagai fase bootstrap selama eksekusi skrip gate-check-commit atau bootstrap-ansible.

source: Simplifies configuration of lbaas-mgmt network.
id: Menyederhanakan konfigurasi jaringan lbaas-mgmt.

source: Since we use neutron's credentials to access the queue, security conscious people might want to set up an extra user for octavia on the neutron queue restricted to the topics octavia posts to.
id: Karena kami menggunakan kredensial neutron untuk mengakses queue, orang yang sadar akan keamanan mungkin ingin mengatur pengguna tambahan octavia pada queue neutron terbatas (restricted) pada topik posting octavia

source: Some variables names have been changed to reflect upstream design decisions (such as Nova's default API version), or to provide clarity. These require updating in ``/etc/openstack_deploy/user_*.yml`` for any overrides to continue to work. See the `upgrade documentation <http://docs.openstack.org/developer/openstack-ansible/liberty/upgrade-guide/scripts.html#migrate-openstack-vars-py>` for details.
id: Beberapa nama variabel telah diubah untuk mencerminkan keputusan desain hulu (seperti Nova's default API version), atau untuk memberikan kejelasan. Ini membutuhkan updating di ``/etc/openstack_deploy/user_*.yml`` untuk setiap override untuk terus bekerja. Lihat `upgrade documentation <http://docs.openstack.org/developer/openstack-ansible/liberty/upgrade-guide/scripts.html#migrate-openstack-vars-py>` untuk detailnya.

source: Specify the ``gnocchi_auth_mode`` var to set the ``auth_mode`` for gnocchi. This defaults to ``basic`` which has changed from ``noauth`` to match upstream. If ``gnocchi_keystone_auth`` is ``true`` or ``yes`` this value will default to ``keystone``.
id: Tentukan var ``gnocchi_auth_mode`` untuk mengatur ``auth_mode`` untuk gnocchi. Ini default ke ``basic`` yang telah berubah dari ``noauth`` untuk mencocokkan dengan upstream. Jika ``gnocchi_keystone_auth`` menjadi ``true`` atau ``yes`` nilai ini akan default ke ``keystone``.

source: Specify the ``gnocchi_git_config_lookup_location`` value to specify the git repository where the ``gnocchi`` config files can be retrieved. The ``api-paste.ini`` and ``policy.json`` files are now retrieved from the specified git repository and are not carried in the ``os_gnocchi`` role.
id: Tentukan nilai ``gnocchi_git_config_lookup_location`` untuk menentukan repositori git di mana file konfigurasi ``gnocchi`` dapat diambil. File ``api-paste.ini`` dan ``policy.json`` sekarang diambil dari repositori git yang ditentukan dan tidak dijalankan dalam role ``os_gnocchi``.

source: Static route information for provider networks now *must* include the `cidr` and `gateway` information. If either key is missing, an error will be raised and the dynamic_inventory.py script will halt before any Ansible action is taken. Previously, if either key was missing, the inventory script would continue silently without adding the static route information to the networks. Note that this check does not validate the CIDR or gateway values, just just that the values are present.
id: Informasi rute statis untuk jaringan penyedia sekarang *must* menyertakan informasi `cidr` dan `gateway`. Jika salah satu kunci tidak ada, kesalahan akan dimunculkan dan skrip dynamic_inventory.py akan berhenti sebelum tindakan yang mungkin dilakukan. Sebelumnya, jika salah satu kunci tidak ada, skrip inventaris akan terus diam tanpa menambahkan informasi rute statis ke jaringan. Perhatikan bahwa pemeriksaan ini tidak memvalidasi nilai CIDR atau gateway, hanya saja nilainya ada.

source: Stein Series Release Notes
id: Catatan Rilis Seri Stein

source: Support added to allow deploying on ppc64le architecture using the Ubuntu distributions.
id: Dukungan ditambahkan untuk memungkinkan penggunaan arsitektur ppc64le menggunakan distribusi Ubuntu.

source: Support for Neutron distributed virtual routing has been added to the ``os_neutron`` role. This includes the implementation of Networking Guide's suggested agent configuration. This feature may be activated by setting ``neutron_plugin_type: ml2.ovs.dvr`` in ``/etc/openstack_deploy/user_variables.yml``.
id: Dukungan untuk perutean virtual terdistribusi Neutron telah ditambahkan ke role ``os_neutron``. Ini termasuk penerapan konfigurasi agen yang disarankan Networking Guide. Fitur ini dapat diaktifkan dengan menetapkan ``neutron_plugin_type: ml2.ovs.dvr`` di ``/etc/openstack_deploy/user_variables.yml``.

source: Support for openSUSE in Ussuri is moved from fully supported to experimental due to insufficient resources to maintain reliable CI jobs. The zuul jobs are moved to be non-voting. Support will be removed entirely in the Victoria cycle.
id: Dukungan untuk openSUSE di Ussuri dipindahkan dari didukung penuh ke eksperimental karena sumber daya yang tidak mencukupi untuk mempertahankan pekerjaan CI yang andal. Pekerjaan zuul dipindahkan menjadi tidak memilih. Dukungan akan dihapus seluruhnya dalam siklus Victoria.

source: Support for the deployment of Unbound caching DNS resolvers has been added as an optional replacement for /etc/hosts management across all hosts in the environment. To enable the Unbound DNS containers, add ``unbound_hosts`` entries to the environment.
id: Dukungan untuk penyebaran resolusi DNS caching tidak terikat telah ditambahkan sebagai pengganti opsional untuk /etc/hosts management di semua host di lingkungan. Untuk mengaktifkan kontainer Unbound DNS, tambahkan entri ``unbound_hosts`` ke lingkungan.

source: Support for the networking-generic-switch mechanism driver has been implemented. This allows Ironic to interface with Neutron when the ``neutron`` network interface has been configured. This feature may be enabled by adding ``ml2.genericswitch`` to the ``neutron_plugin_types`` list in ``/etc/openstack_deploy/user_variables.yml``.
id: Dukungan untuk driver networking-generic-switch mechanism telah diterapkan. Ini memungkinkan Ironic untuk berinteraksi dengan Neutron ketika antarmuka jaringan ``neutron`` telah dikonfigurasi. Fitur ini dapat diaktifkan dengan menambahkan ``ml2.genericswitch`` ke daftar ``neutron_plugin_types`` di ``/etc/openstack_deploy/user_variables.yml``.

source: Support had been added to allow the functional tests to pass when deploying on ppc64le architecture using the Ubuntu distributions.
id: Dukungan telah ditambahkan untuk memungkinkan tes fungsional untuk lulus ketika menggunakan arsitektur ppc64le menggunakan distribusi Ubuntu.

source: Support had been added to install the ceph_client packages and dependencies from Ceph.com, Ubuntu Cloud Archive (UCA), or the operating system's default repository.
id: Dukungan telah ditambahkan untuk menginstal paket dan dependensi ceph_client dari Ceph.com, Ubuntu Cloud Archive (UCA), atau repositori default sistem operasi.

source: Support has been added for deploying on Ubuntu 18.04 LTS hosts. The most significant change is a major version increment of LXC from 2.x to 3.x which deprecates some previously used elements of the container configuration file.
id: Dukungan telah ditambahkan untuk penggunaan pada host Ubuntu 18.04 LTS. Perubahan paling signifikan adalah peningkatan versi utama LXC dari 2.x menjadi 3.x yang mencela (deprecate) beberapa elemen yang sebelumnya digunakan dari file konfigurasi kontainer.

source: Support has been added for the horizon designate-ui dashboard. The dashboard will be automatically enabled if any hosts are in the ``dnsaas_hosts`` inventory group.
id: Dukungan telah ditambahkan untuk dasbor horizon designate-ui. Dasbor akan diaktifkan secara otomatis jika ada host di grup inventory ``dnsaas_hosts``.

source: Support has been added for the horizon trove-ui dashboard. The dashboard will be automatically enabled if any hosts are defined in the ``trove-infra_hosts`` inventory group.
id: Dukungan telah ditambahkan untuk dasbor horizon trove-ui. Dasbor akan diaktifkan secara otomatis jika ada host yang ditentukan dalam grup inventory ``trove-infra_hosts``.

source: Support has been added to allow the deployment of the OpenStack barbican service when hosts are present in the host group ``key-manager_hosts``.
id: Dukungan telah ditambahkan untuk memungkinkan penyebaran layanan barbican OpenStack ketika host hadir dalam grup host ``key-manager_hosts``.

source: Support is added for deploying OpenStack on CentOS 8 with source and distro based installs. However, nspawn support can't be offered, as machinectl relies on btrfs which has been dropped by CentOS.
id: Dukungan ditambahkan untuk menyebarkan OpenStack pada CentOS 8 dengan instalasi berbasis sumber dan distro. Namun, dukungan nspawn tidak dapat ditawarkan, karena machinectl bergantung pada btrf yang telah dijatuhkan oleh CentOS.

source: Support is added for deploying OpenStack on Ubuntu Focal (20.04) with source based installs. Ubuntu Cloud Archive is not available for Focal at this point so it is not possible to offer distro package based installs for Focal.
id: Dukungan ditambahkan untuk menyebarkan OpenStack pada Ubuntu Focal (20.04) dengan instalasi berbasis sumber (source based installs). Ubuntu Cloud Archive tidak tersedia untuk Focal pada saat ini sehingga tidak mungkin untuk menawarkan instalasi berbasis paket distro untuk Focal.

source: Support of the legacy neutron L3 tool has been dropped. Deployers are appreciated to use built-in l3-agent options for configuring HA.
id: Dukungan legacy neutron L3 tool telah dijatuhkan. Deployers diapresiasi untuk menggunakan opsi built-in l3-agent untuk mengonfigurasi HA.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in aodh.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di aodh.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in barbican.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di barbican.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in ceilometer.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di ceilometer.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in cinder.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di cinder.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in designate.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di designate.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in glance.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di glance.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in heat.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di heat.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in ironic.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di ironic.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in keystone.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di keystone.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in magnum.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di magnum.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in neutron.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di neutron.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in nova.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di nova.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in octavia.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di octavia.

source: Support separate oslo.messaging services for RPC and Notifications to enable operation of separate and different messaging backend servers in sahara.
id: Mendukung layanan oslo.messaging terpisah untuk RPC dan Notification untuk mengaktifkan operasi server backend messaging yang berbeda dan terpisah di sahara.
