Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: During upgrade process role will drop `gnocchi_service_port` from apache listeners (ports.conf) and gnocchi virtualhost, which by default means misconfigured apache service (since it won't have any listeners) unless it's aio build and this apache server is in use by other role/service. Apache server won't be dropped from gnocchi_api hosts, so deployers are encoureged to remove it manually.
id: Selama proses pemutakhiran, role akan melepaskan `gnocchi_service_port` dari apache listeners (ports.conf) dan gnocchi virtualhost, yang secara default berarti apache service yang tidak terkonfigurasi (karena tidak akan memiliki listeners) kecuali itu membangun dan server apache ini digunakan oleh role/service lain. Server Apache tidak akan di-drop dari host gnocchi_api, jadi deployer disarankan untuk menghapusnya secara manual.

source: During upgrade process role will drop `panko_service_port` from apache listeners (ports.conf) and panko virtualhost, which by default means misconfigured apache service (since it won't have any listeners) unless it's aio build and this apache server is in use by other role/service. Apache server won't be dropped from panko_api hosts, so deployers are encoureged to remove it manually.
id: Selama proses pemutakhiran, role akan menurunkan `panko_service_port` dari apache listeners (ports.conf) dan panko virtualhost, yang secara default berarti apache service yang tidak terkonfigurasi (karena tidak akan memiliki listeners) kecuali itu aio build dan server apache ini digunakan oleh role/service lain. Server Apache tidak akan di-drop dari host panko_api, jadi deployer disarankan untuk menghapusnya secara manual.

source: During upgrades, container and service restarts for the mariadb/galera cluster were being triggered multiple times and causing the cluster to become unstable and often unrecoverable. This situation has been improved immensely, and we now have tight control such that restarts of the galera containers only need to happen once, and are done so in a controlled, predictable and repeatable way.
id: Selama upgrade, kontainer dan restart layanan untuk klaster mariadb/galera dipicu beberapa kali dan menyebabkan kluster menjadi tidak stabil dan sering tidak dapat dipulihkan. Situasi ini telah sangat ditingkatkan, dan kami sekarang memiliki kontrol ketat sehingga me-restart kontainer galera hanya perlu terjadi sekali, dan dilakukan dengan cara yang terkendali, dapat diprediksi, dan dapat diulang ((repeatable way).

source: Each openstack service role has a new variable <role>_bind_address which defaults to 0.0.0.0. A global override openstack_service_bind_address may be used by a deployer either in group_vars or user_variables to define an alternative IP address for services to bind to. This feature allows a deployer to bind all of the services to a specific network, for example the openstack management network. In this release the default binding remains 0.0.0.0, and future releases may default the binding to the management network.
id: Setiap peran layanan openstack memiliki variabel baru <role>_bind_address yang standarnya adalah 0,0.0.0. Openstack_service_service_bind_address global dapat digunakan oleh deployer baik dalam group_vars atau user_variables untuk menentukan alamat IP alternatif untuk mengikat layanan. Fitur ini memungkinkan penyebar untuk mengikat semua layanan ke jaringan tertentu, misalnya jaringan manajemen openstack. Dalam rilis ini pengikatan default tetap 0.0.0.0, dan rilis di masa depan mungkin default pengikatan ke jaringan manajemen.

source: Each service using RabbitMQ now has a separate vhost and user.
id: Setiap layanan yang menggunakan RabbitMQ sekarang memiliki vhost dan pengguna yang terpisah.

source: Each service using RabbitMQ now has a separate vhost and user. The shared / vhost is cleaned up so that it contains only the default data. The shared user 'openstack' is removed.
id: Setiap layanan yang menggunakan RabbitMQ sekarang memiliki vhost dan pengguna yang terpisah. Shared/vhost dibersihkan sehingga hanya berisi data default. 'openstack' pengguna bersama dihapus.

source: Enable HTTPS on the horizon host without a load balancer. This is the role's default behaviour which matches what it always has been.
id: Aktifkan HTTPS di horison host tanpa penyeimbang beban. Ini adalah perilaku default peran yang cocok dengan yang selalu ada.

source: Enable Kernel Shared Memory support by setting ``nova_compute_ksm_enabled`` to ``True``.
id: Aktifkan dukungan Kernel Shared Memory dengan mengatur ``nova_compute_ksm_enabled`` ke ``True``.

source: Enable rsync module per object server drive by setting the ``swift_rsync_module_per_drive`` setting to ``True``. Set this to configure rsync and swift to utilise individual configuration per drive. This is required when disabling rsyncs to individual disks. For example, in a disk full scenario.
id: Aktifkan modul rsync per drive server objek dengan mengatur pengaturan ``swift_rsync_module_per_drive`` ke ``True``. Setel ini untuk mengkonfigurasi rsync dan cepat untuk menggunakan konfigurasi individual per drive. Ini diperlukan saat menonaktifkan rsyncs ke disk individual. Misalnya, dalam skenario disk penuh.

source: Errors relating to groups containing both hosts and other groups as children now raise a more descriptive error. See inventory documentation for more details. Fixes bug
id: Kesalahan yang berkaitan dengan grup yang anggotanya host dan grup lain ketika turunannya menimbulkan kesalahan yang lebih deskriptif. Lihat dokumentasi inventaris untuk lebih jelasnya. Memperbaiki bug

source: Example, for an override like:
id: Contoh, untuk override seperti:

source: Existing LBaaS v1 load balancers and agents will not be altered by the new OpenStack-Ansible release.
id: Agent dan penyeimbang beban LBaaS v1 yang ada tidak akan diubah oleh rilis OpenStack-Ansible yang baru.

source: Experimental support has been added to allow the deployment of the OpenStack Bare Metal Service (Ironic). Details for how to set it up are available in the `OpenStack-Ansible Install Guide for Ironic <http://docs.openstack.org/developer/openstack-ansible/install-guide/configure-ironic.html>`_.
id: Dukungan eksperimental telah ditambahkan untuk memungkinkan penyebaran OpenStack Bare Metal Service (Ironic). Rincian cara mengaturnya tersedia di `OpenStack-Ansible Install Guide for Ironic <http://docs.openstack.org/developer/openstack-ansible/install-guide/configure-ironic.html>`_.

source: Experimental support has been added to allow the deployment of the OpenStack Bare Metal Service (Ironic). Details for how to set it up are available in the `OpenStack-Ansible Install Guide for Ironic <http://docs.openstack.org/developer/openstack-ansible/mitaka/install-guide/configure-ironic.html>`_.
id: Dukungan eksperimental telah ditambahkan untuk memungkinkan penyebaran OpenStack Bare Metal Service (Ironic). Rincian cara mengaturnya tersedia di `OpenStack-Ansible Install Guide for Ironic <http://docs.openstack.org/developer/openstack-ansible/mitaka/install-guide/configure-ironic.html>`_.

source: Experimental support has been added to allow the deployment of the OpenStack Designate service when hosts are present in the host group ``dnsaas_hosts``.
id: Dukungan eksperimental telah ditambahkan untuk memungkinkan penyebaran layanan OpenStack Designate ketika host ada di grup host ``dnsaas_hosts``.

source: Experimental support has been added to allow the deployment of the OpenStack Magnum service when hosts are present in the host group ``magnum-infra_hosts``.
id: Dukungan eksperimental telah ditambahkan untuk memungkinkan penyebaran layanan OpenStack Magnum ketika host ada di grup host ``magnum-infra_hosts``.

source: Experimental support has been added to allow the deployment of the OpenStack Masakari service when hosts are present in the host group ``masakari-infra_hosts``.
id: Dukungan eksperimental telah ditambahkan untuk memungkinkan penyebaran layanan OpenStack Masakari ketika host ada di grup host ``masakari-infra_hosts``.

source: Experimental support has been added to allow the deployment of the OpenStack Octavia Load Balancing service when hosts are present in the host group ``octavia-infra_hosts``.
id: Dukungan eksperimental telah ditambahkan untuk memungkinkan penyebaran layanan OpenStack Octavia Load Balancing ketika host hadir dalam grup host ``octavia-infra_hosts``.

source: Experimental support has been added to allow the deployment of the OpenStack Senlin service when hosts are present in the host group ``senlin-infra_hosts``.
id: Dukungan eksperimental telah ditambahkan untuk memungkinkan deployment layanan OpenStack Senlin ketika host ada di grup host ``senlin-infra_hosts``.

source: Experimental support has been added to allow the deployment of the OpenStack trove service when hosts are present in the host group ``trove-infra_hosts``.
id: Dukungan eksperimental telah ditambahkan untuk memungkinkan penyebaran layanan OpenStack trove ketika host ada di grup host ``trove-infra_hosts``.

source: Experimental support has been added to allow the deployment of the Sahara data-processing service. To deploy sahara hosts should be present in the host group ``sahara-infra_hosts``.
id: Dukungan eksperimental telah ditambahkan untuk memungkinkan penyebaran layanan pemrosesan data Sahara. Untuk menggunakan host sahara harus ada di grup host ``sahara-infra_hosts``.

source: Extra headers can be added to Keystone responses by adding items to ``keystone_extra_headers``. Example:
id: Header tambahan dapat ditambahkan ke respons Keystone dengan menambahkan item ke ``keystone_extra_headers``. Contoh:

source: FWaaS V2 has been added to neutron. To enable this service simply add "firewall_v2" to the "neutron_plugin_base" list.
id: FWaaS V2 telah ditambahkan ke neutron. Untuk mengaktifkan layanan ini cukup tambahkan "firewall_v2" ke daftar "neutron_plugin_base".

source: Failed access logging is now disabled by default and can be enabled by changing ``security_audit_failed_access`` to ``yes``. The rsyslog daemon checks for the existence of log files regularly and this audit rule was triggered very frequently, which led to very large audit logs.
id: Pencatatan akses yang gagal sekarang dinonaktifkan secara default dan dapat diaktifkan dengan mengubah ``security_audit_failed_access`` menjadi ``yes``. Daemon rsyslog memeriksa keberadaan file log secara teratur dan aturan audit ini dipicu sangat sering, yang menyebabkan log audit sangat besar.

source: Fedora 25 support is deprecated and no longer tested on each commit.
id: Dukungan Fedora 25 sudah usang dan tidak lagi diuji pada setiap komit.

source: Fedora 26 is now supported.
id: Fedora 26 sekarang didukung.

source: Fedora is no longer tested in CI for each commit.
id: Fedora tidak lagi diuji dalam CI untuk setiap komit.

source: Fix bug https://bugs.launchpad.net/openstack-ansible/+bug/1553796 by ensuring that the --insecure flag is passed to the cinder CLI tool during task execution
id: Perbaiki bug https://bugs.launchpad.net/openstack-ansible/+bug/1553796 dengan memastikan bahwa the --insecure flag diteruskan ke CLI cinder tool selama pelaksanaan tugas

source: Fix run-upgrade.sh so that it correctly calls nova-flavor-migration.yml and no longer fails due to the non-existent playbook nova-extra-migrations.yml.
id: Perbaiki run-upgrade.sh sehingga benar memanggil nova-flavor-migration.yml dan tidak lagi gagal karena playbook tidak ada nova-extra-migrations.yml.

source: Fixes bug https://bugs.launchpad.net/openstack-ansible/+bug/1778098 where playbook failed, if ``horizon_custom_themes`` is specified, and directory for theme is not provided
id: Memperbaiki bug https://bugs.launchpad.net/openstack-ansible/+bug/1778098 ketika playbook gagal, jika ``horizon_custom_themes`` ditentukan, dan direktori untuk tema tidak disediakan

source: Fixes neutron HA routers, by enabling ``neutron-l3-agent`` to invoke the required helper script.
id: Memperbaiki router HA neutron, dengan mengaktifkan ``neutron-l3-agent`` untuk memanggil skrip pembantu yang diperlukan.

source: For OpenStack-Ansible Liberty releases earlier than 12.2.2 the default container apt source used was ``https://mirror.rackspace.com/ubuntu``. This mirror seems to sometimes have broken package indexes or missing packages. The default package source has therefore been changed to make use of ``http://archive.ubuntu.com/ubuntu`` for packages and ``http://security.ubuntu.com/ubuntu`` for security packages.
id: Untuk rilis OpenStack-Ansible Liberty lebih awal dari 12.2.2 sumber apt container default yang digunakan adalah ``https://mirror.rackspace.com/ubuntu``. Cermin ini tampaknya terkadang memiliki indeks paket rusak atau paket yang hilang. Sumber paket default karenanya telah diubah untuk menggunakan ``http://archive.ubuntu.com/ubuntu`` untuk paket dan ``http://security.ubuntu.com/ubuntu`` untuk paket keamanan.

source: For OpenStack-Ansible Liberty versions <12.0.9 and Kilo versions <11.2.12 the package ``pywbem`` will fail to build due to the update to v0.8.0 including new requirements which are not met by the repo server. This issue has been resolved in 12.0.9. A workaround for this is to set ``pywbem<0.8.0`` in the file ``global-requirement-pins.txt``.
id: Untuk versi OpenStack-Ansible Liberty <12.0.9 dan Kilo versi <11.2.12 paket ``pywbem`` akan gagal dibangun karena pembaruan ke v0.8.0 termasuk persyaratan baru yang tidak dipenuhi oleh server repo. Masalah ini telah diatasi dalam 12.0.9. Solusi untuk ini adalah dengan menetapkan ``pywbem <0.8.0`` dalam file ``global-requirement-pins.txt``.

source: For OpenStack-Ansible Liberty versions >12.0.7,<12.0.9 the wheel version pinned in OpenStack-Ansible (0.29.0) is higher that the OpenStack upper-constraint (0.26.0). This causes an issue where the repo-server install may fail because it cannot find a version of wheel to install that meets the requirements of <0.26.0 and ==0.29.0. A workaround for this issue is to change the wheel package pin in the following files ``wheel==0.26.0``.
id: Untuk versi OpenStack-Ansible Liberty> 12.0.7, <12.0.9 versi roda (wheel version) yang disematkan di OpenStack-Ansible (0.29.0) lebih tinggi daripada batasan atas (upper-constraint) OpenStack (0.26.0). Ini menyebabkan masalah di mana instalasi repo-server mungkin gagal karena tidak dapat menemukan versi untuk menginstal yang memenuhi persyaratan <0.26.0 dan == 0.29.0. Solusi untuk masalah ini adalah mengubah pin paket roda (wheel package pin) dalam file berikut ``wheel == 0.26.0``.

source: For OpenStack-Ansible Mitaka releases earlier than 13.3.1 the default container apt source used was ``http://mirror.rackspace.com/ubuntu``. This mirror seems to sometimes have broken package indexes or missing packages. The default package source has therefore been changed to make use of ``http://archive.ubuntu.com/ubuntu/`` for packages and ``http://security.ubuntu.com/ubuntu`` for security packages.
id: Untuk rilis OpenStack-Ansible Mitaka lebih awal dari 13.3.1 sumber apt container default yang digunakan adalah``http://mirror.rackspace.com/ubuntu``. Cermin ini tampaknya terkadang memiliki indeks paket rusak atau paket yang hilang. Sumber paket default karenanya telah diubah untuk menggunakan ``http://archive.ubuntu.com/ubuntu/`` untuk paket dan ``http://security.ubuntu.com/ubuntu`` untuk paket keamanan.

source: For additional information, refer to the following bugs:
id: Untuk informasi tambahan, lihat bug berikut:

source: For all newton releases up to 14.2.14 when executing the os-nova-install.yml playbook the ``nova-novncproxy`` and ``nova-spicehtml5proxy`` services will fail. The workaround to resolve this issue is to restart the services.
id: Untuk semua rilis newton hingga 14.2.14 ketika menjalankan playbook os-nova-install.yml ``nova-novncproxy`` dan ``nova-spicehtml5proxy`` layanan akan gagal. Solusi untuk menyelesaikan masalah ini adalah memulai kembali layanan.

source: For all ocata releases prior to OpenStack-Ansible 15.1.16, several of the magnum requirements were not constrained. This resulted in the kubernetes version changing over time unexpectedly, rather than by intention. Most recently this lack of constraint causes the repo build to fail when trying to build the magnum venv due to incompatible requirements.
id: Untuk semua rilis ocata sebelum OpenStack-Ansible 15.1.16, beberapa persyaratan magnum tidak dibatasi. Ini mengakibatkan versi kubernet berubah dari waktu ke waktu secara tak terduga, bukan karena niat. Baru-baru ini kurangnya pembatasan ini menyebabkan repo build gagal ketika mencoba membangun magnum venv karena persyaratan yang tidak kompatibel.

source: For all ocata releases up to 15.1.16 when executing the os-nova-install.yml playbook the ``nova-novncproxy`` and ``nova-spicehtml5proxy`` services will fail. The workaround to resolve this issue is to restart the services.
id: Untuk semua rilis ocata hingga 15.1.16 ketika menjalankan playbook os-nova-install.yml, ``nova-novncproxy`` dan `` nova-spicehtml5proxy`` layanan akan gagal. Solusi untuk menyelesaikan masalah ini adalah memulai kembali (restart) layanan.

source: For all pike releases up to 16.0.7 when executing the os-nova-install.yml playbook the ``nova-novncproxy`` and ``nova-spicehtml5proxy`` services will fail. The workaround to resolve this issue is to restart the services.
id: Untuk semua rilis pike hingga 16.0.7 saat menjalankan playbook os-nova-install.yml, ``nova-novncproxy`` dan ``nova-spicehtml5proxy`` layanan akan gagal. Solusi untuk menyelesaikan masalah ini adalah memulai kembali layanan.

source: For example, a deployer could have disabled direct root ssh logins with the following variable:
id: Sebagai contoh, seorang deployer bisa menonaktifkan login ssh root langsung dengan variabel berikut:

source: For example, to enable the `InstanceLocalityFilter` in addition to the normally enabled scheduler filters, use the following variable.
id: Misalnya, untuk mengaktifkan `InstanceLocalityFilter` di samping filter penjadwal yang diaktifkan secara normal, gunakan variabel berikut ini.

source: For more information about SFC in Neutron, refer to the following:
id: Untuk informasi lebih lanjut tentang SFC di Neutron, lihat yang berikut ini:

source: For newton releases 14.2.14 and earlier, we recommend pinning the LXD version for all newton deployments at a version less than 2.0.11. For newton releases 14.2.15 onwards, the newer release of LXD should be usable again.
id: Untuk rilis newton 14.2.14 dan sebelumnya, kami sarankan menyematkan versi LXD untuk semua penyebaran newton pada versi kurang dari 2.0.11. Untuk rilis newton 14.2.15 dan seterusnya, rilis LXD yang lebih baru harus dapat digunakan kembali.

source: For systems using the APT package manager, the sources file for the MariaDB repo now has a consistent name, 'MariaDB.list'.
id: Untuk sistem yang menggunakan manajer paket APT, file sumber untuk repo MariaDB sekarang memiliki nama yang konsisten, 'MariaDB.list'.

source: For systems using the APT package manager, the sources files for the MariaDB and Percona repos now have consistent names, 'MariaDB.list' and 'Percona.list'.
id: Untuk sistem yang menggunakan manajer paket APT, file sumber untuk repo MariaDB dan Percona sekarang memiliki nama yang konsisten, 'MariaDB.list' dan 'Percona.list'.

source: For the ``os_aodh`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``aodh_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_aodh``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan (drain) sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``aodh_*_init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_barbican`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``barbican_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_barbican``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan (drain) sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``barbican_*_init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_ceilometer`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``ceilometer_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_ceilometer``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan (drain) sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``ceilometer_*_init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.
