Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: When using the pypy python interpreter you can configure the garbage collection (gc) settings for pypy. Set the minimum GC value using the ``swift_pypy_gc_min`` variable. GC will only happen when the memory size is above this value. Set the maximum GC value using the ``swift_pypy_gc_max`` variable. This is the maximum memory heap size for pypy. Both variables are not defined by default, and will only be used if the values are defined and ``swift_pypy_enabled`` is set to ``True``.
id: Saat menggunakan interpreter python pypy, Anda dapat mengonfigurasi pengaturan garbage collection (gc) untuk pypy. Tetapkan nilai GC minimum menggunakan variabel ``swift_pypy_gc_min``. GC hanya akan terjadi ketika ukuran memori di atas nilai ini. Tetapkan nilai GC maksimum menggunakan variabel ``swift_pypy_gc_max``. Ini adalah ukuran tumpukan memori maksimum untuk pypy. Kedua variabel tidak didefinisikan secara default, dan hanya akan digunakan jika nilainya ditentukan dan ``swift_pypy_enabled`` diatur ke ``True``.

source: Whether ceilometer should be enabled by default for each service is now dynamically determined based on whether there are any ceilometer hosts/containers deployed. This behaviour can still be overridden by toggling ``<service>_ceilometer_enabled`` in ``/etc/openstack_deploy/user_variables.yml``.
id: Apakah ceilometer harus diaktifkan secara default untuk setiap layanan sekarang ditentukan secara dinamis berdasarkan apakah ada host/kontainer ceilometer yang digunakan. Perilaku ini masih bisa ditimpa dengan toggling ``<service>_ceilometer_enabled`` di ``/etc/openstack_deploy/user_variables.yml``.

source: Whether the Neutron DHCP Agent, Metadata Agent or LinuxBridge Agent should be enabled is now dynamically determined based on the ``neutron_plugin_type`` and the ``neutron_ml2_mechanism_drivers`` that are set. This aims to simplify the configuration of Neutron services and eliminate the need for deployers to override the entire ``neutron_services`` dict variable to disable these services.
id: Apakah Neutron DHCP Agent, Metadata Agent atau LinuxBridge Agent harus diaktifkan sekarang ditentukan secara dinamis berdasarkan ``neutron_plugin_type`` dan ``neutron_ml2_mechanism_drivers`` yang ditetapkan. Ini bertujuan untuk menyederhanakan konfigurasi layanan Neutron dan meniadakan kebutuhan deployer untuk override seluruh variabel dict ``neutron_services`` untuk menonaktifkan layanan ini.

source: While default python interpreter for swift is cpython, pypy is now an option. This change adds the ability to greatly improve swift performance without the core code modifications. These changes have been implemented using the documentation provided by Intel and Swiftstack. Notes about the performance increase can be seen `here <https://software.intel.com/en-us/blogs/2016/05/06/doubling-the-performance-of-openstack-swift-with-no-code-changes>`_.
id: Sementara interpreter python default untuk swift adalah cpython, pypy sekarang menjadi pilihan. Perubahan ini menambahkan kemampuan untuk sangat meningkatkan kinerja swift tanpa modifikasi kode inti. Perubahan ini telah dilaksanakan dengan menggunakan dokumentasi yang disediakan oleh Intel dan Swiftstack. Catatan tentang peningkatan kinerja dapat dilihat `here <https://software.intel.com/en-us/blogs/2016/05/06/doubling-the-performance-of-openstack-swift-with-no-code-changes>`_.

source: With the implementation of `systemd-journal-remote` the `rsyslog_client` role is no longer run by default. To enable the legacy functionality, the variable `rsyslog_client_enabled` and `rsyslog_server_enabled` can be set to **true**.
id: Dengan implementasi `systemd-journal-remote` peran` rsyslog_client` tidak lagi dijalankan secara default. Untuk mengaktifkan fungsi legacy, variabel `rsyslog_client_enabled` dan` rsyslog_server_enabled` dapat diatur ke **true**.

source: With the release of CentOS 7.5, all pike releases are broken due to a mismatch in version between the libvirt-python library specified by the OpenStack community, and the version provided in CentOS 7.5. As such OSA is unable build the appropriate python library for libvirt. The only recourse for this is to upgrade the environment to the latest queens release.
id: Dengan rilis CentOS 7.5, semua rilis pike rusak karena ketidakcocokan dalam versi antara pustaka libvirt-python yang ditentukan oleh komunitas OpenStack, dan versi yang disediakan di CentOS 7.5. Karena itu OSA tidak dapat membangun pustaka python yang sesuai untuk libvirt. Satu-satunya jalan lain (recourse) untuk ini adalah melakukan upgrade lingkungan ke rilis ratu terbaru.

source: With the release of CentOS 7.6, deployments were breaking and becoming very slow when we restart dbus in order to catch some PolicyKit changes. However, those changes were never actaully used so they were happening for no reason. We no longer make any modifications to the systemd-machined configuration and/or PolicyKit to maintain upstream compatibility.
id: Dengan rilis CentOS 7.6, deployment menjadi rusak dan menjadi sangat lambat ketika kami me-restart dbus untuk menangkap beberapa perubahan PolicyKit. Namun, perubahan itu tidak pernah digunakan secara penuh sehingga terjadi tanpa alasan. Kami tidak lagi melakukan modifikasi pada konfigurasi systemd-machined dan/atau PolicyKit untuk menjaga kompatibilitas hulu.

source: Within the ``haproxy`` role *hatop* has been changed from a package installation to a source-based installation. This has been done to ensure that the same operator tooling is available across all supported distributions. The download URL for the source can be set using the variable ``haproxy_hatop_download_url``.
id: Dalam peran ``haproxy`` *hatop* telah diubah dari instalasi paket menjadi instalasi berbasis sumber. Ini telah dilakukan untuk memastikan bahwa peralatan operator yang sama tersedia di semua distribusi yang didukung. URL unduhan untuk sumber dapat diatur dengan menggunakan variabel ``haproxy_hatop_download_url``.

source: XtraBackup is currently on version 2.4.5 for amd64 architecture when pulling rpm/deb packages from the repos. To pull the latest available 2.4 branch version from the yum/apt repository set the ``use_percona_upstream`` variable to ``True``. The default behavior using deb packages is unchanged.
id: XtraBackup saat ini pada versi 2.4.5 untuk arsitektur amd64 ketika menarik paket rpm/deb dari repo. Untuk menarik versi 2.4 branch terbaru yang tersedia dari repositori yum/apt, setel variabel ``use_percona_upstream`` menjadi ``True``. Perilaku default menggunakan paket deb tidak berubah.

source: XtraBackup is currently on version 2.4.5 for ppc64le architecture when pulling deb packages from the repos.
id: XtraBackup saat ini pada versi 2.4.5 untuk arsitektur ppc64le ketika menarik paket deb dari repo.

source: Yaml files used for ceilometer configuration will now allow a deployer to override a given list. If an override is provided that matches an already defined list in one of the ceilometer default yaml files the entire list will be replaced by the provided override. Previously, a nested lists of lists within the default ceilometer configration files would extend should a deployer provide an override matching an existing pipeline. The extension of the defaults had a high probability to cause undesirable outcomes and was very unpredictable.
id: File yaml yang digunakan untuk konfigurasi ceilometer sekarang akan memungkinkan deployer untuk override daftar yang diberikan. Jika override disediakan yang cocok dengan daftar yang sudah ditentukan dalam salah satu file yaml default ceilometer, seluruh daftar akan diganti oleh override yang disediakan. Sebelumnya, daftar yang bersarang di dalam file konfigurasi ceilometer default akan diperluas jika deployer menyediakan override yang cocok dengan pipeline yang ada. Perpanjangan default memiliki probabilitas tinggi untuk menyebabkan hasil yang tidak diinginkan dan sangat tidak terduga.

source: You can create a file for the network_host group, inside its group vars folder ``/etc/openstack_deploy/group_vars/network_hosts``, with the content:
id: Anda dapat membuat file untuk grup network_host, di dalam folder grup vars ``/etc/openstack_deploy/group_vars/network_hosts``, dengan konten:

source: You can force update the translations direct from Zanata by setting ``horizon_translations_update`` to ``True``. This will call the ``pull_catalog`` option built into ``horizon-manage.py``. You should only use this when testing translations, otherwise this should remain set to the default of ``False``.
id: Anda dapat memaksa memperbarui terjemahan langsung dari Zanata dengan mengatur ``horizon_translations_update`` ke ``True``. Ini akan memanggil opsi ``pull_catalog`` yang dibangun di dalam ``horizon-manage.py``. Anda hanya harus menggunakan ini saat menguji terjemahan, jika tidak, ini akan tetap diatur ke default ``False``.

source: You can now set the Libvirt CPU model and feature flags from the appropriate entry under the ``nova_virt_types`` dictionary variable (normally ``kvm``). ``nova_cpu_model`` is a string value that sets the CPU model; this value is ignored if you set any ``nova_cpu_mode`` other than ``custom``. ``nova_cpu_model_extra_flags`` is a list that allows you to specify extra CPU feature flags not normally passed through with ``host-model``, or the ``custom`` CPU model of your choice.
id: Anda sekarang dapat mengatur model CPU Libvirt dan flag fitur dari entri yang sesuai di bawah variabel pustaka ``nova_virt_types`` (biasanya ``kvm``). ``nova_cpu_model`` adalah nilai string yang mengatur model CPU; nilai ini diabaikan jika Anda mengatur ``nova_cpu_mode`` selain ``custom``. ``nova_cpu_model_extra_flags`` adalah daftar yang memungkinkan Anda menentukan flag fitur CPU tambahan yang biasanya tidak dilewati dengan ``host-model``, atau model CPU ``custom`` pilihan Anda.

source: You can set a private repository for epel, you must use ``repo_centos_epel_mirror`` for the repo URL and if you need to get the GPG key from intranet or a mirror use ``repo_centos_epel_key`` for gpg key location.
id: Anda dapat mengatur repositori pribadi untuk epel, Anda harus menggunakan ``repo_centos_epel_mirror`` untuk URL repo dan jika Anda perlu mendapatkan GPG key dari penggunaan intranet atau mirror ``repo_centos_epel_key`` untuk lokasi gpg key.

source: You can set the ``endpoint_type`` used when creating the Trove service network by specifying the ``trove_service_net_endpoint_type`` variable. This will default to ``internal``. Other possible options are ``public`` and ``admin``.
id: Anda dapat mengatur ``endpoint_type`` yang digunakan saat membuat jaringan layanan Trove dengan menentukan variabel ``trove_service_net_endpoint_type``. Ini akan default ke ``internal``. Opsi lain yang mungkin adalah ``public`` dan ``admin``.

source: You can specify the ``galera_package_arch`` variable to force a specific architecture when installing percona and qpress packages. This will be automatically calculated based on the architecture of the ``galera_server`` host. Acceptable values are ``x86_64`` for ``Ubuntu-14.04`, ``Ubuntu-16.04`` and ``RHEL 7``, and ``ppc64le`` for ``Ubuntu-16.04``.
id: Anda dapat menentukan variabel ``galera_package_arch`` untuk memaksa arsitektur spesifik saat menginstal paket percona dan qpress. Ini akan dihitung secara otomatis berdasarkan arsitektur host ``galera_server``. Nilai yang dapat diterima adalah ``x86_64`` untuk ``Ubuntu-14.04``, ``Ubuntu-16.04`` dan ``RHEL 7``, dan ``ppc64le`` untuk ``Ubuntu-16.04``.

source: You can specify the ``galera_package_arch`` variable to force a specific architecture when installing percona and qpress packages. This will be automatically calculated based on the architecture of the ``galera_server`` host. Acceptable values are ``x86_64`` for ``Ubuntu-16.04`` and ``RHEL 7``, and ``ppc64le`` for ``Ubuntu-16.04``.
id: Anda dapat menentukan variabel ``galera_package_arch`` untuk memaksa arsitektur spesifik saat menginstal paket percona dan qpress. Ini akan dihitung secara otomatis berdasarkan arsitektur host ``galera_server``. Nilai yang dapat diterima adalah ``x86_64`` untuk ``Ubuntu-16.04`` dan ``RHEL 7``, dan ``ppc64le`` untuk ``Ubuntu-16.04``.

source: `SESSION_ENGINE` has been changed to memcached by default. So that horizon do not require it's own database for storing session information anymore. `horizon_galera_*` variables has no effect now.
id: `SESSION_ENGINE` telah diubah menjadi memcached secara default. Sehingga horizon tidak memerlukan database sendiri untuk menyimpan informasi sesi lagi. Variabel `horizon_galera_ *` tidak berpengaruh sekarang.

source: ``PermitRootLogin`` in the ssh configuration has changed from ``yes`` to ``without-password``. This will only allow ssh to be used to authenticate root via a key.
id: ``PermitRootLogin`` dalam konfigurasi ssh telah berubah dari ``yes`` menjadi ``without-password``. Ini hanya akan memungkinkan ssh digunakan untuk mengotentikasi root melalui kunci.

source: ``SKIP_OSA_BOOTSTRAP_AIO``: Skip execution of the bootstrap-aio playbook in gate-check-commit
id: ``SKIP_OSA_BOOTSTRAP_AIO``: Lewati eksekusi playbook bootstrap-aio di gate-check-commit

source: ``SKIP_OSA_ROLE_CLONE``: Skip execution of the get-role-requirements-playbook in the bootstrap-ansible.sh script
id: ``SKIP_OSA_ROLE_CLONE``: Lewati eksekusi get-role-requirements-playbook dalam skrip bootstrap-ansible.sh

source: ``SKIP_OSA_RUNTIME_VENV_BUILD``: Skip bootstrapping of the OSA ansible venv in bootstrap-ansible.sh
id: ``SKIP_OSA_RUNTIME_VENV_BUILD``: Lewati bootstrap dari OSA ansible venv di bootstrap-ansible.sh

source: ``ceph``: This option installs Ceph from a ceph.com repo. Additional variables to adjust items such as Ceph release and regional download mirror can be found in the variables files.
id: ``ceph``: Opsi ini menginstal Ceph dari repo ceph.com. Variabel tambahan untuk menyesuaikan item seperti rilis Ceph dan mirror unduhan regional dapat ditemukan di file variabel.

source: ``distro``: This options installs Ceph from the operating system's default repository and unlike the other options does not attempt to manage package keys or add additional package repositories.
id: ``distro``: Opsi ini menginstal Ceph dari repositori default sistem operasi dan tidak seperti opsi lain tidak mencoba untuk mengelola kunci paket atau menambah repositori paket tambahan.

source: ``nova_compute_manager`` is now phased out.
id: ``nova_compute_manager`` sekarang dihapus.

source: ``nova_libvirt_live_migration_flag`` is now phased out. Please create a nova configuration override with ``live_migration_tunnelled: True`` if you want to force the flag ``VIR_MIGRATE_TUNNELLED`` to libvirt. Nova "chooses a sensible default" otherwise.
id: ``nova_libvirt_live_migration_flag`` sekarang dihapus. Harap buat override konfigurasi nova dengan ``live_migration_tunnelled: True`` jika Anda ingin memaksa flag ``VIR_MIGRATE_TUNNELLED`` ke libvirt. Nova "chooses a sensible default" jika tidak.

source: ``uca``: This option installs Ceph from the Ubuntu Cloud Archive. Additional variables to adjust items such as the OpenStack/Ceph release can be found in the variables files.
id: ``uca``: Opsi ini menginstal Ceph dari Ubuntu Cloud Archive. Variabel tambahan untuk menyesuaikan item seperti rilis OpenStack/Ceph dapat ditemukan dalam file variabel.

source: `horizon_listen_ports` variable was transformed to the dictionary with required keys `http` and `https` to have effect not only for apache ports.conf file, but also for the virtual host.
id: Variabel `horizon_listen_ports` ditransformasikan ke kamus dengan kunci yang diperlukan`http` dan `https` agar memiliki efek tidak hanya untuk file apache ports.conf, tetapi juga untuk host virtual.

source: `rabbitmq_install_method: file` is deprecated now and will be removed in the Wallaby release. As for now supported options are only `external_repo` and `distro`. Among with that the following variables are deprecated and prepared for the removal:
id: `rabbitmq_install_method: file` sudah tidak digunakan lagi dan akan dihapus dalam rilis Wallaby. Sedangkan untuk opsi yang didukung saat ini hanya `external_repo` dan`distro`. Diantara dengan itu variabel-variabel berikut sudah usang dan siap untuk dihapus:

source: aodh.yml and haproxy.yml will be copied into ``/etc/openstack_deploy/env.d``. LBaaS agent information will be added to ``/etc/openstack_deploy/env.d/neutron.yml``.
id: aodh.yml dan haproxy.yml akan disalin ke ``/etc/openstack_deploy/env.d``. Informasi agen LBaaS akan ditambahkan ke ``/etc/openstack_deploy/env.d/neutron.yml``.

source: ceilometer-polling services running on compute nodes did not have the polling namespace configured. Because of this they used the default value of running all pollsters from the central and compute namespaces. But the pollsters from the central namespace don't have to run on every compute node. This is fixed by only running the compute pollsters on compute nodes.
id: Layanan ceilometer-polling yang berjalan pada node komputasi tidak memiliki namespace polling yang dikonfigurasi. Karena itu, mereka menggunakan nilai default untuk menjalankan semua pollster dari pusat dan menghitung namespace. Tetapi pollster dari namespace pusat tidak harus berjalan pada setiap node komputasi. Ini diperbaiki dengan hanya menjalankan pollster komputasi pada node komputasi.

source: ceph-ansible is no longer configured to install ntp by default, which creates a conflict with OSA's ansible-hardening role that is used to implement ntp using 'chrony'.
id: ceph-ansible tidak lagi dikonfigurasikan untuk menginstal ntp secara default, yang menciptakan konflik dengan role ansible-hardening OSA yang digunakan untuk mengimplementasikan ntp menggunakan 'chrony'.

source: galera_package_download_validate_certs changed to percona_package_download_validate_certs for clarity
id: galera_package_download_validate_certs diubah menjadi percona_package_download_validate_certs untuk kejelasan

source: galera_package_path changed to percona_package_path for clarity
id: galera_package_path changed to percona_package_path untuk kejelasan

source: galera_package_sha256 changed to percona_package_sha256 for clarity
id: galera_package_sha256 changed to percona_package_sha256 untuk kejelasan

source: galera_package_url changed to percona_package_url for clarity
id: galera_package_url changed to percona_package_url untuk kejelasan

source: has been changed to:
id: telah diubah menjadi:

source: liberty release notes: https://wiki.openstack.org/wiki/ReleaseNotes/Liberty#OpenStack_Image_Service_.28Glance.29
id: catatan rilis liberty: https://wiki.openstack.org/wiki/ReleaseNotes/Liberty#OpenStack_Image_Service_.28Glance.29

source: memcached now logs with multiple levels of verbosity, depending on the user variables. Setting ``debug: True`` enables maximum verbosity while setting ``verbose: True`` logs with an intermediate level.
id: sekarang memcached log dengan beberapa level verbosity, tergantung pada variabel pengguna. Mengatur ``debug: True`` memungkinkan verbosity maksimum sementara pengaturan ``verbose: True`` mencatat dengan tingkat menengah.

source: nova-placement-api has been removed from the os_nova role, along with all `nova_placement_*` variables. Please review the `os_placement` role for information about how to configure the new placement service.
id: nova-placement-api telah dihapus dari peran os_nova, bersama dengan semua variabel `nova_placement_*`. Harap tinjau peran `os_placement` untuk informasi tentang cara mengonfigurasi layanan penempatan baru.

source: openSUSE Leap 42.X support is still work in progress and not fully tested besides basic coverange in the OpenStack CI and individual manual testing. Even though backporting fixes to the Pike release will be done on best effort basis, it's advised to use the master branch when working on openSUSE hosts.
id: Dukungan openSUSE Leap 42.X masih berjalan dan belum sepenuhnya diuji selain cakupan dasar dalam OpenStack CI dan pengujian manual individu. Meskipun perbaikan backporting pada rilis Pike akan dilakukan berdasarkan upaya terbaik, disarankan untuk menggunakan branch master saat bekerja pada host openSUSE.

source: pip can be installed via the deployment host using the new variable ``pip_offline_install``. This can be useful in environments where the containers lack internet connectivity. Please refer to the `limited connectivity installation guide <http://docs.openstack.org/developer/openstack-ansible/install-guide/app-no-internet-connectivity.html#install-pip-through-deployment-host>`_ for more information.
id: pip dapat diinstal melalui deployment host menggunakan variabel baru ``pip_offline_install``. Ini dapat berguna di lingkungan di mana kontainer tidak memiliki konektivitas internet. Silakan merujuk ke `limited connectivity installation guide <http://docs.openstack.org/developer/openstack-ansible/install-guide/app-no-internet-connectivity.html#install-pip-through-deployment-host>`_ untuk informasi lebih lanjut.
