Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: For the ``os_cinder`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``cinder_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_cinder``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan (drain) sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``cinder_*_init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_cloudkitty`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``cloudkitty_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_cloudkitty``, nilai unit systemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi yang tahan lama untuk dikeringkan sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai-nilai ini dapat disesuaikan dengan menggunakan variabel ``cloudkitty_*_init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_designate`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``designate_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_designate``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``designate_*_init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_glance`` role, the systemd unit ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. This value can be adjusted by using the ``glance_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_glance``, nilai systemd unit ``RestartSec`` yang mengontrol waktu antara penghentian layanan dan mulai ketika memulai ulang telah dikurangi dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``glance_*_init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_gnocchi`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``gnocchi_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_gnocchi``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan (drain) sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``gnocchi_*_init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_heat`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``heat_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_heat``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan (drain) sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``heat_*_init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_ironic`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``ironic_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_ironic``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan (drain) sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai `` RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``ironis _*_ init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_keystone`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``keystone_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_keystone``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan (drain) sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``keystone _*_ init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_magnum`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``magnum_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_magnum``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``magnum _*_ init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_neutron`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``neutron_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_neutron``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan (drain) sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``neutron _*_ init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_nova`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``nova_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_nova``, nilai unitd unit ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``nova_*_init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_octavia`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``octavia_*_init_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_octavia``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``octavia_*_init_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_sahara`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``sahara_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_sahara``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``sahara_*_init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_swift`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``swift_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_swift``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``swift_*_init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: For the ``os_trove`` role, the systemd unit ``TimeoutSec`` value which controls the time between sending a SIGTERM signal and a SIGKILL signal when stopping or restarting the service has been reduced from 300 seconds to 120 seconds. This provides 2 minutes for long-lived sessions to drain while preventing new ones from starting before a restart or a stop. The ``RestartSec`` value which controls the time between the service stop and start when restarting has been reduced from 150 seconds to 2 seconds to make the restart happen faster. These values can be adjusted by using the ``trove_*_init_config_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Untuk peran ``os_trove``, nilai unit sistemd ``TimeoutSec`` yang mengontrol waktu antara pengiriman sinyal SIGTERM dan sinyal SIGKILL saat menghentikan atau memulai kembali layanan telah berkurang dari 300 detik menjadi 120 detik. Ini memberikan waktu 2 menit untuk sesi long-lived untuk dikeringkan sekaligus mencegah yang baru dimulai sebelum restart atau berhenti. Nilai ``RestartSec`` yang mengontrol waktu antara berhenti layanan dan mulai ketika memulai ulang telah berkurang dari 150 detik menjadi 2 detik untuk membuat restart terjadi lebih cepat. Nilai ini dapat disesuaikan dengan menggunakan variabel ``trove_*_init_config_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default templat.

source: Fork the ``openstack/openstack-ansible-os_neutron`` git repository.
id: Fork repositori git ``openstack/openstack-ansible-os_neutron``.

source: Fork the ``openstack/openstack-ansible-repo_build`` git repository.
id: Fork repositori git ``openstack/openstack-ansible-repo_build``.

source: Fork the ``openstack/openstack-ansible`` git repository.
id: Fork repositori git `` openstack / openstack-ansible``.

source: From 15.1.16 onwards, these values are set as defaults and will be updated from time to time after verifying that the new versions work. As such, setting these overrides is not required for 15.1.16 onwards.
id: Dari 15.1.16 dan seterusnya, nilai-nilai ini ditetapkan sebagai default dan akan diperbarui dari waktu ke waktu setelah memverifikasi bahwa versi baru berfungsi. Dengan demikian, pengaturan override ini tidak diperlukan untuk 15.1.16 dan seterusnya.

source: From 16.0.8 onwards, these values are set as defaults and will be updated from time to time after verifying that the new versions work. As such, setting these overrides is not required for 16.0.8 onwards.
id: Dari 16.0.8 dan selanjutnya, nilai-nilai ini ditetapkan sebagai default dan akan diperbarui dari waktu ke waktu setelah memverifikasi bahwa versi baru berfungsi. Dengan demikian, pengaturan override ini tidak diperlukan untuk 16.0.8 dan seterusnya.

source: From now on, a deployer can override any group_var in userspace, by creating a folder ``/etc/openstack_deploy/group_vars/``. This folder has precedence over OpenStack-Ansible default group_vars, and the merge behavior is similar to Ansible merge behavior. The group_vars folder precedence can still be changed with the GROUP_VARS_PATH. Same applies for host vars.
id: Mulai sekarang, deployer dapat menimpa group_var apa pun di userspace, dengan membuat folder ``/etc/openstack_deploy/group_vars/``. Folder ini lebih diutamakan daripada OpenStack-Ansible default group_vars, dan perilaku gabungan mirip dengan perilaku gabungan Ansible. Diutamakan folder group_vars masih dapat diubah dengan GROUP_VARS_PATH. Hal yang sama berlaku untuk host vars.

source: From now on, external repo management (in use for RDO/UCA for example) will be done inside the pip-install role, not in the repo_build role.
id: Mulai sekarang, manajemen repo eksternal (digunakan untuk RDO/UCA misalnya) akan dilakukan di dalam peran pip-install, bukan dalam peran repo_build.

source: Functionality to support Ubuntu Trusty (14.04) has been removed from the code base.
id: Fungsi untuk mendukung Ubuntu Trusty (14.04) telah dihapus dari basis kode.
