Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The variable ``horizon_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``horizon_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``ironic_api_apt_packages`` has been renamed to ``ironic_api_distro_packages``.
id: Variabel ``ironic_api_apt_packages`` telah diubah namanya menjadi ``ironic_api_distro_packages``.

source: The variable ``ironic_conductor_apt_packages`` has been renamed to ``ironic_conductor_distro_packages``.
id: Variabel ``ironic_conductor_apt_packages`` telah diubah namanya menjadi ``ironic_conductor_distro_packages``.

source: The variable ``ironic_conductor_standalone_apt_packages`` has been renamed to ``ironic_conductor_standalone_distro_packages``.
id: Variabel ``ironic_conductor_standalone_apt_packages`` telah diubah namanya menjadi ``ironic_conductor_standalone_distro_packages``.

source: The variable ``ironic_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``ironic_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``keepalived_uca_enable`` is deprecated, and replaced by ``keepalived_ubuntu_src``. The ``keepalived_uca_enable`` variable will be removed in future versions of the keepalived role. The value of ``keepalived_ubuntu_src`` should be either "uca", "ppa", or "native", for respectively installing from the Ubuntu Cloud archive, from keepalived stable ppa, or not installing from an external source.
id: Variabel ``keepalived_uca_enable`` sudah usang, dan diganti dengan ``keepalived_ubuntu_src``. Variabel ``keepalived_uca_enable`` akan dihapus di versi selanjutnya dari peran keepalived. Nilai ``keepalived_ubuntu_src`` harus berupa "uca", "ppa", atau "native", untuk masing-masing menginstal dari arsip Ubuntu Cloud, dari keepalived stable ppa, atau tidak menginstal dari sumber eksternal.

source: The variable ``keepalived_use_latest_stable`` is deprecated, and replaced by ``keepalived_package_state``. The ``keepalived_use_latest_stable`` variable will be removed in future versions of the keepalived role. The value of ``keepalived_package_state`` should be either "latest" or "present".
id: Variabel ``keepalived_use_latest_stable`` sudah usang, dan diganti dengan ``keepalived_package_state``. Variabel ``keepalived_use_latest_stable`` akan dihapus di versi selanjutnya dari peran keepalived. Nilai ``keepalived_package_state`` harus berupa "latest" atau "present".

source: The variable ``keystone_apt_packages`` has been renamed to ``keystone_distro_packages``.
id: Variabel ``keystone_apt_packages`` telah diubah namanya menjadi ``keystone_distro_packages``.

source: The variable ``keystone_developer_apt_packages`` has been renamed to ``keystone_developer_mode_distro_packages``.
id: Variabel ``keystone_developer_apt_packages`` telah diubah namanya menjadi ``keystone_developer_mode_distro_packages``.

source: The variable ``keystone_idp_apt_packages`` has been renamed to ``keystone_idp_distro_packages``.
id: Variabel ``keystone_idp_apt_packages`` telah diubah namanya menjadi ``keystone_idp_distro_packages``.

source: The variable ``keystone_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``keystone_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``keystone_sp_apt_packages`` has been renamed to ``keystone_sp_distro_packages``.
id: Variabel ``keystone_sp_apt_packages`` telah diubah namanya menjadi ``keystone_sp_distro_packages``.

source: The variable ``lxc_apt_packages`` has been renamed to ``lxc_hosts_distro_packages``.
id: Variabel ``lxc_apt_packages`` telah diubah namanya menjadi ``lxc_hosts_distro_packages``.

source: The variable ``lxc_cache_environment`` has been added. This dictionary can be overridden by deployers to set HTTP proxy environment variables that will be applied to all lxc container download tasks.
id: Variabel ``lxc_cache_environment`` telah ditambahkan. Kamus ini dapat ditimpa oleh deployment untuk menetapkan variabel lingkungan proxy HTTP yang akan diterapkan pada semua tugas unduhan kontainer lxc.

source: The variable ``lxc_container_release`` has been removed from the ``lxc-container-create.yml`` playbook as it is no longer consumed by the container creation process.
id: Variabel ``lxc_container_release`` telah dihapus dari playbook ``lxc-container-create.yml`` karena tidak lagi dikonsumsi oleh proses pembuatan kontainer.

source: The variable ``lxc_host_machine_volume_size`` is used to set the size of the default sparse file as well as define a limit within the ``machinectl`` quota system. When the ``machinectl`` quota system is enabled deployers should appropriately set this value to the size of the container volume, even when not using a sparse file.
id: Variabel ``lxc_host_machine_volume_size`` digunakan untuk mengatur ukuran file sparse default serta menentukan batas dalam sistem kuota ``machinectl``. Ketika sistem kuota ``machinectl`` diaktifkan, deployer harus dengan tepat mengatur nilai ini ke ukuran volume kontainer, bahkan ketika tidak menggunakan file sparse.

source: The variable ``lxc_host_machine_volume_size`` now accepts any valid size modifier acceptable by ``truncate -s`` and ``machinectl set-limit``. prior to this change the option assumed an integer was set for some value in gigabytes. All acceptable values can be seen within the `documentation for machinectl <https://www.freedesktop.org/software/systemd/man/machinectl.html#set-limit%20%5BNAME%5D%20BYTES>`_
id: Variabel ``lxc_host_machine_volume_size`` sekarang menerima setiap pengubah ukuran yang valid yang dapat diterima oleh ``truncate -s`` dan ``machinectl set-limit``. Sebelum perubahan ini, opsi diasumsikan integer ditetapkan untuk beberapa nilai dalam gigabytes. Semua nilai yang dapat diterima dapat dilihat di dalam `documentation for machinectl <https://www.freedesktop.org/software/systemd/man/machinectl.html#set-limit%20%5BNAME%5D%20BYTES>`_

source: The variable ``lxc_image_cache_server_mirrors`` has been added to the "lxc_hosts" role. This is a list type variable and gives deployers the ability to specify multiple lxc-image mirrors at the same time.
id: Variabel ``lxc_image_cache_server_mirrors`` telah ditambahkan ke peran "lxc_hosts". Ini adalah variabel tipe daftar dan memberikan kemampuan pada penelepon untuk menentukan beberapa mirror lxc-image secara bersamaan.

source: The variable ``lxc_image_cache_server`` has been deprecated in the "lxc_hosts" role. By default this value will pull the first item out of ``lxc_image_cache_server_mirrors`` list which is only done for compatibility (legacy) purposes. The default string type variable, ``lxc_image_cache_server``, will be removed from the "lxc_hosts" role in the in "R" release.
id: Variabel ``lxc_image_cache_server`` telah ditinggalkan dalam peran "lxc_hosts". Secara default nilai ini akan menarik item pertama dari daftar ``lxc_image_cache_server_mirrors`` yang hanya dilakukan untuk tujuan kompatibilitas (legacy). Variabel tipe string default, ``lxc_image_cache_server``, akan dihapus dari peran "lxc_hosts" di rilis "R".

source: The variable ``lxc_net_manage_iptables`` has been added. This variable can be overridden by deployers if system wide iptables rules are already in place or managed by deployers chioce.
id: Variabel ``lxc_net_manage_iptables`` telah ditambahkan. Variabel ini dapat ditimpa oleh deployer jika aturan iptables sistem yang lebar sudah ada atau dikelola oleh chioce deployers.

source: The variable ``magnum_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``magnum_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``memcached_apt_packages`` has been renamed to ``memcached_distro_packages``.
id: Variabel ``memcached_apt_packages`` telah diubah namanya menjadi ``memcached_distro_packages``.

source: The variable ``neutron_agent_mode`` has been removed from the ``os_neutron`` role. The appropriate value for ``l3_agent.ini`` is now determined based on the ``neutron_plugin_type`` and host group membership.
id: Variabel ``neutron_agent_mode`` telah dihapus dari peran ``os_neutron``. Nilai yang sesuai untuk ``l3_agent.ini`` sekarang ditentukan berdasarkan ``neutron_plugin_type`` dan keanggotaan grup host.

source: The variable ``neutron_apt_packages`` has been renamed to ``neutron_distro_packages``.
id: Variabel ``neutron_apt_packages`` telah diubah namanya menjadi ``neutron_distro_packages``.

source: The variable ``neutron_apt_remove_packages`` has been renamed to ``neutron_remove_distro_packages``.
id: Variabel ``neutron_apt_remove_packages`` telah diubah namanya menjadi ``neutron_remove_distro_packages``.

source: The variable ``neutron_dhcp_domain`` has been renamed to ``neutron_dns_domain``.
id: Variabel ``neutron_dhcp_domain`` telah diubah namanya menjadi ``neutron_dns_domain``.

source: The variable ``neutron_driver_firewall`` has been removed. The appropriate value for ``neutron.conf`` is now determined based on the ``neutron_plugin_type``.
id: Variabel ``neutron_driver_firewall`` telah dihapus. Nilai yang sesuai untuk ``neutron.conf`` sekarang ditentukan berdasarkan ``neutron_plugin_type``.

source: The variable ``neutron_driver_interface`` has been removed. The appropriate value for ``neutron.conf`` is now determined based on the ``neutron_plugin_type``.
id: Variabel ``neutron_driver_interface`` telah dihapus. Nilai yang sesuai untuk ``neutron.conf`` sekarang ditentukan berdasarkan ``neutron_plugin_type``.

source: The variable ``neutron_lbaas_apt_packages`` has been renamed to ``neutron_lbaas_distro_packages``.
id: Variabel ``neutron_lbaas_apt_packages`` telah diubah namanya menjadi ``neutron_lbaas_distro_packages``.

source: The variable ``neutron_linuxbridge`` has been removed as it is no longer used.
id: Variabel ``neutron_linuxbridge`` telah dihapus karena tidak lagi digunakan.

source: The variable ``neutron_ml2_mechanism_drivers`` has been removed. The appropriate value for ml2_conf.ini is now determined based on the ``neutron_plugin_type``.
id: Variabel ``neutron_ml2_mechanism_drivers`` telah dihapus. Nilai yang sesuai untuk ml2_conf.ini sekarang ditentukan berdasarkan ``neutron_plugin_type``.

source: The variable ``neutron_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``neutron_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``neutron_service_names`` has been removed. A more efficient way of determining the list of Neutron services for service restarts has been implemented.
id: Variabel ``neutron_service_names`` telah dihapus. Cara yang lebih efisien untuk menentukan daftar layanan Neutron untuk memulai kembali layanan telah diterapkan.

source: The variable ``neutron_vpnaas_apt_packages`` has been renamed to ``neutron_vpnaas_distro_packages``.
id: Variabel ``neutron_vpnaas_apt_packages`` telah diubah namanya menjadi ``neutron_vpnaas_distro_packages``.

source: The variable ``nova_compute_pip_packages`` is no longer used and has been removed.
id: Variabel ``nova_compute_pip_packages`` tidak lagi digunakan dan telah dihapus.

source: The variable ``nova_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``nova_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``octavia_ansible_endpoint_type`` has been removed. The endpoint used for ansible tasks has been hard set to the 'admin' endpoint as is commonly used across all OSA roles.
id: Variabel ``octavia_ansible_endpoint_type`` telah dihapus. Endpoint yang digunakan untuk tugas ansible telah sulit diatur ke endpoint 'admin' seperti yang biasa digunakan di semua peran OSA.

source: The variable ``octavia_image_downloader`` has been removed. The image download now uses the same host designated by the ``octavia_service_setup_host`` for the image download.
id: Variabel ``octavia_image_downloader`` telah dihapus. Pengunduhan image sekarang menggunakan host yang sama yang ditunjuk oleh ``octavia_service_setup_host`` untuk pengunduhan image.

source: The variable ``octavia_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``octavia_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``openstack_host_apt_packages`` has been renamed to ``openstack_host_distro_packages``.
id: Variabel ``openstack_host_apt_packages`` telah diubah namanya menjadi ``openstack_host_distro_packages``.

source: The variable ``proxy_env_url`` is now used by the apt-cacher-ng jinja2 template to set up an HTTP/HTTPS proxy if needed.
id: Variabel ``proxy_env_url`` sekarang digunakan oleh templat jinja2 apt-cacher-ng untuk mengatur proxy HTTP/HTTPS jika diperlukan.

source: The variable ``rabbitmq_monitoring_password`` has been added to ``user_secrets.yml``. If this variable does not exist, the RabbitMQ monitoring user will not be created.
id: Variabel ``rabbitmq_monitoring_password`` telah ditambahkan ke ``user_secrets.yml``. Jika variabel ini tidak ada, pengguna pemantauan RabbitMQ tidak akan dibuat.

source: The variable ``repo_build_pip_extra_index`` has been removed. The replacement list variable ``repo_build_pip_extra_indexes`` should be used instead.
id: Variabel ``repo_build_pip_extra_index`` telah dihapus. Variabel daftar pengganti ``repo_build_pip_extra_indexes`` harus digunakan sebagai gantinya.

source: The variable ``repo_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``repo_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``repo_server_packages`` that defines the list of packages required to install a repo server has been replaced by ``repo_server_distro_packages``.
id: Variabel ``repo_server_packages`` yang mendefinisikan daftar paket yang diperlukan untuk menginstal server repo telah diganti oleh ``repo_server_distro_packages``.

source: The variable ``rsyslog_client_packages`` has been replaced by ``rsyslog_client_distro_packages``.
id: Variabel ``rsyslog_client_packages`` telah digantikan oleh ``rsyslog_client_distro_packages``.

source: The variable ``rsyslog_server_packages`` has been replaced by ``rsyslog_server_distro_packages``.
id: Variabel ``rsyslog_server_packages`` telah diganti oleh ``rsyslog_server_distro_packages``.

source: The variable ``sahara_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``sahara_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``security_audit_apparmor_changes`` is now renamed to ``security_audit_mac_changes`` and is enabled by default. Setting ``security_audit_mac_changes`` to ``no`` will disable syscall auditing for any changes to AppArmor policies (in Ubuntu) or SELinux policies (in CentOS).
id: Variabel ``security_audit_apparmor_changes`` sekarang diubah namanya menjadi ``security_audit_mac_changes`` dan diaktifkan secara default. Mengatur ``security_audit_mac_changes`` ke `` no`` akan menonaktifkan audit syscall untuk setiap perubahan pada kebijakan AppArmor (di Ubuntu) atau kebijakan SELinux (dalam CentOS).

source: The variable ``security_sysctl_enable_tcp_syncookies`` has replaced ``security_sysctl_tcp_syncookies`` and it is now a boolean instead of an integer. It is still enabled by default, but deployers can disable TCP syncookies by setting the following Ansible variable:
id: Variabel ``security_sysctl_enable_tcp_syncookies`` telah menggantikan ``security_sysctl_tcp_syncookies`` dan sekarang menjadi boolean bukan integer. Ini masih diaktifkan secara default, tetapi deployer dapat menonaktifkan TCP syncookies dengan mengatur variabel Ansible berikut:

source: The variable ``swift_apt_packages`` has been renamed to ``swift_distro_packages``.
id: Variabel ``swift_apt_packages`` telah diubah namanya menjadi ``swift_distro_packages``.

source: The variable ``swift_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``swift_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``tempest_image_dir_owner`` is removed in favour of using default ansible user to create the image directory.
id: Variabel ``tempest_image_dir_owner`` dihapus karena menggunakan pengguna yang dimungkinkan secara default untuk membuat direktori image.

source: The variable ``tempest_image_downloader`` has been removed. The image download now uses the same host designated by the ``tempest_service_setup_host`` for the image download.
id: Variabel ``tempest_image_downloader`` telah dihapus. Unduhan image sekarang menggunakan host yang sama yang ditunjuk oleh ``tempest_service_setup_host`` untuk unduhan image.

source: The variable ``tempest_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``tempest_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``trove_conductor_workers`` can be configured for defining the number of workers for the trove conductor service. The default value is half the number of vCPUs available on the machine with a capping value of 16.
id: Variabel ``trove_conductor_workers`` dapat dikonfigurasi untuk menentukan jumlah pekerja (worker) untuk layanan konduktor trove. Nilai default adalah setengah dari jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: The variable ``trove_requires_pip_packages`` is no longer required and has therefore been removed.
id: Variabel ``trove_requires_pip_packages`` tidak lagi diperlukan dan karenanya telah dihapus.

source: The variable ``verbose`` has been removed. Deployers should rely on the ``debug`` var to enable higher levels of logging.
id: Variabel ``verbose`` telah dihapus. Deployer harus bergantung pada var ``debug`` untuk mengaktifkan tingkat logging yang lebih tinggi.

source: The variable ``verbose`` has been removed. Deployers should rely on the ``debug`` var to enable higher levels of memcached logging.
id: Variabel ``verbose`` telah dihapus. Deployer harus bergantung pada var ``debug`` untuk mengaktifkan level lebih tinggi dari logging memcached.

source: The variable `cinder_iscsi_helper` has been replaced by the new variable which is `cinder_target_helper` due to the fact that iscsi_helper has been deprecated in Cinder.
id: Variabel `cinder_iscsi_helper` telah digantikan oleh variabel baru yaitu `cinder_target_helper` karena fakta bahwa iscsi_helper telah ditinggalkan dalam Cinder.

source: The variable used to store the mysql password used by the ironic service account has been changed. The following variable:
id: Variabel yang digunakan untuk menyimpan kata sandi mysql yang digunakan oleh akun layanan ironic telah diubah. Variabel berikut:

source: The variables ```galera_client_package_*``` and ```galera_client_apt_percona_xtrabackup_*``` have been removed from the role as Xtrabackup is no longer deployed.
id: Variabel ```galera_client_package_*``` dan ```galera_client_apt_percona_xtrabackup_*``` telah dihapus dari peran karena Xtrabackup tidak lagi digunakan.

source: The variables ``aodh_requirements_git_repo`` and ``aodh_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``aodh_requirements_git_repo`` dan ``aodh_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``barbican_requirements_git_repo`` and ``barbican_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``barbican_requirements_git_repo`` dan ``barbican_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``ceilometer_oslomsg_rpc_servers`` and ``ceilometer_oslomsg_notify_servers`` have been removed in favour of using ``ceilometer_oslomsg_rpc_host_group`` and ``ceilometer_oslomsg_notify_host_group`` instead.
id: Variabel ``ceilometer_oslomsg_rpc_servers`` dan ``ceilometer_oslomsg_notify_servers`` telah dihapus mendukung pemakaian ``ceilometer_oslomsg_rpc_host_group`` dan ``ceilometer_oslomsg_notify_host_group`` sebagai gantinya.

source: The variables ``ceilometer_requirements_git_repo`` and ``ceilometer_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``ceilometer_requirements_git_repo`` dan ``ceilometer_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``cinder_requirements_git_repo`` and ``cinder_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``cinder_requirements_git_repo`` dan ``cinder_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``cinder_sigkill_timeout`` and ``cinder_restart_wait`` have been deprecated and will be removed in Pike.
id: Variabel ``cinder_sigkill_timeout`` dan ``cinder_restart_wait`` telah ditinggalkan dan akan dihapus di Pike.

source: The variables ``cinder_sigkill_timeout`` and ``cinder_restart_wait`` have been removed. The previous default values have now been set in the template directly and can be adjusted by using the ``cinder_*_init_overrides`` variables which use the ``config_template`` task to change template defaults.
id: Variabel ``cinder_sigkill_timeout`` dan ``cinder_restart_wait`` telah dihapus. Nilai-nilai default sebelumnya sekarang telah ditetapkan dalam template secara langsung dan dapat disesuaikan dengan menggunakan variabel ``cinder_*_init_overrides`` yang menggunakan tugas ``config_template`` untuk mengubah default template.

source: The variables ``cloudkitty_requirements_git_repo`` and ``cloudkitty_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``cloudkitty_requirements_git_repo`` dan ``cloudkitty_requirements_git_install_branch`` telah dihapus karena menggunakan URL/path ke file batasan atas menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.

source: The variables ``galera_client_apt_repo_url`` and ``galera_client_yum_repo_url`` are deprecated in favour of the common variable ``galera_client_repo_url``.
id: Variabel ``galera_client_apt_repo_url`` dan ``galera_client_yum_repo_url`` tidak digunakan lagi karena variabel umum ``galera_client_repo_url``.

source: The variables ``glance_requirements_git_repo`` and ``glance_requirements_git_install_branch`` have been removed in favour of using the URL/path to the upper-constraints file using the variable ``pip_install_upper_constraints`` instead.
id: Variabel ``glance_requirements_git_repo`` dan ``glance_requirements_git_install_branch`` telah dihapus mendukung pemakaian URL/path ke file upper-constraints menggunakan variabel ``pip_install_upper_constraints`` sebagai gantinya.
