Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: All OSA releases earlier than 17.0.5, 16.0.4, and 15.1.22 will fail to build the rally venv due to the release of the new cmd2-0.9.0 python library. Deployers are encouraged to update to the latest OSA release which pins to an appropriate version which is compatible with python2.
id: Semua rilis OSA lebih awal dari 17.0.5, 16.0.4, dan 15.1.22 akan gagal membangun rally venv karena rilis python library cmd2-0.9.0 baru. Deployer didorong untuk memperbarui ke rilis OSA terbaru yang menyematkan (pin) ke versi yang sesuai yang kompatibel dengan python2.

source: All cinder container services are consolidated into a single ``cinder_api_container``. The previously implemented ``cinder_scheduler_container`` can be removed.
id: Semua layanan kontainer cinder dikonsolidasikan ke dalam ``cinder_api_container`` tunggal. ``cinder_scheduler_container`` yang sebelumnya diterapkan dapat dihapus.

source: All nova services are consolidated into the ``nova_api_container`` and the rest of the nova containers can be removed.
id: Semua layanan nova dikonsolidasikan ke dalam ``nova_api_container`` dan sisa kontainer nova dapat dihapus.

source: All of the database and database user creates have been removed from the roles into the playbooks. This allows the roles to be tested independently of the deployed database and also allows the roles to be used independently of infrastructure choices made by the integrated OSA project.
id: Semua database dan database yang dibuat pengguna telah dihapus dari peran ke dalam playbook. Hal ini memungkinkan peran untuk diuji secara independen dari database yang digunakan dan juga memungkinkan peran untuk digunakan secara independen dari pilihan infrastruktur yang dibuat oleh proyek OSA terintegrasi.

source: All of the discretionary access control (DAC) auditing is now disabled by default. This reduces the amount of logs generated during deployments and minor upgrades. The following variables are now set to ``no``:
id: Semua audit discretionary access control (DAC) sekarang dinonaktifkan secara default. Ini mengurangi jumlah log yang dihasilkan selama penerapan dan upgrade kecil. Variabel berikut sekarang disetel ke ``no``:

source: All roles always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``package_state`` should be set to ``present``.
id: Semua peran selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``package_state`` harus diatur ke ``present``.

source: All roles are migrated from usage of regular log files to systemd-journald
id: Semua roles dimigrasikan dari penggunaan file log biasa ke systemd-journald

source: All the ocata versions 15.1.15 and before use mariadb-server 10.1 with no minor version frozen. The latest version, 10.1.31, has presented problems with the state transfer for multi-node environments when the variable ``galera_wsrep_sst_method`` is set to ``xtrabackup-v2`` (the default value). This causes a new cluster to fail, or an existing cluster to be unable to transfer state when a node is rebooted.
id: Semua versi ocata 15.1.15 dan sebelum menggunakan mariadb-server 10.1 tanpa versi minor dibekukan. Versi terbaru, 10.1.31, telah menyajikan masalah dengan transfer status untuk lingkungan multi-node ketika variabel ``galera_wsrep_sst_method`` diatur ke ``xtrabackup-v2`` (nilai default). Ini menyebabkan cluster baru gagal, atau cluster yang ada tidak dapat mentransfer status saat sebuah node di-boot ulang.

source: All the pike versions 16.0.7 and before use mariadb-server 10.1 with no minor version frozen. The latest version, 10.1.31, has presented problems with the state transfer for multi-node environments when the variable ``galera_wsrep_sst_method`` is set to ``xtrabackup-v2`` (the default value). This causes a new cluster to fail, or an existing cluster to be unable to transfer state when a node is rebooted.
id: Semua versi pike 16.0.7 dan sebelum menggunakan mariadb-server 10.1 tanpa versi minor dibekukan. Versi terbaru, 10.1.31, telah menyajikan masalah dengan transfer status untuk lingkungan multi-node ketika variabel ``galera_wsrep_sst_method`` diatur ke ``xtrabackup-v2`` (nilai default). Ini menyebabkan cluster baru gagal, atau cluster yang ada tidak dapat mentransfer status saat sebuah simpul di-boot ulang.

source: All trove services have been consolidated into the ``trove_api_container``. The previously implemented ``trove_conductor_container`` and ``trove_taskmanager_container`` can be removed.
id: Semua layanan trove telah dikonsolidasikan ke dalam ``trove_api_container``. ``trove_conductor_container`` dan sebelumnya diimplementasikan ``trove_taskmanager_container`` dapat dihapus.

source: All variables in the security role are now prepended with ``security_`` to avoid collisions with variables in other roles. All deployers who have used the security role in previous releases will need to prepend all security role variables with ``security_``.
id: Semua variabel dalam peran keamanan sekarang diawali dengan ``security_`` untuk menghindari tabrakan dengan variabel di peran lain. Semua deployer yang telah menggunakan peran keamanan dalam rilis sebelumnya perlu menambahkan semua variabel peran keamanan dengan ``security_``.

source: Allow the default section in an ini file to be specified using the ``default_section`` variable when calling a ``config_template`` task. This defaults to ``DEFAULT``.
id: Izinkan bagian default dalam file ini ditentukan menggunakan variabel ``default_section`` saat memanggil tugas ``config_template``. Ini default ke ``DEFAULT``.

source: Allow the fallocate_reserve option to be set (in bytes) for Swift, to help prevent disks from filling up and prevent a situation where Swift is unable to remove objects due to a lack of disk space. The fallocate_reserve value to is set to a default of 10GB.
id: Izinkan opsi fallocate_reserve diatur (dalam byte) untuk Swift, untuk membantu mencegah pengisian disk dan mencegah situasi di mana Swift tidak dapat menghapus objek karena kurangnya ruang disk. Nilai fallocate_reserve ke diatur ke default 10GB.

source: Allows SSL connection to Galera with SSL support. ``galera_use_ssl`` option has to be set to ``true``, in this case self-signed CA cert or user-provided CA cert will be delivered to the container/host.
id: Mengizinkan koneksi SSL ke Galera dengan dukungan SSL. Opsi ``galera_use_ssl`` harus disetel ke ``true``, dalam hal ini self-signed CA cert atau user-provided CA cert akan dikirimkan ke container/host.

source: Although the STIG requires martian packets to be logged, the logging is now disabled by default. The logs can quickly fill up a syslog server or make a physical console unusable.
id: Meskipun STIG membutuhkan paket Mars untuk dicatat, pencatatan log sekarang dinonaktifkan secara default. Log dapat dengan cepat mengisi server syslog atau membuat konsol fisik tidak dapat digunakan.

source: Although the ``ceph-rgw`` playbooks do enable Swift object versioning, support in radosgw is currently limited to setting ``X-Versions-Location`` on a container. ``X-History-Location``, understood by native Swift, is currently not supported by radosgw (although the feature is `pending <https://github.com/ceph/ceph/pull/15020>`_ upstream).
id: Meskipun playbook ``ceph-rgw`` memungkinkan pengubahan versi objek Swift, dukungan di radosgw saat ini terbatas pada pengaturan ``X-Version-Location`` pada sebuah kontainer. ``X-History-Location``, dipahami oleh Swift asli, saat ini tidak didukung oleh radosgw (walaupun fitur ini `pending <https://github.com/ceph/ceph/pull/15020>`_ upstream).

source: An Ansible task was added to disable the ``netconsole`` service on CentOS systems if the service is installed on the system.
id: Tugas Ansible ditambahkan untuk menonaktifkan layanan ``netconsole`` pada sistem CentOS jika layanan diinstal pada sistem.

source: An Ansible was added to disable the ``rdisc`` service on CentOS systems if the service is installed on the system.
id: Ansible ditambahkan untuk menonaktifkan layanan ``rdisc`` pada sistem CentOS jika layanan diinstal pada sistem.

source: An export flag has been added to the ``inventory-manage.py`` script. This flag allows exporting of host and network information from an OpenStack-Ansible inventory for import into another system, or an alternate view of the existing data. See the developer docs for more details.
id: Flag ekspor telah ditambahkan ke skrip ``inventory-manage.py``. Flag ini memungkinkan ekspor informasi host dan jaringan dari inventaris yang dimungkinkan OpenStack untuk diimpor ke sistem lain, atau tampilan alternatif dari data yang ada. Lihat dokumen pengembang untuk detail lebih lanjut.

source: An opportunistic Ansible execution strategy has been implemented. This allows the Ansible linear strategy to skip tasks with conditionals faster by never queuing the task when the conditional is evaluated to be false.
id: Strategi eksekusi oportunistik yang mungkin telah dilaksanakan. Hal ini memungkinkan strategi linier yang dimungkinkan untuk melewati tugas dengan persyaratan lebih cepat dengan tidak pernah mengantri tugas ketika kondisi dievaluasi salah.

source: An option has been added allowing the user to define the `user_group` LBaaSv2 uses. The new option is ``neutron_lbaasv2_user_group`` and is set within the OS specific value by default.
id: Opsi telah ditambahkan yang memungkinkan pengguna untuk menentukan penggunaan `user_group` LBaaSv2. Opsi baru adalah ``neutron_lbaasv2_user_group`` dan diatur dalam nilai spesifik OS secara default.

source: An option to disable the ``machinectl`` quota system has been added. The variable ``lxc_host_machine_quota_disabled`` is a Boolean with a default of **true**. When this option is set to **true** it will disable the ``machinectl`` quota system.
id: Opsi untuk menonaktifkan sistem kuota ``machinectl`` telah ditambahkan. Variabel ``lxc_host_machine_quota_disabled`` adalah Boolean dengan default **true**. Ketika opsi ini disetel ke **true**, opsi ini akan menonaktifkan sistem kuota ``machinectl``.

source: An option to disable the ``machinectl`` quota system has been changed. The variable ``lxc_host_machine_quota_disabled`` is a Boolean with a default of **false**. When this option is set to **true** it will disable the ``machinectl`` quota system.
id: Opsi untuk menonaktifkan sistem kuota ``machinectl`` telah diubah. Variabel ``lxc_host_machine_quota_disabled`` adalah Boolean dengan default ** false **. Ketika opsi ini disetel ke ** true **, opsi ini akan menonaktifkan sistem kuota ``machinectl``.

source: Any ceph infrastructure components (OSDs, MONs etc) deployed using the OSA/ceph-ansible tooling will be upgraded to the Ceph Nautilus release. Deployers should verify that this upgrade is suitable for their environment before commencing a major upgrade to Train, and consult the ceph-ansible and ceph release notes for Nautilus. For integration with external ceph clusters where OSA does not deploy any of the ceph cluster infrastructure, overrides can be used to select the specific version of ceph repositories used by the OSA ceph_client ansible role.
id: Setiap komponen infrastruktur ceph (OSD, MONs dll) yang dikerahkan menggunakan OSA/ceph-ansible tooling akan ditingkatkan ke rilis Ceph Nautilus. Deployers harus memverifikasi bahwa pemutakhiran ini cocok untuk lingkungan mereka sebelum memulai pemutakhiran besar-besaran ke Train, dan berkonsultasi dengan catatan ceph-ansible dan ceph untuk Nautilus. Untuk integrasi dengan cluster ceph eksternal di mana OSA tidak deploy infrastruktur cluster ceph, override dapat digunakan untuk memilih versi spesifik dari repositori ceph yang digunakan oleh OSA ceph_client ansible role.

source: Any tooling using the Designate v1 API needs to be reworked to use the v2 API
id: Perkakas (tooling) apa pun yang menggunakan API Designate v1 perlu dikerjakan ulang untuk menggunakan API v2

source: Any user that is coming from Pike or below on Ubuntu should modify its ``user_external_repos_list``, switching its ubuntu cloud archive repository from ``state: present`` to ``state: absent``. From now on, UCA will be defined with the filename ``uca``. If the deployer wants to use its mirror, he can still override the variable ``uca_repo`` to point to its mirror. Alternatively, the deployer can completely define which repos to add and remove, ignoring our defaults, by overriding ``openstack_hosts_package_repos``.
id: Setiap pengguna yang berasal dari Pike atau di bawahnya di Ubuntu harus memodifikasi ``user_external_repos_list`` -nya, mengalihkan repositori arsip cloud ubuntu dari ``state: present`` ke ``state: absent``. Mulai sekarang, UCA akan ditentukan dengan nama file ``uca``. Jika deployer ingin menggunakan mirrornya, ia masih bisa mengganti variabel ``uca_repo`` untuk menunjuk ke mirrornya. Sebagai alternatif, deployer dapat sepenuhnya menentukan repo mana yang akan ditambahkan dan dihapus, mengabaikan standar kami, dengan mengesampingkan ``openstack_hosts_package_repos``.

source: Aodh has deprecated support for NoSQL storage (MongoDB and Cassandra) in Mitaka with removal scheduled for the O* release. This causes warnings in the logs. The default of using MongoDB storage for Aodh is replaced with the use of Galera. Continued use of MongoDB will require the use of vars to specify a correct ``aodh_connection_string`` and add pymongo to the ``aodh_pip_packages`` list.
id: Aodh telah mencabut dukungan untuk penyimpanan NoSQL (MongoDB dan Cassandra) di Mitaka dengan penghapusan dijadwalkan untuk rilis O*. Ini menyebabkan peringatan di log. Default menggunakan penyimpanan MongoDB untuk Aodh diganti dengan penggunaan Galera. Terus menggunakan MongoDB akan membutuhkan penggunaan vars untuk menentukan ``aodh_connection_string`` yang benar dan menambahkan pymongo ke daftar ``aodh_pip_packages``.

source: Apache MPM tunable support has been added to the os-keystone role in order to allow MPM thread tuning. Default values reflect the current Ubuntu default settings:
id: Dukungan Apache MPM yang dapat diubah telah ditambahkan ke peran os-keystone untuk memungkinkan penyetelan thread MPM. Nilai default mencerminkan pengaturan default Ubuntu saat ini:

source: Application credentials are now enabled by default as a keystone authentication method. If deployments do not wish to enable application credentials then the existing keystone_auth_methods variable can be overidden with the required set of authentication methods.
id: Kredensial aplikasi sekarang diaktifkan secara default sebagai metode otentikasi keystone. Jika penyebaran tidak ingin mengaktifkan kredensial aplikasi maka variabel keystone_auth_methods yang ada dapat ditimpa dengan set metode otentikasi yang diperlukan.

source: As described in the `Mitaka release notes <http://docs.openstack.org/releasenotes/neutron/mitaka.html>`_ Neutron now correctly calculates for and advertises the MTU to instances. As such the ``neutron_network_device_mtu`` variable has been removed and the hard-coded values in the templates for ``advertise_mtu``, ``path_mtu``, and ``segment_mtu`` have been removed to allow upstream defaults to operate as intended.
id: Seperti dijelaskan dalam `Mitaka release notes <http://docs.openstack.org/releasenotes/neutron/mitaka.html>`_ Neutron sekarang menghitung dengan benar dan mengiklankan MTU ke instance. Dengan demikian variabel ``neutron_network_device_mtu`` telah dihapus dan nilai-nilai hard-coded di templat untuk ``advertise_mtu``, ``path_mtu``, dan ``segment_mtu`` telah dihapus untuk memungkinkan default upstream untuk beroperasi sebagaimana dimaksud.

source: As described in the `Mitaka release notes <http://docs.openstack.org/releasenotes/neutron/mitaka.html>`_ Neutron now correctly calculates for and advertises the MTU to instances. The default DHCP configuration to advertise an MTU to instances has therefore been removed from the variable ``neutron_dhcp_config``.
id: Seperti dijelaskan dalam `Mitaka release notes <http://docs.openstack.org/releasenotes/neutron/mitaka.html>`_ Neutron sekarang menghitung dengan benar dan mengiklankan MTU ke instance. Konfigurasi DHCP default untuk mengiklankan MTU ke instance karenanya telah dihapus dari variabel ``neutron_dhcp_config``.

source: Assigning multiple IP addresses to the same host name will now result in an inventory error before running any playbooks.
id: Menetapkan beberapa alamat IP ke nama host yang sama sekarang akan menghasilkan kesalahan inventory sebelum menjalankan playbook apa pun.

source: Avoid setting the quotas too high for your cloud since this can impact the performance of other servcies and lead to a potential Denial-of-Service attack if Loadbalancer quotas are not set properly or RBAC is not properly set up.
id: Hindari menetapkan kuota terlalu tinggi untuk cloud Anda karena hal ini dapat berdampak pada kinerja servcies lain dan menyebabkan potensi serangan Denial-of-Service jika kuota Loadbalancer tidak disetel dengan benar atau RBAC tidak diatur dengan benar.

source: Based on documentation from RabbitMQ [ https://www.rabbitmq.com/which-erlang.html ] this change ensures the version of erlang we're using across distros is consistent and supported by RabbitMQ.
id: Berdasarkan dokumentasi dari RabbitMQ [https://www.rabbitmq.com/which-erlang.html] perubahan ini memastikan versi erlang yang kami gunakan di seluruh distro konsisten dan didukung oleh RabbitMQ.

source: Bug Fixes
id: Perbaikan Bug

source: Capping the default value for the variable ``aodh_wsgi_processes`` to 16 when the user doesn't configure this variable. Default value is twice the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``aodh_wsgi_processes`` hingga 16 saat pengguna tidak mengonfigurasi variabel ini. Nilai default adalah dua kali jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: Capping the default value for the variable ``cinder_osapi_volume_workers`` to 16 when the user doesn't configure this variable. Default value is half the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``cinder_osapi_volume_workers`` hingga 16 saat pengguna tidak mengonfigurasi variabel ini. Nilai default adalah setengah dari jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: Capping the default value for the variable ``galera_max_connections`` to 1600 when the user doesn't configure this variable. Default value is 100 times the number of vCPUs available on the machine with a capping value of 1600.
id: Pembatasan nilai default untuk variabel ``galera_max_connections`` hingga 1600 ketika pengguna tidak mengonfigurasi variabel ini. Nilai default adalah 100 kali jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 1600.

source: Capping the default value for the variable ``galera_wsrep_slave_threads`` to 16 when the user doesn't configure this variable. Default value is the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``galera_wsrep_slave_threads`` hingga 16 saat pengguna tidak mengonfigurasi variabel ini. Nilai default adalah jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: Capping the default value for the variable ``gnocchi_wsgi_processes`` to 16 when the user doesn't configure this variable. Default value is twice the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``gnocchi_wsgi_processes`` hingga 16 saat pengguna tidak mengonfigurasi variabel ini. Nilai default adalah dua kali jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: Capping the default value for the variable ``ironic_wsgi_processes`` to 16 when the user doesn't configure this variable. Default value is one fourth the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``ironic_wsgi_processes`` hingga 16 saat pengguna tidak mengonfigurasi variabel ini. Nilai default adalah seperempat jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: Capping the default value for the variable ``keystone_wsgi_processes`` to 16 when the user doesn't configure this variable. Default value is half the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``keystone_wsgi_processes`` hingga 16 saat pengguna tidak mengonfigurasi variabel ini. Nilai default adalah setengah dari jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: Capping the default value for the variable ``repo_nginx_workers`` to 16 when the user doesn't configure this variable. Default value is half the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``repo_nginx_workers`` hingga 16 saat pengguna tidak mengonfigurasi variabel ini. Nilai default adalah setengah dari jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: Capping the default value for the variable ``sahara_api_workers`` to 16 when the user doesn't configure this variable. Default value is half the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``sahara_api_workers`` hingga 16 saat pengguna tidak mengonfigurasi variabel ini. Nilai default adalah setengah dari jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: Capping the default value for the variable ``swift_proxy_server_workers`` to 16 when the user doesn't configure this variable and if the swift proxy is in a container. Default value is half the number of vCPUs available on the machine if the swift proxy is not in a container. Default value is half the number of vCPUs available on the machine with a capping value of 16 if the proxy is in a container.
id: Pembatasan nilai default untuk variabel ``swift_proxy_server_workers`` hingga 16 saat pengguna tidak mengonfigurasi variabel ini dan jika proxy swift berada dalam container. Nilai default adalah setengah dari jumlah vCPU yang tersedia pada mesin jika proksi cepat tidak dalam sebuah container. Nilai default adalah setengah dari jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16 jika proxy ada di dalam container.

source: Capping the default value for the variables ``ceilometer_api_workers`` and ``ceilometer_notification_workers`` to 16 when the user doesn't configure these variables. Default value is half the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``ceilometer_api_workers`` dan ``ceilometer_notification_workers`` hingga 16 saat pengguna tidak mengonfigurasi variabel ini. Nilai default adalah setengah dari jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: Capping the default value for the variables ``glance_api_workers`` and ``glance_registry_workers`` to 16 when the user doesn't configure these variables. Default value is half the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``glance_api_workers`` dan `` glance_registry_workers`` hingga 16 ketika pengguna tidak mengkonfigurasi variabel ini. Nilai default adalah setengah dari jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.
