Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: OpenStack-Ansible now provided corosync and pacemaker cluster setup as part of the os-masakari-install playbook. Corosync/pacemaker cluster is required for the proper work of masakari hostmonitors, as they identify hosts state with help of corosync.
id: OpenStack-Ansible sekarang menyediakan konfigurasi cluster corosync dan pacemaker sebagai bagian dari playbook os-masakari-install. Cluster Corosync/pacemaker diperlukan untuk pekerjaan hostmonitors masakari yang benar, karena mereka mengidentifikasi status host dengan bantuan corosync.

source: OpenStack-Ansible now support deployments on Debian 10 (buster)
id: OpenStack-Ansible sekarang mendukung penyebaran di Debian 10 (buster)

source: OpenStack-Ansible now supports the openSUSE Leap 42.X distributions mainly targeting the latest 42.3 release.
id: OpenStack-Ansible sekarang mendukung distribusi openSUSE Leap 42.X terutama menargetkan rilis 42.3 terbaru.

source: OpenStack-Ansible sets a new variable, `galera_disable_privatedevices`, that controls whether the `PrivateDevices` configuration in MariaDB's systemd unit file is enabled.
id: OpenStack-Ansible menetapkan variabel baru, `galera_disable_privatedevices`, yang mengontrol apakah konfigurasi `PrivateDevices` dalam file unit systemd MariaDB diaktifkan.

source: OpenStack-Ansible sets a new variable, `memcached_disable_privatedevices`, that controls whether the `PrivateDevices` configuration in MemcacheD's systemd unit file is enabled.
id: OpenStack-Ansible menetapkan variabel baru, `memcached_disable_privatedevices`, yang mengontrol apakah konfigurasi `PrivateDevices` dalam file unit systemd MemcacheD diaktifkan.

source: Openstack services and infrastructure such as galera, rabbitmq and memcached already have defaults in their ansible roles to control the IP address which those services bind to. Prior to this release the default of 0.0.0.0 was used. A global setting in the openstack-ansible group variables now overrides those default bind address to be the local address on the openstack management network (typically br-mgmt) for the relevant host or container.
id: Layanan dan infrastruktur openstack seperti galera, rabbitmq, dan memcache sudah memiliki default dalam perannya yang memungkinkan untuk mengontrol alamat IP tempat layanan tersebut terikat. Sebelum rilis ini default 0.0.0.0 digunakan. Pengaturan global dalam variabel grup openstack-ansible sekarang mengganti alamat mengikat default tersebut menjadi alamat lokal di jaringan manajemen openstack (typically br-mgmt) untuk host atau container yang relevan.

source: Other Notes
id: Catatan lain

source: Our general config options are now stored in an "/usr/local/bin/openstack-ansible.rc" file and will be sourced when the "openstack-ansible" wrapper is invoked. The RC file will read in BASH environment variables and should any Ansible option be set that overlaps with our defaults the provided value will be used.
id: Opsi konfigurasi umum kami sekarang disimpan dalam file "/usr/local/bin/openstack-ansible.rc" dan akan diambil dari sumber ketika pembungkus "openstack-ansible" dipanggil. File RC akan membaca dalam variabel lingkungan BASH dan jika ada opsi Ansible diatur yang tumpang tindih dengan default kami, nilai yang disediakan akan digunakan.

source: Overrides for ceilometer ``aodh_connection_string`` will no longer work. Specifying an Aodh connection string in Ceilometer was deprecated within Ceilometer in a prior release so this option has been removed.
id: Override untuk ceilometer ``aodh_connection_string`` tidak akan berfungsi lagi. Menentukan string koneksi Aodh di Ceilometer tidak digunakan lagi dalam Ceilometer dalam rilis sebelumnya sehingga opsi ini telah dihapus.

source: Panko migrated from usage of Apache mod_wsgi or native daemon to uWSGI daemon. This means, that `panko_apache_*` variables are not available and has no effect anymore.
id: Panko bermigrasi dari penggunaan Apache mod_wsgi atau native daemon ke uWSGI daemon. Ini berarti, bahwa variabel `panko_apache_ *` tidak tersedia dan tidak berpengaruh lagi.

source: Paramiko version 2.0 Python requires the Python cryptography library. New system packages must be installed for this library. For OpenStack-Ansible versions <12.0.12, <11.2.15, <13.0.2 the system packages must be installed on the **deployment host** manually by executing ``apt-get install -y build-essential libssl-dev libffi-dev``.
id: Paramiko versi 2.0 Python membutuhkan pustaka kriptografi Python. Paket sistem baru harus diinstal untuk perpustakaan ini. Untuk versi OpenStack-Ansible <12.0.12, <11.2.15, <13.0.2 paket sistem harus diinstal pada **deployment host** secara manual dengan menjalankan ``apt-get install -y build-essential libssl-dev libffi-dev``.

source: Passed --extra-vars flag to the openstack-ansible should have precedence over the user-variables*.yml now.
id: Passed --extra-vars flag ke openstack-ansible seharusnya didahulukan dari user-variables*.yml sekarang.

source: Per https://review.openstack.org/#/c/413920/20, the ceilometer-collector service is now deprecated and its respective container is no longer deployed by default. Gnocchi is now used as the default publisher.
id: Per https://review.openstack.org/#/c/413920/20, layanan ceilometer-collector sekarang tidak digunakan lagi dan kontainernya masing-masing tidak lagi digunakan secara default. Gnocchi sekarang digunakan sebagai penerbit default.

source: Percona Xtrabackup has been removed from the Galera client role.
id: Percona Xtrabackup telah dihapus dari peran klien Galera.

source: Persistent systemd journals are now enabled. This allows deployers to keep older systemd journals on disk for review. The disk space requirements are extremely low since the journals are stored in binary format. The default location for persistent journals is in ``/var/log/journal``.
id: Jurnal systemd persisten sekarang diaktifkan. Hal ini memungkinkan pengerahkan untuk menyimpan jurnal systemd yang lebih lama pada disk untuk ditinjau. Persyaratan ruang disk sangat rendah karena jurnal disimpan dalam format biner. Lokasi default untuk jurnal persisten ada di ``/var/log/journal``.

source: Pike Series Release Notes
id: Catatan Rilis Seri Pike

source: Playbooks for `ceph-ansible <https://github.com/ceph/ceph-ansible/>`_ have been added to facilitate gate testing of the OpenStack-Ansible integration with Ceph clusters, and can be used to integrate the two projects so that OpenStack-Ansible can deploy and consume its own Ceph installation using ceph-ansible. This should be considered an experimental integration until further testing is been completed by deployers and the OpenStack-Ansible gate to fine tune its stability and completeness. The ceph-install playbook can be activated by adding hosts to the ``ceph-mon_hosts`` and ``ceph-osd_hosts`` in the OSA inventory. A variety of ceph-ansible specific variables will likely need to be configured in ``user_variables.yml`` to configure ceph-ansible for your environment. Please reference the `ceph-ansible repo <https://github.com/ceph/ceph-ansible/blob/master/group_vars/all.yml.sample>`_ for a list of variables the project supports.
id: Playbook untuk `ceph-ansible <https://github.com/ceph/ceph-ansible/>`_ telah ditambahkan untuk memfasilitasi pengujian gerbang integrasi OpenStack-Ansible dengan cluster Ceph, dan dapat digunakan untuk mengintegrasikan kedua proyek sehingga OpenStack-Ansible dapat menggunakan dan menggunakan instalasi Ceph sendiri menggunakan ceph-ansible. Ini harus dianggap sebagai integrasi eksperimental sampai pengujian lebih lanjut diselesaikan oleh para deployer dan gate OpenStack-Ansible untuk menyempurnakan stabilitas dan kelengkapannya. Playbook ceph-install dapat diaktifkan dengan menambahkan host ke ``ceph-mon_hosts`` dan ``ceph-osd_hosts`` dalam OSA inventory. Berbagai variabel spesifik yang dimungkinkan mungkin perlu dikonfigurasikan di ``user_variables.yml`` untuk mengonfigurasi yang mungkin untuk lingkungan Anda. Silakan rujuk `ceph-ansible repo <https://github.com/ceph/ceph-ansible/blob/master/group_vars/all.yml.sample>`_ untuk daftar variabel yang didukung proyek.

source: Playbooks have been added to facilitate this process through automation. Please see the ``Major upgrades`` chapter in the Operations Guide.
id: Playbook telah ditambahkan untuk memfasilitasi proses ini melalui otomatisasi. Silakan lihat bab ``Major upgrades`` idalam Operations Guide.

source: Please note: Horizon will still display IPv6 addresses in various panels with IPv6 support disabled. However, it will not allow any direct management of IPv6 configuration.
id: Harap dicatat: Horizon masih akan menampilkan alamat IPv6 di berbagai panel dengan dukungan IPv6 dinonaktifkan. Namun, itu tidak akan mengizinkan manajemen langsung konfigurasi IPv6.

source: Power off one Galera container
id: Matikan satu kontainer Galera

source: Power on the Galera container
id: Nyalakan kontainer Galera

source: Prelude
id: Prelude (pendahuluan)

source: Previously, the ``ansible_managed`` var was being used to insert a header into the ``swift.conf`` that contained date/time information. This meant that swift.conf across different nodes did not have the same MD5SUM, causing ``swift-recon --md5`` to break. We now insert a piece of static text instead to resolve this issue.
id: Sebelumnya, var ``ansible_managed`` sedang digunakan untuk memasukkan header ke dalam ``swift.conf`` yang berisi informasi tanggal/waktu. Ini berarti bahwa swift.conf di seluruh node yang berbeda tidak memiliki MD5SUM yang sama, menyebabkan ``swift-recon --md5`` rusak. Kami sekarang menyisipkan selembar teks statis sebagai gantinya untuk menyelesaikan masalah ini.

source: Properly distrubute client keys to nova hypervisors when extra ceph clusters are being deployed.
id: Sebarkan kunci klien dengan benar ke hypervisor nova ketika cluster ceph ekstra sedang digunakan.

source: Properly remove temporary files used to transfer ceph client keys from the deploy host and hypervisors.
id: Hapus file sementara yang digunakan untuk mentransfer kunci klien ceph dengan benar dari host dan hypervisor.

source: Public endpoints will need to be updated using the Keystone admin API to support secure endpoints. The Keystone ansible module will not recreate the endpoints automatically. Documentation on the `Keystone service catalog can be found here <http://docs.openstack.org/developer/keystone/configuration.html#service-catalog>`_.
id: Endpoint publik perlu diperbarui menggunakan Keystone admin API untuk mendukung endpoint yang aman. Modul Keystone ansible tidak akan membuat ulang endpoint secara otomatis. Dokumentasi tentang `Keystone service catalog can be found here <http://docs.openstack.org/developer/keystone/configuration.html#service-catalog>`_.

source: Python 2.7 support has been dropped. Last release of openstack ansible to support python 2.7 is OpenStack Train.
id: Dukungan Python 2.7 telah dijatuhkan. Rilis terakhir dari openstack yang dapat digunakan untuk mendukung python 2.7 adalah OpenStack Train.

source: Python-tempestconf is a tool that generates a tempest.conf file, based only on the credentials from an openstack installation. It uses the discoverable api from openstack to check for services, features, etc.
id: Python-tempestconf adalah alat yang menghasilkan file tempest.conf, hanya berdasarkan pada kredensial dari instalasi openstack. Ia menggunakan api yang dapat ditemukan dari openstack untuk memeriksa layanan, fitur, dll.

source: Queens Series Release Notes
id: Catatan Rilis Seri Queens

source: RabbitMQ Server can now be installed from different methods: a deb file (default), from standard repository package and from external repository. Current behavior is unchanged. Please define ``rabbitmq_install_method: distro`` to use packages provided by your distribution or ``rabbitmq_install_method: external_repo`` to use packages stored in an external repo. In the case ``external_repo`` is used, the process will install RabbitMQ from the packages hosted by packagecloud.io, as recommended by RabbitMQ.
id: RabbitMQ Server sekarang dapat diinstal dari berbagai metode: file deb (default), dari paket repositori standar dan dari repositori eksternal. Perilaku saat ini tidak berubah. Silakan tentukan `` rabbitmq_install_method: distro`` untuk menggunakan paket yang disediakan oleh distribusi Anda atau `` rabbitmq_install_method: external_repo`` untuk menggunakan paket yang disimpan dalam repo eksternal. Jika `` external_repo`` digunakan, proses akan menginstal RabbitMQ dari paket yang di-host oleh packagecloud.io, seperti yang direkomendasikan oleh RabbitMQ.

source: RabbitMQ is now installed via an RPM repository provided by RabbitMQ developers. The version is kept constant via yum's versionlock plugin. This allows the tasks to lock the RabbitMQ version to a particular revision and prevent changes to that version.
id: RabbitMQ sekarang diinstal melalui repositori RPM yang disediakan oleh pengembang RabbitMQ. Versi ini dijaga konstan melalui plugin versionlock yum. Ini memungkinkan tugas untuk mengunci versi RabbitMQ ke revisi tertentu dan mencegah perubahan ke versi itu.

source: Rather than a hard-coded set of projects and users, tempest can now be configured with a custom list with the variables ``tempest_projects`` and ``tempest_users``.
id: Dari sekumpulan proyek hard-coded dan pengguna , tempest sekarang dapat dikonfigurasi dengan daftar kustom dengan variabel ``tempest_projects`` dan ``tempest_users``.

source: Recently the spice-html5 git repository was entirely moved from ``https://github.com/SPICE/spice-html5`` to ``https://gitlab.freedesktop.org/spice/spice-html5``. This results in a failure in the git clone stage of the ``repo-build.yml`` playbook for OSA ocata releases earlier than ``15.1.22``. To fix the issue, deployers may upgrade to the most recent release, or may implement the following override in ``user_variables.yml``.
id: Baru-baru ini repositori git spice-html5 sepenuhnya dipindahkan dari ```https://github.com/SPICE/spice-html5`` ke ``https://gitlab.freedesktop.org/spice/spice-html5``. Ini menghasilkan kegagalan pada tahap git clone dari ``repo-build.yml`` playbook untuk OSA rilis ocata lebih awal dari ``15.1.22``. Untuk memperbaiki masalah ini, para deployer dapat upgrade ke rilis terbaru, atau dapat menerapkan override berikut di ``user_variables.yml``.

source: Recently the spice-html5 git repository was entirely moved from ``https://github.com/SPICE/spice-html5`` to ``https://gitlab.freedesktop.org/spice/spice-html5``. This results in a failure in the git clone stage of the ``repo-build.yml`` playbook for OSA pike releases earlier than ``16.0.14``. To fix the issue, deployers may upgrade to the most recent release, or may implement the following override in ``user_variables.yml``.
id: Baru-baru ini repositori git spice-html5 sepenuhnya dipindahkan dari ``https://github.com/SPICE/spice-html5`` ke ``https://gitlab.freedesktop.org/spice/spice-html5``. Ini menghasilkan kegagalan pada tahap git clone dari ``repo-build.yml`` playbook untuk rilis OSA pike lebih awal dari ``16.0.14``. Untuk memperbaiki masalah ini, para deployer dapat upgrade ke rilis terbaru, atau dapat menerapkan override berikut di ``user_variables.yml``.

source: Recently the spice-html5 git repository was entirely moved from ``https://github.com/SPICE/spice-html5`` to ``https://gitlab.freedesktop.org/spice/spice-html5``. This results in a failure in the git clone stage of the ``repo-build.yml`` playbook for OSA queens releases earlier than ``17.0.5``. To fix the issue, deployers may upgrade to the most recent release, or may implement the following override in ``user_variables.yml``.
id: Baru-baru ini repositori git spice-html5 sepenuhnya dipindahkan dari ``https://github.com/SPICE/spice-html5`` ke ``https://gitlab.freedesktop.org/spice/spice-html5``. Ini menghasilkan kegagalan pada tahap git klon dari ``repo-build.yml`` playbook untuk rilis ratu OSA lebih awal dari ``17.0.5``. Untuk memperbaiki masalah ini, para deployer dapat upgrade ke rilis terbaru, atau dapat menerapkan override berikut di ``user_variables.yml``.

source: Related-Bugs:
id: Bug terkait:

source: Removal of the magnum module. Please use the ansible native module 'os_coe_cluster_template'. More information: https://docs.ansible.com/ansible/latest/modules/os_coe_cluster_template_module.html This module was not used in the openstack repos therefore no updates were required.
id: Penghapusan modul magnum. Silakan gunakan modul asli 'os_coe_cluster_template'. Informasi lebih lanjut: https://docs.ansible.com/ansible/latest/modules/os_coe_cluster_template_module.html Modul ini tidak digunakan dalam repo openstack sehingga tidak diperlukan pembaruan.

source: Removal of the netloc, netloc_no_port and netorigin filters. Please use the urlsplit filter instead. All usages of the deprecated filters in openstack repos have been updated.
id: Penghapusan filter netloc, netloc_no_port dan netorigin. Silakan gunakan filter urlsplit sebagai gantinya. Semua penggunaan filter usang dalam repo openstack telah diperbarui.

source: Remove ``CONF.scenario.img_dir`` option as it is being removed from Tempest after ~4 year deprecation period. ``CONF.scenario.img_file`` option needs to contain the full path to an image to upload to glance.
id: Hapus opsi ``CONF.scenario.img_dir '' karena sedang dihapus dari Tempest setelah ~ periode penghentian 4 tahun. ``CONF.scenario.img_file`` opsi tersebut harus berisi full path ke image untuk diunggah untuk dilihat glance.

source: Remove ``cinder_glance_api_version`` option due to deprecation of glance_api_version option in Cinder.
id: Hapus opsi ``cinder_glance_api_version`` karena penghentian opsi glance_api_version di Cinder.

source: Remove ``cinder_rpc_backend`` option due to deprecation of rpc_backend option in oslo.messaging.
id: Hapus opsi ``cinder_rpc_backend`` karena penghentian opsi rpc_backend di oslo.messaging.

source: Remove ``cloudkitty_rpc_backend`` option due to deprecation of rpc_backend option in oslo.messaging.
id: Hapus opsi ``cloudkitty_rpc_backend`` karena penghentian opsi rpc_backend di oslo.messaging.

source: Remove ``designate_rpc_backend`` option due to deprecation of rpc_backend option in oslo.messaging.
id: Hapus opsi ``designate_rpc_backend`` karena penghentian opsi rpc_backend di oslo.messaging.

source: Remove ``glance_rpc_backend`` option due to deprecation of rpc_backend option in oslo.messaging.
id: Hapus opsi ``glance_rpc_backend`` karena penghentian opsi rpc_backend di oslo.messaging.

source: Remove ``heat_rpc_backend`` option due to deprecation of rpc_backend option in oslo.messaging.
id: Hapus opsi ``heat_rpc_backend`` karena penghentian opsi rpc_backend di oslo.messaging.

source: Remove ``keystone_rpc_backend`` option due to deprecation of rpc_backend option in oslo.messaging.
id: Hapus opsi ``keystone_rpc_backend`` karena penghentian opsi rpc_backend di oslo.messaging.

source: Remove ``magnum_rpc_backend`` option due to deprecation of rpc_backend option in oslo.messaging.
id: Hapus opsi ``magnum_rpc_backend`` karena penghentian opsi rpc_backend di oslo.messaging.

source: Remove ``neutron_rpc_backend`` option due to deprecation of rpc_backend option in oslo.messaging.
id: Hapus opsi ``neutron_rpc_backend`` karena penghentian opsi rpc_backend di oslo.messaging.

source: Remove ``octavia_rpc_backend`` option due to deprecation of rpc_backend option in oslo.messaging.
id: Hapus opsi ``octavia_rpc_backend`` karena penghentian opsi rpc_backend di oslo.messaging.

source: Remove ``sahara_rpc_backend`` option due to deprecation of rpc_backend option in oslo.messaging.
id: Hapus opsi ``sahara_rpc_backend`` karena penghentian opsi rpc_backend di oslo.messaging.

source: Remove ``trove_rpc_backend`` option due to deprecation of rpc_backend option in oslo.messaging.
id: Hapus opsi ``trove_rpc_backend`` karena penghentian opsi rpc_backend di oslo.messaging.

source: Removed PKI token support and the ``cloudkitty_signing_dir`` parameter.
id: Dukungan token PKI yang dihapus dan parameter ``cloudkitty_signing_dir``.

source: Removed ``cirros_img_url`` and in most places replaced with ``tempest_img_url``.
id: ``cirros_img_url`` yang dihapus dan di sebagian besar tempat diganti dengan ``tempest_img_url``.

source: Removed ``cirros_tgz_url`` and in most places replaced with ``tempest_img_url``.
id: ``cirros_tgz_url`` dihapus dan di sebagian besar tempat diganti dengan ``tempest_img_url``.

source: Removed ``tempest_volume_backend1_name`` and ``tempest_volume_backend1_name`` since ``backend1_name`` and ``backend2_name`` were removed from tempest in commit 27905cc (merged 26/04/2016)
id: ``tempest_volume_backend1_name`` dan ``tempest_volume_backend1_name`` yang dihapus karena ``backend1_name`` dan ``backend2_name`` telah dihapus dari tempest di commit 27905cc (digabung 26/04/2016)

source: Removed dependency for ``cinder_backends_rbd_inuse`` in nova.conf when setting ``rbd_user`` and ``rbd_secret_uuid`` variables. Cinder delivers all necessary values via RPC when attaching the volume, so those variables are only necessary for ephemeral disks stored in Ceph. These variables are required to be set up on cinder-volume side under backend section.
id: Dependency dihapus untuk ``cinder_backends_rbd_inuse`` di nova.conf ketika mengatur variabel ``rbd_user`` dan ``rbd_secret_uuid``. Cinder memberikan semua nilai yang diperlukan melalui RPC saat melampirkan volume, sehingga variabel itu hanya diperlukan untuk disk sementara yang disimpan di Ceph. Variabel ini harus diatur pada sisi volume cinder di bawah bagian backend.

source: Removed deprecated variable ``tempest_compute_image_alt_ssh_password``
id: Variabel usang yang dihapus ``tempest_compute_image_alt_ssh_password``

source: Removed deprecated variable ``tempest_compute_image_alt_ssh_user``
id: Variabel usang yang dihapus ``tempest_compute_image_alt_ssh_user``

source: Removed deprecated variable ``tempest_compute_image_ssh_password``
id: Variabel usang yang dihapus ``tempest_compute_image_ssh_password``

source: Removed various deprecated / no longer supported features from tempest.conf.j2. Some variables have been moved to their new sections in the config.
id: Menghapus berbagai fitur usang / tidak didukung lagi dari tempest.conf.j2. Beberapa variabel telah dipindahkan ke bagian baru di config.

source: Renamed ``cirros_img_disk_format`` to ``tempest_img_disk_format``
id: Berganti nama ``cirros_img_disk_format`` menjadi ``tempest_img_disk_format``

source: Repeat for the other Galera containers
id: Ulangi untuk kontainer Galera lainnya

source: Repeatable deployments are now easier since the manifest files for OpenStack software uses the exact content from an upstream repository. Specific commits or tags can be referenced within the manifest. The ``yaprt`` package is no longer used to build the repo.
id: Deployment yang dapat diulang sekarang lebih mudah karena file manifes untuk perangkat lunak OpenStack menggunakan konten yang tepat dari repositori hulu. Komit atau tag tertentu dapat dirujuk dalam manifes. Paket ``yaprt`` tidak lagi digunakan untuk membangun repo.

source: Restricted: Supported software that is not available under a completely free license.
id: Restricted: Perangkat lunak yang didukung yang tidak tersedia di bawah lisensi sepenuhnya gratis.

source: Rocky Series Release Notes
id: Catatan Rilis Seri Rocky

source: SELinux policy for neutron on CentOS 7 is now provided to fix SELinux AVCs that occur when neutron's agents attempt to start daemons such as haproxy and dnsmasq.
id: Kebijakan SELinux untuk neutron pada CentOS 7 sekarang disediakan untuk memperbaiki SELinux AVC yang terjadi ketika agen neutron berusaha memulai daemon seperti haproxy dan dnsmasq.
