Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: It is commonly considered bad practice to downlaod random images from the Internet expecially the test images the Octavia team provides which could potentially include unpatched operating system packages - so for any production deploy adjust the download url to an artifact storage your organization controls. The system also does not authenticate the image (e.g. with an md5) so should only be used on networks your organization controls.
id: Biasanya dianggap praktik buruk untuk menurunkan image acak dari Internet, terutama image uji yang disediakan oleh tim Octavia yang berpotensi mencakup paket sistem operasi yang tidak ditambal (unpatched) - jadi untuk setiap penyebaran produksi sesuaikan url unduhan ke penyimpanan artefak yang dikendalikan organisasi Anda. Sistem juga tidak mengautentikasi image (misal dengan md5) sehingga hanya boleh digunakan pada jaringan yang dikontrol organisasi Anda.

source: It is not possible to override the ceph client credential for nova and cinder with ansible 1.9.4.
id: Tidak mungkin untuk menimpa kredensial klien ceph untuk nova dan cinder dengan ansible 1.9.4.

source: It is now possible for deployers to enable or disable the `mysqlcheck` capability. The Boolean option `galera_monitoring_check_enabled` has been added which has a default value of **true**.
id: Sekarang memungkinkan bagi para deployer untuk mengaktifkan atau menonaktifkan kemampuan `mysqlcheck`. Opsi Boolean `galera_monitoring_check_enabled` telah ditambahkan yang memiliki nilai default **true**.

source: It is now possible to change the port used by `mysqlcheck`. The integer option `galera_monitoring_check_port` has been added with the default value of **9200**.
id: Sekarang dimungkinkan untuk mengubah port yang digunakan oleh `mysqlcheck`. Opsi integer `galera_monitoring_check_port` telah ditambahkan dengan nilai default **9200 **.

source: It is now possible to customise the location of the configuration file source for the All-In-One (AIO) bootstrap process using the ``bootstrap_host_aio_config_path`` variable.
id: Sekarang dimungkinkan untuk menyesuaikan lokasi sumber file konfigurasi untuk proses bootstrap All-In-One (AIO) menggunakan variabel ``bootstrap_host_aio_config_path``.

source: It is now possible to customise the location of the scripts used in the All-In-One (AIO) boostrap process using the ``bootstrap_host_aio_script_path`` variable.
id: Sekarang dimungkinkan untuk menyesuaikan lokasi skrip yang digunakan dalam proses boostrap All-In-One (AIO) menggunakan variabel ``bootstrap_host_aio_script_path``.

source: It is now possible to customise the name of the ``user_secrets.yml`` file created by the All-In-One (AIO) bootstrap process using the ``bootstrap_host_user_secrets_filename`` variable.
id: Sekarang dimungkinkan untuk menyesuaikan nama file ``user_secrets.yml`` yang dibuat oleh proses bootstrap All-In-One (AIO) menggunakan variabel ``bootstrap_host_user_secrets_filename``.

source: It is now possible to customise the name of the ``user_variables.yml`` file created by the All-In-One (AIO) bootstrap process using the ``bootstrap_host_user_variables_filename`` variable.
id: Sekarang mungkin untuk menyesuaikan nama file ``user_variables.yml`` yang dibuat oleh proses bootstrap All-In-One (AIO) menggunakan variabel ``bootstrap_host_user_variables_filename``.

source: It is now possible to modify the NTP server options in chrony using ``security_ntp_server_options``.
id: Sekarang dimungkinkan untuk mengubah opsi server NTP dalam kroni menggunakan ``security_ntp_server_options``.

source: It is now possible to specify a list of tests for tempest to blacklist when executing using the ``tempest_test_blacklist`` list variable.
id: Sekarang dimungkinkan untuk menentukan daftar tes untuk tempest ke daftar hitam ketika mengeksekusi menggunakan variabel daftar ``tempest_test_blacklist``.

source: It is now possible to use NFS mountpoints with the role by using the nova_nfs_client variable, which is useful for using NFS for instance data and saves.
id: Sekarang dimungkinkan untuk menggunakan NFS mountpoint dengan peran dengan menggunakan variabel nova nfs_client, yang berguna untuk menggunakan NFS untuk data instance dan menyimpan.

source: It is now possible to use the horizon_launch_instance_defaults variable that allows customizing the default values for properties found in the Launch Instance modal, using the LAUNCH_INSTANCE_DEFAULTS config option. See https://docs.openstack.org/developer/horizon/install/settings.html#launch-instance-defaults
id: Sekarang dimungkinkan untuk menggunakan variabel horizon_launch_instance_defaults yang memungkinkan penyesuaian nilai default untuk properti yang ditemukan dalam modal Instance Launch, menggunakan opsi konfigurasi LAUNCH_INSTANCE_DEFAULTS config. Lihat https://docs.openstack.org/developer/horizon/install/settings.html#launch-instance-defaults

source: It is possible that you may need to use the cinder-manage command to migrate volumes to a specific host. In addition, you will have to remove the old ``rbd:volumes`` service which will be stale.
id: Mungkin saja Anda perlu menggunakan perintah cinder-manage untuk memigrasi volume ke host tertentu. Selain itu, Anda harus menghapus layanan ``rbd: volumes`` lama yang akan basi.

source: It is possible to configure Glance to allow cross origin requests by specifying the allowed origin address using the ``glance_cors_allowed_origin`` variable. By default, this will be the load balancer address.
id: Dimungkinkan untuk mengkonfigurasi Glance untuk mengizinkan permintaan asal silang (cross origin request) dengan menentukan alamat asal yang diizinkan menggunakan variabel ``glance_cors_allowed_origin``. Secara default, ini akan menjadi alamat penyeimbang beban.

source: It is recommended for deployers to clean up the **neutron_agents** container(s) after an upgrade is complete and the cluster has been verified as stable. This can be done by simply disabling the neutron agents running in the **neutron_agent** container(s), re-balancing the agent services targeting the new baremetal agents, deleting the container(s), and finally removing the container(s) from inventory.
id: Direkomendasikan bagi para deployer untuk membersihkan **neutron_agents** container(s) setelah upgrade selesai dan cluster telah diverifikasi sebagai stabil. Ini dapat dilakukan dengan hanya menonaktifkan agen neutron yang berjalan di ***neutron_agent** container(s), re-balancing layanan agen menargetkan agen baremetal baru, menghapus container, dan akhirnya menghapus container (s) dari persediaan.

source: It is recommended that the certificate generation is always reviewed by security professionals since algorithms and key-lengths considered secure change all the time.
id: Direkomendasikan bahwa pembuatan sertifikat selalu ditinjau oleh para profesional keamanan karena algoritma dan panjang kunci dianggap perubahan yang aman sepanjang waktu.

source: It's now possible to change the behavior of ``DISALLOW_IFRAME_EMBED`` by defining the variable ``horizon_disallow_iframe_embed`` in the user variables.
id: Sekarang mungkin untuk mengubah perilaku ``DISALLOW_IFRAME_EMBED`` dengan mendefinisikan variabel ``horizon_disallow_iframe_embed`` dalam variabel pengguna.

source: It's now possible to disable heat stack password field in horizon. ``horizon_enable_heatstack_user_pass`` variable has been added and default to True.
id: Sekarang dimungkinkan untuk menonaktifkan field password heat stack di horizon. Variabel ``horizon_enable_heatstack_user_pass`` telah ditambahkan dan default ke True.

source: KSM configuration is changed to disabled by default on Ubuntu. If you overcommit the RAM on your hypervisor it's a good idea to set ``nova_compute_ksm_enabled`` to ``True``.
id: Konfigurasi KSM diubah menjadi dinonaktifkan secara default di Ubuntu. Jika Anda terlalu berkomitmen pada RAM pada hypervisor Anda, sebaiknya atur ``nova_compute_ksm_enabled`` menjadi ``True``.

source: Keystone can now be configured for multiple LDAP or Active Directory identity back-ends. Configuration of this feature is documented in the `Keystone Configuration <http://docs.openstack.org/developer/openstack-ansible/install-guide/configure-keystone.html>`_ section of the `Install Guide <http://docs.openstack.org/developer/openstack-ansible/install-guide/>`_.
id: Keystone sekarang dapat dikonfigurasi untuk beberapa LDAP atau Active Directory identity back-ends. Konfigurasi fitur ini didokumentasikan di bagian `Keystone Configuration <http://docs.openstack.org/developer/openstack-ansible/install-guide/configure-keystone.html>` _ dari `Install Guide <http://docs.openstack.org/developer/openstack-ansible/install-guide/>`_.

source: Keystone can now be configured for multiple LDAP or Active Directory identity back-ends. Configuration of this feature is documented in the `Keystone Configuration <http://docs.openstack.org/developer/openstack-ansible/mitaka/install-guide/configure-keystone.html>`_ section of the `Install Guide <http://docs.openstack.org/developer/openstack-ansible/mitaka/install-guide/>`_.
id: Keystone sekarang dapat dikonfigurasi untuk beberapa LDAP atau Active Directory identity back-ends. Konfigurasi fitur ini didokumentasikan dalam bagian `Konfigurasi Keystone <http://docs.openstack.org/developer/openstack-ansible/mitaka/install-guide/configure-keystone.html>` _ dari `Install Guide <http://docs.openstack.org/developer/openstack-ansible/mitaka/install-guide/>`_.

source: Keystone now uses uWSGI exclusively (instead of Apache with mod_wsgi) and has the web server acting as a reverse proxy. The default web server is now set to Nginx instead of Apache, but Apache will automatically used if federation is configured.
id: Keystone sekarang menggunakan uWSGI secara eksklusif (bukan Apache dengan mod_wsgi) dan memiliki server web yang bertindak sebagai proxy terbalik. Server web default sekarang diatur ke Nginx bukan Apache, tetapi Apache akan secara otomatis digunakan jika federasi dikonfigurasi.

source: Keystone's v3 API is now the default for all services.
id: API v3 Keystone sekarang menjadi standar untuk semua layanan.

source: Known Issues
id: Masalah Dikenal

source: LBaaS v2 is available for deployment in addition to LBaaS v1. Both versions are mutually exclusive and cannot be running at the same time. Deployers will need to re-create any existing load balancers if they switch between LBaaS versions. Switching to LBaaS v2 will stop any existing LBaaS v1 load balancers.
id: LBaaS v2 tersedia untuk deployment selain LBaaS v1. Kedua versi ini saling eksklusif dan tidak dapat berjalan pada saat bersamaan. Pemberi kerja perlu membuat kembali penyeimbang beban yang ada jika mereka beralih di antara versi LBaaS. Beralih ke LBaaS v2 akan menghentikan penyeimbang beban LBaaS v1 yang ada.

source: LBaaS v2 is available for deployment in addition to LBaaS v1. Both versions are mutually exclusive and cannot be running at the the same time. Deployers will need to re-create any existing load balancers if they switch between LBaaS versions. Switching to LBaaS v2 will stop any existing LBaaS v1 load balancers.
id: LBaaS v2 tersedia untuk deployment selain LBaaS v1. Kedua versi ini saling eksklusif dan tidak dapat berjalan pada saat bersamaan. Pemberi kerja perlu membuat kembali penyeimbang beban yang ada jika mereka beralih di antara versi LBaaS. Beralih ke LBaaS v2 akan menghentikan penyeimbang beban LBaaS v1 yang ada.

source: LBaaS v2 panels in Horizon will automatically be enabled when LBaaS v2 is included in ``neutron_plugin_base``.
id: Panel LBaaS v2 di Horizon akan secara otomatis diaktifkan ketika LBaaS v2 dimasukan dalam ``neutron_plugin_base``.

source: LBaaSv1 has been removed from the ``neutron-lbaas`` project in the Newton release and it has been removed from OpenStack-Ansible as well.
id: LBaaSv1 telah dihapus dari proyek ``neutron-lbaas`` di rilis Newton dan telah dihapus dari OpenStack-Ansible juga.

source: LBaaSv2 is now enabled by default in all-in-one (AIO) deployments.
id: LBaaSv2 sekarang diaktifkan secara default di deployment all-in-one (AIO).

source: LXC containers will have their TZ data sync with their physical host machines. This is being done because containers have been assumed to use UTC while a host could be using something else. This causes issues in some services like celiometer and can result in general time differences in logging.
id: Kontainer LXC akan memiliki sinkronisasi data TZ mereka dengan mesin host fisik mereka. Ini sedang dilakukan karena kontainer diasumsikan menggunakan UTC sedangkan host dapat menggunakan sesuatu yang lain. Ini menyebabkan masalah di beberapa layanan seperti celiometer dan dapat menghasilkan perbedaan waktu secara umum dalam pencatatan.

source: LXC containers will now generate a fixed mac address on all network interfaces when the option `lxc_container_fixed_mac` is set to **true**. This feature was implemented to resolve issues with dynamic mac addresses in containers generally experienced at scale with network intensive services.
id: Kontainer LXC sekarang akan menghasilkan alamat mac tetap pada semua antarmuka jaringan ketika opsi `lxc_container_fixed_mac` diatur ke **true **. Fitur ini diterapkan untuk menyelesaikan masalah dengan alamat mac dinamis dalam kontainer yang umumnya dialami pada skala dengan layanan intensif jaringan.

source: LXC containers will now have a proper RFC1034/5 hostname set during post build tasks. A localhost entry for 127.0.1.1 will be created by converting all of the "_" in the ``inventory_hostname`` to "-". Containers will be created with a default domain of *openstack.local*. This domain name can be customized to meet your deployment needs by setting the option ``lxc_container_domain``.
id: Kontainer LXC sekarang akan memiliki set hostname RFC1034/5 yang tepat selama tugas post build. Entri localhost untuk 127.0.1.1 akan dibuat dengan mengonversi semua "_" di ``inventory_hostname`` ke "-". Kontainer akan dibuat dengan domain default *openstack.local*. Nama domain ini dapat disesuaikan untuk memenuhi kebutuhan deployment Anda dengan mengatur opsi ``lxc_container_domain``.

source: LXC containers will now have the ability to use a fixed mac address on all network interfaces when the option `lxc_container_fixed_mac` is set **true**. This change will assist in resolving a long standing issue where network intensive services, such as neutron and rabbitmq, can enter a confused state for long periods of time and require rolling restarts or internal system resets to recover.
id: Kontainer LXC sekarang akan memiliki kemampuan untuk menggunakan alamat mac tetap pada semua antarmuka jaringan ketika opsi `lxc_container_fixed_mac` diatur **true**. Perubahan ini akan membantu dalam menyelesaikan masalah lama di mana layanan intensif jaringan, seperti neutron dan rabbitmq, dapat memasuki keadaan bingung untuk jangka waktu yang lama dan membutuhkan restart bergulir atau reset sistem internal untuk pulih.

source: LXC on CentOS is now installed via package from a COPR repository rather than installed from the upstream source.
id: LXC pada CentOS sekarang diinstal melalui paket dari repositori COPR daripada diinstal dari sumber hulu.

source: LXC package installation and cache preparation will now occur by default only on hosts which will actually implement containers.
id: Instalasi paket LXC dan persiapan cache sekarang akan terjadi secara default hanya pada host yang benar-benar akan mengimplementasikan kontainer.

source: LXD 2.0.11 grew a new feature ('description' tag for a container) and this has been added to the stable Ubuntu Xenial 16.04 release. Unfortunately, pylxd 2.0.5 can't handle this extra attribute and crashes out.
id: LXD 2.0.11 mengembangkan fitur baru (tag 'description' untuk sebuah kontainer) dan ini telah ditambahkan ke rilis Ubuntu Xenial 16.04 yang stabil. Sayangnya, pylxd 2.0.5 tidak dapat menangani atribut tambahan ini dan lumpuh.

source: Liberty Series Release Notes
id: Catatan Rilis Seri Liberty

source: Listen via HTTPS on a load balancer, but via HTTP on the horizon host and have the load balancer forward the correct headers. It will do this by default in the integrated build due to the presence of the load balancer, so the current behaviour is retained.
id: Dengarkan melalui HTTPS pada load balancer, tetapi melalui HTTP pada host horizon dan minta load balancer meneruskan header yang benar. Ini akan melakukan ini secara default di build terintegrasi karena adanya penyeimbang beban, sehingga perilaku saat ini dipertahankan.

source: Logging within the container has been bind mounted to the hosts this reslves issue `1588051 <https://bugs.launchpad.net/openstack-ansible/+bug/1588051>_`
id: Logging di dalam kontainer telah diikat ke host untuk mengatasi masalah ini `1588051 <https://bugs.launchpad.net/openstack-ansible/+bug/1588051>_`

source: Logs for haproxy can now be found in ``/openstack/log/<haproxy host name>-haproxy/`` on the container host (if haproxy is in a container), or ``/var/log/haproxy/`` if haproxy is installed directly on a host.
id: Log untuk haproxy sekarang dapat ditemukan di ``/openstack/log/<haproxy host name>-haproxy/`` pada host kontainer (jika haproxy berada dalam sebuah kontainer), atau ``/var/log/haproxy/`` jika haproxy dipasang langsung pada host.

source: MAC addresses for containers with a fixed MAC (`lxc_container_fixed_mac` variable) are now saved to the ``/etc/ansible/facts.d/mac.fact`` file. Should such a container be destroyed but not removed from inventory, the interfaces will be recreated with the same MAC address when the container is recreated.
id: Alamat MAC untuk kontainer dengan variabel MAC tetap (variabel `lxc_container_fixed_mac`) sekarang disimpan ke file ``/etc/ansible/facts.d/mac.fact``. Jika kontainer seperti itu dihancurkan tetapi tidak dihapus dari inventaris, antarmuka akan dibuat kembali dengan alamat MAC yang sama ketika kontainer dibuat kembali.

source: Main: Officially supported software.
id: Utama: Perangkat lunak yang didukung secara resmi.

source: MariaDB 10.0.32 released on Aug 17 which, when configured to use xtrabackup for the SST, requires percona xtrabackup version 2.3.5 or higher. As xtrabackup is the default SST mechanism in the ``galera_server`` role, the version used has been updated from 2.2.13 to 2.3.5 for the x86_64 hardware architecture. See `the percona release notes for 2.3.2 <https://www.percona.com/doc/percona-xtrabackup/LATEST/release-notes/2.3/2.3.2.html#new-features>`_ for more details of what was included in the fix.
id: MariaDB 10.0.32 dirilis pada 17 Agustus, ketika dikonfigurasi untuk menggunakan xtrabackup untuk SST, memerlukan percona xtrabackup versi 2.3.5 atau lebih tinggi. Karena xtrabackup adalah mekanisme SST default dalam role ``galera_server``, versi yang digunakan telah diperbarui dari 2.2.13 ke 2.3.5 untuk arsitektur perangkat keras x86_64. Lihat 'the percona release notes for 2.3.2 <https://www.percona.com/doc/percona-xtrabackup/LATEST/release-notes/2.3/2.3.2.html#new-features>` _ untuk detail lebih lanjut tentang yang termasuk dalam perbaikan.

source: MariaDB 10.1+ includes `PrivateDevices=true` in its systemd unit files to add extra security around mount namespaces for MariaDB. While this is useful when running MariaDB on a bare metal host with other services, it is less useful when MariaDB is already in a container with its own namespaces. In addition, LXC 2.0.8 presents `/dev/ptmx` as a bind mount within the container and systemd 219 (on CentOS 7) cannot make an additional bind mount of `/dev/ptmx` when `PrivateDevices` is enabled.
id: MariaDB 10.1+ termasuk `PrivateDevices = true` dalam file unit systemd untuk menambah keamanan tambahan di sekitar mount namespaces untuk MariaDB. Meskipun ini berguna ketika menjalankan MariaDB pada host bare metal dengan layanan lain, itu kurang berguna ketika MariaDB sudah berada dalam kontainer dengan ruang namanya sendiri. Selain itu, LXC 2.0.8 menyajikan `/dev/ptmx` sebagai bind mount di dalam kontainer dan systemd 219 (pada CentOS 7) tidak dapat membuat bind mount tambahan dari `/dev/ptmx` ketika `PrivateDevices` diaktifkan.

source: MariaDB version 10.x is now the default in OpenStack-Ansible.
id: MariaDB versi 10.x sekarang menjadi default di OpenStack-Ansible.

source: Mariadb version upgrade gate checks removed.
id: Pemeriksaan gate upgrade versi Mariadb dihapus.

source: MemcacheD sets `PrivateDevices=true` in its systemd unit file to add extra security around mount namespaces. While this is useful when running MemcacheD on a bare metal host with other services, it is less useful when MemcacheD is already in a container with its own namespaces. In addition, LXC 2.0.8 presents `/dev/ptmx` as a bind mount within the container and systemd 219 (on CentOS 7) cannot make an additional bind mount of `/dev/ptmx` when `PrivateDevices` is enabled.
id: MemcacheD menetapkan `PrivateDevices = true` dalam file unit systemd untuk menambah keamanan tambahan di sekitar mount namespaces. Meskipun ini berguna ketika menjalankan MemcacheD pada host bare metal dengan layanan lain, itu kurang berguna ketika MemcacheD sudah berada dalam kontainer dengan ruang nama sendiri. Selain itu, LXC 2.0.8 menyajikan `/dev/ptmx` sebagai bind mount di dalam kontainer dan systemd 219 (pada CentOS 7) tidak dapat membuat bind mount tambahan dari `/dev/ptmx` ketika `PrivateDevices` diaktifkan.

source: Metal hosts were being inserted into the ``lxc_hosts`` group, even if they had no containers (Bug 1660996). This is now corrected for newly configured hosts. In addition, any hosts that did not belong in ``lxc_hosts`` will be removed on the next inventory run or playbook call.
id: Metal host sedang dimasukkan ke dalam grup ``lxc_hosts``, bahkan jika mereka tidak memiliki kontainer (Bug 1660996). Ini sekarang diperbaiki untuk host yang baru dikonfigurasi. Selain itu, semua host yang tidak termasuk dalam ``lxc_hosts`` akan dihapus pada inventory berikutnya atau panggilan playbook.

source: Mitaka Series Release Notes
id: Catatan Rilis Seri Mitaka

source: Modify the handler named ``Reload systemd daemon`` and all references to it in the role to something else (e.g. ``os_neutron Reload systemd daemon``).
id: Memodifikasi handler yang bernama ``Reload systemd daemon`` dan semua referensi untuknya di peran ke sesuatu yang lain (misal ``Os_neutron Reload systemd daemon``).

source: Moved ``haproxy_service_configs`` var to ``haproxy_default_service_configs`` so that ``haproxy_service_configs`` can be modified and added to without overriding the entire default service dict.
id: Pindah ``haproxy_service_configs`` var ke ``haproxy_default_service_configs`` sehingga ``haproxy_service_configs`` dapat dimodifikasi dan ditambahkan ke tanpa mengesampingkan seluruh dict layanan default.
