Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The ceilometer configuration files other than ``ceilometer.conf`` are now retrieved from upstream. You can override the repository from which these are retrieved by setting the ``ceilometer_git_config_lookup_location`` variable which defaults to the git.openstack.org.
id: File konfigurasi ceilometer selain ``ceilometer.conf`` sekarang diambil dari hulu. Anda dapat mengganti repositori dari mana ini diambil dengan mengatur variabel ``ceilometer_git_config_lookup_location`` yang default ke git.openstack.org.

source: The ceilometer-api service/container can be removed as part of O->P upgrades. A ceilometer-central container will be created to contain the central ceilometer agents.
id: Layanan/kontainer ceilometer-api dapat dilepas sebagai bagian dari upgrade O-> P. Kontainer ceilometer-central akan dibuat untuk berisi agen ceilometer central.

source: The ceph-ansible common roles are no longer namespaced with a galaxy-style '.' (ie. ``ceph.ceph-common`` is now cloned as ``ceph-common``), due to a change in the way upstream meta dependencies are handled in the ceph roles. The roles will be cloned according to the new naming, and an upgrade playbook ``ceph-galaxy-removal.yml`` has been added to clean up the stale galaxy-named roles.
id: Peran umum yang dimungkinkan tidak lagi diberi nama dengan galaxy-style '.' (misal ``ceph.ceph-common`` sekarang dikloning sebagai ``ceph-common``), karena perubahan dalam cara ketergantungan meta hulu ditangani dalam peran ceph. Peran tersebut akan dikloning sesuai dengan penamaan yang baru, dan playbook pemutakhiran ``ceph-galaxy-removal.yml`` telah ditambahkan untuk membersihkan peran yang dinamai galaksi basi (stale galaxy-named role).

source: The ceph-ansible integration has been updated to support the ceph-ansible v3.0 series tags. The new v3.0 series brings a significant refactoring of the ceph-ansible roles and vars, so it is strongly recommended to consult the upstream `ceph-ansible documentation <http://docs.ceph.com/ceph-ansible/master/>`_ to perform any required vars migrations before you upgrade.
id: Integrasi ceph-ansible telah diperbarui untuk mendukung tag seri ceph-ansible v3.0. Seri v3.0 baru membawa refactoring yang signifikan dari peran dan var ceph-ansible, sehingga sangat disarankan untuk berkonsultasi dengan bagian hulu `ceph-ansible documentation <http://docs.ceph.com/ceph-ansible/master/>`_ untuk melakukan migrasi vars yang diperlukan sebelum Anda memutakhirkan.

source: The ceph_client role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``ceph_client_package_state`` should be set to ``present``.
id: Peran ceph_client selalu memeriksa apakah paket terbaru diinstal ketika dieksekusi. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``ceph_client_package_state`` harus diatur ke ``present``.

source: The ceph_client role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``ceph_client_package_state`` to ``present``.
id: Peran ceph_client sekarang mendukung kemampuan untuk mengkonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``ceph_client_package_state`` ke ``present``.

source: The ceph_client role will now look for and configure manila services to work with ceph and cephfs.
id: Peran ceph_client sekarang akan mencari dan mengkonfigurasi layanan manila untuk bekerja dengan ceph dan cephfs.

source: The check to validate whether an appropriate ssh public key is available to copy into the container cache has been corrected to check the deployment host, not the LXC host.
id: Pemeriksaan untuk memvalidasi apakah kunci publik ssh yang sesuai tersedia untuk disalin ke dalam cache kontainer telah diperbaiki untuk memeriksa deployment host, bukan host LXC.

source: The cloudkitty dashboard is available in Horizon. Deployers can enable the panel by setting the following Ansible variable:
id: Dasbor cloudkitty tersedia di Horizon. Deployer dapat mengaktifkan panel dengan mengatur variabel Ansible berikut:

source: The compression option in the ``galera_server`` role has been removed due to the fact that it is not recommended by MariaDB anymore. This means that all the dependencies from Percona such as QPress are no longer necessary.
id: Opsi kompresi dalam peran ``galera_server`` telah dihapus karena fakta bahwa itu tidak direkomendasikan oleh MariaDB lagi. Ini berarti bahwa semua dependensi dari Percona seperti QPress tidak lagi diperlukan.

source: The conditional that determines whether the ``sso_callback_template.html`` file is deployed for federated deployments has been fixed.
id: Persyaratan yang menentukan apakah file ``sso_callback_template.html`` dikerahkan untuk penyebaran federasi telah diperbaiki.

source: The config_template action plugin now has a new option to toggle list extension for JSON or YAML formats. The new option is ``list_extend`` and is a boolean. The default is True which maintains the existing API.
id: Plugin action config_template sekarang memiliki opsi baru untuk beralih ekstensi daftar untuk format JSON atau YAML. Opsi baru adalah ``list_extend`` dan merupakan boolean. Defaultnya adalah True yang memelihara API yang ada.

source: The config_template template module now supports writing out valueless INI options without suffixing them with '=' or ':'. This is done via the 'ignore_none_type' attribute. If ignore_none_type is set to true, these key/value entries will be ignored, if it's set to false, then ConfigTemplateParser will write out only the option name without the '=' or ':' suffix. The default is true.
id: Modul template config_template sekarang mendukung penulisan opsi INI yang tidak bernilai tanpa membuatnya suffix dengan '=' atau ':'. Ini dilakukan melalui atribut 'ign_none_type'. Jika ign_none_type disetel ke true, entri key/value ini akan diabaikan, jika disetel ke false, maka ConfigTemplateParser hanya akan menuliskan nama opsi tanpa akhiran '=' atau ':'. Defaultnya true.

source: The container cache preparation process now allows ``copy-on-write`` to be set as the ``lxc_container_backing_method`` when the ``lxc_container_backing_store`` is set to ``lvm``. When this is set a base container will be created using a name of the form `<linux-distribution>`-`distribution-release>`-`<host-cpu-architecture>`. The container will be stopped as it is not used for anything except to be a backing store for all other containers which will be based on a snapshot of the base container.
id: Proses persiapan cache kontainer sekarang memungkinkan ``copy-on-write`` dapat ditetapkan sebagai ``lxc_container_backing_method`` ketika ``lxc_container_backing_store`` diatur ke ``lvm``. Ketika ini diatur kontainer dasar akan dibuat menggunakan nama dari bentuk `<linux-distribution>`-`distribution-release>`-`<host-cpu-architecture>`. Kontainer akan dihentikan karena tidak digunakan untuk apa pun kecuali menjadi backing store untuk semua kontainer lain yang akan didasarkan pada snapshot dari kontainer dasar (base container).

source: The container cache preparation process now allows ``overlayfs`` to be set as the ``lxc_container_backing_store``. When this is set a base container will be created using a name of the form `<linux-distribution>`-`distribution-release>`-`<host-cpu-architecture>`. The container will be stopped as it is not used for anything except to be a backing store for all other containers which will be based on a snapshot of the base container. The ``overlayfs`` backing store is not recommended to be used for production unless the host kernel version is 3.18 or higher.
id: Proses persiapan cache kontainer sekarang memungkinkan ``overlayfs`` untuk ditetapkan sebagai ``lxc_container_backing_store``. Ketika ini diatur kontainer dasar akan dibuat menggunakan nama dari bentuk `<linux-distribution>`-`distribution-release>`-`<host-cpu-architecture>`. Kontainer akan dihentikan karena tidak digunakan untuk apa pun kecuali menjadi backing store untuk semua kontainer lain yang akan didasarkan pada snapshot dari kontainer dasar. Backing store ``overlayfs`` tidak disarankan untuk digunakan untuk produksi kecuali versi host kernel 3.18 atau lebih tinggi.

source: The container creation process now allows ``copy-on-write`` to be set as the ``lxc_container_backing_method`` when the ``lxc_container_backing_store`` is set to ``lvm``. When this is set it will use a snapshot of the base container to build the containers.
id: Proses pembuatan kontainer sekarang memungkinkan ``copy-on-write`` untuk ditetapkan sebagai ``lxc_container_backing_method`` ketika ``lxc_container_backing_store`` diatur ke ``lvm``. Saat ini diatur, ia akan menggunakan snapshot dari kontainer dasar untuk membangun kontainer.

source: The container creation process now allows ``overlayfs`` to be set as the ``lxc_container_backing_store``. When this is set it will use a snapshot of the base container to build the containers. The ``overlayfs`` backing store is not recommended to be used for production unless the host kernel version is 3.18 or higher.
id: Proses pembuatan kontainer sekarang memungkinkan ``overlayfs`` untuk ditetapkan sebagai ``lxc_container_backing_store``. Saat ini diatur, ia akan menggunakan snapshot dari kontainer dasar untuk membangun kontainer. Backing store ``overlayfs`` tidak disarankan untuk digunakan untuk produksi kecuali versi host kernel 3.18 atau lebih tinggi.

source: The container image cache within machinectl has been set to "64G" by default.
id: Container image cache di dalam machinectl telah diatur ke "64G" secara default.

source: The container property ``container_release`` has been removed as this is automatically set to the same version as the host in the container creation process.
id: Properti kontainer ``container_release`` telah dihapus karena ini secara otomatis disetel ke versi yang sama dengan host dalam proses pembuatan kontainer.

source: The copy of the ``/etc/openstack-release`` file is now optional. To disable the copy of the file, set ``openstack_distrib_file`` to ``no``.
id: Salinan file ``/etc/openstack-release`` sekarang opsional. Untuk menonaktifkan salinan file, atur ``openstack_distrib_file`` ke ``no``.

source: The data structure for ``ceph_gpg_keys`` has been changed to be a list of dicts, each of which is passed directly to the applicable apt_key/rpm_key module. As such any overrides would need to be reviewed to ensure that they do not pass any key/value pairs which would cause the module to fail.
id: Struktur data untuk ``ceph_gpg_keys`` telah diubah menjadi daftar dicts, yang masing-masing diteruskan langsung ke modul apt_key/rpm_key yang berlaku. Karenanya, setiap pengesampingan akan perlu ditinjau untuk memastikan bahwa mereka tidak melewatkan pasangan key/value yang akan menyebabkan modul gagal.

source: The data structure for ``galera_client_gpg_keys`` has been changed to be a dict passed directly to the applicable apt_key/rpm_key module. As such any overrides would need to be reviewed to ensure that they do not pass any key/value pairs which would cause the module to fail.
id: Struktur data untuk ``galera_client_gpg_keys`` telah diubah menjadi dict yang diteruskan langsung ke modul apt_key/rpm_key yang berlaku. Karenanya, setiap pengesampingan akan perlu ditinjau untuk memastikan bahwa mereka tidak melewatkan pasangan key/value yang akan menyebabkan modul gagal.

source: The data structure for ``galera_gpg_keys`` has been changed to be a dict passed directly to the applicable apt_key/rpm_key module. As such any overrides would need to be reviewed to ensure that they do not pass any key/value pairs which would cause the module to fail.
id: Struktur data untuk ``galera_gpg_keys`` telah diubah menjadi dict yang diteruskan langsung ke modul apt_key/rpm_key yang berlaku. Karenanya, setiap pengesampingan akan perlu ditinjau untuk memastikan bahwa mereka tidak melewatkan pasangan key/value yang akan menyebabkan modul gagal.

source: The data structure for ``rabbitmq_gpg_keys`` has been changed to be a dict passed directly to the applicable apt_key/rpm_key module. As such any overrides would need to be reviewed to ensure that they do not pass any key/value pairs which would cause the module to fail.
id: Struktur data untuk ``rabbitmq_gpg_keys`` telah diubah menjadi dict yang diteruskan langsung ke modul apt_key/rpm_key yang berlaku. Karenanya, setiap pengesampingan akan perlu ditinjau untuk memastikan bahwa mereka tidak melewatkan pasangan key/value yang akan menyebabkan modul gagal.

source: The database and user creates have been removed from the ``os_horizon`` role. These tasks have been relocated to the playbooks.
id: Database dan pembuatan user telah dihapus dari peran ``os_horizon``. Tugas ini telah dipindahkan ke playbook.

source: The database create and user creates have been removed from the ``os_cinder`` role. These tasks have been relocated to the playbooks.
id: Pembuatan database dan pembuatan user telah dihapus dari peran ``os_cinder``. Tugas ini telah dipindahkan ke playbook.

source: The database create and user creates have been removed from the ``os_glance`` role. These tasks have been relocated to the playbooks.
id: Pembuatan database dan pembuatan user telah dihapus dari peran ``os_glance``. Tugas ini telah dipindahkan ke playbook.

source: The database create and user creates have been removed from the ``os_heat`` role. These tasks have been relocated to the playbooks.
id: Pembuatan database dan pembuatan user telah dihapus dari peran ``os_heat``. Tugas ini telah dipindahkan ke playbook.

source: The database create and user creates have been removed from the ``os_neutron`` role. These tasks have been relocated to the playbooks.
id: Pembuatan database dan pembuatan user telah dihapus dari peran ``os_neutron``. Tugas ini telah dipindahkan ke playbook.

source: The database create and user creates have been removed from the ``os_nova`` role. These tasks have been relocated to the playbooks.
id: Pembuatan database dan pembuatan user dihapus dari peran ``os_nova``. Tugas ini telah dipindahkan ke playbook.

source: The default Mnesia ``dump_log_write_threshold`` value has changed to ``300`` instead of ``100`` for efficiency. ``dump_log_write_threshold`` specifies the maximum number of writes allowed to the transaction log before a new dump of the log is performed. Increasing this value can increase the performances during the queues/exchanges/bindings creation/destroying. The values should be between 100 and 1000. More detail [1].
id: Nilai Mnesia ``dump_log_write_threshold`` default telah berubah menjadi ``300`` daripada ``100`` untuk efisiensi. ``dump_log_write_threshold`` menentukan jumlah maksimum penulisan yang diizinkan untuk log transaksi sebelum dump baru dari log dilakukan. Peningkatan nilai ini dapat meningkatkan kinerja selama antrian/pertukaran/kreasi binding/penghancuran (queues/exchanges/bindings creation/destroying). Nilai harus antara 100 dan 1000. Lebih detail [1].

source: The default TLS verion has been set to TLS1.2. This only allows version 1.2 of the protocol to be used when terminating or creating TLS connections. You can change the value with the keystone_ssl_protocol variable.
id: Verifikasi TLS default telah ditetapkan ke TLS1.2. Ini hanya memungkinkan versi 1.2 protokol untuk digunakan ketika mengakhiri atau membuat koneksi TLS. Anda dapat mengubah nilainya dengan variabel keystone_ssl_protocol.

source: The default TLS version has been set to TLS1.2. This only allows version 1.2 of the protocol to be used when terminating or creating TLS connections. You can change the value with the barbican_ssl_protocol variable.
id: Verifikasi TLS default telah ditetapkan ke TLS1.2. Ini hanya memungkinkan versi 1.2 protokol untuk digunakan ketika mengakhiri atau membuat koneksi TLS. Anda dapat mengubah nilainya dengan variabel barbican_ssl_protocol.

source: The default TLS version has been set to TLS1.2. This only allows version 1.2 of the protocol to be used when terminating or creating TLS connections. You can change the value with the gnocchi_ssl_protocol variable.
id: Verifikasi TLS default telah ditetapkan ke TLS1.2. Ini hanya memungkinkan versi 1.2 protokol untuk digunakan ketika mengakhiri atau membuat koneksi TLS. Anda dapat mengubah nilainya dengan variabel gnocchi_ssl_protocol.

source: The default TLS version has been set to TLS1.2. This only allows version 1.2 of the protocol to be used when terminating or creating TLS connections. You can change the value with the horizon_ssl_protocol variable.
id: Versi TLS default telah diatur ke TLS1.2. Ini hanya memungkinkan versi 1.2 protokol untuk digunakan ketika mengakhiri atau membuat koneksi TLS. Anda bisa mengubah nilainya dengan variabel horizon_ssl_protocol.

source: The default TLS version has been set to TLS1.2. This only allows version 1.2 of the protocol to be used when terminating or creating TLS connections. You can change the value with the ssl_protocol variable.
id: Verifikasi TLS default telah ditetapkan ke TLS1.2. Ini hanya memungkinkan versi 1.2 protokol untuk digunakan ketika mengakhiri atau membuat koneksi TLS. Anda dapat mengubah nilainya dengan variabel ssl_protocol.

source: The default TLS version has been set to TLS1.2. This only allows version 1.2 of the protocol to be used when terminating or creating TLS connections. You can change the value with the trove_ssl_protocol variable.
id: Verifikasi TLS default telah ditetapkan ke TLS1.2. Ini hanya memungkinkan versi 1.2 protokol untuk digunakan ketika mengakhiri atau membuat koneksi TLS. Anda dapat mengubah nilainya dengan variabel trove_ssl_protocol.

source: The default TLS version has been set to force-tlsv12. This only allows version 1.2 of the protocol to be used when terminating or creating TLS connections. You can change the value with the haproxy_ssl_bind_options variable.
id: Verifikasi TLS default telah ditetapkan ke TLS1.2. Ini hanya memungkinkan versi 1.2 protokol untuk digunakan ketika mengakhiri atau membuat koneksi TLS. Anda dapat mengubah nilainya dengan variabel haproxy_ssl_bind_options.

source: The default apt sources configuration is now set to only include the ``main`` and ``universe`` components as those are the only required components for a functional deployment. If deployers wish to include other components then the variable ``lxc_container_template_apt_components`` may be set in ``/etc/openstack_deploy/user_variables.yml`` with the full list of desired components.
id: Konfigurasi sumber apt default sekarang diatur untuk hanya menyertakan komponen ``main`` dan ``universe`` karena itu adalah satu-satunya komponen yang diperlukan untuk penyebaran fungsional. Jika deployer ingin memasukkan komponen lain, maka variabel ``lxc_container_template_apt_components`` dapat diatur dalam ``/etc/openstack_deploy/user_variables.yml`` dengan daftar lengkap komponen yang diinginkan.

source: The default apt sources configuration uses all components. If deployers wish to change this to reduce the components configured then the variable ``lxc_container_template_apt_components`` may be set in ``/etc/openstack_deploy/user_variables.yml`` with the full list of desired components.
id: Konfigurasi sumber apt default menggunakan semua komponen. Jika deployer ingin mengubah ini untuk mengurangi komponen yang dikonfigurasi maka variabel ``lxc_container_template_apt_components`` dapat diatur dalam ``/etc/openstack_deploy/user_variables.yml`` dengan daftar lengkap komponen yang diinginkan.

source: The default behaviour of ``ensure_endpoint`` in the keystone module has changed to update an existing endpoint, if one exists that matches the service name, type, region and interface. This ensures that no duplicate service entries can exist per region.
id: Perilaku default ``ensure_endpoint`` dalam modul keystone telah berubah untuk memperbarui endpoint yang ada, jika ada yang cocok dengan nama layanan, jenis, wilayah, dan antarmuka. Ini memastikan bahwa tidak ada entri layanan duplikat yang dapat ada per wilayah.

source: The default behaviour of rsync, to perform reverse lookups, has been changed to ``False``. This can be set to ``True`` by setting the ``swift_rsync_reverse_lookup`` variable to ``True``.
id: Perilaku default rsync, untuk melakukan pencarian terbalik, telah diubah menjadi ``False``. Ini dapat diatur ke ``True`` dengan mengatur variabel ``swift_rsync_reverse_lookup`` ke ``True``.

source: The default bind address for all openstack services and infrastructure services such as galera, rabbitmq and memcached has changed from 0.0.0.0 to the IP address of the openstack mangement network on the relevent host or container. Deployers should ensure that any additional systems that expect to communicate with internal components of their openstack-ansible deployment do so over the managment network. Services which are bound to the management network IP will not be accessible via other interfaces.
id: Alamat bind default untuk semua layanan openstack dan layanan infrastruktur seperti galera, rabbitmq, dan memcache telah berubah dari 0.0.0.0 menjadi alamat IP jaringan pengelolaan openstack pada host atau container yang relevan. Deployer harus memastikan bahwa sistem tambahan apa pun yang berharap untuk berkomunikasi dengan komponen internal dari penerapan openstack-ansible mereka melakukannya melalui jaringan manajemen. Layanan yang terikat ke IP jaringan manajemen tidak akan dapat diakses melalui interfaces lain.

source: The default container apt sources have been changed from using ``http://mirror.rackspace.com/ubuntu`` to ``http://archive.ubuntu.com/ubuntu/`` for packages and ``http://security.ubuntu.com/ubuntu`` for security packages. This is to resolve issues with unavailable packages during the install process due to incomplete mirror updates.
id: Sumber apt container default telah diubah dari menggunakan ``http://mirror.rackspace.com/ubuntu`` menjadi ``http://archive.ubuntu.com/ubuntu/`` untuk paket dan ``http://security.ubuntu.com/ubuntu`` untuk paket keamanan. Ini untuk menyelesaikan masalah dengan paket yang tidak tersedia selama proses instalasi karena pembaruan mirror tidak lengkap.

source: The default container apt sources have been changed from using ``https://mirror.rackspace.com/ubuntu`` to ``http://archive.ubuntu.com/ubuntu`` for packages and ``http://security.ubuntu.com/ubuntu`` for security packages. This is to resolve issues with unavailable packages during the install process due to incomplete mirror updates.
id: Sumber apt kontainer default telah diubah dari menggunakan ``https://mirror.rackspace.com/ubuntu`` menjadi ``http://archive.ubuntu.com/ubuntu`` untuk paket dan ``http://security.ubuntu.com/ubuntu`` untuk paket keamanan. Ini untuk menyelesaikan masalah dengan paket yang tidak tersedia selama proses instalasi karena pembaruan mirror tidak lengkap.

source: The default database collation has changed from `utf8_unicode_ci` to `utf8_general_ci`. Existing databases and tables will need to be converted.
id: Susunan database default telah berubah dari `utf8_unicode_ci` menjadi `utf8_general_ci`. Database dan tabel yang ada perlu dikonversi.
