Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: In OSA deployments prior to Queens, if ``repo_git_cache_dir`` was set to a folder which existed on a repo container host then that folder would be symlinked to the repo container bind mount instead of synchronising its contents to the repo container. This functionality is deprecated in Queens and will be removed in Rocky. The ability to make use of the git cache still exists, but the folder contents will be synchronised from the deploy host to the repo container. If you have made use of the symlink functionality previously, please move the contents to a standard folder and remove the symlink.
id: Dalam deployment OSA sebelum Queens, jika ``repo_git_cache_dir`` disetel ke folder yang ada pada repo container host maka folder itu akan disinkronkan ke repo container bind mount daripada menyinkronkan isinya ke repo container. Fungsi ini sudah usang di Queens dan akan dihapus di Rocky. Kemampuan untuk menggunakan cache git masih ada, tetapi konten folder akan disinkronkan dari host penyebaran ke repo container. Jika Anda telah menggunakan fungsionalitas symlink sebelumnya, silakan pindahkan konten ke folder standar dan hapus symlink.

source: In Stein, Cinder stopped supporting configuring backup drivers without the full class path. This means that you must now use the following values for ``cinder_service_backup_driver``.
id: Di Stein, Cinder berhenti mendukung konfigurasi driver cadangan tanpa full class path. Ini berarti bahwa Anda sekarang harus menggunakan nilai berikut untuk ``cinder_service_backup_driver``.

source: In Ubuntu the ``dnsmasq`` package actually includes init scripts and service configuration which conflict with LXC and are best not included. The actual dependent package is ``dnsmasq-base``. The package list has been adjusted and a task added to remove the ``dnsmasq`` package and purge the related configuration files from all LXC hosts.
id: Di Ubuntu paket ``dnsmasq`` sebenarnya termasuk skrip init dan konfigurasi layanan yang bertentangan dengan LXC dan yang terbaik tidak termasuk. Paket dependen aktual adalah ``dnsmasq-base``. Daftar paket telah disesuaikan dan tugas ditambahkan untuk menghapus paket ``dnsmasq`` dan membersihkan file konfigurasi terkait dari semua host LXC.

source: In addition, this should speed up playbook runs since ``yum`` can check a locally-hosted repository instead of a remote repository with availability and performance challenges.
id: Selain itu, ini harus mempercepat playbook berjalan karena ``yum`` dapat memeriksa repositori yang di-host secara lokal daripada repositori jarak jauh dengan ketersediaan dan tantangan kinerja.

source: In https://review.openstack.org/582633 an adjustment was made to the ``openstack-ansible`` wrapper which mistakenly changed the intended behaviour. The wrapper is only meant to include the extra-vars and invoke the inventory if ``ansible-playbook`` was executed from inside the ``openstack-ansible`` repository clone (typically ``/opt/openstack-ansible``), but the change made the path irrelevant. This has now been fixed - ``ansible-playbook`` and ``ansible`` will only invoke the inventory and include extra vars if it is invoked from inside the git clone path.
id: Di https://review.openstack.org/582633 penyesuaian dibuat ke wrapper ``openstack-ansible`` yang secara keliru mengubah perilaku yang dimaksud. Wrapper hanya dimaksudkan untuk memasukkan extra-vars dan memanggil inventaris jika ``ansible-playbook`` dijalankan dari dalam klon repositori ``openstack-ansible`` (biasanya ``/opt/openstack-ansible``)) , tetapi perubahan itu membuat jalan itu tidak relevan. Ini sekarang telah diperbaiki - ``ansible-playbook`` dan ``ansible`` hanya akan memanggil inventaris dan memasukkan vars tambahan jika itu dipanggil dari dalam git clone path.

source: In order to ensure that the appropriate data is delivered to requesters from the repo servers, the slave repo_server web servers are taken offline during the synchronisation process. This ensures that the right data is always delivered to the requesters through the load balancer.
id: Untuk memastikan bahwa data yang sesuai dikirimkan kepada pemohon dari server repo, server web repo_server slave diambil offline selama proses sinkronisasi. Ini memastikan bahwa data yang tepat selalu dikirimkan ke pemohon melalui load balancer.

source: In order to make use of the latest stable keepalived version, the variable ``keepalived_use_latest_stable`` must be set to ``True``
id: Untuk menggunakan versi stabil keepalived terbaru, variabel ``keepalived_use_latest_stable`` harus disetel ke ``True``

source: In order to prevent further issues with a libvirt and python-libvirt version mismatch, KVM-based compute nodes will now use the distribution package python library for libvirt. This should resolve the issue seen with pike builds on CentOS 7.5.
id: Untuk mencegah masalah lebih lanjut dengan ketidakcocokan libvirt dan versi python-libvirt, node komputasi berbasis KVM sekarang akan menggunakan paket distribusi python library untuk libvirt. Ini harus menyelesaikan masalah yang terlihat dengan pike build di CentOS 7.5.

source: In order to reduce the time taken for fact gathering, the default subset gathered has been reduced to a smaller set than the Ansible default. This may be changed by the deployer by setting the ``ANSIBLE_GATHER_SUBSET`` variable in the bash environment prior to executing any ansible commands.
id: Untuk mengurangi waktu yang dibutuhkan untuk pengumpulan fakta, subset default yang dikumpulkan telah dikurangi menjadi set yang lebih kecil dari default Ansible. Ini dapat diubah oleh deployer dengan mengatur variabel ``ANSIBLE_GATHER_SUBSET`` di lingkungan bash sebelum menjalankan perintah ansible.

source: In previous releases connections to Horizon originally terminated SSL at the Horizon container. While that is still an option, SSL is now assumed to be terminated at the load balancer. If you wish to terminate SSL at the horizon node change the ``horizon_external_ssl`` option to **false**.
id: Dalam rilis sebelumnya koneksi ke Horizon awalnya dihentikan SSL di kontainer Horizon. Sementara itu masih merupakan opsi, SSL sekarang diasumsikan dihentikan di load balancer. Jika Anda ingin mengakhiri SSL di node horizon, ubah opsi ``horizon_external_ssl`` menjadi **false **.

source: In the Ocata release, Trove added support for encrypting the rpc communication between the guest DBaaS instances and the control plane. The default values for ``trove_taskmanager_rpc_encr_key`` and ``trove_inst_rpc_key_encr_key`` should be overridden to specify installation specific values.
id: Dalam rilis Ocata, Trove menambahkan dukungan untuk mengenkripsi komunikasi rpc antara instance DBaaS guest dan control plane. Nilai default untuk ``trove_taskmanager_rpc_encr_key`` dan ``trove_inst_rpc_key_encr_key`` harus diganti untuk menentukan nilai spesifik instalasi.

source: In the ``ceph_client`` role, the only valid values for ``ceph_pkg_source`` are now ``ceph`` and ``distro``. For Ubuntu, the Ubuntu Cloud Archive apt source is already setup by the ``openstack_hosts`` role, so there is no need for it to also be setup by the ``ceph_client`` role.
id: Dalam peran ``ceph_client``, satu-satunya nilai yang valid untuk ``ceph_pkg_source`` sekarang menjadi ``ceph`` dan ``distro``. Untuk Ubuntu, sumber apt Ubuntu Cloud Archive sudah diatur oleh peran ``openstack_hosts``, jadi tidak perlu untuk itu juga diatur oleh peran ``ceph_client``.

source: In the ``lxc_hosts`` role execution, we make use of the images produced on a daily basis by images.linuxcontainers.org. Recent changes in the way those images are produced have resulted in changes to the default ``/etc/resolve.conf`` in that default image. As such, when executing the cache preparation it fails. For all newton queens releases the workaround to get past the error is to add the following to the ``/etc/openstack_deploy/user_variables.yml`` file.
id: Dalam eksekusi peran ``lxc_hosts``, kami menggunakan image yang dihasilkan setiap hari oleh images.linuxcontainers.org. Perubahan terbaru dalam cara image itu dihasilkan telah mengakibatkan perubahan ke default ``/etc/resolve.conf`` di image default itu. Karena itu, ketika menjalankan persiapan cache gagal. Untuk semua newton queen melepaskan solusinya untuk melewati kesalahan adalah dengan menambahkan berikut ke file ``/etc/openstack_deploy/user_variables.yml``.

source: In the ``lxc_hosts`` role execution, we make use of the images produced on a daily basis by images.linuxcontainers.org. Recent changes in the way those images are produced have resulted in changes to the default ``/etc/resolve.conf`` in that default image. As such, when executing the cache preparation it fails. For ocata releases prior to 15.1.21 the workaround to get past the error is to add the following to the ``/etc/openstack_deploy/user_variables.yml`` file.
id: Dalam eksekusi peran ``lxc_hosts``, kami menggunakan image yang dihasilkan setiap hari oleh images.linuxcontainers.org. Perubahan terbaru dalam cara image itu dihasilkan telah mengakibatkan perubahan ke default ``/etc/resolve.conf`` di image default itu. Karena itu, ketika menjalankan persiapan cache gagal. Untuk rilis ocata sebelum 15.1.21 solusi untuk melewati kesalahan adalah dengan menambahkan yang berikut ke file ``/etc/openstack_deploy/user_variables.yml``.

source: In the ``lxc_hosts`` role execution, we make use of the images produced on a daily basis by images.linuxcontainers.org. Recent changes in the way those images are produced have resulted in changes to the default ``/etc/resolve.conf`` in that default image. As such, when executing the cache preparation it fails. For pike releases prior to 16.0.13 the workaround to get past the error is to add the following to the ``/etc/openstack_deploy/user_variables.yml`` file.
id: Dalam eksekusi peran ``lxc_hosts``, kami menggunakan image yang dihasilkan setiap hari oleh images.linuxcontainers.org. Perubahan terbaru dalam cara image itu dihasilkan telah mengakibatkan perubahan ke default ``/etc/resolve.conf`` di image default itu. Karena itu, ketika menjalankan persiapan cache gagal. Untuk rilis pike sebelum 16.0.13 solusi untuk melewati kesalahan adalah dengan menambahkan yang berikut ke file ``/etc/openstack_deploy/user_variables.yml``.

source: In the ``lxc_hosts`` role execution, we make use of the images produced on a daily basis by images.linuxcontainers.org. Recent changes in the way those images are produced have resulted in changes to the default ``/etc/resolve.conf`` in that default image. As such, when executing the cache preparation it fails. For queens releases prior to 17.0.4 the workaround to get past the error is to add the following to the ``/etc/openstack_deploy/user_variables.yml`` file.
id: Dalam eksekusi peran ``lxc_hosts``, kami menggunakan image yang dihasilkan setiap hari oleh images.linuxcontainers.org. Perubahan terbaru dalam cara image itu dihasilkan telah mengakibatkan perubahan ke default ``/etc/resolve.conf`` di image default itu. Karena itu, ketika menjalankan persiapan cache gagal. Untuk rilis ratu sebelum 17.0.4 solusi untuk melewati kesalahan adalah dengan menambahkan berikut ke file ``/etc/openstack_deploy/user_variables.yml``.

source: In the ``rsyslog_client`` role, the variable ``rsyslog_client_repos`` has been removed as it is no longer used.
id: Dalam peran ``rsyslog_client``, variabel ``rsyslog_client_repos`` telah dihapus karena tidak lagi digunakan.

source: In the latest stable version of keepalived there is a problem with the priority calculation when a deployer has more than five keepalived nodes. The problem causes the whole keepalived cluster to fail to work. To work around this issue it is recommended that deployers limit the number of keepalived nodes to no more than five or that the priority for each node is set as part of the configuration (cf. ``haproxy_keepalived_vars_file`` variable).
id: Di versi stabil terbaru dari keepalived ada masalah dengan perhitungan prioritas ketika seorang deployer memiliki lebih dari lima node keepalived. Masalahnya menyebabkan seluruh cluster yang disimpan tetap gagal bekerja. Untuk mengatasi masalah ini, disarankan bahwa deployer membatasi jumlah node yang disimpan tidak lebih dari lima atau bahwa prioritas untuk setiap node ditetapkan sebagai bagian dari konfigurasi (cf. ``haproxy_keepalived_vars_file`` variable).

source: In the lxc_container_create role, the keys ``preup``, ``postup``, ``predown``, and ``postdown`` are now supported in the ``container_networks`` dict for Ubuntu systems. This allows operators to configure custom scripts to be run by Ubuntu's ifupdown system when network interface states are changed.
id: Dalam peran lxc_container_create, tombol ``preup``, ``postup``, ``predown``, dan ``postdown`` sekarang didukung dalam ``container_networks`` dict untuk sistem Ubuntu. Ini memungkinkan operator untuk mengkonfigurasi skrip khusus untuk dijalankan oleh sistem ifupdown Ubuntu ketika status antarmuka jaringan diubah.

source: Installation of Ansible on the root system, outside of a virtual environment, will no longer be supported.
id: Instalasi Ansible di sistem root, di luar lingkungan virtual, tidak akan lagi didukung.

source: Installation of aodh and its dependent pip packages will now only occur within a Python virtual environment. The ``aodh_venv_enabled`` and ``aodh_venv_bin`` variables have been removed.
id: Instalasi aodh dan paket pip dependennya sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``aodh_venv_enabled`` dan ``aodh_venv_bin`` telah dihapus.

source: Installation of ceilometer and its dependent pip packages will now only occur within a Python virtual environment. The ``ceilometer_venv_enabled`` and ``ceilometer_venv_bin`` variables have been removed.
id: Instalasi ceilometer dan paket pip yang tergantung sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``ceilometer_venv_enabled`` dan ``ceilometer_venv_bin`` telah dihapus.

source: Installation of cinder and its dependent pip packages will now only occur within a Python virtual environment. The ``cinder_venv_enabled`` and ``cinder_venv_bin`` variables have been removed.
id: Instalasi cinder dan paket pip yang tergantung sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``cinder_venv_enabled`` dan ``cinder_venv_bin`` telah dihapus.

source: Installation of cloudkitty and its dependent pip packages will now only occur within a Python virtual environment. The ``cloudkitty_venv_bin`` and ``cloudkitty_venv_enabled`` variables have been removed.
id: Instalasi cloudkitty dan paket-paket pip yang tergantung sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``cloudkitty_venv_bin`` dan ``cloudkitty_venv_enabled`` telah dihapus.

source: Installation of designate and its dependent pip packages will now only occur within a Python virtual environment. The ``designate_venv_enabled``, ``designate_venv_bin``, ``designate_venv_etc_dir`` and ``designate_non_venv_etc_dir`` variables have been removed.
id: Instalasi yang ditunjuk dan paket pip yang tergantung sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``designate_venv_enabled``, ``designate_venv_bin``, ``designate_venv_etc_dir`` dan ``designate_non_venv_etc_dir`` telah dihapus.

source: Installation of glance and its dependent pip packages will now only occur within a Python virtual environment. The ``glance_venv_bin``, ``glance_venv_enabled``, ``glance_venv_etc_dir``, and ``glance_non_venv_etc_dir`` variables have been removed.
id: Instalasi sekilas dan paket pip dependennya sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``glance_venv_bin``, ``glance_venv_enabled``, ``glance_venv_etc_dir``, dan ``glance_non_venv_etc_dir`` telah dihapus.

source: Installation of glance and its dependent pip packages will now only occur within a Python virtual environment. The ``gnocchi_venv_bin``, ``gnocchi_venv_enabled``, ``gnocchi_venv_etc_dir``, and ``gnocchi_non_venv_etc_dir`` variables have been removed.
id: Instalasi glance dan paket pip dependennya sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``gnocchi_venv_bin``, ``gnocchi_venv_enabled``, ``gnocchi_venv_etc_dir``, dan ``gnocchi_non_venv_etc_dir`` telah dihapus.

source: Installation of heat and its dependent pip packages will now only occur within a Python virtual environment. The ``heat_venv_bin`` and ``heat_venv_enabled`` variables have been removed.
id: Instalasi heat dan paket pip yang tergantung sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``heat_venv_bin`` dan ``heat_venv_enabled`` telah dihapus.

source: Installation of horizon and its dependent pip packages will now only occur within a Python virtual environment. The ``horizon_venv_bin``, ``horizon_venv_enabled``, ``horizon_venv_lib_dir``, and ``horizon_non_venv_lib_dir`` variables have been removed.
id: Instalasi horizon dan paket pip dependennya sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``horizon_venv_bin``, ``horizon_venv_enabled``, ``horizon_venv_lib_dir``, dan ``horizon_non_venv_lib_dir`` telah dihapus.

source: Installation of ironic and its dependent pip packages will now only occur within a Python virtual environment. The ``ironic_venv_bin`` and ``ironic_venv_enabled`` variables have been removed.
id: Instalasi ironic dan paket pip dependennya sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``ironic_venv_bin`` dan ``ironic_venv_enabled`` telah dihapus.

source: Installation of keystone and its dependent pip packages will now only occur within a Python virtual environment. The ``keystone_venv_enabled`` variable has been removed.
id: Instalasi keystone dan paket pip dependennya sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``keystone_venv_enabled`` telah dihapus.

source: Installation of magnum and its dependent pip packages will now only occur within a Python virtual environment. The ``magnum_venv_bin``, ``magnum_venv_enabled`` variables have been removed.
id: Instalasi magnum dan paket pip dependennya sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``magnum_venv_bin``, ``magnum_venv_enabled`` telah dihapus.

source: Installation of neutron and its dependent pip packages will now only occur within a Python virtual environment. The ``neutron_venv_enabled``, ``neutron_venv_bin``, ``neutron_non_venv_lib_dir`` and ``neutron_venv_lib_dir`` variables have been removed.
id: Instalasi neutron dan paket pip dependennya sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``neutron_venv_enabled``, ``neutron_venv_bin``, ``neutron_non_venv_lib_dir`` dan ``neutron_venv_lib_dir`` telah dihapus.

source: Installation of nova and its dependent pip packages will now only occur within a Python virtual environment. The ``nova_venv_enabled``, ``nova_venv_bin`` variables have been removed.
id: Instalasi nova dan paket pip dependennya sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``nova_venv_enabled``, ``nova_venv_bin`` telah dihapus.

source: Installation of rally and its dependent pip packages will now only occur within a Python virtual environment. The ``rally_venv_bin``, ``rally_venv_enabled`` variables have been removed.
id: Instalasi rally dan paket pip dependennya sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``rally_venv_bin``, ``rally_venv_enabled`` telah dihapus.

source: Installation of sahara and its dependent pip packages will now only occur within a Python virtual environment. The ``sahara_venv_bin``, ``sahara_venv_enabled``, ``sahara_venv_etc_dir``, and ``sahara_non_venv_etc_dir`` variables have been removed.
id: Instalasi sahara dan paket pip ketergantungannya sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``sahara_venv_bin``, ``sahara_venv_enabled``, ``sahara_venv_etc_dir``, dan variabel ``sahara_non_venv_etc_dir`` telah dihapus.

source: Installation of swift and its dependent pip packages will now only occur within a Python virtual environment. The ``swift_venv_enabled``, ``swift_venv_bin`` variables have been removed.
id: Instalasi swift dan paket pip dependennya sekarang hanya akan terjadi dalam lingkungan virtual Python. Variabel ``swift_venv_enabled``, ``swift_venv_bin`` telah dihapus.

source: Instead of downloading images to the magnum API servers, the images will now download to the ``magnum_service_setup_host`` to the folder set in ``magnum_image_path`` owned by ``magnum_image_path_owner``.
id: Sebagai ganti mengunduh image ke server API magnum, image sekarang akan mengunduh ke ``magnum_service_setup_host`` ke folder yang diatur dalam ``magnum_image_path`` yang dimiliki oleh ``magnum_image_path_owner``.

source: Introduced option to deploy Keystone behind Nginx. A new variable ``keystone_apache_enabled`` is introduced to toggle this behavior. The default is ``true`` which continues to deploy with Apache. Additional configuration can be delivered to Nginx through the use of the ``keystone_nginx_extra_conf`` list variable. Federation features are not supported with this configuration at this time. Use of this option requires ``keystone_mod_wsgi_enabled`` to be set to ``false`` which will deploy Keystone under Uwsgi.
id: Opsi yang diperkenalkan untuk menggunakan Keystone di belakang Nginx. Variabel baru ``keystone_apache_enabled`` diperkenalkan untuk mengganti perilaku ini. Standarnya adalah ``true`` yang terus digunakan dengan Apache. Konfigurasi tambahan dapat dikirim ke Nginx melalui penggunaan variabel daftar ``keystone_nginx_extra_conf``. Fitur Federasi tidak didukung dengan konfigurasi ini saat ini. Penggunaan opsi ini memerlukan ``keystone_mod_wsgi_enabled`` untuk diatur ke ``false`` yang akan menggunakan Keystone di bawah Uwsgi.

source: Introduced option to deploy Keystone under Uwsgi. A new variable ``keystone_mod_wsgi_enabled`` is introduced to toggle this behavior. The default is ``true`` which continues to deploy with mod_wsgi for Apache. The ports used by Uwsgi for socket and http connection for both public and admin Keystone services are configurable (see also the ``keystone_uwsgi_ports`` dictionary variable). Other Uwsgi configuration can be overridden by using the ``keystone_uwsgi_ini_overrides`` variable as documented under "Overriding OpenStack configuration defaults" in the OpenStack-Ansible Install Guide. Federation features should be considered _experimental_ with this configuration at this time.
id: Opsi yang diperkenalkan untuk menggunakan Keystone di bawah Uwsgi. Variabel baru ``keystone_mod_wsgi_enabled`` diperkenalkan untuk mengganti perilaku ini. Standarnya adalah ``true`` yang terus digunakan dengan mod_wsgi untuk Apache. Port yang digunakan oleh Uwsgi untuk koneksi soket dan http untuk layanan publik dan admin Keystone dapat dikonfigurasi (lihat juga variabel kamus ``keystone_uwsgi_ports``). Konfigurasi Uwsgi lain dapat diganti dengan menggunakan variabel ``keystone_uwsgi_ini_overrides`` seperti yang didokumentasikan dalam "Overriding OpenStack configuration defaults" di OpenStack-Ansible Install Guide. Fitur federasi harus dianggap _eksperimental_ dengan konfigurasi ini saat ini.
