Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - sahara_oslomsg_rpc_servers replaces sahara_rabbitmq_servers - sahara_oslomsg_rpc_port replaces sahara_rabbitmq_port - sahara_oslomsg_rpc_use_ssl replaces sahara_rabbitmq_use_ssl - sahara_oslomsg_rpc_userid replaces sahara_rabbitmq_userid - sahara_oslomsg_rpc_vhost replaces sahara_rabbitmq_vhost - sahara_oslomsg_notify_servers replaces sahara_rabbitmq_telemetry_servers - sahara_oslomsg_notify_port replaces sahara_rabbitmq_telemetry_port - sahara_oslomsg_notify_use_ssl replaces sahara_rabbitmq_telemetry_use_ssl - sahara_oslomsg_notify_userid replaces sahara_rabbitmq_telemetry_userid - sahara_oslomsg_notify_vhost replaces sahara_rabbitmq_telemetry_vhost
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - sahara_oslomsg_rpc_servers menggantikan sahara_rabbitmq_servers - sahara_oslomsg_rpc_port menggantikan sahara_rabbitmq_port - sahara_oslomsg_rpc_use_ssl menggantikan sahara_rabbitmq_use_ssl - sahara_oslomsg_rpc_userid menggantikan sahara_rabbitmq_userid - sahara_oslomsg_rpc_vhost menggantikan sahara_rabbitmq_vhost - sahara_oslomsg_notify_servers menggantikan sahara_rabbitmq_telemetry_servers - sahara_oslomsg_notify_port menggantikan sahara_rabbitmq_telemetry_port - sahara_oslomsg_notify_use_ssl menggantikan sahara_rabbitmq_telemetry_use_ssl - sahara_oslomsg_notify_userid menggantikan sahara_rabbitmq_telemetry_userid - sahara_oslomsg_notify_vhost menggantikan sahara_rabbitmq_telemetry_vhost

source: The rabbitmq server parameters have been replaced by corresponding oslo.messaging RPC and Notify parameters in order to abstract the messaging service from the actual backend server deployment. - trove_oslomsg_rpc_servers replaces trove_rabbitmq_servers - trove_oslomsg_rpc_port replaces trove_rabbitmq_port - trove_oslomsg_rpc_use_ssl replaces trove_rabbitmq_use_ssl - trove_oslomsg_rpc_userid replaces trove_rabbitmq_userid - trove_oslomsg_rpc_vhost replaces trove_rabbitmq_vhost - added trove_oslomsg_notify_servers - added trove_oslomsg_notify_port - added trove_oslomsg_notify_use_ssl - added trove_oslomsg_notify_userid - added trove_oslomsg_notify_vhost - added trove_oslomsg_notify_password
id: Parameter server rabbitmq telah digantikan oleh parameter oslo.messaging RPC dan Notify untuk abstrak layanan pesan dari deployment server backend yang sebenarnya. - trove_oslomsg_rpc_servers menggantikan trove_rabbitmq_servers - trove_oslomsg_rpc_port menggantikan trove_rabbitmq_port - trove_oslomsg_rpc_use_ssl menggantikan trove_rabbitmq_use_ssl - trove_oslomsg_rpc_userid menggantikan trove_rabbitmq_userid - trove_oslomsg_rpc_vhost menggantikan trove_rabbitmq_vhost - menambahkan trove_oslomsg_notify_servers - menambahkan trove_oslomsg_notify_port - menambahkan trove_oslomsg_notify_use_ssl - menambahkan trove_oslomsg_notify_userid - menambahkan trove_oslomsg_notify_vhost - menambahkan trove_oslomsg_notify_password

source: The rabbitmq_server role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``rabbitmq_package_state`` should be set to ``present``.
id: Peran rabbitmq_server selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``rabbitmq_package_state`` harus diatur ke ``present``.

source: The rabbitmq_server role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``rabbitmq_package_state`` to ``present``.
id: Peran rabbitmq_server sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``rabbitmq_package_state`` ke ``present``.

source: The repo build process is now able to make use of a pre-staged git cache. If the ``/var/www/repo/openstackgit`` folder on the repo server is found to contain existing git clones then they will be updated if they do not already contain the required SHA for the build.
id: Proses repo build sekarang dapat menggunakan cache git yang sudah diprogram sebelumnya. Jika folder ``/var/www/repo/openstackgit`` pada server repo ditemukan mengandung klon git yang ada maka mereka akan diperbarui jika mereka belum mengandung SHA yang diperlukan untuk build.

source: The repo build process is now able to support building and synchronizing artifacts for multiple CPU architectures. Build artifacts are now tagged with the appropriate CPU architecture by default, and synchronization of build artifacts from secondary, architecture-specific repo servers back to the primary repo server is supported.
id: Proses repo build sekarang dapat mendukung building dan synchronizing artefak untuk beberapa arsitektur CPU. Artefak build sekarang ditandai dengan arsitektur CPU yang sesuai secara default, dan sinkronisasi artefak build dari sekunder, server repo spesifik arsitektur kembali ke server repo primer didukung.

source: The repo build process is now able to synchronize a git cache from the deployment node to the repo server. The git cache path on the deployment node is set using the variable ``repo_build_git_cache``. If the deployment node hosts the repo container, then the folder will be symlinked into the bind mount for the repo container. If the deployment node does not host the repo container, then the contents of the folder will be synchronised into the repo container.
id: Proses repo build sekarang dapat menyinkronkan git cache dari deployment node ke server repo. Path git cache pada node deployment diatur menggunakan variabel ``repo_build_git_cache``. Jika deployment node menjadi host kontainer repo, maka folder akan disinkronkan ke bind mount untuk kontainer repo. Jika deployment node tidak menjadi host kontainer repo, maka isi folder akan disinkronkan ke kontainer repo.

source: The repo build process no longer builds packaged venvs. Instead, the venvs are created on the target hosts as the install process for each service needs to. This opens up the opportunity for roles to be capable of creating multiple venvs, and for any role to create venvs - neither of these options were possible in previous releases.
id: Proses repo build tidak lagi membangun venvs paket. Sebagai gantinya, venvs dibuat pada host target sebagaimana proses instalasi untuk setiap layanan perlu. Ini membuka peluang bagi peran untuk dapat membuat banyak venvs, dan peran apa pun untuk membuat venvs - tidak satu pun dari opsi ini yang dimungkinkan dalam rilis sebelumnya.

source: The repo build process now has the ability to store the pip sources within the build archive. This ability is useful when deploying environments that are "multi-architecture", "multi-distro", or "multi-interpreter" where specific pre-build wheels may not be enough to support all of the deployment. To enable the ability to store the python source code within a given release, set the new option ``repo_build_store_pip_sources`` to ``true``.
id: Proses repo build sekarang memiliki kemampuan untuk menyimpan sumber pip dalam arsip build. Kemampuan ini berguna ketika deploying lingkungan yang "multi-architecture", "multi-distro", atau "multi-interpreter" di mana wheels pre-build spesifik mungkin tidak cukup untuk mendukung semua deployment. Untuk mengaktifkan kemampuan untuk menyimpan kode sumber python dalam rilis yang diberikan, setel opsi baru ``repo_build_store_pip_sources`` ke ``true``.

source: The repo build process now only has the following tags, providing a clear path for each deliverable. The tag ``repo-build-install`` completes the installation of required packages. The tag ``repo-build-wheels`` completes the wheel build process. The tag ``repo-build-venvs`` completes the venv build process. Finally, the tag ``repo-build-index`` completes the manifest preparation and indexing of the os-releases and links folders.
id: Proses repo build sekarang hanya memiliki tag berikut, memberikan path yang jelas untuk setiap pengiriman. Tag ``repo-build-install`` menyelesaikan instalasi paket yang diperlukan. Tag ``repo-build-wheels`` melengkapi proses wheel build. Tag ``repo-build-venvs`` melengkapi proses venv build. Akhirnya, tag ``repo-build-index`` melengkapi persiapan manifest dan pengindeksan folder os-release dan tautan.

source: The repo build process now selectively builds python packages based on whether each OpenStack service group has any hosts in it. If there are no hosts in the group, the list of python packages for the service will not be built. This behaviour can be optionally changed to force all python packages to be built by setting ``repo_build_wheel_selective`` to ``no``.
id: Proses repo build sekarang secara selektif membangun paket python berdasarkan apakah setiap grup layanan OpenStack memiliki host di dalamnya. Jika tidak ada host di grup, daftar paket python untuk layanan tidak akan dibangun. Perilaku ini secara opsional dapat diubah untuk memaksa semua paket python dibangun dengan mengatur ``repo_build_wheel_selective`` ke ``no``.

source: The repo build process now selectively builds venvs based on whether each OpenStack service group has any hosts in it. If there are no hosts in the group, the venv will not be built. This behaviour can be optionally changed to force all venvs to be built by setting ``repo_build_venv_selective`` to ``yes``.
id: Proses repo build sekarang secara selektif membangun venv berdasarkan apakah masing-masing grup layanan OpenStack memiliki host di dalamnya. Jika tidak ada host di grup, venv tidak akan dibangun. Perilaku ini secara opsional dapat diubah untuk memaksa semua venvs untuk dibangun dengan mengatur ``repo_build_venv_selective`` ke ``yes``.

source: The repo build process now selectively clones git repositories based on whether each OpenStack service group has any hosts in it. If there are no hosts in the group, the git repo for the service will not be cloned. This behaviour can be optionally changed to force all git repositories to be cloned by setting ``repo_build_git_selective`` to ``no``.
id: Proses repo build sekarang secara selektif mengkloning git repositori berdasarkan apakah setiap grup layanan OpenStack memiliki host di dalamnya. Jika tidak ada host di grup, repo git untuk layanan tidak akan dikloning. Perilaku ini secara opsional dapat diubah untuk memaksa semua repositori git untuk dikloning dengan menetapkan ``repo_build_git_selective`` ke ``no``.

source: The repo install process is now able to support building and synchronizing artifacts for multiple CPU architectures. To support multiple architectures, one or more repo servers must be created for each CPU architecture in the deployment. When multiple CPU architectures are detected among the repo servers, the repo-discovery process will automatically assign a repo master to perform the build process for each architecture.
id: Proses pemasangan repo sekarang dapat mendukung pembuatan dan sinkronisasi artefak untuk beberapa arsitektur CPU. Untuk mendukung banyak arsitektur, satu atau lebih server repo harus dibuat untuk setiap arsitektur CPU dalam deployment. Ketika beberapa arsitektur CPU terdeteksi di antara server repo, proses repo-discovery akan secara otomatis menetapkan master repo untuk melakukan proses pembangunan untuk setiap arsitektur.

source: The repo server file system structure has been updated to allow for multiple Operating systems running multiple architectures to be run at the same time and served from a single server without impacting pools, venvs, wheel archives, and manifests. The new structure follows the following pattern `$RELEASE/$OS_TYPE-$ARCH` and has been applied to *os-releases*, *venvs*, and *pools*.
id: Struktur sistem file server repo telah diperbarui untuk memungkinkan beberapa sistem Operasi menjalankan banyak arsitektur untuk dijalankan pada waktu yang sama dan dilayani dari satu server tanpa memengaruhi pools, venvs, wheel archives, and manifests. Struktur baru mengikuti pola berikut `$RELEASE/$OS_TYPE-$ARCH` dan telah diterapkan pada *os-releases*, *venvs*, dan *pools*.

source: The repo server no longer uses pypiserver, so it has been removed. Along with this, the following variables have also been removed.
id: Server repo tidak lagi menggunakan pypiserver, jadi sudah dihapus. Bersamaan dengan ini, variabel berikut juga telah dihapus.

source: The repo server now has a Package Cache service for distribution packages. To leverage the cache, deployers will need to configure the package manager on all hosts to use the cache as a proxy. If a deployer would prefer to disable this service, the variable ``repo_pkg_cache_enabled`` should be set to ``false``.
id: Server repo sekarang memiliki layanan Package Cache untuk paket distribusi. Untuk meningkatkan cache, para deployer perlu mengkonfigurasi manajer paket pada semua host untuk menggunakan cache sebagai proxy. Jika seorang deployer lebih memilih untuk menonaktifkan layanan ini, variabel ``repo_pkg_cache_enabled`` harus diatur ke ``false``.

source: The repo server now implements nginx as a reverse proxy for python packages sourced from pypi. The initial query will be to a local deployment of pypiserver in order to serve any locally built packages, but if the package is not available locally it will retry the query against the upstream pypi mirror set in the variable ``repo_nginx_pypi_upstream`` (defaults to pypi) and cache the response.
id: Server repo sekarang mengimplementasikan nginx sebagai proxy terbalik untuk paket python yang bersumber dari pypi. Kueri awal adalah untuk penyebaran pypiserver lokal untuk melayani setiap paket yang dibuat secara lokal, tetapi jika paket tidak tersedia secara lokal, ia akan mencoba lagi kueri terhadap mirror pypi hulu yang diatur dalam variabel ``repo_nginx_pypi_upstream`` (default ke pypi) dan cache response.

source: The repo server will now be used as a package manager cache.
id: Server repo sekarang akan digunakan sebagai cache manajer paket.

source: The repo server's reverse proxy for pypi has now been removed, leaving only the pypiserver to serve packages already on the repo server. The attempt to reverse proxy upstream pypi turned out to be very unstable with increased complexity for deployers using proxies or offline installs. With this, the variables ``repo_nginx_pypi_upstream`` and ``repo_nginx_proxy_cache_path`` have also been removed.
id: Proxy reverse server repo untuk pypi kini telah dihapus, hanya menyisakan pypiserver untuk melayani paket yang sudah ada di server repo. Upaya untuk membalikkan proxy hulu proksi ternyata sangat tidak stabil dengan meningkatnya kerumitan bagi deployer yang menggunakan proxy atau pemasangan offline. Dengan ini, variabel ``repo_nginx_pypi_upstream`` dan ``repo_nginx_proxy_cache_path`` juga telah dihapus.

source: The repo-clone-mirror.yml file is being deprecated, effective immediately. The playbook itself has been changed to no longer sync and will be removed from the tree in the Mitaka branch.
id: File repo-clone-mirror.yml sedang tidak digunakan lagi, segera berlaku. Playbook itu sendiri telah diubah menjadi tidak lagi disinkronkan dan akan dihapus dari tree di branch Mitaka.

source: The repo_build play now correctly evaluates environment variables configured in /etc/environment. This enables deployments in an environment with http proxies.
id: Play repo_build sekarang dengan benar mengevaluasi variabel lingkungan yang dikonfigurasi di /etc/environment. Ini memungkinkan deployment di lingkungan dengan proksi http.

source: The repo_build role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``repo_build_package_state`` should be set to ``present``.
id: Role repo_build selalu memeriksa apakah paket terbaru diinstal ketika dieksekusi. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``repo_build_package_state`` harus diatur ke ``present``.

source: The repo_build role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``repo_build_package_state`` to ``present``.
id: Role repo_build sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``repo_build_package_state`` ke ``present``.

source: The repo_server role always checks whether the latest package is installed when executed. If a deployer wishes to change the check to only validate the presence of the package, the option ``repo_server_package_state`` should be set to ``present``.
id: Role repo_server selalu memeriksa apakah paket terbaru diinstal ketika dijalankan. Jika seorang deployer ingin mengubah tanda centang untuk hanya memvalidasi keberadaan paket, opsi ``repo_server_package_state`` harus diatur ke ``present``.

source: The repo_server role now supports the ability to configure whether apt/yum tasks install the latest available package, or just ensure that the package is present. The default action is to ensure that the latest package is present. The action taken may be changed to only ensure that the package is present by setting ``repo_server_package_state`` to ``present``.
id: Role repo_server sekarang mendukung kemampuan untuk mengonfigurasi apakah tugas apt/yum menginstal paket terbaru yang tersedia, atau hanya memastikan bahwa paket tersebut ada. Tindakan default adalah untuk memastikan bahwa paket terbaru hadir. Tindakan yang diambil dapat diubah hanya untuk memastikan bahwa paket hadir dengan mengatur ``repo_server_package_state`` ke ``present``.

source: The requirements version has bumped to pull in os-vif 1.15.2, which contains the fix for OSSA-2019-004 / CVE-2019-15753. Operators using linuxbridge networking (the default in openstack-ansible) should update immediately. The fixed package will be installed in the nova venv upon re-deployment of nova using the os-nova-install.yml playbook. Afterwards, verify that the ageing timer on neutron-controlled linux bridges displays as "300.00" raher than "0.00" using ``brctl showstp <bridge name>``.
id: Versi persyaratan telah dihancurkan untuk menarik os-vif 1.15.2, yang berisi perbaikan untuk OSSA-2019-004 / CVE-2019-15753. Operator yang menggunakan jaringan linuxbridge (default di openstack-ansible) harus segera memperbarui. Paket tetap akan diinstal di nova venv setelah penempatan kembali nova menggunakan os-nova-install.yml playbook. Setelah itu, verifikasi bahwa penghitung waktu penuaan pada neutron-controlled linux bridges ditampilkan sebagai "300,00" dari pada "0,00" menggunakan `` brctl showstp <bridge name> ``.

source: The role now enables auditing during early boot to comply with the requirements in V-38438. By default, the GRUB configuration variables in ``/etc/default/grub.d/`` will be updated and the active ``grub.cfg`` will be updated.
id: Role sekarang memungkinkan audit selama boot awal untuk memenuhi persyaratan di V-38438. Secara default, variabel konfigurasi GRUB di ``/etc/default/grub.d/`` akan diperbarui dan ``grub.cfg`` yang aktif akan diperbarui.

source: The role now supports SUSE based distributions. Required packages can now be installed using the `zypper` package manager.
id: Role sekarang mendukung distribusi berbasis SUSE. Paket yang dibutuhkan sekarang dapat diinstal menggunakan manajer paket `zypper`.

source: The role now supports using the distribution packages for the OpenStack services instead of the pip ones. This feature is disabled by default and can be enabled by simply setting the ``aodh_install_method`` variable to ``distro``.
id: Role sekarang mendukung menggunakan paket distribusi untuk layanan OpenStack bukan yang pip. Fitur ini dinonaktifkan secara default dan dapat diaktifkan hanya dengan mengatur variabel ``aodh_install_method`` menjadi ``distro``.

source: The role now supports using the distribution packages for the OpenStack services instead of the pip ones. This feature is disabled by default and can be enabled by simply setting the ``barbican_install_method`` variable to ``distro``.
id: Role sekarang mendukung menggunakan paket distribusi untuk layanan OpenStack bukan yang pip. Fitur ini dinonaktifkan secara default dan dapat diaktifkan dengan hanya mengatur variabel ``barbican_install_method`` ke ``distro``.

source: The role now supports using the distribution packages for the OpenStack services instead of the pip ones. This feature is disabled by default and can be enabled by simply setting the ``ceilometer_install_method`` variable to ``distro``.
id: Peran sekarang mendukung menggunakan paket distribusi untuk layanan OpenStack bukan yang pip. Fitur ini dinonaktifkan secara default dan dapat diaktifkan hanya dengan mengatur variabel ``ceilometer_install_method`` menjadi ``distro``.

source: The role now supports using the distribution packages for the OpenStack services instead of the pip ones. This feature is disabled by default and can be enabled by simply setting the ``cinder_install_method`` variable to ``distro``.--
id: Role sekarang mendukung menggunakan paket distribusi untuk layanan OpenStack bukan yang pip. Fitur ini dinonaktifkan secara default dan dapat diaktifkan hanya dengan mengatur variabel ``cinder_install_method`` menjadi ``distro`` .--

source: The role now supports using the distribution packages for the OpenStack services instead of the pip ones. This feature is disabled by default and can be enabled by simply setting the ``designate_install_method`` variable to ``distro``.
id: Role sekarang mendukung menggunakan paket distribusi untuk layanan OpenStack bukan yang pip. Fitur ini dinonaktifkan secara default dan dapat diaktifkan dengan hanya mengatur variabel ``designate_install_method`` ke ``distro``.

source: The role now supports using the distribution packages for the OpenStack services instead of the pip ones. This feature is disabled by default and can be enabled by simply setting the ``glance_install_method`` variable to ``distro``.
id: Role sekarang mendukung menggunakan paket distribusi untuk layanan OpenStack bukan yang pip. Fitur ini dinonaktifkan secara default dan dapat diaktifkan hanya dengan mengatur variabel `` glance_install_method`` menjadi `` distro``.

source: The role now supports using the distribution packages for the OpenStack services instead of the pip ones. This feature is disabled by default and can be enabled by simply setting the ``heat_install_method`` variable to ``distro``.
id: Role sekarang mendukung menggunakan paket distribusi untuk layanan OpenStack bukan yang pip. Fitur ini dinonaktifkan secara default dan dapat diaktifkan dengan hanya mengatur variabel ``heat_install_method`` ke ``distro``.
