Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The Nova project has set the v2.1 API as the default and those configuration variables have changed. Variables that began with ``nova_v21_*`` in the Kilo release are now renamed to ``nova_*``. All new Liberty deployments will have only the v2.1 API registered in the service catalog.
id: Proyek Nova telah menetapkan API v2.1 sebagai default dan variabel konfigurasi tersebut telah berubah. Variabel yang dimulai dengan ``nova_v21_*`` dalam rilis Kilo sekarang diubah namanya menjadi ``nova_*``. Semua penyebaran Liberty baru hanya akan memiliki API v2.1 terdaftar di katalog layanan.

source: The PATH environment variable that is configured on the remote system can now be set using the ``openstack_host_environment_path`` list variable.
id: Variabel lingkungan PATH yang dikonfigurasi pada sistem jarak jauh sekarang dapat diatur menggunakan variabel daftar ``openstack_host_environment_path``.

source: The PKI-based authentication checks for RHEL-07-040030, RHEL-07-040040, and RHEL-07-040050 are no longer included in the RHEL 7 STIG. The tasks and documentation for these outdated configurations are removed.
id: Otentikasi berbasis PKI memeriksa RHEL-07-040030, RHEL-07-040040, dan RHEL-07-040050 tidak lagi termasuk dalam RHEL 7 STIG. Tugas dan dokumentasi untuk konfigurasi yang lama ini dihapus.

source: The PermitRootLogin in sshd_config changed from 'yes' to 'prohibit-password' in the containers. By default there is no password set in the containers but the ssh pub key from the deployment host is injected in the targets nodes authorized_keys.
id: PermitRootLogin di sshd_config berubah dari 'yes' menjadi 'prohibit-password' di kontainer. Secara default tidak ada password yang diatur dalam kontainer tetapi kunci ssh pub dari deployment host disuntikkan dalam node target authorized_keys.

source: The PowerVM driver has been removed as it is not tested and it has been broken since late 2016 due to the driver name being renamed to powervm_ext instead of powervm.
id: Driver PowerVM telah dihapus karena tidak diuji dan telah rusak sejak akhir 2016 karena nama driver diubah namanya menjadi powervm_ext bukan powervm.

source: The Project Calico Neutron networking plugin is now integrated into the ``os_neutron`` role. This can be activated using the instructions located in the role documentation.
id: Plugin jaringan Project Calico Neutron sekarang terintegrasi ke dalam peran ``os_neutron``. Ini dapat diaktifkan menggunakan instruksi yang ada di dokumentasi peran.

source: The Project Calico Neutron networking plugin is now integrated into the deployment. For setup instructions please see ``os_neutron`` role documentation.
id: Plugin jaringan Project Calico Neutron sekarang terintegrasi ke dalam deployment. Untuk instruksi pengaturan silakan lihat dokumentasi peran ``os_neutron``.

source: The RabbitMQ Management UI is now available through HAProxy on port 15672. The default userid is ``monitoring``. This user can be modified by changing the parameter ``rabbitmq_monitoring_userid`` in the file ``user_variables.yml``. Please note that ACLs have been added to this HAProxy service by default, such that it may only be accessed by common internal clients. Reference ``playbooks/vars/configs/haproxy_config.yml``
id: RabbitMQ Management UI sekarang tersedia melalui HAProxy pada port 15672. Userid default adalah ``monitoring``. User ini dapat dimodifikasi dengan mengubah parameter ``rabbitmq_monitoring_userid`` dalam file ``user_variables.yml``. Harap dicatat bahwa ACL telah ditambahkan ke layanan HAProxy ini secara default, sehingga hanya dapat diakses oleh klien internal umum. Referensi ``playbooks/vars/configs/haproxy_config.yml``

source: The Red Hat Enteprise Linux 6 STIG content has been deprecated. The tasks and variables for the RHEL 6 STIG will be removed in a future release.
id: Konten Red Hat Enterprise Linux 6 STIG telah ditinggalkan. Tugas dan variabel untuk RHEL 6 STIG akan dihapus dalam rilis mendatang.

source: The Red Hat Enterprise Linux (RHEL) 7 STIG content is now deployed by default. Deployers can continue using the RHEL 7 STIG content by setting the following Ansible variable:
id: Konten Red Hat Enterprise Linux (RHEL) 7 STIG sekarang digunakan secara default. Deployer dapat terus menggunakan konten RHEL 7 STIG dengan mengatur variabel Ansible berikut:

source: The RyuBgpDriver is no longer available and replaced by the OsKenBgpDriver of the neutron_dynamic_routing project.
id: RyuBgpDriver tidak lagi tersedia dan digantikan oleh OsKenBgpDriver dari proyek neutron_dynamic_routing.

source: The S3, v3, and EC2 API's have been deprecated by the Nova project in the liberty release. Those variables have been removed. They include variables that begin with ``nova_s3_*``, ``nova_ec2_*``, and ``nova_v3_*``.
id: API S3, v3, dan EC2 telah ditinggalkan oleh proyek Nova dalam rilis liberty. Variabel itu telah dihapus. Mereka termasuk variabel yang dimulai dengan ``nova_s3_*``, ``nova_ec2_*``, dan ``nova_v3_*``.

source: The Sahara dashboard is available in Horizon. Deployers can enable the panel by setting the following Ansible variable:
id: Dasbor Sahara tersedia di Horizon. Deployer dapat mengaktifkan panel dengan mengatur variabel Ansible berikut:

source: The Trove dashboard is available in Horizon. Deployers can enable the panel by setting the following Ansible variable:
id: Dasbor Trove tersedia di Horizon. Deployer dapat mengaktifkan panel dengan mengatur variabel Ansible berikut:

source: The URL of NovaLink uses 'ftp' protocol to provision apt key. It causes apt_key module to fail to retrieve NovaLink gpg public key file. Therefore, change the protocol of URL to 'http'. For more information, see bug 1637348.
id: URL NovaLink menggunakan protokol 'ftp' untuk menyediakan kunci apt. Itu menyebabkan modul apt_key gagal mengambil file kunci publik NovaLink gpg. Karena itu, ubah protokol URL menjadi 'http'. Untuk informasi lebih lanjut, lihat bug 1637348.

source: The XFS filesystem is excluded from the daily mlocate crond job in order to conserve disk IO for large IOPS bursts due to updatedb/mlocate file indexing.
id: Sistem file XFS dikecualikan dari mlocate crond job harian untuk menghemat disk IOPS untuk semburan (burst) IOPS besar karena pengindeksan file updatedb/mlocate.

source: The ``--check`` parameter for ``dynamic_inventory.py`` will now raise warnings if there are any groups defined in the user configuration that are not also found in the environment definition.
id: Parameter ``--check`` untuk ``dynamic_inventory.py`` sekarang akan memunculkan peringatan jika ada grup yang ditentukan dalam konfigurasi pengguna yang tidak juga ditemukan dalam definisi lingkungan.

source: The ``--compact`` flag has been removed from xtrabackup options. This had been shown to cause crashes in some SST situations
id: Flag ``--compact`` telah dihapus dari opsi xtrabackup. Ini telah terbukti menyebabkan crash dalam beberapa situasi SST

source: The ``/run`` directory is excluded from AIDE checks since the files and directories there are only temporary and often change when services start and stop.
id: Direktori ``/run`` dikecualikan dari pemeriksaan AIDE karena file dan direktori hanya ada sementara dan sering berubah ketika layanan mulai dan berhenti.

source: The ``/var/lib/libvirt/qemu/save`` directory is now a symlink to ``{{ nova_system_home_folder }}/save`` to resolve an issue where the default location used by the libvirt managed save command can result with the root partitions on compute nodes becoming full when ``nova image-create`` is run on large instances.
id: Direktori ``/var/lib/libvirt/qemu/save`` sekarang menjadi symlink ke ``{{ nova_system_home_folder }}/save`` untuk menyelesaikan masalah di mana lokasi default yang digunakan oleh perintah libvirt managed save dapat dihasilkan dengan partisi root pada compute nodes menjadi penuh ketika ``nova image-create`` dijalankan pada instance besar.

source: The ``[boto]`` section of tempest.conf.j2 has been removed. These tests have been completely removed from tempest for some time.
id: Bagian ``[boto]`` dari tempest.conf.j2 telah dihapus. Tes ini telah sepenuhnya dihapus dari tempest selama beberapa waktu.

source: The ``ansible-role-requirements.yml`` reference to the ``ceph-ansible`` role has been fixed to refer to the current ``HEAD`` of that role's ``stable-3.1`` branch. It previously pointed to the pre-release 3.2.0beta1 version.
id: Referensi ``ansible-role-requirements.yml`` untuk peran ``ceph-ansible`` telah diperbaiki untuk merujuk ke ``HEAD`` saat ini dari branch ``stable-3.1`` peran itu. Ini sebelumnya menunjuk ke versi 3.2.0beta1 pra-rilis.

source: The ``aodh_keystone_auth_plugin`` variable has been deprecated. ``aodh_keystone_auth_type`` should be used instead to configure authentication type.
id: Variabel ``aodh_keystone_auth_plugin`` telah ditinggalkan. ``aodh_keystone_auth_type`` harus digunakan sebagai gantinya untuk mengkonfigurasi tipe otentikasi.

source: The ``ca-certificates`` package has been included in the LXC container build process in order to prevent issues related to trying to connect to public websites which make use of newer certificates than exist in the base CA certificate store.
id: Paket ``ca-certificates`` telah dimasukkan dalam proses pembuatan kontainer LXC untuk mencegah masalah yang terkait dengan mencoba terhubung ke situs web publik yang menggunakan sertifikat yang lebih baru daripada yang ada di store sertifikat CA dasar.

source: The ``ceilometer-api`` init service is removed since ``ceilometer-api`` is deployed as an apache ``mod_wsgi`` service.
id: Layanan ``ceilometer-api`` init dihapus karena ``ceilometer-api`` digunakan sebagai layanan apache ``mod_wsgi``.

source: The ``ceilometer_gnocci_resources_yaml_overrides`` variable is deprecated and scheduled for removal in the Pike cycle. This is replaced with the correctly spelled variable, which should now be used ``ceilometer_gnocchi_resources_yaml_overrides``.
id: Variabel ``ceilometer_gnocci_resources_yaml_overrides`` sudah usang dan dijadwalkan untuk dihapus dalam siklus Pike. Ini diganti dengan variabel yang dieja dengan benar, yang sekarang harus digunakan ``ceilometer_gnocchi_resources_yaml_overrides``.

source: The ``ceilometer_keystone_auth_plugin`` variable has been deprecated. ``ceilometer_keystone_auth_type`` should be used instead to configure authentication type.
id: Variabel ``ceilometer_keystone_auth_plugin`` telah ditinggalkan. ``ceilometer_keystone_auth_type`` harus digunakan sebagai gantinya untuk mengkonfigurasi tipe otentikasi.

source: The ``ceph-ansible`` individual role repositories were all removed from github on around 16 January 2019, causing the bootstrap-ansible script to fail for any new deployments, or during upgrades for environments which had these roles previously. To replace them, the ``ceph-ansible`` git repository is used instead.
id: Repositori peran individu ``ceph-ansible`` semua dihapus dari github pada sekitar 16 Januari 2019, menyebabkan skrip yang memungkinkan bootstrap gagal untuk penyebaran apa pun, atau selama peningkatan untuk lingkungan yang memiliki peran ini sebelumnya. Untuk menggantinya, repositori git ``ceph-ansible`` digunakan sebagai gantinya.

source: The ``ceph-ansible`` individual role repositories were all removed from github on around 16 January 2019, causing the bootstrap-ansible script to fail for any new deployments, or during upgrades for environments which had these roles previously. To replace them, the ``ceph-ansible`` git repository is used instead. In order to prevent clashes between the old and new roles, the existing ``/etc/ansible/roles/ceph*`` folders should be removed prior to running ``scripts/bootstrap-ansible.sh`` during the minor upgrade process.
id: Repositori peran individu ``ceph-ansible`` semua dihapus dari github pada sekitar 16 Januari 2019, menyebabkan skrip yang memungkinkan bootstrap gagal untuk penyebaran apa pun, atau selama peningkatan untuk lingkungan yang memiliki peran ini sebelumnya. Untuk menggantinya, repositori git ``ceph-ansible`` digunakan sebagai gantinya. Untuk mencegah bentrokan antara peran lama dan baru, folder ``/etc/ansible/roles/ceph*`` yang ada harus dihapus sebelum menjalankan ``scripts/bootstrap-ansible.sh`` selama proses peningkatan minor. .

source: The ``ceph-rgw`` playbooks now include the ``AUTH_%(tenant_id)s`` suffix in the Keystone ``object-store`` endpoint. This aligns radosgw's behavior with that of native Swift. It also enables radosgw to support public read ACLs on containers, and temporary URLs on objects, in the same way that Swift does (`bug 1800637 <https://bugs.launchpad.net/openstack-ansible/+bug/1800637>`_).
id: Playbook ``ceph-rgw`` sekarang menyertakan akhiran ``AUTH_%(tenant_id)s``` di endpoint ``object-store`` Keystone. Ini menyelaraskan perilaku radosgw dengan perilaku Swift native. Ini juga memungkinkan radosgw untuk mendukung ACL membaca publik pada kontainer, dan URL sementara pada objek, dengan cara yang sama seperti yang dilakukan Swift (`bug 1800637 <https://bugs.launchpad.net/openstack-ansible/+bug/1800637>` _).

source: The ``ceph-rgw`` playbooks now set ``rgw_swift_account_in_url = true`` and update the corresponding Keystone service catalog entry accordingly. Applications (such as monitoring scripts) that do *not* rely on service catalog lookup must be updated with the new endpoint URL that includes ``AUTH_%(tenant_id)s`` just like native Swift does --- or, alternatively, should be updated to honor the service catalog after all.
id: Playbook ``ceph-rgw`` sekarang menetapkan ``rgw_swift_account_in_url = true`` dan update entri katalog layanan Keystone yang sesuai. Aplikasi (seperti monitoring script) yang *not* mengandalkan pencarian katalog layanan harus diperbarui dengan URL endpoint baru yang mencakup ``AUTH_%(tenant_id)s`` seperti halnya yang dilakukan swift native --- atau, jika tidak, harus diperbarui untuk menghormati katalog layanan bagaimanapun.

source: The ``ceph-rgw`` playbooks now set ``rgw_swift_versioning_enabled = true``, adding support for object versioning for the ``object-store`` service.
id: Playbook ``ceph-rgw`` sekarang mengatur ``rgw_swift_versioning_enabled = true``, menambahkan dukungan object versioning untuk layanan ``object-store``.

source: The ``ceph_pkg_source`` variable controls the install source for the Ceph packages. Valid values include:
id: Variabel ``ceph_pkg_source`` mengontrol sumber instal untuk paket Ceph. Nilai yang valid meliputi:

source: The ``cinder-api`` service has moved to run as a uWSGI application. You can set the max number of WSGI processes, the number of processes, threads, and buffer size utilizing the ``cinder_wsgi_processes_max``, ``cinder_wsgi_processes``, ``cinder_wsgi_threads``, and ``cinder_wsgi_buffer_size``. Additionally, you can override any settings in the uWSGI ini configuration file using the ``cinder_api_uwsgi_ini_overrides`` setting. The uWSGI application will listen on the address specified by ``cinder_uwsgi_bind_address`` which defaults to ``0.0.0.0``.
id: Layanan ``cinder-api`` telah dipindahkan untuk berjalan sebagai aplikasi uWSGI. Anda dapat mengatur jumlah maksimum proses WSGI, jumlah proses, thread, dan ukuran buffer menggunakan ``cinder_wsgi_processes_max``, ``cinder_wsgi_processes``, ``cinder_wsgi_threads``, dan ``cinder_wsgi_buffer_si``. Selain itu, Anda dapat mengabaikan pengaturan apa pun di file konfigurasi uWSGI ini menggunakan pengaturan ``cinder_api_uwsgi_ini_overrides``. Aplikasi uWSGI akan mendengarkan alamat yang ditentukan oleh ``cinder_uwsgi_bind_address`` yang secara default adalah ``0.0.0.0``.

source: The ``cinder_keystone_auth_plugin`` variable has been deprecated. ``cinder_keystone_auth_type`` should be used instead to configure authentication type.
id: Variabel ``cinder_keystone_auth_plugin`` telah ditinggalkan. ``cinder_keystone_auth_type`` harus digunakan sebagai gantinya untuk mengkonfigurasi tipe otentikasi.

source: The ``cinder`` project removed the ``shred`` value for the ``volume_clear`` option. The default for the ``os_cinder`` OpenStack-Ansible role has changed to ``zero``.
id: Proyek ``cinder`` menghapus nilai ``shred`` untuk opsi ``volume_clear``. Default untuk peran ``os_cinder`` OpenStack-Ansible telah berubah menjadi ``zero``.

source: The ``cn_map`` permissions and ownership adjustments included as part of RHEL-07-040070 and RHEL-07-040080 has been removed. This STIG configuration was removed in the most recent release of the RHEL 7 STIG.
id: Izin ``cn_map`` dan penyesuaian kepemilikan termasuk sebagai bagian dari RHEL-07-040070 dan RHEL-07-040080 telah dihapus. Konfigurasi STIG ini telah dihapus dalam rilis terbaru RHEL 7 STIG.

source: The ``config_template`` action module has now been moved into its own git repository (``openstack/ansible-config_template``). This has been done to simplify the ability to use the plugin in other non OpenStack-Ansible projects.
id: Modul aksi ``config_template`` sekarang telah dipindahkan ke repositori gitnya sendiri (``openstack/ansible-config_template``). Ini telah dilakukan untuk menyederhanakan kemampuan untuk menggunakan plugin dalam proyek non-OpenStack-Ansible lainnya.

source: The ``container_cidr`` key has been restored back to ``openstack_inventory.json``.
id: Kunci ``container_cidr`` telah dikembalikan ke ``openstack_inventory.json``.

source: The ``container_interface`` provider network option is no longer required for Neutron provider network definitions when related agents or OVN controllers are deployed on bare metal.
id: Opsi jaringan penyedia ``container_interface`` tidak lagi diperlukan untuk definisi jaringan penyedia Neutron ketika agen terkait atau pengontrol OVN digunakan pada bare metal.

source: The ``dragonflow`` plugin for neutron is now available. You can set the ``neutron_plugin_type`` to ``ml2.dragonflow`` to utilize this code path. The ``dragonflow`` code path is currently experimental.
id: Plugin ``dragonflow`` untuk neutron sekarang tersedia. Anda dapat mengatur ``neutron_plugin_type`` ke ``ml2.dragonflow`` untuk memanfaatkan jalur kode ini. Jalur kode ``dragonflow`` saat ini sedang dalam percobaan.

source: The ``dynamic_inventory.py`` script now takes a ``--config`` argument rather than a ``--file`` argument.
id: Skrip ``dynamic_inventory.py`` sekarang mengambil argumen ``--config`` sebagai ganti argumen ``--file``.

source: The ``fallocate_reserve` option can now be set (in bytes or as a percentage) for swift by using the ``swift_fallocate_reserve`` variable in ``/etc/openstack_deploy/user_variables.yml``. This value is the amount of space to reserve on a disk to prevent a situation where swift is unable to remove objects due to a lack of available disk space to work with. The default value is 1% of the total disk size.
id: Opsi ``fallocate_reserve` sekarang dapat disetel (dalam byte atau sebagai persentase) untuk swift dengan menggunakan variabel ``swift_fallocate_reserve`` dalam ``/etc/openstack_deploy/user_variables.yml``. Nilai ini adalah jumlah ruang untuk cadangan pada disk untuk mencegah situasi dimana swift tidak dapat menghapus objek karena kurangnya ruang disk yang tersedia untuk bekerja. Nilai default adalah 1% dari total ukuran disk.

source: The ``galera_apt_repo_url`` and ``galera_yum_repo_url`` variables have been renamed to ``galera_repo_url``.
id: Variabel ``galera_apt_repo_url`` dan ``galera_yum_repo_url`` telah diubah namanya menjadi ``galera_repo_url``.

source: The ``galera_client_opensuse_mirror_obs_url`` variable has been removed since the OBS repository is no longer used to install the MariaDB packages.
id: Variabel ``galera_client_opensuse_mirror_obs_url`` telah dihapus karena repositori OBS tidak lagi digunakan untuk menginstal paket MariaDB.

source: The ``galera_client_package_install`` option can now be specified to handle whether packages are installed as a result of the ``openstack-ansible-galera_client`` role running. This will default to ``true``, but can be set to ``false`` to prevent package installs. This is useful when deploying the ``my.cnf`` client configuration file on hosts that already have Galera installed.
id: Opsi ``galera_client_package_install`` sekarang dapat ditentukan untuk menangani apakah paket diinstal sebagai hasil dari peran ``openstack-ansible-galera_client`` berjalan. Ini akan secara default menjadi ``true``, tetapi dapat diatur ke ``false`` untuk mencegah instalasi paket. Ini berguna ketika menggunakan file konfigurasi klien ``my.cnf`` pada host yang sudah menginstal Galera.

source: The ``galera_client`` role will default to using the ``galera_repo_url`` URL if the value for it is set. This simplifies using an alternative mirror for the MariaDB server and client as only one variable needs to be set to cover them both.
id: Peran ``galera_client`` akan menjadi default untuk menggunakan URL ``galera_repo_url`` jika nilai untuk itu ditetapkan. Ini menyederhanakan menggunakan mirror alternatif untuk server dan klien MariaDB karena hanya satu variabel yang perlu diatur untuk mencakup keduanya.

source: The ``galera_mariadb_apt_server_package`` and ``galera_mariadb_yum_server_package`` variables have been renamed to ``galera_mariadb_server_package``.
id: Variabel ``galera_mariadb_apt_server_package`` dan ``galera_mariadb_yum_server_package`` telah diubah namanya menjadi ``galera_mariadb_server_package``.

source: The ``galera_percona_xtrabackup_repo_url`` variable which was used on Ubuntu distributions to select the upstream Percona repository has been dropped and the default upstream repository is always used from now on.
id: Variabel ``galera_percona_xtrabackup_repo_url`` yang digunakan pada distribusi Ubuntu untuk memilih repositori upstream Percona telah dihapus dan repositori upstream default selalu digunakan mulai sekarang.

source: The ``galera_server`` role now ships with the latest MariaDB release of 10.3.13.
id: Peran ``galera_server`` sekarang dikirim dengan rilis MariaDB terbaru dari 10.3.13.

source: The ``galera_server`` role now uses mariabackup in order to complete SST operations due to the fact that this is the recommended choice from MariaDB.
id: Peran ``galera_server`` sekarang menggunakan mariabackup untuk menyelesaikan operasi SST karena fakta bahwa ini adalah pilihan yang disarankan dari MariaDB.

source: The ``galera_upgrade`` variable is now provided to allow the MariaDB role to update existing installs.
id: Variabel ``galera_upgrade`` sekarang disediakan untuk memungkinkan peran MariaDB memperbarui pemasangan yang ada.

source: The ``get_gested`` filter has been removed, as it is not used by any roles/plays.
id: Filter ``get_gested`` telah dihapus, karena tidak digunakan oleh roles/plays apa pun.

source: The ``glance-api`` service has moved to run as a uWSGI application. You can set the max number of WSGI processes, the number of processes, threads, and buffer size utilizing the ``glance_wsgi_processes_max``, ``glance_wsgi_processes``, ``glance_wsgi_threads``, and ``glance_wsgi_buffer_size``. Additionally, you can override any settings in the uWSGI ini configuration file using the ``glance_api_uwsgi_ini_overrides`` setting.
id: Layanan ``glance-api`` telah dipindahkan untuk berjalan sebagai aplikasi uWSGI. Anda dapat mengatur jumlah maksimum proses WSGI, jumlah proses, thread, dan ukuran buffer menggunakan ``glance_wsgi_processes_max``, ``glance_wsgi_processes``, ``glance_wsgi_threads``, dan ``glance_wsgi_buffer_si``. Selain itu, Anda dapat mengabaikan pengaturan apa pun di file konfigurasi uWSGI ini menggunakan pengaturan ``glance_api_uwsgi_ini_overrides``.
