Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: A self-signed certificate will now be generated by default when HAproxy is used as a load balancer. This certificate is used to terminate the public endpoint for Horizon and all OpenStack API services.
id: Sertifikat yang ditandatangani sendiri sekarang akan dihasilkan secara default ketika HAproxy digunakan sebagai penyeimbang beban (load balancer). Sertifikat ini digunakan untuk mengakhiri endpoint publik untuk Horizon dan semua layanan OpenStack API.

source: A sudoers entry has been added to the repo_servers in order to allow the nginx user to stop and start nginx via the init script. This is implemented in order to ensure that the repo sync process can shut off nginx while synchronising data from the master to the slaves.
id: Entri sudoer telah ditambahkan ke repo_servers untuk memungkinkan pengguna nginx berhenti dan mulai nginx melalui skrip init. Ini diterapkan untuk memastikan bahwa proses sinkronisasi repo dapat mematikan nginx saat menyinkronkan data dari master ke slave.

source: A sudoers entry is added to the repo_servers to allow the nginx user to stop and start NGINX from the init script. This ensures that the repo sync process can shut off NGINX while synchronizing data from master to slaves.
id: Entri sudoers ditambahkan ke repo_servers untuk memungkinkan pengguna nginx berhenti dan memulai NGINX dari skrip init. Ini memastikan bahwa proses sinkronisasi repo dapat mematikan NGINX sambil menyinkronkan data dari master ke slave.

source: A task was added that restricts ICMPv4 redirects to meet the requirements of V-38524 in the STIG. This configuration is disabled by default since it could cause issues with LXC in some environments.
id: Sebuah tugas ditambahkan yang membatasi pengalihan ICMPv4 untuk memenuhi persyaratan V-38524 di STIG. Konfigurasi ini dinonaktifkan secara default karena dapat menyebabkan masalah dengan LXC di beberapa lingkungan.

source: A task was added to disable secure ICMP redirects per the requirements in V-38526. This change can cause problems in some environments, so it is disabled by default. Deployers can enable the task (which disables secure ICMP redirects) by setting ``security_disable_icmpv4_redirects_secure`` to ``yes``.
id: Tugas ditambahkan untuk menonaktifkan pengalihan ICMP aman sesuai persyaratan di V-38526. Perubahan ini dapat menyebabkan masalah di beberapa lingkungan, sehingga dinonaktifkan secara default. Deployer dapat mengaktifkan tugas (yang menonaktifkan pengalihan ICMP aman) dengan mengatur ``security_disable_icmpv4_redirects_secure`` ke ``yes``.

source: A typical OSA install will put the neutron and octavia queues on different vhosts thus preventing the event streamer from working While octavia is streaming to its own queue the consumer on the neutron side listens to the neutron queue. With a recent octavia enhancement a separate queue for the event streamer can be configured. This patch will set up the event streamer to post into the neutron queue using neutron's credentials. Thus reaching the consumer on the neutron-lbaas side and allowing for streaming.
id: Instalasi OSA tipikal akan menempatkan antrian neutron dan octavia pada vhost yang berbeda sehingga mencegah event streamer bekerja. Sementara octavia mengalir ke antriannya sendiri, konsumen di sisi neutron mendengarkan antrian neutron. Dengan peningkatan octavia baru-baru ini, antrian terpisah untuk event streamer dapat dikonfigurasi. Patch ini akan mengatur event streamer untuk mengirim ke antrian neutron menggunakan kredensial neutron. Sehingga menjangkau konsumen di sisi neutron-lbaas dan memungkinkan untuk streaming.

source: A variable named ``bootstrap_user_variables_template`` has been added to the bootstrap-host role so the user can define the user variable template filename for AIO deployments
id: Variabel bernama ``bootstrap_user_variables_template`` telah ditambahkan ke peran bootstrap-host sehingga pengguna dapat menentukan nama file template variabel pengguna untuk penyebaran AIO

source: AIDE initialization is now always run on subsequent playbook runs when ``initialize_aide`` is set to ``yes``. The initialization will be skipped if AIDE isn't installed or if the AIDE database already exists.
id: Inisialisasi AIDE sekarang selalu dijalankan pada playbook berikutnya yang berjalan ketika ``initialize_aide`` diatur ke ``yes``. Inisialisasi akan dilewati jika AIDE tidak diinstal atau jika database AIDE sudah ada.

source: AIDE initialization is now always run on subsequent playbook runs when ``security_initialize_aide`` is set to ``yes``. The initialization will be skipped if AIDE isn't installed or if the AIDE database already exists.
id: Inisialisasi AIDE sekarang selalu dijalankan pada playbook berikutnya yang berjalan ketika ``security_initialize_aide`` diatur ke ``yes``. Inisialisasi akan dilewati jika AIDE tidak diinstal atau jika database AIDE sudah ada.

source: AIDE is configured to skip the entire ``/var`` directory when it does the database initialization and when it performs checks. This reduces disk I/O and allows these jobs to complete faster.
id: AIDE dikonfigurasikan untuk melewati seluruh direktori ``/var`` ketika melakukan inisialisasi database dan ketika melakukan pemeriksaan. Ini mengurangi I/O disk dan memungkinkan pekerjaan ini untuk menyelesaikan lebih cepat.

source: Add ``get_networks`` command to the neutron library. This will return network information for all networks, and fail if the specified ``net_name`` network is not present. If no ``net_name`` is specified network information will for all networks will be returned without performing a check on an existing ``net_name`` network.
id: Tambahkan perintah ``get_networks`` ke perpustakaan neutron. Ini akan mengembalikan informasi jaringan untuk semua jaringan, dan gagal jika jaringan ``net_name`` yang ditentukan tidak ada. Jika tidak ada ``net_name`` yang ditentukan, informasi jaringan untuk semua jaringan akan dikembalikan tanpa melakukan pemeriksaan pada jaringan ``net_name`` yang ada.

source: Add architecture-specific locations for percona-xtrabackup and qpress, with alternate locations provided for ppc64el due to package inavailability from the current provider.
id: Tambahkan lokasi architecture-specific untuk percona-xtrabackup dan qpress, dengan lokasi alternatif disediakan untuk ppc64el karena tidak tersedianya paket dari provider saat ini.

source: Add support for Ubuntu on IBM z Systems (s390x).
id: Tambahkan dukungan untuk Ubuntu pada IBM z Systems (s390x).

source: Add support for ``neutron`` as an ``enabled_network_interface``.
id: Tambahkan dukungan untuk ``neutron`` sebagai ``enabled_network_interface``.

source: Add support for the cinder v3 api. This is enabled by default, but can be disabled by setting the ``cinder_enable_v3_api`` variable to ``false``.
id: Tambahkan dukungan untuk api cinder v3. Ini diaktifkan secara default, tetapi dapat dinonaktifkan dengan mengatur variabel ``cinder_enable_v3_api`` menjadi ``false``.

source: Add the launchpad and bugzilla keys in tempest_test_blacklist ansible variable. Developers must have a way to trackdown why a test was inserted in the skiplist, and one of the ways is through bugs. This feature add the information regarding it in the list of skipped tests on os_tempest
id: Tambahkan launchpad dan kunci bugzilla di tempest_test_blacklist variabel ansible. Pengembang harus memiliki cara untuk melacak mengapa tes dimasukkan dalam daftar kosong, dan salah satu caranya adalah melalui bug. Fitur ini menambahkan informasi mengenai hal ini dalam daftar tes yang dilewati pada os_tempest

source: Add the possibility to disable openrc v2 download in the dashboard. new var ``horizon_show_keystone_v2_rc`` can be set to ``False`` to remove the entry for the openrc v2 download.
id: Tambahkan kemungkinan untuk menonaktifkan unduhan openrc v2 di dasbor. var baru ``horizon_show_keystone_v2_rc`` dapat diatur ke ``False`` untuk menghapus entri untuk unduhan openrc v2.

source: Add the possibility to use python-tempestconf tool to generate tempest.conf file, rather than use the role template.
id: Tambahkan kemungkinan untuk menggunakan alat python-tempestconf untuk menghasilkan file tempest.conf, daripada menggunakan templat peran.

source: Added 2 new varibles for all groups - `oslomsg_notify_policies` and `oslomsg_rpc_policies`. These variables contain default rabbitmq policies, which will be applied for every rabbitmq vhost. As for now they will enable [HA mode](https://www.rabbitmq.com/ha.html) for all vhosts. If you would like to disable HA mode just set these variables to empty lists inside your `user_config.yml`
id: Menambahkan 2 variabel baru untuk semua grup - `oslomsg_notify_policies` dan `oslomsg_rpc_policies`. Variabel ini mengandung kebijakan rabbitmq default, yang akan diterapkan untuk setiap rabbitmq vhost. Adapun saat ini mereka akan mengaktifkan [mode HA](https://www.rabbitmq.com/ha.html) untuk semua vhosts. Jika Anda ingin menonaktifkan mode HA, cukup atur variabel ini ke daftar kosong di dalam `user_config.yml` Anda

source: Added ``cinder_auth_strategy`` variable to configure Cinder's auth strategy since Cinder can work in noauth mode as well.
id: Menambahkan variabel ``cinder_auth_strategy`` untuk mengkonfigurasi strategi autentikasi Cinder karena Cinder juga dapat bekerja dalam mode noauth.

source: Added ``horizon_apache_custom_log_format`` tunable to the os-horizon role for changing CustomLog format. Default is "combined".
id: Menambahkan ``horizon_apache_custom_log_format`` yang dapat disetel ke peran os-horizon untuk mengubah format CustomLog. Default adalah "combined".

source: Added a boolean var `haproxy_service_enabled` to the `haproxy_service_configs` dict to support toggling haproxy endpoints on/off.
id: Menambahkan boolean var `haproxy_service_enabled` ke perintah `haproxy_service_configs` untuk mendukung pengalihan on/off endpoint haproxy.

source: Added a function in dynamic_inventory.py to improve the identification of incorrect settings inside the user config files.
id: Menambahkan fungsi di dynamic_inventory.py untuk meningkatkan identifikasi pengaturan yang salah di dalam file konfigurasi pengguna.

source: Added a new ``haproxy_extra_services`` var which will allow extra haproxy endpoint additions.
id: Menambahkan var ``haproxy_extra_services`` baru yang akan memungkinkan penambahan endpoint haproxy tambahan.

source: Added keystone_apache_custom_log_format tunable for changing CustomLog format. Default is "combined".
id: Menambahkan keystone_apache_custom_log_format tunable untuk mengubah format CustomLog. Default adalah "combined".

source: Added new parameter ```cirros_img_disk_format`` to support disk formats other than qcow2.
id: Menambahkan parameter baru ```cirros_img_disk_format`` untuk mendukung format disk selain qcow2.

source: Added new parameter ``tempest_services`` for setting tempest_service_available_{service_name} var automatically.
id: Menambahkan parameter baru ``tempest_services`` untuk pengaturan tempest_service_available_ {service_name} var secara otomatis.

source: Added new variable ``tempest_image_file``. This variable replaces the hard-coded value for the ``img_file`` setting in tempest.conf.j2. This will allow users to specify images other than cirros.
id: Menambahkan variabel baru ``tempest_image_file``. Variabel ini menggantikan nilai hard-coded untuk pengaturan ``img_file`` di tempest.conf.j2. Ini akan memungkinkan pengguna untuk menentukan image selain cirro.

source: Added new variable ``tempest_img_disk_format``. This variable replaces ``cirros_img_disk_format``.
id: Menambahkan variabel baru ``tempest_img_disk_format``. Variabel ini menggantikan ``cirros_img_disk_format``.

source: Added new variable ``tempest_img_name``.
id: Menambahkan variabel baru ``tempest_img_name``.

source: Added new variable ``tempest_img_url``. This variable replaces ``cirros_tgz_url`` and ``cirros_img_url``.
id: Menambahkan variabel baru ``tempest_img_url``. Variabel ini menggantikan ``cirros_tgz_url`` dan ``cirros_img_url``.

source: Added new variable ``tempest_volume_backend_names`` and updated templates/tempest.conf.j2 to point ``backend_names`` at this variable
id: Menambahkan variabel baru ``tempest_volume_backend_names`` dan templates/tempest.conf.j2 yang diperbarui ke point ``backend_names`` pada variabel ini

source: Added playbook for deploying Rally in the utility containers
id: Menambahkan playbook untuk menyebarkan Rally dalam kontainer utilitas

source: Added possibility to override ceph.conf partially by defining `ceph_client_ceph_conf_overrides` variable. It uses regular format of OpenStack-Ansible overrides. From now on, config_template plugin should be present for ansible.
id: Menambahkan kemungkinan untuk menimpa ceph.conf sebagian dengan mendefinisikan variabel `ceph_client_ceph_conf_overrides`. Ini menggunakan format reguler dari menimpa OpenStack-Ansible. Mulai sekarang, config_template plugin harus ada untuk ansible.

source: Added storage policy so that deployers can override how to store the logs. ``per_host`` stores logs in a sub-directory per host. ``per_program`` stores logs in a single file per application which facilitates troubleshooting easy.
id: Menambahkan kebijakan penyimpanan sehingga pengalih dapat menimpa cara menyimpan log. ``per_host`` menyimpan log di sub-direktori per host. ``per_program`` menyimpan log dalam satu file per aplikasi yang memudahkan pemecahan masalah.

source: Added support for ironic-OneView drivers. Check the documentation on how to enable them.
id: Dukungan tambahan untuk driver ironic-OneView. Periksa dokumentasi tentang cara mengaktifkannya.

source: Added support for specifying GID and UID for cinder system user by defining ``cinder_system_user_uid`` and ``cinder_system_group_gid``. This setting is optional.
id: Menambahkan dukungan untuk menentukan GID dan UID untuk pengguna sistem cinder dengan mendefinisikan ``cinder_system_user_uid`` dan ``cinder_system_group_gid``. Pengaturan ini opsional.

source: Added support for using mod_auth_openidc instead of shibboleth as a service provider for supporting users who have a preference to use OIDC for federation. Mod_auth_openidc is the apache module that is recommended in the keystone documentation for implementing openidc. Added a variable to called apache_mod to keystone_sp, if left undefined shibboleth will continue to be installed by default provided keystone_sp is not empty. Mod_auth_openidc will not be installed unless it is spelled correctly, any misspellings will result in a shibboleth install. Note that installing shibboleth on Debian based metal distro deployments may break services that depend on libcurl4, as shib2 requires libcurl3, and they are unable to coexist. This can be resolved when there is a shib3 package available in a future release of Ubuntu/Debian. There is currently no support for simultaneous use of shibboleth2 and mod_auth_openidc.
id: Menambahkan dukungan untuk menggunakan mod_auth_openidc bukan shibboleth sebagai penyedia layanan untuk mendukung pengguna yang memiliki preferensi untuk menggunakan OIDC untuk federasi. Mod_auth_openidc adalah modul apache yang direkomendasikan dalam dokumentasi keystone untuk mengimplementasikan openidc. Menambahkan variabel yang disebut apache_mod ke keystone_sp, jika dibiarkan shibboleth yang tidak terdefinisi akan terus diinstal secara default asalkan keystone_sp tidak kosong. Mod_auth_openidc tidak akan diinstal kecuali jika dieja dengan benar, kesalahan ejaan akan menghasilkan pemasangan shibboleth. Perhatikan bahwa menginstal shibboleth pada penyebaran distro berbasis logam Debian dapat memutuskan layanan yang bergantung pada libcurl4, karena shib2 membutuhkan libcurl3, dan mereka tidak dapat hidup berdampingan. Ini dapat diatasi ketika ada paket shib3 yang tersedia dalam rilis Ubuntu/Debian di masa mendatang. Saat ini tidak ada dukungan untuk penggunaan simultan shibboleth2 dan mod_auth_openidc.

source: Added the ``lxc_container_recreate`` option, which will destroy then recreate LXC containers. The container names and IP addresses will remain the same, as will the MAC addresses of any containers using the ``lxc_container_fixed_mac`` setting.
id: Menambahkan opsi ``lxc_container_recreate``, yang akan menghancurkan kemudian membuat ulang kontainer LXC. Nama kontainer dan alamat IP akan tetap sama, seperti halnya alamat MAC dari kontainer apa pun menggunakan pengaturan ``lxc_container_fixed_mac``.

source: Added the ability to configure vendor data for Nova in order to be able to push things via the metadata service or config drive.
id: Menambahkan kemampuan untuk mengonfigurasikan data vendor untuk Nova agar dapat mendorong berbagai hal melalui layanan metadata atau drive konfigurasi.

source: Added variable `horizon_bind_address` which defines IP address where Apache will listen on `horizon_listen_ports`
id: Menambahkan variabel `horizon_bind_address` yang menentukan alamat IP tempat Apache akan mendengarkan di `horizon_listen_ports`

source: Added variables `cinder_active_active_cluster` and `cinder_active_active_cluster_name` that allow to explicitly enable or disable active/active feature, and set cluster name.
id: Menambahkan variabel `cinder_active_active_cluster` dan`cinder_active_active_cluster_name` yang memungkinkan untuk mengaktifkan atau menonaktifkan fitur aktif/aktif secara eksplisit, dan menetapkan nama kluster.

source: Added variables `horizon_session_engine` and `horizon_session_caches` which can be used to configure horizon session engine and a backend for it.
id: Menambahkan variabel `horizon_session_engine` dan`horizon_session_caches` yang dapat digunakan untuk mengkonfigurasi mesin sesi horizon dan backend untuk itu.

source: Added variables `magnum_cluster_templates` and `magnum_flavors` which allow deployers to define coe cluster template and nova flavors creation during role execution. These variables may contain list of resources to add. All keys supported by appropriate ansible modules may be passed as items in the list.
id: Variabel yang ditambahkan `magnum_cluster_templates` dan` magnum_flavours` yang memungkinkan para deployer untuk mendefinisikan coe cluster template dan pembuatan flavors nova selama eksekusi peran. Variabel-variabel ini mungkin berisi daftar sumber daya untuk ditambahkan. Semua kunci yang didukung oleh ansible modules yang sesuai dapat diteruskan sebagai item dalam daftar.

source: Adding a new nova.conf entry, live_migration_uri. This entry will default to a ``qemu-ssh://`` uri, which uses the ssh keys that have already been distributed between all of the compute hosts.
id: Menambahkan entri nova.conf baru, live_migration_uri. Entri ini akan secara default menjadi ``qemu-ssh://`` uri, yang menggunakan kunci ssh yang telah didistribusikan antara semua host komputasi.

source: Adding support for Mistral to be built as part of the repo build process.
id: Menambahkan dukungan untuk Mistral untuk dibangun sebagai bagian dari proses pembuatan repo.

source: Adding the ``os-mistral-install.yml`` file to deploy mistral to hosts tagged with hostgroup ``mistral_all``
id: Menambahkan file ``os-mistral-install.yml`` untuk menyebarkan mistral ke host yang ditandai dengan hostgroup ``mistral_all``

source: Additional libvirt ceph client secrets can be defined to support attaching volumes from different ceph clusters.
id: Rahasia klien libvirt ceph tambahan dapat didefinisikan untuk mendukung pelampiran (attaching) volume dari berbagai cluster ceph.

source: Additional volume-types can be created by defining a list named ``extra_volume_types`` in the desired backend of the variable(s) ``cinder_backends``
id: Tipe volume tambahan dapat dibuat dengan mendefinisikan daftar yang bernama ``extra_volume_types`` di backend variabel yang diinginkan ``cinder_backends``

source: Adds a new flag to enable Octavia V2 API (disabled by default) to facilitate to run Octavia stand alone (without Neutron)
id: Menambahkan flag baru untuk mengaktifkan Octavia V2 API (dinonaktifkan secara default) untuk memfasilitasi menjalankan Octavia berdiri sendiri (tanpa Neutron)

source: Adds a new flag to toggle Octavia V1 API (the API needed to run in conjunction with Neutron) and enables it by default.
id: Menambahkan flag baru untuk mengaktifkan Octavia V1 API (API yang diperlukan untuk berjalan bersama dengan Neutron) dan mengaktifkannya secara default.

source: Adds a way for the system to automatically create the Octavia management network if octavia_service_net_setup is enabled (DEFAULT). Additional parameters can control the setup.
id: Menambahkan cara bagi sistem untuk secara otomatis membuat jaringan manajemen Octavia jika octavia_service_net_setup diaktifkan (DEFAULT). Parameter tambahan dapat mengontrol pengaturan.

source: Adds iptables rules to block taffic from the octavia managment network to the octavia container for both ipv4 and ipv6.
id: Menambahkan aturan iptables untuk memblokir lalu lintas dari jaringan manajemen octavia ke kontainer octavia untuk ipv4 dan ipv6.

source: Adds new variable `tempest_tempestconf_profile_extras` which allows to extend `tempest_tempestconf_profile` dictionary without need to override all existing keys. `tempest_tempestconf_profile_extras` has presedence over `tempest_tempestconf_profile`. For example, it may be used to define extra image or it's format.
id: Menambahkan variabel baru `tempest_tempestconf_profile_extras` yang memungkinkan untuk diperpanjang `tempest_tempestconf_profile` dictionary tanpa perlu mengganti semua kunci yang ada. `tempest_tempestconf_profile_extras` lebih diutamakan `tempest_tempestconf_profile`. Misalnya, ini dapat digunakan untuk menentukan image ekstra atau formatnya.

source: Adds support for glance-image-id and automatic uploading of the image if octavia_amp_image_upload_enabled is True (Default is False). This is mostly tp work around the limitations of Ansible's OpenStack support and should not be used in prodcution settings. Instead refer to the documentation to upload images yourself.
id: Menambahkan dukungan untuk glance-image-id dan mengunggah otomatis image jika octavia_amp_image_upload_enabled adalah True (Default is False). Ini sebagian besar adalah untuk mengatasi keterbatasan dukungan OpenStack Ansible dan tidak boleh digunakan dalam pengaturan produksi. Alih-alih merujuk pada dokumentasi untuk mengunggah image sendiri.

source: Adds support for the horizon ironic-ui dashboard. The dashboard will be automatically enabled if any ironic hosts are defined.
id: Menambahkan dukungan untuk dasbor ironic-ui horizon. Dasbor akan diaktifkan secara otomatis jika ada host ironis ditentukan.

source: Adds support for the horizon magnum-ui dashboard. The dashboard will be automatically enabled if any magnum hosts are defined.
id: Menambahkan dukungan untuk dashboard horizon magnum-ui. Dasbor akan diaktifkan secara otomatis jika ada host magnum yang ditentukan.

source: Adds support for the horizon octavia-ui dashboard. The dashboard will be automatically enabled if any octavia hosts are defined. If both Neutron LBaaSv2 and Octavia are enabled, two Load Balancer panels will be visible in Horizon.
id: Menambahkan dukungan untuk dasbor horizon octavia-ui. Dasbor akan diaktifkan secara otomatis jika ada host octavia yang ditentukan. Jika Neutron LBaaSv2 dan Octavia diaktifkan, dua panel Load Balancer akan terlihat di Horizon.

source: Adds support for the horizon trove-ui dashboard. The dashboard will be automatically enabled if any trove hosts are defined.
id: Menambahkan dukungan untuk dasbor trove-ui horizon. Dasbor akan diaktifkan secara otomatis jika ada trove host yang ditentukan.
