Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: Capping the default value for the variables ``heat_api_workers`` and ``heat_engine_workers`` to 16 when the user doesn't configure these variables. Default value is half the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``heat_api_workers`` dan ``heat_engine_workers`` hingga 16 ketika pengguna tidak mengkonfigurasi variabel ini. Nilai default adalah setengah dari jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: Capping the default value for the variables ``horizon_wsgi_processes`` and ``horizon_wsgi_threads`` to 16 when the user doesn't configure these variables. Default value is half the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``horizon_wsgi_processes`` dan ``horizon_wsgi_threads`` hingga 16 saat pengguna tidak mengonfigurasi variabel ini. Nilai default adalah setengah dari jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: Capping the default value for the variables ``neutron_api_workers``, ``neutron_num_sync_threads`` and ``neutron_metadata_workers`` to 16 when the user doesn't configure these variables. Default value is half the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``neutron_api_workers``, ``neutron_num_sync_threads`` dan ``neutron_metadata_workers`` ke 16 ketika pengguna tidak mengkonfigurasi variabel ini. Nilai default adalah setengah dari jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: Capping the default value for the variables ``nova_wsgi_processes``, ``nova_osapi_compute_workers``, ``nova_metadata_workers`` and ``nova_conductor_workers`` to 16 when the user doesn't configure these variables. Default value is half the number of vCPUs available on the machine with a capping value of 16.
id: Pembatasan nilai default untuk variabel ``nova_wsgi_processes``, ``nova_osapi_compute_workers``, ``nova_metadata_workers`` dan ``nova_conductor_workers`` ke 16 saat pengguna tidak mengkonfigurasi variabel ini. Nilai default adalah setengah dari jumlah vCPU yang tersedia di mesin dengan nilai pembatasan 16.

source: Ceilometer can now use Gnocchi for storage. By default this is disabled. To enable the service, set ``ceilometer_gnocchi_enabled: yes``. See the Gnocchi role documentation for more details.
id: Ceilometer sekarang dapat menggunakan Gnocchi untuk penyimpanan. Secara default ini dinonaktifkan. Untuk mengaktifkan layanan, atur ``ceilometer_gnocchi_enabled: yes``. Lihat dokumentasi peran Gnocchi untuk lebih jelasnya.

source: Ceilometer does not support V3 endpoints in Liberty, which are the flavor created by OSA. To deploy Ceilometer some endpoints in the Keystone service catalog must be removed and replaced with V2 endpoints. This is neccessary, for example, to use the Swift pollster to collect metrics for Swift storage use the Swift endpoint. For detailed instructions on the steps for these changes to the service catalog see the `OpenStack Liberty Install Guide <http://docs.openstack.org/liberty>`.
id: Ceilometer tidak mendukung titik akhir V3 di Liberty, yang merupakan flavor yang diciptakan oleh OSA. Untuk menggunakan Ceilometer, beberapa endpoint dalam katalog layanan Keystone harus dihapus dan diganti dengan endpoint V2. Ini diperlukan, misalnya, untuk menggunakan jajak pendapat Swift untuk mengumpulkan metrik untuk penyimpanan Swift menggunakan endpoint Swift. Untuk petunjuk terperinci tentang langkah-langkah untuk perubahan ini pada katalog layanan, lihat `OpenStack Liberty Install Guide <http://docs.openstack.org/liberty>`.

source: Ceilometer no longer manages alarm storage when Aodh is enabled. It now redirects alarm-related requests to the Aodh API. This is now auto-enabled when Aodh is deployed.
id: Ceilometer tidak lagi mengelola penyimpanan alarm ketika Aodh diaktifkan. Sekarang pengalihan permintaan terkait alarm ke Aodh API. Ini sekarang diaktifkan secara otomatis ketika Aodh digunakan.

source: Ceilometer now uses the Keystone v3 endpoint. The 'identity_uri' directive has been removed since it's unused. 'region_name' has been added. The directives under 'service_credentials' have been updated to support the keystoneauth library
id: Ceilometer sekarang menggunakan endpoint Keystone v3. Arahan 'identity_uri' telah dihapus karena tidak digunakan. 'region_name' telah ditambahkan. Arahan di bawah 'service_credentials' telah diperbarui untuk mendukung perpustakaan keystoneauth

source: CentOS 7 and Ubuntu 16.04 support have been added to the ``haproxy`` role.
id: Dukungan CentOS 7 dan Ubuntu 16.04 telah ditambahkan ke role ``haproxy``.

source: CentOS 7 support has been added to the ``galera_client`` role.
id: Dukungan CentOS 7 telah ditambahkan ke role ``galera_client``.

source: CentOS 7 support has been added to the ``galera_server`` role.
id: Dukungan CentOS 7 telah ditambahkan ke role ``galera_server``.

source: CentOS deployments require a special COPR repository for modern LXC packages. The COPR repository is not mirrored at this time and this causes failed gate tests and production deployments.
id: Deployment CentOS memerlukan repositori COPR khusus untuk paket LXC modern. Repositori COPR tidak dicerminkan pada saat ini dan ini menyebabkan tes gate gagal dan deployment produksi.

source: CentOS7 support has been added to the ``rsyslog_client`` role.
id: Dukungan CentOS 7 telah ditambahkan ke role ``rsyslog client``.

source: CentOS7/RHEL support has been added to the ceph_client role.
id: Dukungan CentOS7/RHEL telah ditambahkan ke role ceph_client.

source: CentOS7/RHEL support has been added to the os_aodh role.
id: Dukungan CentOS7/RHEL telah ditambahkan ke peran os_aodh.

source: CentOS7/RHEL support has been added to the os_ceilometer role.
id: Dukungan CentOS7/RHEL telah ditambahkan ke role os_ceilometer.

source: CentOS7/RHEL support has been added to the os_cinder role.
id: Dukungan CentOS7/RHEL telah ditambahkan ke role os_cinder.

source: CentOS7/RHEL support has been added to the os_designate role.
id: Dukungan CentOS7/RHEL telah ditambahkan ke role os_designate.

source: CentOS7/RHEL support has been added to the os_glance role.
id: Dukungan CentOS7/RHEL telah ditambahkan ke role os_glance.

source: CentOS7/RHEL support has been added to the os_gnocchi role.
id: Dukungan CentOS7/RHEL telah ditambahkan ke role os_gnocchi.

source: CentOS7/RHEL support has been added to the os_heat role.
id: Dukungan CentOS7/RHEL telah ditambahkan ke role os_heat.

source: CentOS7/RHEL support has been added to the os_horizon role.
id: Dukungan CentOS7/RHEL telah ditambahkan ke role os_horizon.

source: CentOS7/RHEL support has been added to the os_keystone role.
id: Dukungan CentOS7/RHEL telah ditambahkan ke role os_keystone.

source: CentOS7/RHEL support has been added to the os_neutron role.
id: Dukungan CentOS7/RHEL telah ditambahkan ke peran os_neutron.

source: CentOS7/RHEL support has been added to the os_nova role.
id: Dukungan CentOS7 / RHEL telah ditambahkan ke role os_nova.

source: CentOS7/RHEL support has been added to the os_swift role.
id: Dukungan CentOS7 / RHEL telah ditambahkan ke role os_swift.

source: Ceph storage backend is known not to work on openSUSE Leap 42.X yet. This is due to missing openSUSE support in the upstream Ceph Ansible playbooks.
id: Backend penyimpanan Ceph diketahui belum bekerja pada openSUSE Leap 42.X. Ini karena tidak adanya dukungan openSUSE di playbook Ceph Ansible hulu.

source: Change the ``ansible-role-requirements.yml`` file to include the URL and git SHA for your patched fork of the os_neutron role.
id: Ubah file ``ansible-role-requirement.yml`` untuk memasukkan URL dan git SHA untuk fork patched Anda dari role os_neutron.

source: Change the ``ansible-role-requirements.yml`` file to include the URL and git SHA for your patched fork of the repo_build role.
id: Ubah file ``ansible-role-requirement.yml`` untuk memasukkan URL dan git SHA untuk patched fork Anda dari role repo_build.

source: Change the port for devices in the ring by adjusting the port value for services, hosts, or devices. This will not involve a rebalance of the ring.
id: Ubah port untuk device di atas ring dengan menyesuaikan nilai port untuk layanan, host, atau device. Ini tidak akan melibatkan rebalance the ring.

source: Changed the default NTP server options in ``chrony.conf``. The ``offline`` option has been removed, ``minpoll``/``maxpoll`` have been removed in favour of the upstream defaults, while the ``iburst`` option was added to speed up initial time synchronization.
id: Mengubah opsi server NTP default di ``chrony.conf``. Opsi ``offline`` telah dihapus,``minpoll``/``maxpoll`` telah dihapus karena standar upstream, sementara opsi ``iburst`` ditambahkan untuk mempercepat sinkronisasi waktu awal.

source: Changed the way we name host containers groups in dynamic_inventory.py for a hostname from hostname_containers to hostname-host_containers to prevent failing in the case where containers groups have the same name as host containers when choosing hostnames inspired from containers group names. This change fixes the following bugs https://bugs.launchpad.net/openstack-ansible/+bug/1512883 and https://bugs.launchpad.net/openstack-ansible/+bug/1528953.
id: Mengubah cara kami memberi nama grup container host di dynamic_inventory.py untuk nama host dari hostname_containers menjadi hostname-host_containers untuk mencegah kegagalan dalam kasus di mana grup kontainer memiliki nama yang sama dengan container host ketika memilih nama host yang terinspirasi dari nama grup kontainer. Perubahan ini memperbaiki bug berikut https://bugs.launchpad.net/openstack-ansible/+bug/1512883 dan https://bugs.launchpad.net/openstack-ansible/+bug/1528953.

source: Changing the port for a device, or group of devices, carries a brief period of downtime to the swift storage services for those devices. The devices will be unavailable during period between when the storage service restarts after the port update, and the ring updates to match the new port.
id: Mengubah port untuk device, atau grup device, membawa periode singkat downtime ke layanan penyimpanan cepat untuk device tersebut. Device tidak akan tersedia selama periode antara saat layanan penyimpanan restart setelah update port, dan update ring untuk mencocokkan port baru.

source: Changing to the ESL repos has no upgrade impact. The version of erlang provided by ESL is newer than that what is found in the distro repos. Furthermore, a pin has been added to ensure that APT always uses the ESL repos as it's preferred source which has been done to simply ensure APT is always pointed at ESL.
id: Mengubah ke repo ESL tidak memiliki dampak upgrade. Versi erlang yang disediakan oleh ESL lebih baru daripada yang ditemukan di repro distro. Selain itu, pin telah ditambahkan untuk memastikan bahwa APT selalu menggunakan repo ESL sebagai sumber pilihan yang telah dilakukan untuk memastikan bahwa APT selalu diarahkan ke ESL.

source: Cherry-pick https://review.openstack.org/557757 into the fork on that branch.
id: Cherry-pick https://review.openstack.org/557757 ke fork di branch itu.

source: Chrony got a new configuration option to synchronize the system clock back to the RTC using the ``security_ntp_sync_rtc`` variable. Disabled by default.
id: Chrony mendapat opsi konfigurasi baru untuk menyinkronkan jam sistem kembali ke RTC menggunakan variabel ``security_ntp_sync_rtc``. Dinonaktifkan secara default.

source: Cinder is deployed with Active-Active enabled by default if you are using Ceph as a backend storage.
id: Cinder dikerahkan dengan Active-Active diaktifkan secara default jika Anda menggunakan Ceph sebagai penyimpanan backend.

source: Cleanup tasks are added to remove the nova console git directories ``/usr/share/novnc`` and ``/usr/share/spice-html5``, prior to cloning these inside the nova vnc and spice console playbooks. This is necessary to guarantee that local modifications do not break git clone operations, especially during upgrades.
id: Tugas pembersihan ditambahkan untuk menghapus direktori ``/usr/share/novnc`` dan ``/usr/share/spice-html5``, sebelum mengkloningnya di dalam nova vnc dan spice console playbooks. Ini diperlukan untuk menjamin bahwa modifikasi lokal tidak merusak operasi git clone, terutama selama upgrade.

source: Code which added 'Acquire::http:No-Cache true' to the host and container apt preferences when http proxy environment variables were set has been removed. This setting is only required when working around issues introduced by badly configured http proxies. In some cases proxies can improperly cache the apt Releases and Packages files leading to package installation errors. If a deployment is behind a badly configured proxy, the deployer can add the necessary apt config fragment as part of host provisioning. OSA will replicate that config into any containers that are created. This setting can be removed from existing deployments if required by manually deleting the file ``/etc/apt/apt.conf.d/00apt-no-cache`` from all host and containers.
id: Kode yang menambahkan 'Acquire::http:No-Cache true' ke host dan preferensi apt container ketika variabel lingkungan proxy http disetel telah dihapus. Pengaturan ini hanya diperlukan saat mengatasi masalah yang diperkenalkan oleh proxy http yang tidak dikonfigurasi dengan benar. Dalam beberapa kasus, proxy dapat melakukan cache yang tidak tepat pada file Rilis dan Paket yang mengarah ke kesalahan instalasi paket. Jika penyebaran berada di belakang proxy yang dikonfigurasi dengan buruk, deployer dapat menambahkan fragmen apt config yang diperlukan sebagai bagian dari penyediaan host. OSA akan mereplikasi konfigurasi itu ke dalam container apa pun yang dibuat. Pengaturan ini dapat dihapus dari deployment yang ada jika diperlukan dengan menghapus file ``/etc/apt/apt.conf.d/00apt-no-cache`` secara manual dari semua host dan container.

source: Compare dict vars of before and after configuration to determine whether the config keys or values have changed so a configuration file will not be incorrectly marked as changed when only the ordering has changed.
id: Bandingkan vct dict sebelum dan sesudah konfigurasi untuk menentukan apakah kunci atau nilai konfigurasi telah berubah sehingga file konfigurasi tidak akan salah ditandai sebagai diubah ketika hanya pemesanan yang telah berubah.

source: Configurations using the ``ceph-ansible`` role (that is, those applying the ``ceph-install.yml`` or ``ceph-rgw-install.yml`` playbooks) should be very carefully reviewed if you are upgrading from prior ``stable/rocky`` releases. Those releases shipped a pre-release version of ``ceph-ansible`` that was unintentionally included in ``ansible-role-requirements.yml``.
id: Konfigurasi yang menggunakan peran ``ceph-ansible`` (yaitu, yang menerapkan playbook ``ceph-install.yml`` atau ``ceph-rgw-install.yml``) harus ditinjau dengan sangat hati-hati jika Anda memutakhirkan dari rilis ``stable/rocky`` sebelumnya. Rilis itu mengirimkan versi pra-rilis dari ``ceph-ansible`` yang secara tidak sengaja termasuk dalam ``ansible-role-requirements.yml``.

source: Container boot ordering has been implemented on container types where it would be beneficial. This change ensures that stateful systems running within a container are started ahead of non-stateful systems. While this change has no impact on a running deployment it will assist with faster recovery should any node hosting container go down or simply need to be restarted.
id: Pemesanan boot kontainer telah diterapkan pada jenis kontainer di mana itu akan bermanfaat. Perubahan ini memastikan bahwa sistem stateful yang berjalan dalam suatu container dimulai di depan sistem non-stateful. Meskipun perubahan ini tidak berdampak pada penyebaran yang berjalan, itu akan membantu dengan pemulihan lebih cepat jika setiap container hosting node turun atau hanya perlu di-restarted.

source: Containers might fail to retrieve packages from the repo server when connecting to a slave repo server that has not finished synchronizing. For more information, see https://bugs.launchpad.net/openstack-ansible/+bug/1543146. This is addressed by adding pre and post hooks into lsyncd to connect to the slave repo servers and disable NGINX for the duration for the sync.
id: Kontainer mungkin gagal untuk mengambil paket dari server repo saat menghubungkan ke server repo slave yang belum selesai menyinkronkan. Untuk informasi lebih lanjut, lihat https://bugs.launchpad.net/openstack-ansible/+bug/1543146. Ini diatasi dengan menambahkan kait sebelum dan sesudah ke lsyncd untuk menyambung ke server repo slave dan menonaktifkan NGINX selama durasi sinkronisasi.

source: Containers will now bind mount all logs to the physical host machine in the "/openstack/log/{{ inventory_hostname }}" location. This change will ensure containers using a block backed file system (lvm, zfs, bfrfs) do not run into issues with full file systems due to logging.
id: Kontainer sekarang akan mengikat mount semua log ke mesin host fisik di lokasi "/openstack/log/{{ inventory_hostname }}". Perubahan ini akan memastikan kontainer menggunakan sistem file yang didukung blok (lvm, zfs, bfrfs) tidak mengalami masalah dengan sistem file lengkap karena logging.

source: Copy the logs from the container's filesystem to ``/openstack/log/{{ inventory_hostname }}`` on the host filesystem
id: Salin log dari sistem file wadah ke ``/openstack/log/{{ inventory_hostname }}`` pada sistem file host

source: Create a ``stable/newton`` branch in the fork based on the ``newton-eol`` tag.
id: Buat cabang ``stable/newton`` di fork berdasarkan tag ``newton-eol``.

source: Critical Issues
id: Critical Issue (masalah kritis)

source: Current Series Release Notes
id: Catatan Rilis Seri Saat Ini

source: Data structure for ``tempest_test_blacklist`` has been updated to add launchpad and/or bugzilla linked with the test being skipped.
id: Struktur data untuk ``tempest_test_blacklist`` telah diperbarui untuk menambahkan launchpad dan/atau bugzilla yang ditautkan dengan tes yang dilewati.

source: Database migration tasks have been added for the FWaaS neutron plugin.
id: Tugas migrasi database telah ditambahkan untuk plugin neutron FWaaS.

source: Database migration tasks have been added for the LBaaS neutron plugin.
id: Tugas migrasi database telah ditambahkan untuk plugin neutron LBaaS.

source: Database migration tasks have been added for the dynamic routing neutron plugin.
id: Tugas migrasi database telah ditambahkan untuk plugin neutron routing dinamis.

source: Default quotas were bumped for the following resources: networks (from 10 to 100), subnets (from 10 to 100), ports (from 50 to 500) to match upstream defaults.
id: Kuota default berbenturan dengan sumber daya berikut: jaringan (dari 10 hingga 100), subnet (dari 10 hingga 100), port (dari 50 hingga 500) untuk mencocokkan default hulu.

source: Deleting variable entries from the ``global_overrides`` dictionary in ``openstack_user_config.yml`` now properly removes those variables from the ``openstack_inventory.json`` file. See Bug
id: Menghapus entri variabel dari kamus ``global_overrides`` di ``openstack_user_config.yml`` sekarang dengan benar menghapus variabel-variabel itu dari file ``openstack_inventory.json``. Lihat Bug

source: Depending on when the initial Kilo deployment was done it is possible the repository servers have a pip.conf locking down the environment which limits the packages available to to install. If this file is present it will cause build failures as the repository server attempts to build Liberty packages.
id: Bergantung pada kapan deployment Kilo awal dilakukan, ada kemungkinan server repositori memiliki pip.conf mengunci lingkungan yang membatasi paket yang tersedia untuk diinstal. Jika file ini ada, itu akan menyebabkan kegagalan build karena server repositori mencoba membangun paket Liberty.

source: Deployers can `galera_disable_privatedevices` to `yes` to set `PrivateDevices=false` in the systemd unit file for MariaDB on CentOS 7. The default is `no`, which keeps the default systemd unit file settings from the MariaDB package.
id: Deployer dapat `galera_disable_privatedevices` ke `yes` untuk mengatur `PrivateDevices = false` dalam file systemd unit untuk MariaDB pada CentOS 7. Standarnya adalah `no`, yang menyimpan pengaturan file systemd unit standar dari paket MariaDB.

source: Deployers can `memcached_disable_privatedevices` to `yes` to set `PrivateDevices=false` in the systemd unit file for MariaDB on CentOS 7. The default is `no`, which keeps the default systemd unit file settings from the MemcacheD package.
id: Deployer dapat `memcached_disable_privatedevices` ke `yes` untuk mengatur `PrivateDevices = false` dalam file systemd unit untuk MariaDB pada CentOS 7. Standarnya adalah `no`, yang menyimpan pengaturan file systemd unit standar dari paket MemcacheD.

source: Deployers can also shut down and power on galera containers **one at a time** manually if that method is preferred.
id: Penyebar juga dapat mematikan dan menyalakan container galera **one at a time** secara manual jika metode itu lebih disukai.

source: Deployers can enable this configuration by setting an Ansible variable:
id: Deployer dapat mengaktifkan konfigurasi ini dengan menetapkan variabel Ansible:

source: Deployers can now blacklist certain Nova extensions by providing a list of such extensions in ``horizon_nova_extensions_blacklist`` variable, for example:
id: Deployer sekarang dapat membuat blacklist ekstensi Nova tertentu dengan memberikan daftar ekstensi tersebut dalam variabel ``horizon_nova_extensions_blacklist``, misalnya:

source: Deployers can now configure tempest public and private networks by setting the following variables, 'tempest_private_net_provider_type' to either vxlan or vlan and 'tempest_public_net_provider_type' to flat or vlan. Depending on what the deployer sets these variables to, they may also need to update other variables accordingly, this mainly involves 'tempest_public_net_physical_type' and 'tempest_public_net_seg_id'. Please refer to http://docs.openstack.org/mitaka/networking-guide/intro-basic-networking.html for more neutron networking information.
id: Deployer sekarang dapat mengkonfigurasi tempest jaringan publik dan pribadi dengan mengatur variabel berikut, 'tempest_private_net_provider_type' ke vxlan atau vlan dan 'tempest_public_net_provider_type' ke flat atau vlan. Bergantung pada apa yang digunakan setel variabel ini, mereka mungkin juga perlu memperbarui variabel lain yang sesuai, ini terutama melibatkan 'tempest_public_net_physical_type' dan 'tempest_public_net_seg_id'. Silakan merujuk ke http://docs.openstack.org/mitaka/networking-guide/intro-basic-networking.html untuk informasi jaringan neutron lainnya.

source: Deployers can now define a cinder-backend volume type explicitly private or public with option ``public`` set to true or false.
id: Deployer sekarang dapat menentukan jenis volume cinder-backend secara eksplisit privat atau publik dengan opsi ``publik`` disetel ke true atau false.

source: Deployers can now define the override ``cinder_rpc_executor_thread_pool_size`` which defaults to 64
id: Deployer sekarang dapat mendefinisikan override ``cinder_rpc_executor_thread_pool_size`` yang secara default adalah 64

source: Deployers can now define the override ``cinder_rpc_response_timeout`` which defaults to 60
id: Deployer sekarang dapat menentukan override ``cinder_rpc_response_timeout`` yang secara default menjadi 60
