Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: Galera healthcheck has been improved, and relies on an xinetd service. By default, the service is unaccessible (filtered with the no_access directive). You can override the directive by setting any xinetd valid value to ``galera_monitoring_allowed_source``.
id: Galera healthcheck telah ditingkatkan, dan bergantung pada layanan xinetd. Secara default, layanan tidak dapat diakses (difilter dengan arahan no_access). Anda dapat mengganti arahan dengan mengatur nilai xinetd yang valid ke ``galera_monitoring_allowed_source``.

source: Generating and validating checksums for all files installed by packages is now disabled by default. The check causes delays in playbook runs and it can consume a significant amount of CPU and I/O resources. Deployers can re-enable the check by setting ``security_check_package_checksums`` to ``yes``.
id: Membuat dan memvalidasi checksum untuk semua file yang diinstal oleh paket sekarang dinonaktifkan secara default. Pemeriksaan menyebabkan keterlambatan dalam menjalankan playbook dan dapat mengkonsumsi sejumlah besar sumber daya CPU and I/O. Deployer dapat mengaktifkan kembali pemeriksaan dengan mengatur ``security_check_package_checksums`` ke ``yes``.

source: Generation of records for `/etc/hosts` is now made with blockinfile ansible module. During upgrade you will have records doubled in yours `/etc/hosts` as we don't drop previously created records for safety reasons if `openstack_host_manage_hosts_file` is set to true.
id: Pembuatan catatan untuk `/etc/hosts` sekarang dibuat dengan modul blockinfile ansible. Selama upgrade, Anda akan memiliki catatan dua kali lipat di milik Anda `/etc/hosts` karena kami tidak menjatuhkan catatan yang dibuat sebelumnya untuk alasan keamanan jika`openstack_host_manage_hosts_file` disetel ke true.

source: Get ceph keyrings from files, if variable``ceph_keyrings_dir`` is defined the keyrings will be extracted from files. All files in the directory must have ``.keyring`` extention and be named with its corresponding ``ceph_client`` name. For example, if ``cinder_ceph_client`` is ``cinder`` the cinder keyring file must be named ``cinder.keyring``. Each file must contain username and the key and nothing more, below an example for cinder.keyring content.
id: Dapatkan key ceph dari file, jika variabel``ceph_keyrings_dir`` didefinisikan, keyrings akan diekstraksi dari file. Semua file dalam direktori harus memiliki ekstensi ``.keyring`` dan dinamai dengan nama ``ceph_client`` yang sesuai. Sebagai contoh, jika ``cinder_ceph_client`` adalah `` cinder`` file keyring cinder harus dinamai `` cinder.keyring``. Setiap file harus mengandung nama pengguna dan kunci dan tidak lebih, di bawah contoh untuk konten cinder.keyring.

source: Glance containers will be rebooted to add the glance cache bind mount if glance_default_store is set to file and nfs is not in use.
id: Glance container akan di-boot ulang untuk menambahkan glance cache mengikat mount direktorinya jika glance_default_store diatur ke file dan nfs tidak digunakan.

source: Glance containers will now bind mount the default glance cache directory from the host when glance_default_store is set to file and nfs is not in use. With this change, the glance file cache size is no longer restricted to the size of the container file system.
id: Glance container sekarang akan mengikat mount direktori cache glance default dari host ketika glance_default_store diatur ke file dan nfs tidak digunakan. Dengan perubahan ini, ukuran cache file glance tidak lagi terbatas pada ukuran sistem file kontainer.

source: Glance registry service has been finally removed
id: Layanan pendaftaran Glance akhirnya telah dihapus

source: Gnocchi is available for deploy as a metrics storage service. At this time it does not integrate with Aodh or Ceilometer. To deploy Aodh or Ceilometer to use Gnocchi as a storage / query API, each must be configured appropriately with the use of overrides as described in the configuration guides for each of these services.
id: Gnocchi tersedia untuk digunakan sebagai layanan penyimpanan metrik. Pada saat ini tidak terintegrasi dengan Aodh atau Ceilometer. Untuk menerapkan Aodh atau Ceilometer untuk menggunakan Gnocchi sebagai storage/query API, masing-masing harus dikonfigurasikan dengan tepat dengan menggunakan override seperti yang dijelaskan dalam panduan konfigurasi untuk masing-masing layanan ini.

source: Gnocchi is now used as the default publisher.
id: Gnocchi sekarang digunakan sebagai penerbit default.

source: Gnocchi migrated from usage of Apache mod_wsgi or native daemon to uWSGI daemon. This means, that some variables are not available and has no effect anymore, specifically * `gnocchi_use_mod_wsgi` * `gnocchi_apache_*` * `gnocchi_ssl*` (except `gnocchi_ssl_external` - it's still in place) * `gnocchi_user_ssl_*`
id: Gnocchi bermigrasi dari penggunaan Apache mod_wsgi atau daemon asli ke daWSGI daemon. Ini berarti, bahwa beberapa variabel tidak tersedia dan tidak berpengaruh lagi, khususnya * `gnocchi_use_mod_wsgi` * `gnocchi_apache_*` * `gnocchi_ssl*` (except `gnocchi_ssl_external` - it's still in place) * `gnocchi_user_ssl_*`

source: Gnocchi service endpoint variables were not named correctly. Renamed variables to be consistent with other roles.
id: Variabel endpoint layanan Gnocchi tidak diberi nama dengan benar. Mengganti nama (renamed) variabel agar konsisten dengan peran lain.

source: HAProxy services that use backend nodes that are not in the Ansible inventory can now be specified manually by setting ``haproxy_backend_nodes`` to a list of ``name`` and ``ip_addr`` settings.
id: Layanan HAProxy yang menggunakan node backend yang tidak ada dalam inventaris yang dimungkinkan sekarang dapat ditentukan secara manual dengan mengatur ``haproxy_backend_nodes`` ke daftar pengaturan ``name`` dan ``ip_addr``.

source: Haproxy has a new backend to support using the repo server nodes as a git server. The new backend is called "repo_git" and uses port "9418". Default ACLs have been created to lock down the port's availability to only internal networks originating from an RFC1918 address.
id: Haproxy memiliki backend baru untuk didukung menggunakan node server repo sebagai server git. Backend baru disebut "repo_git" dan menggunakan port "9418". ACL default telah dibuat untuk mengunci ketersediaan port hanya untuk jaringan internal yang berasal dari alamat RFC1918.

source: Haproxy has a new backend to support using the repo server nodes as a package manager cache. The new backend is called "repo_cache" and uses port "3142" and a single active node. All other nodes within the pool are backups and will be promoted if the active node goes down. Default ACLs have been created to lock down the port's availability to only internal networks originating from an RFC1918 address.
id: Haproxy memiliki backend baru untuk didukung menggunakan node server repo sebagai cache manajer paket. Backend baru disebut "repo_cache" dan menggunakan port "3142" dan satu node aktif. Semua node lain di dalam kumpulan adalah cadangan dan akan dipromosikan jika node aktif turun. ACL default telah dibuat untuk mengunci ketersediaan port hanya untuk jaringan internal yang berasal dari alamat RFC1918.

source: Haproxy-server role allows to set up tunable parameters. For doing that it is necessary to set up a dictionary of options in the config files, mentioning those which have to be changed (defaults for the remaining ones are programmed in the template). Also "maxconn" global option made to be tunable.
id: Peran Haproxy-server memungkinkan untuk mengatur parameter yang bisa disetel. Untuk melakukan itu perlu mengatur kamus opsi dalam file konfigurasi, menyebutkan yang harus diubah (default untuk parameter lainnya diprogram dalam templat). Juga opsi global "maxconn" dibuat agar bisa ditala (tunable).

source: Horizon deployment now supports an operator provided customization module which can be configured using the ``horizon_customization_module`` variable. Please see `the Horizon documentation <http://docs.openstack.org/developer/openstack-ansible/mitaka/install-guide/configure-horizon.html>`_ for more information.
id: Deployment Horizon sekarang mendukung modul kustomisasi yang disediakan operator yang dapat dikonfigurasi menggunakan variabel ``horizon_customization_module``. Silakan lihat `the Horizon documentation <http://docs.openstack.org/developer/openstack-ansible/mitaka/install-guide/configure-horizon.html>` _ untuk informasi lebih lanjut.

source: Horizon deployments were broken due to an incorrect hostname setting being placed in the apache ServerName configuration. This caused Horizon startup failure any time debug was disabled.
id: Deployment Horizon rusak karena pengaturan nama host yang salah ditempatkan di konfigurasi ServerName apache. Ini menyebabkan kegagalan startup Horizon setiap kali debug dinonaktifkan.

source: Horizon disables password autocompletion in the browser by default, but deployers can now enable autocompletion by setting ``horizon_enable_password_autocomplete`` to ``True``.
id: Horizon menonaktifkan pelengkapan otomatis kata sandi di browser secara default, tetapi deployer sekarang dapat mengaktifkan pelengkapan otomatis dengan mengatur ``horizon_enable_password_autocomplete`` ke ``True``.

source: Horizon has, since OSA's inception, been deployed with HTTPS access enabled, and has had no way to turn it off. Some use-cases may want to access via HTTP instead, so this patch enables the following.
id: Horizon, sejak awal OSA, telah dikerahkan dengan akses HTTPS diaktifkan, dan tidak memiliki cara untuk mematikannya. Beberapa kasus penggunaan mungkin ingin diakses melalui HTTP, jadi patch ini memungkinkan yang berikut ini.

source: Horizon now has a boolean variable named ``horizon_enable_ha_router`` to enable Neutron HA router management.
id: Horizon sekarang memiliki variabel boolean bernama ``horizon_enable_ha_router`` untuk mengaktifkan manajemen router HA Neutron.

source: Horizon now has the ability to set arbitrary configuration options using global option ``horizon_config_overrides`` in YAML format. The overrides follow the same pattern found within the other OpenStack service overrides. `General documentation on overrides can be found here <http://docs.openstack.org/developer/openstack-ansible/install-guide/configure-openstack.html#overriding-openstack-configuration-defaults>`_.
id: Horizon sekarang memiliki kemampuan untuk mengatur opsi konfigurasi acak menggunakan opsi global ``horizon_config_overrides`` dalam format YAML. Override mengikuti pola yang sama dengan yang ditemukan pada override layanan OpenStack lainnya. `General documentation on overrides can be found here <http://docs.openstack.org/developer/openstack-ansible/install-guide/configure-openstack.html#overriding-openstack-configuration-defaults>` _.

source: Horizon's IPv6 support is now configurable with Ansible variables. Deployers can enable IPv6 support in Horizon by setting the following variable:
id: Dukungan Horizon IPv6 sekarang dapat dikonfigurasi dengan variabel Ansible. Deployer dapat mengaktifkan dukungan IPv6 di Horizon dengan menetapkan variabel berikut:

source: Horizon's IPv6 support is now enabled by default. This allows users to manage subnets with IPv6 addresses within the Horizon interface. Deployers can disable IPv6 support in Horizon by setting the following variable:
id: Dukungan Horizon IPv6 sekarang diaktifkan secara default. Ini memungkinkan pengguna untuk mengelola subnet dengan alamat IPv6 dalam antarmuka Horizon. Deployer dapat menonaktifkan dukungan IPv6 di Horizon dengan mengatur variabel berikut:

source: Host security hardening is now applied by default using the ``openstack-ansible-security`` role. Developers can opt out by setting the ``apply_security_hardening`` Ansible variable to ``false``. For more information about the role and the changes it makes, refer to the `openstack-ansible-security documentation <http://docs.openstack.org/developer/openstack-ansible-security/>`_.
id: Pengerasan keamanan host sekarang diterapkan secara default menggunakan peran ``openstack-ansible-security``. Pengembang dapat memilih keluar dengan mengatur ``apply_security_hardening`` Variabel yang mungkin ke ``false``. Untuk informasi lebih lanjut tentang peran dan perubahan yang dibuatnya, lihat `openstack-ansible-security documentation <http://docs.openstack.org/developer/openstack-ansible-security/>`_.

source: Hosts running LXC on Ubuntu 14.04 will now need to enable the "trusty-backports" repository. The backports repo on Ubuntu 14.04 is now required to ensure LXC is updated to the latest stable version.
id: Host yang menjalankan LXC di Ubuntu 14.04 sekarang harus mengaktifkan repositori "trusty-backports". Repo backports di Ubuntu 14.04 sekarang diperlukan untuk memastikan LXC diperbarui ke versi stabil terbaru.

source: IPv6 support has been added for the LXC bridge network. This can be configured using ``lxc_net6_address``, ``lxc_net6_netmask``, and ``lxc_net6_nat``.
id: Dukungan IPv6 telah ditambahkan untuk jaringan jembatan LXC. Ini dapat dikonfigurasi menggunakan `` lxc_net6_address``, `` lxc_net6_netmask``, dan `` lxc_net6_nat``.

source: If HAProxy is used as the loadbalancer for a deployment it will generate a self-signed certificate by default. If HAProxy is NOT used, an SSL certificate should be installed on the external loadbalancer. The installation of an SSL certificate on an external load balancer is not covered by the deployment tooling.
id: Jika HAProxy digunakan sebagai loadbalancer untuk penempatan, HAProxy akan menghasilkan sertifikat yang ditandatangani sendiri secara default. Jika HAProxy TIDAK digunakan, sertifikat SSL harus dipasang pada loadbalancer eksternal. Pemasangan sertifikat SSL pada penyeimbang beban eksternal tidak dicakup oleh perkakas deployment.

source: If Horizon dashboard of OSA installation has a public FQDN, is it now possible to use LetsEncrypt certification service. Certificate will be generated within HAProxy installation and a cron entry to renew the certificate daily will be setup. Note that there is no certificate distribution implementation at this time, so this will only work for a single haproxy-server environment.
id: Jika Horizon dashboard instalasi OSA memiliki FQDN publik, apakah sekarang mungkin untuk menggunakan layanan sertifikasi LetsEncrypt. Sertifikat akan dihasilkan dalam instalasi HAProxy dan entri cron untuk memperbarui sertifikat setiap hari akan diatur. Perhatikan bahwa tidak ada implementasi distribusi sertifikat saat ini, jadi ini hanya akan berfungsi untuk lingkungan server haproxy tunggal.

source: If defined in applicable host or group vars the variable ``container_extra_networks`` will be merged with the existing ``container_networks`` from the dynamic inventory. This allows a deployer to specify special interfaces which may be unique to an indivdual container. An example use for this feature would be applying known fixed IP addresses to public interfaces on BIND servers for designate.
id: Jika didefinisikan dalam host atau grup vars yang berlaku, variabel ``container_extra_networks`` akan digabungkan dengan ``container_networks`` yang ada dari inventaris dinamis. Ini memungkinkan penyebar untuk menentukan antarmuka khusus yang mungkin unik untuk container individual. Contoh penggunaan untuk fitur ini adalah menerapkan alamat IP tetap yang dikenal ke antarmuka publik pada server BIND yang ditunjuk.

source: If newton is still in use and a new build is executed, the repo-build process will fail due to a new PBR library release which was issued after newton was declared end-of-life (EOL). This issue will show up if gnocchi is being used in the environment and may also show up as a venv build failure for other services. This issue can be resolved either by upgrading the environment to a recent OpenStack-Ansible Ocata release, or by doing the following.
id: Jika newton masih digunakan dan build baru dieksekusi, proses repo-build akan gagal karena rilis perpustakaan PBR baru yang dikeluarkan setelah newton dinyatakan sebagai end-of-life (EOL). Masalah ini akan muncul jika gnocchi digunakan di lingkungan dan mungkin juga muncul sebagai kegagalan pembangunan untuk layanan lain. Masalah ini dapat diatasi dengan memutakhirkan lingkungan ke rilis terbaru OpenStack-Ansible Ocata, atau dengan melakukan hal berikut.

source: If the `galera_server` role is deployed on a bare metal host, the MariaDB default is maintained (`PrivateDevices=true`). If the `galera_server` role is deployed within a container, the `PrivateDevices` configuration is set to `true` to work around a systemd bug with a bind mounted `/dev/ptmx`.
id: Jika peran `galera_server` digunakan pada bare metal host, standar MariaDB dipertahankan (`PrivateDevices = true`). Jika peran `galera_server` dikerahkan dalam sebuah container, konfigurasi `PrivateDevices` diatur ke `true` untuk mengatasi bug systemd dengan bind di-mount `/dev/ptmx`.

source: If the `memcached_server` role is deployed on a bare metal host, the default is maintained (`PrivateDevices=true`). If the role is deployed within a container, the `PrivateDevices` configuration is set to `true` to work around a systemd bug with a bind mounted `/dev/ptmx`.
id: Jika peran `memcached_server` digunakan pada bare metal host, standarnya dipertahankan (`PrivateDevices = true`). Jika peran ditempatkan dalam container, konfigurasi `PrivateDevices` diatur ke `true` untuk mengatasi bug systemd dengan bind di-mount `/dev/ptmx`.

source: If the cinder backup service is enabled with ``cinder_service_backup_program_enabled: True``, then heat will be configured to use the cinder backup service. The ``heat_cinder_backups_enabled`` variable will automatically be set to ``True``.
id: Jika layanan pencadangan cinder diaktifkan dengan ``cinder_service_backup_program_enabled: True``, maka heat akan dikonfigurasikan untuk menggunakan layanan pencadangan cinder. Variabel ``heat_cinder_backups_enabled`` akan secara otomatis diatur ke ``True``.

source: If the protocol of either the keystone admin or internal endpoints is 'https' and SSL is being terminated at a load balancer, tasks which verify that services are responsive and perform the initial service setup through through the keystone hosts' web server ports may fail.
id: Jika protokol admin keystone atau endpoint internal adalah 'https' dan SSL dihentikan di load balancer, tugas yang memverifikasi bahwa layanan responsif dan melakukan pengaturan layanan awal melalui port server web host keystone mungkin gagal.

source: If there are swift hosts in the environment, then the value for ``cinder_service_backup_program_enabled`` will automatically be set to ``True``. This negates the need to set this variable in ``user_variables.yml``, but the value may still be overridden at the deployer discretion.
id: Jika ada swift host di lingkungan, maka nilai untuk ``cinder_service_backup_program_enabled`` akan secara otomatis diatur ke ``True``. Ini meniadakan kebutuhan untuk mengatur variabel ini dalam ``user_variables.yml``, tetapi nilainya mungkin masih akan ditimpa atas kebijakan deployer.

source: If there are swift hosts in the environment, then the value for ``glance_default_store`` will automatically be set to ``swift``. This negates the need to set this variable in ``user_variables.yml``, but the value may still be overridden at the deployer discretion.
id: Jika ada swift host di lingkungan, maka nilai untuk ``glance_default_store`` akan secara otomatis diatur ke ``swift``. Ini meniadakan kebutuhan untuk mengatur variabel ini dalam ``user_variables.yml``, tetapi nilainya mungkin masih akan ditimpa atas kebijakan deployer.

source: If you do not make this change, the Cinder backup service will refuse to start properly.
id: Jika Anda tidak melakukan perubahan ini, layanan cadangan Cinder akan menolak untuk memulai dengan benar.

source: If you had your own keepalived configuration file, please rename and move it to the openstack-ansible user space, for example by moving it to ```/etc/openstack_deploy/keepalived/keepalived.yml```. Our haproxy playbook does not load an external variable files anymore. The keepalived variable override system has been standardised to the same method used elsewhere.
id: Jika Anda memiliki file konfigurasi keepalived Anda sendiri, silakan ganti nama dan pindahkan ke ruang pengguna openstack-ansible, misalnya dengan memindahkannya ke ```/etc/openstack_deploy/keepalived/keepalived.yml```. Playbook haproxy kami tidak memuat file variabel eksternal lagi. Sistem penggantian variabel keepalived telah distandarisasi untuk metode yang sama yang digunakan di tempat lain.

source: If you have overriden your ``openstack_host_specific_kernel_modules``, please remove its group matching, and move that override directly to the appropriate group.
id: Jika Anda mengganti ``openstack_host_specific_kernel_modules`` Anda, harap hapus pencocokan grupnya, dan pindahkan override itu langsung ke grup yang sesuai.

source: If your configuration previously set the ``libvirt/cpu_model`` and/or ``libvirt/cpu_model_extra_flags`` variables in a ``nova_nova_conf_overrides`` dictionary, you should consider moving those to ``nova_cpu_model`` and ``nova_cpu_model_extra_flags`` in the appropriate entry (normally ``kvm``) in the ``nova_virt_types`` dictionary.
id: Jika konfigurasi Anda sebelumnya mengatur variabel ``libvirt / cpu_model`` dan/atau `libvirt/cpu_model_extra_flags``` dalam kamus ``nova_nova_conf_overrides``, Anda harus mempertimbangkan untuk memindahkannya ke ``nova_cpu_model`` dan ``nova_cpu_model_model_model_model_teks_paket_model_flags`` dalam entri yang sesuai (biasanya ``kvm``) dalam kamus ``nova_virt_types``.

source: Implemented support for Ubuntu 16.04 Xenial. percona-xtrabackup packages will be installed from distro repositories, instead of upstream percona repositories due to lack of available packages upstream at the time of implementing this feature.
id: Dukungan yang diimplementasikan untuk Ubuntu 16.04 Xenial. Paket percona-xtrabackup akan diinstal dari repositori distro, bukan repositori hulu percona karena kurangnya paket yang tersedia di hulu pada saat menerapkan fitur ini.

source: Implements SSL connection ability to MySQL. ``galera_use_ssl`` option has to be set to ``true`` (default), in this case playbooks create self-signed SSL bundle and sets up MySQL configs to use it or distributes user-provided bundle throughout Galera nodes.
id: Menerapkan kemampuan koneksi SSL ke MySQL. Opsi ``galera_use_ssl`` harus disetel ke ``true`` (default), dalam hal ini playbook membuat bundel SSL yang ditandatangani sendiri dan mengatur konfigurasi MySQL untuk menggunakannya atau mendistribusikan bundel yang disediakan pengguna di seluruh node Galera.
