Repository: openstack/openstack-ansible
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: The ``glance_apt_packages`` variable has been renamed to ``glance_distro_packages`` so that it applies to multiple operating systems.
id: Variabel ``glance_apt_packages`` telah diubah namanya menjadi ``glance_distro_packages`` sehingga variabel ini berlaku untuk beberapa sistem operasi.

source: The ``glance_digest_algorithm`` has changed from ``sha1`` to ``sha256`` and this improves integrity verification of stored images.
id: ``glance_digest_algorithm`` telah berubah dari ``sha1`` menjadi ``sha256`` dan ini meningkatkan verifikasi integritas image yang disimpan.

source: The ``glance_enable_v1_registry`` variable has been removed. When using the glance v1 API the registry service is required, so having a variable to disable it makes little sense. The service is now enabled/disabled for the v1 API using the ``glance_enable_v1_api`` variable.
id: Variabel ``glance_enable_v1_registry`` telah dihapus. Saat menggunakan glance v1 API layanan registri diperlukan, sehingga memiliki variabel untuk menonaktifkannya tidak masuk akal. Layanan sekarang diaktifkan/dinonaktifkan untuk API v1 menggunakan variabel ``glance_enable_v1_api``.

source: The ``glance`` library has been removed from OpenStack-Ansible's plugins. Upstream Ansible modules for managing OpenStack image resources should be used instead.
id: Pustaka ``glance`` telah dihapus dari plugins OpenStack-Ansible's. Modul Upstream Ansible untuk mengelola sumber daya image OpenStack harus digunakan sebagai gantinya.

source: The ``gnocchi_keystone_auth_plugin`` variable has been deprecated. ``gnocchi_keystone_auth_type`` should be used instead to configure authentication type.
id: Variabel ``gnocchi_keystone_auth_plugin`` telah ditinggalkan. ``gnocchi_keystone_auth_type`` harus digunakan sebagai gantinya untuk mengkonfigurasi tipe otentikasi.

source: The ``gnocchi_keystone_auth`` is deprecated, and will be removed in the ``Queen`` cycle. Setting ``gnocchi_auth_mode`` to ``keystone`` will achieve the same result.
id: ``gnocchi_keystone_auth`` sudah usang, dan akan dihapus dalam siklus ``Queen``. Mengatur ``gnocchi_auth_mode`` ke ``keystone`` akan mencapai hasil yang sama.

source: The ``haproxy_bufsize`` variable has been removed and made a part of the ``haproxy_tuning_params`` dictionary.
id: Variabel ``haproxy_bufsize`` telah dihapus dan menjadi bagian dari kamus ``haproxy_tuning_params``.

source: The ``haproxy`` role installs *hatop* from source to ensure that the same operator tooling is available across all supported distributions. The download URL for the source can be set using the variable ``haproxy_hatop_download_url``.
id: Peran ``haproxy`` menginstal *hatop * dari sumber untuk memastikan bahwa operator tooling yang sama tersedia di semua distribusi yang didukung. URL unduhan untuk sumber dapat diatur dengan menggunakan variabel ``haproxy_hatop_download_url``.

source: The ``heat-api``, ``heat-api-cfn``, and ``heat-api-cloudwatch`` services have moved to run as a uWSGI applications. You can set the max number of WSGI processes, the number of processes, threads, and buffer size utilizing the ``heat_wsgi_processes_max``, ``heat_wsgi_processes``, ``heat_wsgi_threads``, and ``heat_wsgi_buffer_size``. Additionally, you can override any settings in the uWSGI ini configuration file using the ``heat_api_uwsgi_ini_overrides``, ``heat_api_cfn_uwsgi_ini_overrides``, and ``heat_api_cloudwatch_uwsgi_ini_overrides`` settings. The uWSGI applications will listen on the addresses specified by ``heat_api_uwsgi_bind_address``, ``heat_api_cfn_uwsgi_bind_address``, and ``heat_api_cloudwatch_uwsgi_bind_address`` respectively. Which all default to ``0.0.0.0``.
id: Layanan ``heat-api``, ``heat-api-cfn``, dan ``heat-api-cloudwatch`` telah berpindah untuk dijalankan sebagai aplikasi uWSGI. Anda dapat mengatur jumlah maksimum proses WSGI, jumlah proses, thread, dan ukuran buffer menggunakan ``heat_wsgi_processes_max``, ``heat_wsgi_processes``, ``heat_wsgi_threads``, dan ``heat_wsgi_buffer_size``. Selain itu, Anda dapat mengabaikan pengaturan apa pun di file konfigurasi uWSGI ini menggunakan pengaturan ``heat_api_uwsgi_ini_overrides``, ``heat_api_cfn_uwsgi_ini_overrides``, dan ``heat_api_cloudwatch_uwsgi_ini_overrides``. Aplikasi uWSGI akan mendengarkan pada alamat yang ditentukan oleh masing-masing ``heat_api_uwsgi_bind_address``, ``heat_api_cfn_uwsgi_bind_address``, dan ``heat_api_cloudwatch_uwsgi_bind_address``. Yang semuanya default ke ``0.0.0.0``.

source: The ``heat_cinder_backups_enabled`` variable is set to ``false`` by default.
id: Variabel ``heat_cinder_backups_enabled`` diatur ke ``false`` secara default.

source: The ``horizon_images_allow_location`` variable is added to support the ``IMAGES_ALLOW_LOCATION`` setting in the horizon_local_settings.py file to allow to specify and external location during the image creation.
id: Variabel ``horizon_images_allow_location`` ditambahkan untuk mendukung pengaturan ``IMAGES_ALLOW_LOCATION`` dalam file horizon_local_settings.py untuk memungkinkan menentukan dan lokasi eksternal selama pembuatan gambar image

source: The ``horizon_keystone_admin_roles`` variable is added to support the ``OPENSTACK_KEYSTONE_ADMIN_ROLES`` list in the horizon_local_settings.py file.
id: Variabel ``horizon_keystone_admin_roles`` ditambahkan untuk mendukung daftar ``OPENSTACK_KEYSTONE_ADMIN_ROLES`` dalam file horizon_local_settings.py.

source: The ``infra_hosts`` and ``infra_containers`` inventory groups have been removed. No containers or services were assigned to these groups exclusively, and the usage of the groups has been supplanted by the ``shared-infra_*`` and ``os-infra_*`` groups for some time. Deployers who were using the groups should adjust any custom configuration in the ``env.d`` directory to assign containers and/or services to other groups.
id: Grup inventory ``infra_hosts`` dan ``infra_containers`` telah dihapus. Tidak ada kontainer atau layanan yang ditugaskan untuk grup ini secara eksklusif, dan penggunaan grup telah digantikan oleh grup ``shared-infra_*`` and ``os-infra_*`` untuk beberapa waktu. Deployer yang menggunakan grup harus menyesuaikan konfigurasi kustom apa pun di direktori ``env.d`` untuk menetapkan kontainer dan/atau layanan ke grup lain.

source: The ``ironic_neutron_provisioning_network_name`` and ``ironic_neutron_cleaning_network_name`` variable can be set to the name of the neutron network to use for provisioning and cleaning. The ansible tasks will determine the appropriate UUID for that network. Alternatively, ``ironic_neutron_provisioning_network_uuid`` or ``ironic_neutron_cleaning_network`` can be used to directly specify the UUID of the networks. If both ``ironic_neutron_provisioning_network_name`` and ``ironic_neutron_provisioning_network_uuid`` are specified, the specified UUID will be used. If only the provisioning network is specified, the cleaning network will default to the same network.
id: Variabel ``ironic_neutron_provisioning_network_name`` dan ``ironic_neutron_cleaning_network_name`` dapat diatur ke nama jaringan neutron yang digunakan untuk provisioning dan cleaning. Tugas yang dimungkinkan akan menentukan UUID yang sesuai untuk jaringan itu. Atau, ``ironic_neutron_provisioning_network_uuid`` atau ``ironic_neutron_cleaning_network`` dapat digunakan untuk secara langsung menentukan UUID jaringan. Jika ``ironic_neutron_provisioning_network_name`` dan ``ironic_neutron_provisioning_network_uuid`` ditentukan, UUID yang ditentukan akan digunakan. Jika hanya jaringan provisioning yang ditentukan, jaringan cleaning akan secara default ke jaringan yang sama.

source: The ``ironic`` role now supports Ubuntu 16.04 and SystemD.
id: Peran ``ironis`` sekarang mendukung Ubuntu 16.04 dan SystemD.

source: The ``keystone_ldap_identity_driver`` variable has been removed. The driver for an LDAP back-end in Keystone now simply uses the value 'ldap'. There are no other back-end options for Keystone at this time.
id: Variabel ``keystone_ldap_identity_driver`` telah dihapus. Driver untuk back-end LDAP di Keystone sekarang hanya menggunakan nilai 'ldap'. Tidak ada opsi back-end lain untuk Keystone saat ini.

source: The ``lxc-container-create`` role now consumes the variable ``lxc_container_bind_mounts`` which should contain a list of bind mounts to apply to a newly created container. The appropriate host and container directory will be created and the configuration applied to the container config. This feature is designed to be used in group_vars to ensure that containers are fully prepared at the time they are created, thus cutting down the number of times containers are restarted during deployments and upgrades.
id: Peran ``lxc-container-create`` sekarang mengkonsumsi variabel ``lxc_container_bind_mounts`` yang harus berisi daftar mount mengikat untuk diterapkan ke kontainer yang baru dibuat. Direktori host dan kontainer yang sesuai akan dibuat dan konfigurasi diterapkan pada konfigurasi kontainer. Fitur ini dirancang untuk digunakan dalam group_vars untuk memastikan bahwa kontainer sepenuhnya disiapkan pada saat mereka dibuat, sehingga mengurangi berapa kali kontainer di-restart selama deployment dan upgrade.

source: The ``lxc-container-create`` role now consumes the variable ``lxc_container_commands`` which should contain any shell commands that should be executed in a newly created container. This feature is designed to be used in group_vars to ensure that containers are fully prepared at the time they are created, thus cutting down the number of times containers are restarted during deployments and upgrades.
id: Peran ``lxc-container-create`` sekarang mengkonsumsi variabel ``lxc_container_commands`` yang harus berisi perintah shell yang harus dijalankan dalam kontainer yang baru dibuat. Fitur ini dirancang untuk digunakan dalam group_vars untuk memastikan bahwa kontainer sepenuhnya disiapkan pada saat mereka dibuat, sehingga mengurangi berapa kali kontainer di-restart selama deployment dan upgrade.

source: The ``lxc-container-create`` role now consumes the variable ``lxc_container_config_list`` which should contain a list of the entries which should be added to the LXC container config file when the container is created. This feature is designed to be used in group_vars to ensure that containers are fully prepared at the time they are created, thus cutting down the number of times containers are restarted during deployments and upgrades.
id: Peran ``lxc-container-create`` sekarang mengkonsumsi variabel ``lxc_container_config_list`` yang harus berisi daftar entri yang harus ditambahkan ke file konfigurasi kontainer LXC ketika kontainer dibuat. Fitur ini dirancang untuk digunakan dalam group_vars untuk memastikan bahwa kontainer sepenuhnya disiapkan pada saat mereka dibuat, sehingga mengurangi berapa kali kontainer di-restart selama deployment dan upgrade.

source: The ``lxc_container_create`` role no longer uses the distro specific lxc container create template.
id: Peran ``lxc_container_create`` tidak lagi menggunakan templat membuat kontainer lxc spesifik distro.

source: The ``lxc_container_create`` role now supports Ubuntu 14.04, 16.04, and RHEL/CentOS 7
id: Peran ``lxc_container_create`` sekarang mendukung Ubuntu 14.04, 16.04, dan RHEL/CentOS 7

source: The ``lxc_container_create`` role will now build a container based on the distro of the host OS.
id: Peran ``lxc_container_create`` sekarang akan membangun sebuah wadah berdasarkan distro OS host.

source: The ``lxc_host`` cache prep has been updated to use the LXC download template. This removes the last remaining dependency the project has on the `rpc-trusty-container.tgz image <http://rpc-repo.rackspace.com/container_images/rpc-trusty-container.tgz>`_.
id: Persiapan cache ``lxc_host`` telah diperbarui untuk menggunakan templat unduhan LXC. Ini menghapus dependensi terakhir yang tersisa dari proyek pada image `rpc-trusty-container.tgz <http://rpc-repo.rackspace.com/container_images/rpc-trusty-container.tgz>` _.

source: The ``lxc_host`` role introduces support for CentOS 7 and Ubuntu 16.04 container types.
id: Peran ``lxc_host`` memperkenalkan dukungan untuk jenis kontainer CentOS 7 dan Ubuntu 16.04.

source: The ``lxc_host`` role no longer uses the distro specific lxc container create template.
id: Peran ``lxc_host`` tidak lagi menggunakan templat pembuatan kontainer lxc spesifik distro.

source: The ``lxc_host`` role will build lxc cache using the download template built from `images found here <https://images.linuxcontainers.org>`_. These images are upstream builds from the greater LXC/D community.
id: Peran ``lxc_host`` akan membangun cache lxc menggunakan templat unduhan yang dibuat dari `images found here <https://images.linuxcontainers.org>` _. Image ini adalah bangunan hulu dari komunitas LXC/D yang lebih besar.

source: The ``lxcbr0`` bridge now allows NetworkManager to control it, which allows for networks to start in the correct order when the system boots. In addition, the ``NetworkManager-wait-online.service`` is enabled to ensure that all services that require networking to function, such as ``keepalived``, will only start when network configuration is complete. These changes are only applied if a deployer is actively using NetworkManager in their environment.
id: Jembatan ``lxcbr0`` sekarang memungkinkan NetworkManager untuk mengontrolnya, yang memungkinkan jaringan untuk memulai dalam urutan yang benar ketika sistem melakukan booting. Selain itu, ``NetworkManager-wait-online.service`` diaktifkan untuk memastikan bahwa semua layanan yang membutuhkan jaringan berfungsi, seperti ``keepalived``, hanya akan dimulai ketika konfigurasi jaringan selesai. Perubahan ini hanya diterapkan jika penyebar secara aktif menggunakan NetworkManager di lingkungan mereka.

source: The ``main`` function in ``dynamic_inventory.py`` now takes named arguments instead of dictionary. This is to support future code changes that will move construction logic into separate files.
id: Fungsi ``main`` dalam ``dynamic_inventory.py`` sekarang menggunakan argumen yang dinamai daripada kamus. Ini untuk mendukung perubahan kode di masa depan yang akan memindahkan logika konstruksi ke file terpisah.

source: The ``molteniron`` service is no longer included in the OSA integrated build. Any deployers wishing to use it may still use the playbook and configuration examples from the ``os_molteniron`` role.
id: Layanan ``molteniron`` tidak lagi termasuk dalam OSA integrated build. Penyebar apa pun yang ingin menggunakannya masih dapat menggunakan playbook dan contoh konfigurasi dari peran ``os_molteniron``.

source: The ``net.bridge.bridge-nf-call-*`` kernel parameters were set to ``0`` in previous releases to improve performance and it was left up to neutron to adjust these parameters when security groups are applied. This could cause situations where bridge traffic was not sent through iptables and this rendered security groups ineffective. This could allow unexpected ingress and egress traffic within the cloud.
id: Parameter kernel ``net.bridge.bridge-nf-call-*`` disetel ke ``0`` dalam rilis sebelumnya untuk meningkatkan kinerja dan diserahkan ke neutron untuk menyesuaikan parameter ini ketika grup keamanan diterapkan. Ini dapat menyebabkan situasi di mana lalu lintas jembatan tidak dikirim melalui iptables dan ini membuat kelompok keamanan tidak efektif. Ini dapat memungkinkan masuknya lalu lintas yang tidak terduga dan keluar di dalam cloud.

source: The ``neutron_driver_network_scheduler`` variable default has changed from ChanceScheduler to WeightScheduler to match the new Neutron defaults.
id: Default variabel ``neutron_driver_network_scheduler`` telah berubah dari ChanceScheduler ke WeightScheduler agar sesuai dengan default Neutron yang baru.

source: The ``neutron_driver_quota`` variable default has changed slightly to match the new upstream driver paths.
id: Default variabel ``neutron_driver_quota`` telah berubah sedikit agar sesuai dengan jalur driver hulu yang baru.

source: The ``neutron_keystone_auth_plugin`` variable has been deprecated. ``neutron_keystone_auth_type`` should be used instead to configure authentication type.
id: Variabel ``neutron_keystone_auth_plugin`` telah ditinggalkan. ``neutron_keystone_auth_type`` harus digunakan sebagai gantinya untuk mengkonfigurasi tipe otentikasi.

source: The ``neutron_plugin_base`` variable has been modifed to use the friendly names. Deployers should change any customisations to this variable to ensure that the customisation makes use of the short names instead of the full class path.
id: Variabel ``neutron_plugin_base`` telah dimodifikasi untuk menggunakan nama yang ramah. Penyebar harus mengubah penyesuaian apa pun ke variabel ini untuk memastikan bahwa penyesuaian tersebut menggunakan nama pendek daripada full class path.

source: The ``neutron`` library has been removed from OpenStack-Ansible's plugins. Upstream Ansible modules for managing OpenStack network resources should be used instead.
id: Pustaka ``neutron`` telah dihapus dari plugin OpenStack-Ansible. Modul Upstream Ansible untuk mengelola sumber daya jaringan OpenStack harus digunakan sebagai gantinya.

source: The ``nova-api``, and ``nova-metadata`` services have moved to run as uWSGI applications. You can override their uwsgi configuration files using the ``nova_api_os_compute_uwsgi_ini_overrides``, and ``nova_api_metadata_uwsgi_ini_overrides`` settings.
id: Layanan ``nova-api``, dan ``nova-metadata`` telah dipindahkan untuk berjalan sebagai aplikasi uWSGI. Anda dapat mengganti file konfigurasi uwsgi mereka menggunakan pengaturan ``nova_api_os_compute_uwsgi_ini_overrides``, dan ``nova_api_metadata_uwsgi_ini_overrides``.

source: The ``nova-placement`` api service will run as its own ansible group ``nova_api_placement``.
id: Layanan api ``nova-placement`` akan berjalan sebagai grup sendiri yang dapat dilakukan ``nova_api_placement``.

source: The ``nova-placement`` service is now configured by default. ``nova_placement_service_enabled`` can be set to ``False`` to disable the ``nova-placement`` service.
id: Layanan ``nova-placement``` sekarang dikonfigurasi secara default. ``nova_placement_service_enabled`` dapat diatur ke ``False`` untuk menonaktifkan layanan ``nova-placement``.

source: The ``nova-placement`` service now runs as a uWSGI application that is not fronted by an nginx web-server by default. After upgrading, if the ``nova-placement`` service was running on a host or container without any other services requiring nginx, you should manually remove nginx.
id: Layanan ``nova-placement`` sekarang berjalan sebagai aplikasi uWSGI yang tidak digawangi oleh server web nginx secara default. Setelah memutakhirkan, jika layanan ``nova-placement`` dijalankan pada host atau kontainer tanpa layanan lain yang membutuhkan nginx, Anda harus menghapus nginx secara manual.

source: The ``nova.conf`` template still includes these variables and it sets the keymap configuration option. Deployers who have customized this setting will not see a change in their ``nova.conf``.
id: Templat ``nova.conf`` masih menyertakan variabel ini dan ia menetapkan opsi konfigurasi keymap. Penyebar yang telah menyesuaikan pengaturan ini tidak akan melihat perubahan pada ``nova.conf`` mereka.

source: The ``nova_cpu_mode`` Ansible variable has been removed by default, to allow Nova to detect the default value automatically. Hard-coded values can cause problems. You can still set ``nova_cpu_mode`` to enforce a ``cpu_mode`` for Nova. Additionally, the default value for the ``qemu`` ``libvirt_type`` is set to ``none`` to avoid issues caused with ``qemu`` 2.6.0.
id: Variabel Ansible ``nova_cpu_mode`` telah dihapus secara default, untuk memungkinkan Nova mendeteksi nilai default secara otomatis. Nilai hard-coded dapat menyebabkan masalah. Anda masih dapat mengatur ``nova_cpu_mode`` untuk memberlakukan ``cpu_mode`` untuk Nova. Selain itu, nilai default untuk ``qemu`` `` libvirt_type`` diatur ke ``none`` untuk menghindari masalah yang disebabkan oleh ``qemu`` 2.6.0.

source: The ``octavia-api`` service has moved to run as a uWSGI application. You can set the max number of WSGI processes, the number of processes, threads, and buffer size utilizing the ``octavia_wsgi_processes_max``, ``octavia_wsgi_processes``, ``octavia_wsgi_threads``, and ``octavia_wsgi_buffer_size``. Additionally, you can override any settings in the uWSGI ini configuration file using the ``octavia_api_uwsgi_ini_overrides`` setting. The uWSGI application will listen on the address specified by ``octavia_uwsgi_bind_address`` which defaults to ``0.0.0.0``.
id: Layanan ``octavia-api`` telah dipindahkan untuk berjalan sebagai aplikasi uWSGI. Anda dapat mengatur jumlah maksimum proses WSGI, jumlah proses, thread, dan ukuran buffer menggunakan ``octavia_wsgi_processes_max``, ``octavia_wsgi_processes``, ``octavia_wsgi_threads``, dan ``octavia_wsgi_buffer_si``. Selain itu, Anda dapat mengabaikan pengaturan apa pun di file konfigurasi uWSGI ini menggunakan pengaturan ``octavia_api_uwsgi_ini_overrides``. Aplikasi uWSGI akan mendengarkan alamat yang ditentukan oleh ``octavia_uwsgi_bind_address`` yang secara default adalah ``0.0.0.0``.

source: The ``octavia_keystone_auth_plugin`` variable has been deprecated. ``octavia_keystone_auth_type`` should be used instead to configure authentication type.
id: Variabel ``octavia_keystone_auth_plugin`` telah ditinggalkan. ``octavia_keystone_auth_type`` harus digunakan sebagai gantinya untuk mengkonfigurasi tipe otentikasi.

source: The ``openstack-ansible-galera_server`` role will now prevent deployers from changing the ``galera_cluster_name`` variable on clusters that already have a value set in a running galera cluster. You can set the new ``galera_force_change_cluster_name`` variable to ``True`` to force the ``galera_cluster_name`` variable to be changed. We recommend setting this by running the galera-install.yml playbook with ``-e galera_force_change_cluster_name=True``, to avoid changing the ``galera_cluster_name`` variable unintentionally. Use with caution, changing the ``galera_cluster_name`` value can cause your cluster to fail, as the nodes won't join if restarted sequentially.
id: Peran ``openstack-ansible-galera_server`` sekarang akan mencegah penyebaran mengubah variabel ``galera_cluster_name`` pada kluster yang sudah memiliki nilai yang ditetapkan dalam kluster galera yang sedang berjalan. Anda dapat mengatur variabel ``galera_force_change_cluster_name`` baru menjadi ``True`` untuk memaksa variabel ``galera_cluster_name`` diubah. Kami menyarankan pengaturan ini dengan menjalankan playbook galera-install.yml dengan ``-e galera_force_change_cluster_name = True``, untuk menghindari mengubah variabel ``galera_cluster_name`` secara tidak sengaja. Gunakan dengan hati-hati, mengubah nilai ``galera_cluster_name`` dapat menyebabkan kluster Anda gagal, karena node tidak akan bergabung jika dimulai ulang secara berurutan.
